{"date":"2024-07-01","titles":["BTC TO PKR: Today’s Bitcoin price in Pakistan on 2 July, 2024","BTC TO USD: Today’s Bitcoin Price in Dollar on 2 July, 2024","Why Bitcoin Price Is Not Pumping Despite ETF Inflow","Biggest stock movers today: Crypto stocks, CHWY, SPR, NIO and more","Bitcoin Price Prediction: BTC to Hit $150k After Clearing Big Price Hurdle"],"urls":["https:\/\/www.bolnews.com\/business\/2024\/07\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-2-july-2024\/","https:\/\/www.bolnews.com\/business\/2024\/07\/btc-to-usd-todays-bitcoin-price-in-dollar-on-2-july-2024\/","https:\/\/techstartups.com\/2024\/07\/01\/why-bitcoin-price-is-not-pumping-despite-etf-inflow\/","https:\/\/seekingalpha.com\/news\/4120911-biggest-stock-movers-today-spr","https:\/\/markets.businessinsider.com\/news\/currencies\/bitcoin-price-prediction-150k-crypto-outlook-mt-gox-tom-lee-2024-7"],"sources":["BOL News","BOL News","TechStartups.com","Seeking Alpha","Business Insider"],"descriptions":["The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is PKR 17,495,883.62 on 2nd July, 2024.","As of July 2nd, the Bitcoin to USD exchange rate stood at $62750.50. Bitcoin’s value in dollars reflects the dynamic","TechStartups - Coverage of Technology News, technology startups, Emerging technology, venture capital funding, and Silicon Valley","Stock futures kicked off Q3 and the second half of 2024 on a bullish note, with stock futures inching up slightly in pre-market trading on Monday morning. Here","Bitcoin has wobbled in recent weeks but it's about to clear a big hurdle and will climb 138% by the end of 2024, according to Fundstrat's Tom Lee."],"article_contents":["02nd Jul, 2024. 12:58 am\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO PKR – Today’s Bitcoin price in Pakistan on Feb 7, 2024\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is PKR, 17,495,883.62 on 2nd July, 2024.\n1 BTC =  17,495,883.62 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","02nd Jul, 2024. 12:52 am\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 6, 2024\nAs of July 2nd, the BTC to USD exchange rate stood at $62750.50. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 62750.50 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","The positive sentiment surrounding Bitcoin ETFs by crypto enthusiasts allowed Bitcoin to rally more than 53% after the US Securities and Exchange Commission (SEC) approved the first regulated spot Bitcoin ETFs on Jan. 10. However, since the rally maxed the BTC price with an all-time high of $73,679 on March 13, Bitcoin’s price has traded within the $60,000 to $70,000 range. Even with a record 19-day ETF inflow, several investors are left baffled as to why there’s little price movement.\nThe biggest reason for Bitcoin’s price stagnancy despite ETF inflow is a drop in long-term Bitcoin holder supply. Nevertheless, other factors like bad market timing and Bitcoin ETFs’ low Bitcoin holdings contribute to its static price movement.\nHere’s an in-depth explanation of how these factors influence Bitcoin’s inactive price movement:\nThe effect of a steady inflow into Bitcoin ETFs is getting evened out by a change in long-term Bitcoin holdings. Long-term Bitcoin holders have started to sell off their Bitcoins, with 5.26% of the total supply held by these investors getting into the hands of speculative investors.\nThe total Bitcoin supply held by long-term Bitcoin holders has always been viewed as a metric for how well Bitcoin will perform in the future.\nEven though the 5.26% drop might seem insignificant to someone new to the crypto space, it totals 630,000 Bitcoins or $43 billion. About $15.5 billion in Bitcoin has been purchased by US ETFs since their approval, amounting to one-third of the long-term supply that’s been sold by holders.\nPotentially, the sale of these Bitcoins to speculative investors could affect Bitcoin’s price in the coming months. These speculative or short-term buyers tend to take instant action once news about the crypto market pops up or the market fluctuates, and this can increase Bitcoin’s price volatility.\nShort-term investors use Bitcoin for several purposes with the aim being quick financial gains. For one, they can engage in day trading on crypto exchanges, looking to exploit changes in Bitcoin’s price.\nThe effect of this speculative investment is far-reaching, its influence is felt beyond just crypto investing as its ability to negatively influence Bitcoin price can ripple to other establishments relying on Bitcoin with Bitcoin casino sites, which allow players to wager online using crypto, and outfits that stake Bitcoin as examples. Staking involves getting interest on a specific amount of Bitcoin locked into smart contracts. This reduces Bitcoin’s supply and can increase demand, which in turn spikes its price.\nIn essence, the Bitcoin sell-off to speculative investors has diluted any positive impact triggered by the positive ETF inflow since the market anticipates the possibility of quick sell-offs.\nJune is typically viewed as a dull month for traders across different financial markets and the crypto market is no different. Known as a dull market, it is characterized by a drop in trading volume with very little drive to spark up a significant price movement in the market, even when traders receive good news like positive ETF inflow.\nDuring months like June when there is low trading activity, big institutions prefer to move their money into risk-free assets, and smaller fish in the crypto market end up using fiat for their transactions instead of crypto betting or crypto shopping. Hence, volatile assets like Bitcoin receive less attention.\nAlthough Bitcoin ETFs hold about 5% of Bitcoin’s circulating supply, it pales in comparison to the 31% held by Bitcoin Whales. The decisions taken by these whales have a big impact on the entire cryptocurrency market. As of 2024, three addresses hold between 577,502 Bitcoin and 102 other addresses hold 2.4 million Bitcoin.\nWhales include super investors and big institutions including the top crypto exchanges like Binance that manage their clients’ Bitcoin assets. Since whales hold most of the Bitcoin volume, their trading activities obscure any impact made by Bitcoin ETFs.\nGet in front of thousands of founders, investors, PE firms, tech executives, decision makers, and tech readers by submitting your story to TechStartups.com.",null,"There's fresh upside ahead for bitcoin, with investors set to see a sharp rally in the token to $150,000 by the end of the year, according to Fundstrat's head of research Tom Lee.\nLee, who has been one of bitcoin's most bullish forecasters in recent years, predicted the crypto was still on track to notch a value of $150,000, implying a 138% upside from its price on Monday.\nThat may come as a surprise for holders of the token, who saw bitcoin slide 7% over the last month, not long after reaching record highs earlier in 2024. Yet, Lee said the sell-off has been partly driven by nervousness over payouts from Mount Gox, the crypto exchange that locked away around $9 billion in crypto when it declared bankruptcy a decade ago.\nThe trustee overseeing the exchange's bankruptcy announced that it would start doling out repayments to around 20,000 users starting this month. Anticipation for the event has weighed on crypto prices recently, according to research from K33. The fear is that the distributions will lead to big selling pressure for bitcoin as investors cash in huge gains in the token since being locked out of their accounts a decade ago.\nBut the impact of repayments will fade, Lee suggested, forecasting another big rally to boost bitcoin through the rest of this year.\n\"Bitcoin's probably suffering from the Mount Gox starting distributions in July. That was a huge overhang for many years, but if I was investing in crypto, knowing that one of the biggest overhangs is going to disappear in July, I think it's a reason to actually expect a pretty sharp rebound in the second half,\" he told CNBC on Monday.\nOther bitcoin forecasters have remained bullish on the coin this year, particularly as the Fed looks poised to dial back interest rates. The price of bitcoin has rebounded after a brutal 2022, with the coin recovering all its losses to notch a fresh all-time-high around $73,000 this year.\nCheck out Business Insider's picks for  best cryptocurrency exchanges\nCheck out Business Insider's picks for  best cryptocurrency exchanges"]}
{"date":"2024-07-02","titles":["Invested in cryptos this year? You will have to pay tax at this rate…"],"urls":["https:\/\/www.livemint.com\/money\/personal-finance\/invested-in-cryptos-this-year-you-will-have-to-pay-tax-at-this-rate-11719929735460.html"],"sources":["Livemint"],"descriptions":["Any gains accrued on your investment in cryptocurrencies are liable to 30 percent tax while no set off is allowed for losses incurred in crypto trading"],"article_contents":["If you have invested in cryptocurrencies in the financial year 2023-2024, then the chances are that you earned significant profits in the year gone by.\nMost top crypto currencies reported noticeable jump in their prices in the past few months. Bitcoin rose nearly 108 percent in the past one year, while ether rose nearly 80 percent during this time.\nBitcoin, however, has started to drop recently, and lost nearly 4 percent in the third week of June 2024.\n1. When you transfer crypto tokens, also known as virtual digital assets (VDAs) in the taxation lingo, investors are meant to pay 1 percent TDS (tax deducted at source), as per Section 115BBH of Income Tax Act, 1961 that deals with tax on income from virtual digital assets.\n2. When you make profits on crypto transaction, you are liable to pay 30 percent flat tax on the profit. There is a 4 percent less over and above 30 percent tax. There is no capital gain tax or tax on lower rate of interest levied on crypto transactions.\n1. The law also states that any gift of virtual digital assets is liable to be taxed in the hands of the recipient.\n2. Flat rate of 30 percent is imposed regardless of time duration for which crypto tokens are held.\n3. This is not the first time that income earned on crypto assets will be taxed. 30 percent tax on crypto income came into effect on April 1, 2022 and 1 percent TDS came into force from July 1, 2022.\n4. These provisions were introduced in FY 2022 under section 115BBH of Income Tax Act.\n5. The latest Budget announcements including the interim budget of 2024 did not introduce any changes in tax on cryptocurrencies.\n6. To compute income on crypto transaction, one can deduct cost of acquisition, while no other deduction is allowed.\n7. There is no provision of setting off of losses incurred in crypto transaction against any income – even the gains earned on cryptocurrencies.\nThese provisions were introduced in the wake of phenomenal increase in transactions in virtual digital assets, Finance Minister Nirmala Sitharaman had stated while presenting the Budget in Feb 2022.\nCatch all the Instant Personal Loan, Business Loan, Business News, Money news, Breaking News Events and Latest News Updates on Live Mint. Download The Mint News App to get Daily Market Updates.\nLog in to our website to save your bookmarks. It'll just take a moment."]}
{"date":"2024-07-03","titles":["Bitcoin Bottom Is Near as Miners Capitulating Near FTX Implosion Level: CryptoQuant","Institutional cash inflow is poised to change bitcoin markets, per analyst"],"urls":["https:\/\/finance.yahoo.com\/news\/bitcoin-bottom-near-miners-capitulating-151727680.html","https:\/\/finance.yahoo.com\/news\/institutional-cash-inflow-poised-change-105908651.html"],"sources":["Yahoo Finance","Yahoo Finance"],"descriptions":["Bitcoin miners are showing signs of capitulation, an event that is typically tied to a market bottom following a 13% decline over the past 30-days.","The influx of institutional investors will provide stability and new price floors, according to analysts."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin miner capitulation metrics are approaching the same level as the market bottom following the FTX crash in late 2022.\nDaily miner revenue has dropped to $29 million from $79 million following the bitcoin halving earlier this year.\nThe hashrate has slumped by 7.7% since the halving as inefficient miners turn off their equipment.\nBitcoin {{BTC}} miners are showing signs of capitulation, an event that is typically tied to a market bottom after the world's largest cryptocurrency endured a 13% plight over the past 30 days.\nBitcoin is currently trading at $60,300 after sliding by 3% on Wednesday. This level has acted as a critical support since April, with bitcoin bouncing three times from this region before heading back towards the $70,000 mark.\nData provider CryptoQuant believes this is likely to happen again in the near future as numerous signs point towards capitulation following a period of intense sell pressure.\nTwo signs of miner capitulation are dwindling hashrate and mining revenue by hash (hashprice), both of which are down significantly this month, with hash rate plunging by 7.7% since the halving at hashprice nearing all-time lows. Hashrate is the mining power in the Bitcoin network, and hash price refers to the revenue miners earn from a unit of hashrate.\nMiners are also experiencing a hit to their daily revenue, which fell to $29 million today from $79 million on March 6. This has led to miners turning off equipment and the subsequent drop in hashrate.\n\"Miners have been hit by a 63% decline in daily revenues due to the halving and the collapse of transaction fees to 3.2% of total revenue,\" CryptoQuant said in a report.\nMiner capitulation levels are now comparable with those in December 2022, which was the market bottom following the demise of FTX.\nRead more: Bitcoin Hashrate May Finally Slow as Miners Face Scorching Summer Heatwaves","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCryptocurrency markets are experiencing a paradigm shift, driven by the increasing involvement of institutional investors. During a recent discussion, Roundtable anchor Rob Nelson, Jon Najarian from Market Rebellion, and Alex Mascioli of Parlay Labs and founder of Trade The Chain, delved into how these changes are shaping the future of crypto assets like bitcoin and ethereum.\nNelson kicked off the conversation by highlighting the growing maturity of the crypto market. He emphasized the stabilizing effect of institutional investments, predicting that their involvement would limit drastic downturns. \"There's a certain amount of maturity that's happening in the space,\" Nelson said, noting that institutional players are buying more and will eventually sell to retail investors, leading to increased demand and stability.\nMarket Rebellion's Najarian agreed, stating that the influx of institutional cash is changing the market. He pointed out that the ease of entry into crypto, especially through spot bitcoin exchange-traded funds (ETFs), is attracting investors who were previously hesitant. \"Do I expect bitcoin to break below $50,000? No, not really. I would be pretty comfortable with a $45,000 downside, not target, but firm support level,\" Najarian explained. He attributed this confidence to the broader public participation enabled by ETFs, which make digital assets more accessible.\nThe discussion then shifted to the peculiar behavior of crypto investors, especially the so-called \"hodlers\" who hold onto their assets through market fluctuations. Nelson suggested that as more retail investors enter the market, there might be a more natural process of buying and selling, similar to other markets.\nParlay Labs' Mascioli chimed in with a cautionary note, drawing parallels to his experience with Blackberry's stock. He emphasized the unpredictable nature of markets, underscoring that even robust companies can experience unexpected downturns.\nNajarian mentioned a significant withdrawal of ethereum from the Coinbase platform. He clarified that this was a withdrawal, not a sale, and speculated that the holder might be positioning for future gains. \"Sometimes when you see things like that, it's because people are looking ahead to maybe some price gains and they want to be ready for it,\" Najarian explained."]}
{"date":"2024-07-04","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-07-05","titles":["Bitcoin set for worst week in over a year on Mt. Gox liquidation fears","Bitcoin Slumps Below $54K as Mt. Gox Moves $2.6B in BTC","Bitcoin Price Declines Sharply Amid Mt. Gox Payouts, Government Selling"],"urls":["https:\/\/www.theglobeandmail.com\/business\/international-business\/article-bitcoin-set-for-worst-week-in-over-a-year-on-mt-gox-liquidation-fears\/","https:\/\/finance.yahoo.com\/news\/bitcoin-dips-below-54k-mt-043244098.html","https:\/\/markets.businessinsider.com\/news\/currencies\/bitcoin-price-decline-mt-gox-payout-german-us-government-selling-2024-7"],"sources":["The Globe and Mail","Yahoo Finance","Business Insider"],"descriptions":["The price of the world’s largest cryptocurrency slid as much as 8% on the day to $53,523, its lowest since late February","BTC slides to lowest since late February, breaching key price support.","The bankrupt Mt. Gox crypto exchange still holds about 140,000 bitcoin and has started to repay creditors and customers"],"article_contents":["This article was published more than 6 months ago. Some information may no longer be current.\nBitcoin BTN24 was set for its biggest weekly fall in nearly a year on Friday, as traders fretted over the likely dumping of tokens from defunct Japanese exchange Mt. Gox and further selling by leveraged players after the cryptocurrency’s strong run.\nThe price of the world’s largest cryptocurrency slid as much as 8 per cent on the day to $53,523, its lowest since late February. It was last trading at $56,565, down more than 3 per cent on the day.\nIt was on track for a more than 10 per cent weekly decline, its biggest since August 2023.\nEther, the world’s second-largest cryptocurrency, slid to as low as $2,822.30, a more than two-month low. It was last at $2,976.62, down 5.28 per cent.\nMedia reports said Mt. Gox, the world’s leading exchange for cryptocurrencies before it collapsed a decade ago, may start returning bitcoin to creditors, who are seen as likely sellers since the token’s worth was only hundreds of dollars in 2014.\n“The selling pressure is still related to creditor selling from the failed Mt Gox exchange,” said Tony Sycamore, a market analyst at IG.\n“However, the acceleration to the downside suggests the market is trying to get ahead of the creditor flows.”\nThe move downward in bitcoin triggered the largest daily liquidations for crypto traders since the collapse of crypto exchange FTX in 2022, according to a research note from Wintermute, a crypto trading firm.\nAnalysts have also pointed to worries over the possibility of Joe Biden being replaced as the Democrats’ presidential nominee by someone less pro-crypto after a shaky debate performance with rival candidate Donald Trump.\n“What’s striking about this slide in bitcoin is it comes as U.S. stocks and global equity indexes rest at or near record highs – the correlation between Bitcoin and mainstream equities is fraying,” said Antoni Trenchev, co-founder of crypto platform Nexo.\nBitcoin had a strong start to the year after the launch of exchange-traded funds in the U.S., propelling it to a record $73,803.25 in mid-March. However, it has since struggled.\n“With an asset that has been rangebound for quite a while and recently in the lower end of that range, there are plenty of margined positions,” said Justin D’Anethan at digital assets market maker Keyrock.\n“This of course creates a cascading effect, pushing prices further down than it might in a market with less leverage.”\nReport an editorial error\nReport a technical issue\nAuthors and topics you follow will be added to your personal news feed in Following.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBTC slides to its lowest level since late February, breaching key price support.\nEarly Friday, defunct exchange Mt. Gox moved 47,228 to a new address from cold storage.\nBitcoin's {{BTC}} slid for a fourth day as defunct exchange Mt. Gox moved sizeable BTC to a new wallet, potentially preparing for creditor repayments.\nThe leading cryptocurrency by market value fell over 4% to $53,600, the lowest since Feb. 26, according to charting platform TradingView and CoinDesk data.\nAt 00:27 UTC, Mt. Gox transferred 47,228 BTC ($2.6 billion) from cold storage to a new wallet, according to blockchain analytics firm Arkham Intelligence. The exchange is slated to start distributing assets stolen from clients in a 2014 hack.\nThe impending repayments, which include 140,000 BTC ($7.73 billion), 143,000 BCH, and the Japanese yen, were announced last month. Since then, traders have been worried that creditors who have patiently waited for reimbursements for a decade will immediately sell upon receiving coins, creating mass selling pressure in the market. Note that BTC was trading at roughly $600 when the exchange was hacked in 2014, and today, it is worth over $55,000.\nSeveral analysts have recently tried to calm nerves by saying the potential selling pressure from reimbursements would be limited, but to no avail. BTC has declined 10% in seven days and 22% in four weeks.\nThe intense sell-off has flipped the horizontal support of $56,500 stemming from May lows into resistance. Besides, the bears have established a foothold below the crucial 200-day SMA and the bull market trendline.","Bitcoin has plunged 8% over the past two days, is down 12% since the start of July, and is trading at its lowest level since February.\nThe sharp decline has been accompanied by a wave of selling by notable bitcoin holders, including the defunct Mt. Gox cryptocurrency exchange and the governments of Germany and the US.\nMt. Gox, which at one point was the largest cryptocurrency exchange, went bankrupt in February 2014 after a series of hacks stole nearly one million bitcoin from its customers.\nA decade later, Mt. Gox on Friday has started to repay some of the $9 billion it owes to its creditors and customers via bitcoin and bitcoin cash, according to a statement from the company.\nCryptocurrency wallets tied to Mt. Gox show the defunct exchange still holds nearly 140,000 bitcoin that have yet to be repaid, according to data provider Arkham Intelligence.\nMeanwhile, recent bitcoin transfers from wallets associated with the German and US governments suggest both are liquidating some of their bitcoin stash.\nArkham Intelligence said the German government sold up to $175 million in seized bitcoin on Thursday. The government still holds about 40,000 bitcoin worth more than $2 billion.\nAccording to Blockworks, both the US and German governments have sent a combined $738 million to bitcoin exchanges over the last two weeks, suggesting that they will imminently be sold.\nAll of this selling pressure has sent the price of bitcoin below key technical support levels.\nBitcoin is trading below its 200-day moving average of around $59,500, suggesting more downside ahead.\nFairlead Strategies highlighted $60,000 as a key support level that has since been broken. The decisive breakdown puts bitcoin's next support level target at around $51,500.\nCheck out Business Insider's picks for  best cryptocurrency exchanges\nCheck out Business Insider's picks for  best cryptocurrency exchanges"]}
{"date":"2024-07-08","titles":["Web3 Gaming Needs to Fix Its Identity Crisis Before Mass Adoption Can Occur","DEXs Are Reshaping Crypto Trading for the Good Despite Regulatory Scrutiny"],"urls":["https:\/\/finance.yahoo.com\/news\/web3-gaming-needs-fix-identity-172917722.html","https:\/\/finance.yahoo.com\/news\/dexs-reshaping-crypto-trading-good-172624840.html"],"sources":["Yahoo Finance","Yahoo Finance"],"descriptions":["Part of the problem affecting Web3 gaming was the crypto market downturn but another part of the problem is that Web3 gaming hasn’t found a workable model yet. Web3 gaming needs to sort out its identity before it can expect to attract wider adoption among Web2 gamers.","Despite the SEC's antagonistic posture against the industry, it’s important to note that DEXs like Uniswap, Dexalot, and Dodo as well as others are by and large a financial force for good. Generally speaking DEXs are reshaping the trading landscape for the better by offering unique benefits and features that centralized exchanges simply can't match."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWeb3 gaming has not had an easy go of it the past few years. There was the time when Axie Infinity slashed its play-to-earn rewards to gamers during the recent bear market, catching many users by surprise. Web3 gaming has also been plagued by the perception that the overwhelming majority of GameFi projects tended to over deliver on flashy teaser videos, only to under deliver on the actual gameplay itself.\nPerhaps, the most telling issue is that from 2022 to 2023, only $2.9 billion was invested across 163 deals in Web3 gaming and metaverse projects. That amount represents a 62% drop in investment dollars and a 19% decline in deal volume compared to previous years according to DappRadar’s most recent report published in January 2024.\nPart of the problem affecting Web3 gaming was the crypto market downturn but another part of the problem is that Web3 gaming hasn’t found a workable model yet.\nFor instance, many would-be gamers are still confused with the “play-to-earn” model because it’s unclear whether the “playing” or the “earning” aspect is the most important element. In other words, Web3 gaming needs to sort out its identity before it can expect to attract wider adoption among Web2 gamers.\nA key step toward solving this dilemma is understanding the challenges that have contributed to the perception issues affecting Web3 gaming in general.\n“Honestly, it’s the quality of the games themselves. The key to all of this is to have games that are fun, engaging and incentivizing for players. For us, the crypto components to our games simply unlock further benefits, but at our core, we want to put out the best games possible,” said John Linden, CEO, Mythical Games.\n“Frankly, that can take a bit of time, but already this year, a number of exciting projects are poised for release. As the quality of games in this space rises, I think we’ll see mass adoption by both gamers and studios.”\nIn the past, critics have said that Web3 game developers, enamored by the tech, have focused too much on the “earning” element, which requires linking a digital wallet to the game before playing anything. Requiring gamers to have an online wallet and crypto exchange account seems almost punitive as a prerequisite to playing a game. It’s almost like telling someone who wants some ice cream that they have to get their tonsils removed before they can have two scoops of cookies and cream.\nDistribution of Web3 games has been a big issue as well for years, with both Apple and Android blocking their respective app stores from mobile versions of popular blockchain-based games such as Axie and Pixels. However, that changed last year after a ruling forced Apple to grant app store access to Web3 games.\nIt’s worth noting that end users aren’t the only holdouts to Web3 adoption. Blockchain technology presents a significant disruption to the existing business models of traditional game studios. It’s no secret that these large gaming publishers benefit from the current system, which enables them to resell the same in-game assets repeatedly with each version launch. Those multiple sales add to the total lifetime value of each player, which is a key metric of success.\nAccording to Statista, traditional video gaming is expected to earn $21.1 billion in 2024 in in-app purchases, which is in addition to any advertising and subscription fees they make. Web3’s ownership capabilities shifts that in-app cashflow calculus to favor the players.\nHowever, all is not lost. Blockchain gaming is the largest segment of decentralized applications within the space, accounting for 34% of all activity and 1.1 million active users every day.\nLinden said the key to driving user adoption higher for Web3 is creating great, exciting games that people want to play, “Our guiding philosophy is to, first and foremost, create gaming experiences and games that are fun. Fun is the singular most important aspect. If the game is compelling and organically interesting, it’ll naturally gain traction.”\nAdditionally, distribution through the mobile gaming sector holds significant potential due to shorter development cycles, clearer App Store guidelines, and greater profit potential due to in-app purchases, which Web2 gamers are used to already. Some Web3 platforms are moving beyond the App Store model such as Pixelverse, which offers a mini-version of its game on Telegram where it has more than 8 million users.\nIt also has an open-source game design that solicits ideas and input directly from players is another option that’s currently being used by Web3 project Pixelverse. The website boasts that since its earliest demo through post-launch it has solicited gameplay feedback from its community making updates in near-real time. Beyond its blend of player-verses-player and quest elements, the Pixelverse avatar robots can evolve and the sidekick bots can get custom upgrades too - all that the player\nThe majority of gamers are also very familiar with the “contribute-and-earn” model, which Web3 should emulate because that’s been in place for years. That’s where user-generated content (UGC) gets uploaded to ecosystems such as Fortnite, Roblox, and Minecraft. If the content or modifications are deemed useful, other players will buy them and the creator shares the revenue with the platform designers. The UGC contribute-and-earn format is well-positioned for blockchain integration.\nThe Oasys blockchain gaming platform embraces that UGC model. It focuses on gameplay and UX first to drive mass adoption, while also catering to creators by providing them with sophisticated developer support tools and documentation to bring their designs to the game. Creators have two options to integrate at scale with Oasys - which sets them apart from other projects - allowing third-parties to either build directly on the Oasys layer or bridge into the Oasys platform.\nAnother critical factor to ensure success for Web3 gaming will be to make the games scalable. If the game can’t support millions of users through the platform without glitching or freezing - the growth potential of the project will be severely throttled.\nLastly, applying tried and true Web2 marketing campaigns to Web3 games could help drive broader adoption because it’s what the market is used to seeing. It’s what they’re most familiar with.\nWhile Web3 gaming tech offers transformative potential, it must prioritize delivering high-quality, engaging gameplay over the draw of earnings. Ensuring that games are fun and accessible, without technological hoops to jump through first, will be key to attracting and retaining players. Additionally, leveraging familiar models like user-generated content and marketing tactics can provide a seamless transition for Web2 gamers into the Web3 space.\nThe pathway to success also lies in scalability and usability. By focusing on these core principles, Web3 gaming can shift the narrative from overpromising and under delivering to creating genuinely enjoyable and innovative experiences. This alignment of goals and expectations can help pave the way for a new era in gaming where the benefits of blockchain technology enhance, rather than overshadow, the joy of play.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe crypto industry took another body shot earlier this spring when Uniswap, one of the largest decentralized exchanges (DEXs), received an enforcement notice from the U.S. Securities and Exchange Commission (SEC). The move signaled yet another aggressive step by the regulator in its ongoing campaign against crypto innovation. It also raises reasonable concerns of regulatory overreach from SEC Chair Gary Gensler and a possible chilling effect this latest action could have on the growing decentralized finance (DeFi) ecosystem.\nDespite the SEC's antagonistic posture against the industry, it’s important to note that DEXs like Uniswap, Dexalot, and Dodo as well as others are by and large a financial force for good. Generally speaking DEXs are reshaping the trading landscape for the better.\nThese DeFi platforms offer unique benefits and features that centralized exchanges simply can't match, empowering users and driving innovation in ways that shouldn't be choked out through heavy-handed regulation.\nUnlike centralized crypto exchanges, which require users deposit funds into custodial wallets the exchange controls, traders maintain full custody of their assets throughout the trade when using a DEX. This extra layer of protection using a DEX provides, greatly lowers the risk of hacks, insider theft, or exchange collapse - which have all occurred across crypto in recent memory.\nFor instance, Dexalot has a unique hybrid model that blends the best attributes of both centralized and DeFi exchanges. Specifically Dexalot uses a central limit order book (CLOB) on-chain that presents the familiar trading experience of centralized exchanges while still allowing users to keep control of their funds. This inventive approach not only boosts security, but it provides a “frictionless feel” for users accustomed to traditional exchange dashboards.\nDEXs are also using creative liquidity options and reconfigured market structures. Dodo is a DEX that sets itself apart with a novel way to seed trading with its Proactive Market Maker (PMM) algorithm. This method improves upon a typical automated market maker (AMM) model because it has tighter controls on slippage and better capital efficiency for traders.\nThe PMM software eerily mimics trading behaviors of human market makers, while adjusting prices on market dynamics, and order sizes - all on the fly. This results in more efficient price discovery and tighter spreads, benefiting both traders and liquidity providers. These types of innovation showcase DEXs’ potential to match and exceed the efficiencies of TradFi markets.\nAnother key advantage of DEXs is their ability to promote financial inclusion on a global scale. The latest data from the World Bank still show that 1-in-3 adults globally, approximately 1.4 billion people largely in developing countries, are unbanked - meaning they don’t have access to basic banking services such as a checking or savings account or debit card.\nDEXs help strip away geographic obstacles, middle men, and other barriers to banking so that anyone with a mobile device and link to the internet can easily access a wide range of financial services and trading opportunities. This democratization of finance can dramatically drive economic empowerment for tens of millions of people who would otherwise be blocked from the system through no fault of their own.\nDespite the clear benefits that DEXs provide, the SEC's recent actions against Uniswap highlight the regulatory challenges the DeFi sector is up against. Some may say the agency's public stance of \"regulation by enforcement\" is little more than bureaucratic bullying. What’s certain is that it creates uncertainty and stifles innovation within the U.S., resulting in a crypto “brain drain” abroad.\nUniswap CEO Hayden Adams' response to the SEC's notice was both defiant and pragmatic, vowing to fight the charges. This stance reflects the broader sentiment within the crypto community that the SEC's current approach is misguided and fails to recognize the unique characteristics and potential of decentralized technologies.\nAs the industry continues to evolve, it's crucial for regulators to develop a more nuanced understanding of DEXs and the role they play within the broader financial system. Instead of trying to shoehorn these novel platforms into regulations created in the 1940s, a fresh look that balanced innovation with consumer protections is needed.\nWhile regulatory challenges persist, the benefits and potential of DEXs can’t be ignored. As the crypto industry matures and governing frameworks shift, it's essential that policymakers and regulators collaborate with innovators to create guidelines that work for all stakeholders. It’s possible. The future of finance is being shaped by DEXs, and it's a future that promises greater accessibility, security, and innovation for all - if overanxious regulators don’t kill it first."]}
{"date":"2024-07-09","titles":["Ether's Moment: The Rise of Ethereum ETFs","Bitcoin Price to Hit $100,000 on Slew of Positive Catalysts: Scaramucci"],"urls":["https:\/\/www.devdiscourse.com\/article\/headlines\/3010476-ethers-moment-the-rise-of-ethereum-etfs","https:\/\/markets.businessinsider.com\/news\/currencies\/bitcoin-price-prediction-100k-btc-selloff-forecast-anthony-scaramucci-2024-7"],"sources":["Devdiscourse","Business Insider"],"descriptions":["Ether, the world's second-largest cryptocurrency, could see a substantial price increase with the impending launch of Ethereum ETFs. Experts predict that reduced supply and increased demand could push prices beyond previous all-time highs, despite market volatility and regulatory factors influencing overall crypto dynamics.","Bitcoin could eventually rocket to $170k - and the crypto is still on track to hit $100k this year, Scaramucci said."],"article_contents":["Ether might be nearing a major breakthrough. The world's No.2 cryptocurrency has, until now, stayed in the shadow of bitcoin, which soared to record highs thanks to new U.S. exchange-traded funds (ETFs) designed to track its price.\nHowever, with similar ETFs for ether poised to enter the market soon, some analysts predict that ether's price could surpass its previous all-time high of $4,867.60 set in November 2021. 'Considering that ethereum has about half the spot liquidity compared to bitcoin, it requires less investment to have the same price impact,' noted Thomas Perfumo, Kraken's strategy lead.\nDespite the growing excitement, the volatile nature of the crypto market remains. Recent developments, including the potential liquidation of assets from the defunct Japanese exchange Mt. Gox, have shaken the market. Other influential factors include U.S. Federal Reserve interest rate projections and the upcoming presidential election.\n'Market participants should brace for a resurgence of volatility in both traditional and crypto markets,' said Jag Kooner, Bitfinex's head of derivatives. Regulatory changes and macroeconomic policies will be key determinants of market trends.'\nIn March, bitcoin surged to new heights, reaching as high as $73,803.25 after the debut of the first spot bitcoin ETFs. Conversely, ether has yet to hit its previous peak, although it peaked at $4,093.7 in the same period. This trend may shift with the arrival of ether ETFs, especially considering that a large portion of ether's supply is either staked or locked, limiting its availability for purchase.\nThe impact of ether ETFs is projected to be substantial, though not as significant as that of spot bitcoin ETFs, which have amassed nearly $38 billion in assets. Research by Grayscale Investments suggests that ether ETFs could attract around 25%-30% of the demand drawn by bitcoin ETFs. However, ether's smaller market capitalization could result in comparable price impacts per dollar spent.\n'We anticipate significant new demand for ether ETFs, interacting with a restricted supply,' said Zach Pandl, managing director at Grayscale. Additionally, ether can be staked or locked up for yield, which decreases its available supply and could drive prices higher. 'More demand for ETFs than new supply of bitcoin led to price increases; the situation for ether is even more constrained,' added Matt Hougan, Bitwise's chief investment officer.\nMarket predictions vary, with Standard Chartered forecasting an $8,000 price for ether by year-end and VanEck aiming for $22,000 by 2030. Yet, some analysts caution that the potential effects of ether ETFs may already be factored into current prices, as ether has already risen more than 29% this year.\n'Bitcoin and ethereum are now more richly valued than at the start of bitcoin ETFs; this could mean a slightly lesser effect,' noted Grayscale's Pandl.\n(With inputs from agencies.)\nEmail: info@devdiscourse.com Phone: +91-720-6444012, +91-7027739813, 14, 15\n© Copyright 2025","Bitcoin is still on track to nearly double from current levels this year, despite the crypto's steep sell-off, according to Anthony Scaramucci.\nThe Skyridge Capital founder and longtime crypto bull said he saw a number of bullish factors that lie ahead for bitcoin. Despite the coin's 17% slide over the past month, bitcoin is still on track to eventually reach $170,000, and could potentially pass the $100,000 mark by the end of the year, Scaramucci told CNBC in an interview on Monday.\n\"We still love the fundamentals of bitcoin long term,\" he added, pointing to three positive catalysts for the crypto.\nBitcoin investors could be on the receiving end of a wave of crypto payments — and they're likely to sow a significant portion of that back into the market, Scaramucci said.\nMount Gox, the defunct crypto exchange that failed a decade ago, is already starting to pay back the $9 billion it owes its creditors and customers, the company said in a statement last week.\nFTX, the crypto exchange that collapsed and roiled the digital asset market in 2022, is also planning to pay back most of its depositors in full. That could return up to $16 billion of crypto back to investors, lawyers for the exchange said.\nAround 40%-50% of payouts could end up being reinvested in crypto, Scaramucci estimated, based on the loyalty many \"hardcore\" early bitcoin investors have.\n\"A lot of that was in bitcoin, it got frozen in the bankruptcy, it got dollarized, unfortunately, at low numbers for bitcoin, but going to go back to those account holders shortly, and we think a lot of that will flow back into the asset,\" he said of FTX customer deposits.\nLawmakers have introduced a bill setting a regulatory framework for crypto. That's one promising sign bitcoin is becoming a more widely accepted storage of value, which is bullish for its long-term trajectory, Scaramucci said.\n\"Right there, glaringly in the GOP platform, is the protection of digital assets and the protections specifically of bitcoin,\" he added. \"To me, I think it's an overwhelming conclusion that this will be an acceptable long-term asset class in the United States.\"\nBitcoin's price has been depressed partly due to temporary selling pressure, Scaramucci said.\nBitcoin's halving event, for instance, fueled some selling pressure among miners trying to keep profits afloat, he noted, while Mount Gox's repayments have also fueled some selling pressure from investors regaining access to their crypto investments.\nThe German government has also offloaded several hundred million worth of crypto after law enforcement seized around $2.2 billion in bitcoin from a movie piracy site in 2024. The government sent another $155 million in bitcoin to various crypto exchanges and market makers on Monday, according to data from blockchain analytics site Arkhan Intelligence.\nThose selling pressures, though, will likely subside, Scaramucci said. That's in-line with other crypto forecasters, who have predicting the coin will recover from its slump in the coming months as sellers back off.\nBitcoin treaded slightly higher on Tuesday, trading around $57,000. Despite its recent selloff, the crypto is still up 29% from levels at the start of the year, attesting to more bullish sentiment among risky assets.\nCheck out Business Insider's picks for  best cryptocurrency exchanges\nCheck out Business Insider's picks for  best cryptocurrency exchanges"]}
{"date":"2024-07-10","titles":["Institutional investments could trigger next bitcoin bull cycle","Current price of Bitcoin: Oct. 14, 2024","Current price of Bitcoin: Sept. 23. 2024"],"urls":["https:\/\/finance.yahoo.com\/news\/institutional-investments-could-trigger-next-150555283.html","https:\/\/fortune.com\/recommends\/investing\/current-bitcoin-price-10-14-2024\/","https:\/\/fortune.com\/recommends\/investing\/current-bitcoin-price-09-23-2024\/"],"sources":["Yahoo Finance","Fortune","Fortune"],"descriptions":["Experts discuss bitcoin’s volatility and future, emphasizing market dynamics and institutional investments.","Since its debut in 2009, Bitcoin has remained the most popular cryptocurrency.","Since its debut in 2009, Bitcoin has remained the most popular cryptocurrency."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin’s volatile nature remains a hot topic among crypto enthusiasts and industry leaders alike. In a recent discussion, Roundtable anchor Rob Nelson engaged Brian Dixon, CEO of Off The Chain Capital, and Noah Newton, CEO of Moby Media, in a deep dive into the factors influencing bitcoin's recent price movements and future trajectory. Their insights provide a nuanced understanding of the current market dynamics and what lies ahead for the world's most well-known cryptocurrency.\nRob Nelson opened the discussion by likening bitcoin to a truth-teller with its inherent self-regulation. He observed the growing demand for bitcoin, pointing out that while ETFs are selling out, traditional investors are puzzled by the simultaneous price drop. \"Shouldn't the price be going up, not down?\" he pondered, reflecting a common sentiment among investors.\nBrian Dixon attributed the recent short-term drawdown to market mechanics, particularly pointing to Germany's significant daily sales of seized bitcoin. He noted, \"Germany is allegedly selling 80 to 100 bitcoin daily, creating some of the short-term drawdown.\" Despite this, Dixon remains optimistic about bitcoin's long-term trajectory, emphasizing that the real bull cycle is yet to come. He highlighted the pending institutional allocations from sovereign wealth funds and pension plans as key drivers for future price surges.\nDixon also shed light on bitcoin's historical performance, noting that significant drops are typical during bull cycles. \"A 20 to 30% drop should be expected,\" he said, referencing past bull runs. He believes the current fluctuations are normal and anticipates substantial growth once institutional investments materialize.\nNoah Newton, on the other hand, adopted a more steadfast approach. He distinguished between bitcoin, ethereum, and other cryptocurrencies, emphasizing his commitment to bitcoin irrespective of price fluctuations. Newton revealed his strategy of dollar-cost averaging into bitcoin over the past five years. \"The price doesn't affect me because I know where it's going,\" he stated confidently.\nWhen asked about year-end predictions, Newton refrained from providing specific numbers but expressed his belief that bitcoin might remain under $100,000 by year's end, though he positions himself for a potential rise above $100,000. This cautious yet optimistic outlook underscores his long-term confidence in bitcoin's value.","Gary Shapley was named the new agency leader on Tuesday.\nSign up for the CEO Daily newsletter\nGet global perspectives and insights from CEOs on the biggest stories in business.\nThe U.S. economy is in chaos. What happened and how you should respond.\nThe top companies on our list have one thing in common: Staff largely trust leadership to see them as well-rounded people and reward them for a job well done.\nA generous profit-sharing policy and premium amenities have lifted Delta. Can Bastian keep it up if the economy loses altitude?","Gary Shapley was named the new agency leader on Tuesday.\nSign up for the CEO Daily newsletter\nGet global perspectives and insights from CEOs on the biggest stories in business.\nThe U.S. economy is in chaos. What happened and how you should respond.\nThe top companies on our list have one thing in common: Staff largely trust leadership to see them as well-rounded people and reward them for a job well done.\nA generous profit-sharing policy and premium amenities have lifted Delta. Can Bastian keep it up if the economy loses altitude?"]}
{"date":"2024-07-11","titles":["Retail investors panic as bitcoin volatility spikes","MicroStrategy to Split Stock 10:1 After Share Price Triples in a Year on Bitcoin Rally","BTC TO USD: Today’s Bitcoin price in Dollar on 11 July, 2024","BTC TO PKR: Today’s Bitcoin price in Pakistan on 11 July, 2024"],"urls":["https:\/\/finance.yahoo.com\/news\/retail-investors-panic-bitcoin-volatility-215142040.html","https:\/\/finance.yahoo.com\/news\/microstrategy-split-stock-10-1-132307391.html","https:\/\/www.bolnews.com\/business\/2024\/07\/btc-to-usd-todays-bitcoin-price-in-dollar-on-11-july-2024\/","https:\/\/www.bolnews.com\/business\/2024\/07\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-11-july-2024\/"],"sources":["Yahoo Finance","Yahoo Finance","BOL News","BOL News"],"descriptions":["Bitcoin's rapid market changes create both opportunities and emotional challenges for retail investors.","The company is the largest corporate bitcoin holder with more than $13 billion worth of BTC in its treasury.","As of July 11, Bitcoin to USD exchange rate stood at $58626.53. Bitcoin’s value in dollars reflects dynamic nature of cryptocurrency market.","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16329803.13 on 11 July 2024."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin's unpredictable nature has been a topic of intense discussion lately, with fluctuations causing both excitement and panic among investors. Roundtable anchor Rob Nelson, along with Sam Price, Host of Crypto Lifer, and Claire Ching, Head of Institutional at Gemini, delve into these dynamics, providing insights into both retail and institutional perspectives.\nRob Nelson opened the discussion by addressing the common concerns among retail investors regarding bitcoin's volatility. He pointed out that people often panic when they see rapid price changes, like bitcoin's recent dip from $73,000 to $64,000. \"It's an overreaction, but understandable given the unfamiliarity with such volatility,\" he remarked.\nSam Price shared his thoughts on why retail investors often panic during price drops. He explained that bitcoin creates quick opportunities due to market catalysts like ETFs, which lead to bursts of activity and subsequent corrections. Price highlighted that retail investors often have unrealistic expectations, thinking their investments will grow steadily without encountering volatility. \"When it becomes a little rocky, their emotions get very strong,\" he noted.\nNelson further discussed the behavior of bitcoin holders, contrasting it with typical investment strategies. He pointed out that many investors hold onto bitcoin long-term, unlike other assets where people tend to buy and sell more frequently. “Bitcoin's kind of weird that so many people literally hold it and will never let it go,” he said, emphasizing the unique approach of bitcoin investors.\nChing provided an institutional perspective, discussing the broader market trends and the impact of meme coins. She noted that meme coin performance has plummeted, indicating a significant shift in retail investor behavior. “For those of you tracking meme coin performance, it's absolutely just on the ground,” she stated. Ching suggested that the current market conditions might present a clean slate for investors to re-engage, as positions become more manageable after significant drawdowns.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nNasdaq-listed software firm MicroStrategy (MSTR), the largest corporate holder of bitcoin {{BTC}} , announced a 10-for-1 stock split on Thursday.\nThe split will be effected on Aug. 1 and shares will be distributed after the Aug. 7 market close, the company said in a press release. Holders of class A and class B common shares will receive nine additional shares for each share they own.\nThe company said that the split will make the company's shares \"more accessible to investors and employees.\"\nThe announcement comes after MicroStrategy's share price more than tripled over the past year, hitting an all-time record of over $1,900 in March as BTC rallied past $70,000. The shares rose 6.8% to $1,300 today.\nMicroStrategy, led by executive chairman and widely followed bitcoin proponent Michael Saylor, is often viewed as a leveraged play on the price of bitcoin. The company regularly issues corporate debt to raise funds to buy more bitcoin for its treasury. After its latest purchase last month, the company held 226,331 BTC worth over $13 billion.\nRead more: MicroStrategy Is Pioneering Bitcoin Capital Markets, Bernstein Says\nStock splits are common among public companies whose shares have significantly appreciated. While the split does not change the company's valuation, it could make the stock psychologically more accessible to smaller, retail investors by reducing the share price even at a time when many retail-facing trading platforms offer fractional shares. Most recently, chipmaker juggernaut Nvidia (NVDA) saw a 10:1 stock split last month after reaching a four-digit share price, tripling in a year fueled by the artificial intelligence-driven (AI) equities rally.","11th Jul, 2024. 05:39 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 6, 2024\nAs of July 11, the Bitcoin to USD exchange rate stood at $58626.53. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 58626.53 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","11th Jul, 2024. 05:23 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO PKR – Today’s Bitcoin price in Pakistan on Feb 7, 2024\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16329803.13 on 11 July 2024.\n1 BTC =  16329803.13 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
{"date":"2024-07-12","titles":["Crypto market jitters alleviated as Germany finishes bitcoin sell-off","Will bitcoin's market fundamentals prevent a drop below $40k?"],"urls":["https:\/\/finance.yahoo.com\/news\/crypto-market-jitters-alleviated-germany-215049442.html","https:\/\/finance.yahoo.com\/news\/bitcoins-market-fundamentals-prevent-drop-194047598.html"],"sources":["Yahoo Finance","Yahoo Finance"],"descriptions":["Despite panic among crypto investors that Germany's sell-off would cause bitcoin's price to plunge, the digital asset has held on.","Rob Chang discusses bitcoin's market stability and future technological advancements."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nOn Friday afternoon, the German government’s efforts to empty its bitcoin wallets of billions of dollars in assets seized from criminals reached its conclusion, with the wallets now holding zero digital assets, according to new data from blockchain analytics firm Arkham Intelligence.\nOver the past month, the wallet transfers sparked intense fear in the crypto community that the price of bitcoin, the world’s largest cryptocurrency, would slide as a result of the German government’s large sell-offs.\nInstead, bitcoin’s price rose 3%. At the time of writing, bitcoin’s price is now valued at more than $58,000, representing a 1% jump in the last 24 hours.\nIn June, the German government’s bitcoin wallets contained nearly $3.4 billion in bitcoin, but Berlin has been working aggressively to liquidate its seized assets. Earlier this month, the Federal Criminal Police Office of Germany, known as the Bundeskriminalamt (BKA), offloaded $2.8 billion in bitcoin, or 50,000 bitcoin.\nThe government transferred funds to major crypto exchanges in the U.S. and Europe like Coinbase, Bitstamp, and Kraken.\nMarket watchers of the German government’s sell-off have closely tracked the bitcoin wallet transfers and noted that some of the government’s transfers have been returned to the German government’s wallet addresses, indicating that the BKA was simply gauging liquidity before offloading assets.\nOn Thursday, crypto’s “Fear and Greed” index plunged to “extreme fear” on the back of German government’s transfers, but those jitters were quickly alleviated when the sell-offs were completed. In fact, some analysis points to the fact that elevated levels of investor anxiety may present prime opportunities to buy bitcoin.\n“One of the best metrics for identifying optimal entry points in a bull market is when short-term bitcoin holders sell at a loss and the fear index is ridiculously high (which has been happening in recent weeks),” noted a CryptoQuant analyst. “In contrast, previous market peaks have been signaled by long-term holders taking significant profits over numerous months, which hasn’t happened yet.”","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe cryptocurrency market is no stranger to volatility, and bitcoin, its flagship asset, is often at the center of these turbulent waves. As debates continue over its future, Roundtable anchor Rob Nelson and Rob Chang, CEO of Gryphon Digital Mining, delve into bitcoin's market dynamics, floor prices, and technological prospects.\nRob Nelson kicked off the conversation by expressing his belief that bitcoin's price is unlikely to drop below $40,000, barring a global catastrophe. He acknowledged the inherent volatility of the cryptocurrency market but remained confident in bitcoin's fundamental strength. \"I don't see us going back to the old floors,\" Nelson asserted, highlighting his optimism for bitcoin's resilience.\nChang echoed Nelson's sentiment, emphasizing that bitcoin's current price is influenced by its production costs. He pointed out that the average cost to mine bitcoin is around $70,000, suggesting that the current trading price, hovering in the $50,000 range, is an overcorrection. Chang speculated that only a significant catalyst, such as the recent events involving Germany and Mt. Gox, could push bitcoin's price further down. However, he remained hopeful, noting, \"We have lots of upside from here.\"\nThe discussion then shifted to bitcoin's potential as an asset beyond its store of value proposition. Nelson questioned when bitcoin's value as an emerging technology would begin to materialize, given its current status primarily as a speculative investment. Chang acknowledged this, noting that most bitcoin holders are motivated by its potential for price appreciation or its ability to hedge against currency devaluation. He conceded that bitcoin might not see significant technological use cases in the immediate future, suggesting a timeframe of two to three years before more substantial applications emerge.\nDespite this, Chang remained optimistic about bitcoin's potential. He mentioned that while other cryptocurrencies like ether might have clearer technological use cases, bitcoin's status as digital gold will likely remain its primary appeal. \"We might see more technological uses where there's greater demand,\" Chang speculated, emphasizing the untapped possibilities of bitcoin and its blockchain technology."]}
{"date":"2024-07-15","titles":["Bitcoin surges to two-week high as Trump’s election odds improve","Shares in Trump’s media company surge and bitcoin rises after assassination attempt - business live"],"urls":["https:\/\/finance.yahoo.com\/news\/bitcoin-surges-two-week-high-193234597.html","https:\/\/www.theguardian.com\/business\/live\/2024\/jul\/15\/burberry-chief-executive-china-economy-gdp-sterling-ftse-100-business-live"],"sources":["Yahoo Finance","The Guardian"],"descriptions":["Bitcoin saw gains of 8.6%, climbing to a price of $62,508 after overcoming last week's slump.","Live, rolling coverage of business economics and financial markets as share price of Trump Media & Technology Group and cryptocurrency price rise as traders position for Trump election victory"],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nOn Monday, the world's largest cryptocurrency, bitcoin, hit a fresh two-week high as former President Trump's election odds jumped — improving in the aftermath of a thwarted assassination attempt in Pennsylvania this weekend. Bitcoin saw gains of 8.6%, climbing to a price of $62,508 after overcoming a slump last week.\n“Trump has consistently been seen as the pro-crypto candidate,” Pat Doyle, blockchain researcher at Amberdata, told TheStreet Crypto. “The market's response to the recent failed assassination attempt underscores strong investor confidence in Trump's prospects for winning the upcoming election.\"\nPopular crypto betting sites like Polymarket show crypto betters placing the odds of Trump's potential presidential victory at 71%, reflecting \"significant market support for his candidacy,\" according to Doyle. \"This positive sentiment is reflected in Bitcoin's price movement,” Doyle added.\n“Looking ahead, the primary election-related catalyst that could significantly impact the market is the potential resignation of President Biden,\" Doyle added, pointing out that Trump's pro-crypto stance will likely reverberate positively across crypto markets.\n\"Such a development could be perceived positively by crypto investors, anticipating a shift in regulatory dynamics,\" he said. \"Other scheduled events, including national conventions and presidential debates, will likely have a more subdued impact on the market.”\nBitcoin exchange-traded funds (ETFs) also continued their positive price momentum this month. Last week, crypto ETFs drew in more than $1.35 billion in funds, representing their fifth best week in their history, according to CoinShares data. The surge in inflows was catalyzed by two major factors: the German government’s recent selloff of bitcoin and “a turnaround in sentiment due to lower than expected CPI [Consumer Price Index] in the U.S., [which] prompted investors to add to positions,” according to CoinShares head of research James Butterfill.","Live, rolling coverage of business economics and financial markets as share price of Trump Media & Technology Group and cryptocurrency price rise as traders position for Trump election victory\nShares in Donald Trump’s media company have surged to their highest point since mid-June in the opening minutes of trading on Wall Street, as investors bet that the attempted assassination of the former president will boost his chances of re-election.\nThe share price of Trump Media and Technology Group soared as high as $46.27 on Monday morning in New York – before dropping back to $39. That was a steep 27% increase, although not quite the $50 mark that had been indicated in pre-market trading.\nThe theory that traders appeared to be following was that the assassination attempt makes Trump’s election more likely in November, and that that would somehow increase earnings significantly from Truth Social, his rival network to X, formerly Twitter.\nBut it was not just Trump-specific assets that gained ground. US markets also rose more broadly, and the Dow Jones industrial average rose to a new record high.\nBob Savage, head of markets strategy and insights at BNY Mellon, an investment bank, said:\nThe narrative for the day rests on the “Trump Trade” with many investors assuming the weekend events add to the former president being re-elected. The logic being that the chances of tax cut extensions and higher trade tariffs – leading to even higher US fiscal deficits, even alongside potential growth headwinds and intense political pressure on the Federal Reserve to ease as inflation continues to subside near term. Some also suspect a possible withdrawal of US support for Ukraine would also up fiscal pressures in Europe, who may then have to pick up the funding for the war.\nYou can continue to follow our live coverage from around the world:\nIn the US, Trump says RNC speech will be ‘a lot different’ since shooting at Pennsylvania rally\nIn the UK, Starmer faces test of Labour discipline after SNP proposes vote on ending two-child benefit cap\nIn our Europe coverage, Estonia PM Kaja Kallas resigns to take up EU foreign policy role\nIn our coverage of the Israel-Gaza war, Unrwa HQ ‘turned into a battlefield’ in heavy fighting, says agency chief\nUS stock markets have risen at the opening bell on Monday, in a move some analysts said was related to increased expectations of a presidential election victory by Donald Trump after the attempted assassination on Saturday.\nHere are the opening snaps, via Reuters:\nS&P 500 UP 23.71 POINTS, OR 0.42%, AT 5,639.06\nNASDAQ UP 92.11 POINTS, OR 0.50%, AT 18,490.56\nDOW JONES UP 281.17 POINTS, OR 0.70%, AT 40,282.07\nThe assassination attempt, and Trump’s defiant reaction, have prompted some people to say that a Republican victory is more likely.\nChris Zaccarelli, chief investment officer for Independent Advisor Alliance, said:\nIn a Republican administration, you’ll see a lower tax policy, lower regulatory policy... that’s typically good for stocks. We’re seeing some of that in terms of forward looking expectations from investors at this point.\nWhat will China do to try to hit its 5% annual growth target, given the slowdown revealed today?\nDuncan Wrigley, chief China+ economist at Pantheon Macroeconomics, a consultancy, said:\nPresident Xi Jinping today delivered a work report at the Third Plenum on deepening reform and promoting modernisation, with details yet to be released. The focus will probably be on promoting high-tech and manufacturing as the path to higher productivity and sustained growth in the longer term.\nMeasures to encourage private-sector and foreign business investment are likely, but sweeping reforms to create a consumption-driven growth model, such as household residency reform or building a universal welfare system, are unlikely.\nThe FTSE 100 is down by 0.3% in London. Burberry apart, some of the biggest fallers are miners, who have been hit by concerns over the Chinese economy.\nMining company Antofagasta, whose speciality is copper, fell by 4.1%, while Anglo American fell by 2.1%.\nChina is struggling to keep up the speed of its economy, as the property industry and consumption slow.\nLynn Son, chief economist for Greater China at ING, an investment bank, said:\nThe drag from the property market should come as no surprise. The actual drag on GDP growth will likely persist for an extended period of time, as even if prices bottom out, there is still a high level of inventories that need to be digested before new investment takes place.\nAnd that has hit consumption:\nA negative wealth effect from falling property and stock prices, as well as low wage growth amid various industries’ cost cutting, is dragging consumption and causing a pivot from big-ticket purchases toward a basic “eat drink and play” theme consumption.\nHowever, there was still demand from industry, which could help the Chinese economy weather the slump in spending:\nWe continued to see strong growth in hi-tech manufacturing (8.8% YoY) and computer and electronic equipment manufacturing (11.3% YoY), which should remain a major area for growth as China prioritises its transition toward higher end manufacturing and establishing technological self-sufficiency.\nPressure on Beijing to take steps to improve Chinese consumer confidence has intensified after news that weak retail spending dragged down the growth rate of the world’s second biggest economy.\nWith falling house prices still acting as a drag on activity, official figures showed the Chinese economy expanding at an annual rate of 4.7% in the second quarter – much weaker than the 5.1% expected by the financial markets.\nAnnual retail sales growth slowed from 3.2% to 2% in the three months ending in June – the weakest in 18 months – and fell slightly in June alone.\nYou can read the full report here:\nWe have had some economic updates on industry in Europe and the US.\nIn Europe, industrial production data published this morning showed that output fell by 0.6% during May – less than the 0.8% expected by economists. Output over the course of the previous year was also revised up slightly, although it was still down by 2.9%.\nIn the US, the New York Federal Reserve’s manufacturing survey showed activity slowing slightly – although it was better than expected.\nGoldman Sachs made profits of $3bn in the second quarter of 2024, more than double last year thanks to strong bond trading profits.\nThe Wall Street bank’s revenues were $12.7bn for the second quarter of 2024, 17% higher than the second quarter of 2023, but 10% lower than the bumper first quarter of 2024 when it benefited from a surge in debt issues and some major mergers and acquisitions.\nGoldman’s share price is up by nearly a quarter so far in 2024, as investors appear to welcome a return to focusing on the investment banking that made it one of the best known names in US finance. Goldman had made a brief foray into consumer banking.\nThe bank’s strong share price performance has benefited its bankers, whose shared bonus pot increased by 20% this year.\nDavid Solomon, Goldman’s chief executive, said:\nWe are pleased with our solid second quarter results and our overall performance in the first half of the year, reflecting strong year-on-year growth in both global banking and markets and asset and wealth management.\nThe Bank of England needs to “stop squeezing living standards” and cut interest rates, a senior policymaker has said.\nSwati Dhingra, a member of the central bank’s monetary policy committee (MPC), said official borrowing costs should be cut at its next meeting on 1 August to ease pressure on households and businesses.\nDhingra told the Rest is Money podcast:\nNow is the time to start normalising [interest rates], so that we can then finally stop squeezing living standards the way we have been to try and get inflation down. We are weighing on living standards and that cost does not need to be paid.\nWhether the Bank cuts borrowing costs in August for the first time since the Covid pandemic is thought to be on a knife-edge, with City investors pricing in a 50\/50 chance of a cut from the current level of 5.25%.\nYou can read the full report here:\nShares in retail technology company Ocado have slumped by 11% after an investment broker downgraded its expectations.\nOcado fell by 11.3% on Monday, making it the biggest faller on the FTSE 250 index. Only Burberry – now down 17% after dispensing with its chief executive – has done worse today.\nOcado uses robots running around grids to try to make supermarket deliveries more efficient and therefore profitable. However, after surging in value during the coronavirus pandemic lockdowns, investors have grown wary of its expected cash needs.\nReuters reports that Bernstein, a US brokerage, has said the company’s shares will “underperform”, compared to a previous rating of “outperform”. It expects the share price to move towards 260p – a stark cut from its previous target of 1000p.\nThe report suggests that Ocado should “consider its options” to go private in a grocery deal and reduce cash burn. That would be a major blow to the London Stock Exchange, given that Ocado is one of the few prominent UK tech companies.\nThe broker said:\nLiquidity challenge is real and significant with both existing debt refinancing and a need for more cash soon.\nThe UK government’s stake in NatWest has fallen below 20% for the first time since the bank was bailed out during the financial crisis.\nNatWest, formerly Royal Bank of Scotland, said that the government now owns 19.97% of its shares, after selling off 81m. The government had owned 38% in May, before a programme of share sales.\nPaul Thwaite, NatWest’s chief executive, said:\nReturning NatWest Group to full private ownership remains a key ambition and we believe it is in the best interests of both the bank and all our shareholders.\nLet’s take a closer look at the numbers for Donald Trump’s media company: he could be in line for a paper gain of $2bn thanks to the soaring valuation after the failed assassination attempt over the weekend.\nTrump Media and Technology Group’s shares started trading at $57.25 on 26 March, when it merged with a special purpose acquisition company (Spac). It soared on its first day to a high of $79.38 – briefly valuing it at more than $10bn. It has not hit those heights since then.\nSpacs became a sensation during the financial market bubble during the coronavirus pandemic lockdowns. A shell company lists on the stock market, raises a load of cash, and then looks for a company to merge with – offering a quicker route to a listing.\nTrump’s company – whose stock market ticker bears his initials, DJT – jumped on the Spac bandwagon, and benefited from the “meme stock” craze as many political supporters bought in.\nYet the financial reality facing the company has been quite tricky, as the Truth Social network has struggled to attract the users to justify its lofty valuation. In April the company’s share price dropped as low as $22.55.\nIt has never recovered to its opening price on 26 March, and by Friday it was at $30.89.\nIn pre-market trading (which happens off the main stock exchange) the value of DJT shares rose by as much as 70%, although that surge has weakened somewhat in recent minutes. Google Finance suggests the share price is up 53% at $47.29.\nDJT was worth $5.87bn at the close on Friday, and Trump himself owns 60%, according to Refinitiv.\nIf that 53% gain is replicated when US markets open, then the notional value of Trump’s fortune would rise by about $2bn.\nHowever, Trump is prevented from cashing out on his fortune until September, under terms that prevent him selling shares. The US presidential election does not take place until November.\nThe reaction to the Trump assassination attempt on traditional financial markets has been fairly muted – especially compared with the Trump Media & Technology Group share price surge.\nThe US dollar is almost flat against a trade-weighted basket of currencies, while US futures prices suggest US benchmark stock indices will gain about 0.5% when they open later.\nUS Treasury bond yields have tended to rise when the prospect of Donald Trump winning back the presidency appears to increase. That is on the assumption that his economic policies would increase inflation and add to government debt.\nThe price of benchmark 10-year Treasury bonds fell in price on Monday. The yield on those bonds (which moves inversely to prices) rose by 0.02 percentage points to 4.206.\nThe share price of Donald Trump’s media company has surged in pre-market trading after the attempted assassination of the US presidential candidate.\nDemand for shares in Trump Media & Technology Group (TMTG), the owner of the X rival Truth Social, appeared to soar on Monday. The share price rose 70% in trading ahead of the opening of New York’s Nasdaq stock exchange.\nTraders appear to be speculating that the assassination attempt makes a Trump victory in the November presidential election more likely, and that that would benefit TMTG, despite its financial struggles so far.\nThe price of bitcoin has jumped 10% in a move that some analysts have linked to the attempted assassination of Donald Trump on Saturday.\nThe price of one bitcoin rose above $63,000 on Monday, and was up 9% over the day, according to Refinitiv.\nThe cryptocurrency – which tends to be more volatile than many traditional assets – had slumped from above $70,000 in early June to below $54,000 in early July. Its record high was in March, when it hit 73,803.\nThe theory is that the Trump’s defiance after the assassination attempt makes him more likely to win, and that he will then be more likely to ease regulations on bitcoin, as he has courted crypto advocates, including in a June meeting with crypto “miners” (owners of computers that make the calculations crucial to the decentralised cryptocurrency’s functioning). Many cryptocurrency advocates have links to libertarian politics.\nThe price of #Bitcoin is up nearly 10%(!) following the attack on Donald #Trump. As the odds of Trump winning the US elections rise, so does Bitcoin, underscoring that it is highly susceptible to shifts in the political landscape. This makes the work of investors harder, as… pic.twitter.com\/Z8HLrEMEVw\nRania Gule, market analyst at XS.com, an online trading platform, said that bitcoin had gained after Joe Biden’s poor performance in a debate against Trump earlier this month:\nI believe that US political news is driving gains in cryptocurrencies because it is a “speculation-driven” area.\nIf re-elected, Trump may seek less stringent regulatory policies towards cryptocurrencies, potentially improving regulatory conditions and encouraging more investments.\nHis policies towards international relations and foreign trade also have a significant impact on the market, as tensions or stability in international relations may lead to fluctuations in cryptocurrency markets.\nYou can follow more news on US politics as Trump prepares to accept the Republican party’s nomination as US president:\nRecruiter Robert Walters has also warned that it does not expect the jobs market to pick up at least until next year, after a slowdown in hiring across the world.\nUK revenues for the London-listed company were down 18%, while Asia Pacific revenues were down 15%.\nToby Fowlston, chief executive, said:\nFee income for the first half of 2024 continued to reflect the rebasing in market conditions relative to the post-pandemic peak. This period of market adjustment is now longer in duration than previously expected, with macroeconomic turbulence and political uncertainty restraining client and candidate confidence in certain geographies.\nOur near-term planning now assumes that any material improvement in confidence levels will be gradual, and likely not occur before 2025.\nBurberry’s struggles and the surprisingly weak Chinese economic figures are putting luxury and fashion stocks across Europe under pressure.\nWatch company Swatch Group also reported a steep fall in sales in the first half of its financial year. JP Morgan analysts said that Swatch has one of the highest exposures to China among its European rivals, according to Reuters. they wrote:\nWe think the sector will likely come under pressure first thing this morning, and notably Richemont, the most obvious read-across.\nCartier owner Richemont fell 2.6% and Louis Vuitton owner LVMH was down 1.7%.\nAs might be expected after such a brutal set of news on Monday morning, Burberry’s share price has slumped.\nThe fashion company is down 11% in early trading.\nIt has been a pretty torrid year. You can see today’s slump in the very bottom right of the below chart, but it has been one-way traffic for much of 2024. Shares are down 45% for the year.\nIt looks like those Chinese GDP data may have set the mood for Monday on stock markets, with Europe’s indices falling at the opening bell.\nLondon’s FTSE 100 and Spain’s Ibex are both down 0.4% in early trading, so it doesn’t seem to be a reaction to the football at least.\nHere are the opening snaps, via Reuters:\nEUROPE’S STOXX 600 DOWN 0.3%\nGERMANY’S DAX DOWN 0.2%\nBRITAIN’S FTSE 100 DOWN 0.4%\nFRANCE’S CAC 40 DOWN 0.5%, SPAIN’S IBEX DOWN 0.4%\nEURO STOXX INDEX DOWN 0.4%; EURO ZONE BLUE CHIPS DOWN 0.4%\nGood morning, and welcome to our live coverage of business, economics and financial markets.\nAll change at the top of British fashion: Burberry has announced the departure of chief executive Jonathan Akeroyd after it was forced to cancel its dividend after a slump in sales.\nAkeroyd has left the FTSE 100 company “with immediate effect by mutual agreement with the board”, Burberry said on Monday morning. Burberry has appointed American Joshua Schulman, a former Michael Kors boss, to replace him.\nGerry Murphy, Burberry’s chair said the performance was “disappointing”. He said:\nWe moved quickly with our creative transition in a luxury market that is proving more challenging than expected. The weakness we highlighted coming into full year 2025 has deepened and if the current trend persists through our second quarter, we expect to report an operating loss for our first half. In light of current trading, we have decided to suspend dividend payments in respect of full year 2025.\nThe data published by Burberry in its accompanying trading update do not make for pretty reading for shareholders: comparable store sales are down by 21% to £458m in the 13 weeks to 29 June.\nIn the Asia Pacific region sales are down by 23%. Revenues across the entire financial year could drop by 30%. Burberry said:\nWe are operating against a backdrop of slowing luxury demand with all key regions impacted by macroeconomic uncertainty and contributing to the sector slowdown.\nBuberry’s struggles have been put into context by Chinese GDP figures earlier this morning: growth slowed to 4.7% year-on-year in the second quarter, down from 5.3% in the first quarter and below the 5.1% expected by economists polled by Reuters.\nChina’s Communist party leaders are meeting for their “third plenum” this week, the forum that takes place about every five years at which they set out their long-term policies on the economy. The government is aiming for 5% growth in 2024, which may be a challenging target if the weakness persists.\nThe figures were “hampered mainly by weak consumer spending and demand”, said analysts at Deutsche Bank led by Jim Reid. They added:\nOther data showed that China’s retail sales slowed to +2.0% y\/y in June (v\/s +3.4% expected and the worst since December 2022) after advancing +3.7% in May, thus highlighting that the world’s second largest economy is struggling to boost consumption. Adding to the negative sentiment, China’s home prices fell again in June, declining -0.67% on the month with existing home prices declining -0.85%.\n10am BST: Eurozone industrial production (May; previous: -0.1% month-on-month; consensus: 1%)\n1:30pm BST: US New York Fed manufacturing index (July; prev.: -6; cons.: -6)"]}
{"date":"2024-07-16","titles":["Sam Bankman-Fried’s fraud leaves lasting impact on crypto market","Bitcoin ETFs drive mainstream adoption despite regulatory hurdles"],"urls":["https:\/\/finance.yahoo.com\/news\/sam-bankman-fried-fraud-leaves-192242034.html","https:\/\/finance.yahoo.com\/news\/bitcoin-etfs-drive-mainstream-adoption-191905312.html"],"sources":["Yahoo Finance","Yahoo Finance"],"descriptions":["Aaron Williams shares advice on handling crypto volatility and ignoring regulatory noise for better investments.","Richard Levin and Aaron Williams share strategies for handling bitcoin’s volatility and investment."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCryptocurrency remains a hot topic, with its volatile nature and evolving regulatory landscape often causing concern among investors. Roundtable anchor Rob Nelson, alongside Aaron Williams, Co-host of Bitcoin Bros, and Shalin Madan, Co-Founder and Chief Growth Officer at Formidium, delve into these issues, providing insights and advice for those involved the crypto world.\nNelson opened the discussion by emphasizing the distinction between Sam Bankman-Fried's fraud and the intrinsic value of cryptocurrencies. \"We're just going to keep paying for the sins of Sam Bankman-Fried,\" Nelson remarked. He made it clear that the fraudulent activities associated with Bankman-Fried were not inherent to crypto itself. Rather, it was a case of plain fraud that happened to occur in the crypto space.\nWilliams echoed this sentiment advising investors to ignore the noise surrounding regulatory fears. \"Regulation in the United States is still on a positive path,\" Williams stated, highlighting the increased legislative attention on crypto over the past five years. He reassured that bitcoin, along with other significant cryptocurrencies, would endure these regulatory challenges, regardless of short-term impacts.\nNelson then shifted the conversation to the volatility of bitcoin, noting that while it can rise and fall rapidly, institutional investors have adapted to these fluctuations. \"Bitcoin isn’t going anywhere,\" he asserted. The real challenge lies in how retail investors perceive and react to these swings. Shalin Madan provided an institutional perspective on managing this volatility.\nMadan pointed out that bitcoin is actually less volatile now compared to a few years ago, signaling its maturation as an asset. He emphasized that understanding and quantifying volatility is crucial for managing investments. \"If something's very volatile, you size it smaller, but it doesn't mean that you don't have any position in your portfolio,\" Madan explained.\nHe also drew comparisons between cryptocurrencies and traditional assets, noting that despite high volatility, cryptocurrencies are measurable and can be incorporated into investment portfolios. This measurable nature makes them more predictable than illiquid assets like real estate, whose value can remain uncertain for years.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin's journey from a fringe digital currency to a mainstream financial asset has been tumultuous, drawing both significant interest and concern. In a recent discussion, Roundtable anchor Rob Nelson, Richard Levin, Chair of FinTech and Regulation Practice at Nelson Mullins, and Aaron Williams, co-host of Bitcoin Bros, delved into the complexities of bitcoin's place in institutional balance sheets and strategies for retail investors.\nNelson kicked off the conversation by addressing the challenges companies face when holding bitcoin on their balance sheets. He highlighted the volatility concerns that can deter organizations from retaining significant amounts of the cryptocurrency, drawing a stark comparison to Michael Saylor's MicroStrategy, which has heavily invested in bitcoin.\nRichard Levin, reflecting on his early involvement in the crypto space, emphasized the unexpected evolution of bitcoin ETFs, which he referred to as ETPs (Exchange Traded Products). He remarked, “If you had told me 14 years later we'd be talking about 11 bitcoin ETFs issued by some of the largest financial institutions in the world, I would've laughed.” Levin pointed out the SEC’s primary missions: Promoting capital formation, protecting market integrity, and safeguarding the investing public. He noted that bitcoin, not classified as a security and traded on markets regulated as money service businesses rather than exchanges, poses unique challenges for investor protection and market integrity.\nLevin further explained the significance of bitcoin ETPs, which offer retail investors a way to gain exposure to bitcoin without the complexities of direct ownership. This development, he argued, aligns with the SEC's goal of balancing technological advancement with investor protection. \"The introduction of bitcoin ETPs is an important step,\" Levin stated, highlighting how these products provide a safer entry point for retail investors.\nNelson then turned to Aaron Williams, asking how Bitcoin Bros advises their audience on managing bitcoin's notorious volatility. Williams emphasized the strategy of dollar-cost averaging (DCA), which involves regularly investing a fixed amount of money into bitcoin regardless of its price. He explained, “It has been the best-performing asset over the past 10 years. If you can dollar-cost average over a couple of years, you'll buy the highs and you'll also buy the lows.” This method, he suggested, can mitigate the fear of significant price drops.\nWilliams also advised viewers to consider increasing their investments during periods of market fear, citing the example of bitcoin's price drop to $18,000 following the FTX debacle. He likened this approach to traditional investing principles, where consistent, small contributions from each paycheck can build a substantial investment over time without the stress of market fluctuations."]}
{"date":"2024-07-17","titles":["Will ETFs and sovereign wealth funds drive bitcoin’s climb?","Wh are so many CEOs endorsing Trump? It's a 'bitcoin play,' Mark Cuban says","Larry Fink’s bitcoin support fuels crypto market growth","Undercovered Dozen ETF Edition: China, Bitcoin, Cybersecurity, Motley Fool +","BTC TO PKR - Today’s Bitcoin price in Pakistan on June 17, 2024","BTC TO USD - Today’s Bitcoin price in Dollar on 17 July, 2024","Ethereum ETFs start trading Tuesday. Here’s what you need to know.","Silicon Valley’s Trump Support A Shady Bitcoin Play, Says Mark Cuban"],"urls":["https:\/\/finance.yahoo.com\/news\/etfs-sovereign-wealth-funds-drive-223620277.html","https:\/\/finance.yahoo.com\/news\/wh-many-ceos-endorsing-trump-201312800.html","https:\/\/finance.yahoo.com\/news\/larry-fink-bitcoin-support-fuels-175112924.html","https:\/\/seekingalpha.com\/article\/4704572-undercovered-dozen-etf-edition-china-bitcoin-cybersecurity-motley-fool-plus","https:\/\/www.bolnews.com\/business\/2024\/07\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-june-17-2024\/","https:\/\/www.bolnews.com\/business\/2024\/07\/btc-to-usd-todays-bitcoin-price-in-dollar-on-17-july-2024\/","https:\/\/fortune.com\/crypto\/2024\/07\/17\/ethereum-etfs\/","https:\/\/www.forbes.com\/sites\/dereksaul\/2024\/07\/17\/mark-cuban-mark-cubans-theory-for-trumps-silicon-valley-support-instability-will-help-bitcoin\/"],"sources":["Yahoo Finance","Yahoo Finance","Yahoo Finance","Seeking Alpha","BOL News","BOL News","Fortune","Forbes"],"descriptions":["Despite positive indicators for bitcoin, Rebecca Chow highlights selling pressure and capital needs for market stability.","Cuban adds that Trump is popular with the industry because of how he will impact bitcoin's price.","The crypto market poised for growth as Larry Fink and political shifts boost investor confidence.","This edition of 12 overlooked ETF ideas includes managed futures for maximizing income and reducing portfolio volatility. Explore more details here.","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 18211457.97 on 17 July 2024.","As of July 17, the Bitcoin to USD exchange rate stood at $65345.80. Bitcoin’s value in dollars reflects the dynamic nature of the","What are spot Ether ETFs and what do they mean for the crypto market?","“You can’t align the stars any better for a BTC price acceleration” than Trump’s economic blueprint, according to Cuban, who simultaneously predicted the decline of the dollar under Trump."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAs bitcoin continues to capture the attention of investors and analysts alike, the dynamics driving its price movements remain a hot topic. In a recent discussion, Roundtable anchor Rob Nelson and Rebecca Chow, Head of Investment Research at ViaBTC Capital, delved into the factors influencing bitcoin's trajectory and the broader crypto market.\nNelson kicked off the discussion by highlighting the positive indicators for bitcoin. He noted that increasing retail acceptance, more investment advisors endorsing crypto, and the rise of ETFs contribute to a favorable environment for bitcoin's price increase. Additionally, Nelson pointed out the potential involvement of sovereign wealth funds, adding another layer of optimism.\nHowever, Rebecca Chow offered a nuanced perspective, emphasizing the complexities within the crypto market. While bitcoin remains the dominant force, Chow explained that ethereum's lagging performance and the overall lack of bullish news could dampen the market's momentum. She underscored the need for fresh, positive developments to invigorate the market and bridge existing gaps.\nNelson further explored the supply and demand dynamics, questioning whether bitcoin and the broader crypto market could defy traditional economic patterns. He suggested that, theoretically, the increasing demand and finite supply should drive bitcoin's price upward. Yet, he acknowledged the unpredictable nature of crypto markets, where price movements might not always align with these fundamentals.\nChow agreed but stressed the importance of considering selling pressure alongside buying interest. She highlighted the exponential growth in the number of tokens, which necessitates substantial capital inflow to counteract the selling pressure. Despite the influx of capital, she cautioned that the market requires even more to stabilize and grow.\nThe discussion also touched on the potential impact of ETFs on capital flow. Nelson questioned whether there are clear pathways for more capital to enter the market, especially in the late summer and fall. Chow responded that interest rates play a significant role in this equation. While she anticipates more capital entering the market, she emphasized the inherent uncertainty in predicting crypto trends.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nShark Tank’s Mark Cuban, the billionaire owner of the Dallas Mavericks, says that Silicon Valley tech entrepreneurs are supporting Donald Trump for president as nothing more than a “bitcoin play.”\n“It’s a bitcoin play,” Cuban posted on social media. “What will drive the price of [bitcoin] is lower tax rates and tariffs, which if history is any guide (and it’s not always), will be inflationary,” he said.\n“Combine that with global uncertainty as to the geopolitical role of the USA, and the impact on the U.S. dollar as a reserve currency, and you can’t align the stars any better for a [bitcoin] price acceleration,” he explained.\nProminent tech CEOs like Elon Musk have endorsed Trump for the 2024 election, throwing millions behind his presidential ticket. The Tesla CEO alone is spending approximately $45 million per month to the Trump election campaign. Gemini co-founders Tyler and Cameron Winklevoss have also donated $2 million to Trump. Other tech entrepreneurs like Palantir co-founder Joe Lonsdale have contributed $1 million to a super PAC (political action committee) supporting Trump, while investors from Sequoia Capital investors have also donated $1 million apiece.\nCuban, however, believes the industry is opting for Trump because of how he impacts bitcoin's price, not because he claims to support digital assets. “Not because the former President is a far stronger proponent of crypto. That’s nice,” Cuban explained. “But doesn’t really impact the price of crypto. It makes it easier to operate a crypto business because of the inevitable, and required, changes at the SEC [U.S. Securities and Exchange Commission].”\nIn recent months, Trump has shifted his tune on bitcoin. Although he previously called bitcoin a scam, the former president now pledges to “defend the right to mine bitcoin” and will be headlining bitcoin’s most well-known conference later this month in Tennessee.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nLarry Fink’s recent remarks on bitcoin have stirred the crypto world. In a significant shift from his earlier stance, the BlackRock CEO now views bitcoin as a \"hedge for optimism\" and a \"legitimate financial instrument.\" This change in perspective was discussed by Mario Nawfal, host of Mario Nawfal’s Roundtable, and Scott Melker, host of The Wolf of All Streets Podcast, highlighting a pivotal moment for cryptocurrency.\nNawfal opened the discussion by noting the dramatic evolution in Larry Fink’s views. Once a skeptic who labeled bitcoin as an \"index for money laundering,\" Fink now praises its potential as a store of value and digital gold. Nawfal emphasized the importance of this shift for traditional investors, especially in today's volatile financial climate.\nMelker pointed out that Fink’s transformation is emblematic of a broader trend among seasoned investors. Melker recounted an anecdote involving Anthony Scaramucci, who was initially mocked by Fink for his bitcoin advocacy. Today, Fink's endorsement of bitcoin and his firm's push for a bitcoin spot ETF signify a notable pivot. Melker lauded Fink for his ability to adapt his views based on new information, showcasing the mark of a great investor.\nThe conversation further delved into the impact of regulatory and institutional developments on the crypto market. Nawfal highlighted recent political shifts, such as Trump's increasing likelihood of a presidential win and J.D. Vance’s addition to his ticket, which may influence crypto regulations. He also noted that since the FTX debacle, Larry Fink’s endorsement has played a crucial role in legitimizing the industry among skeptics.\nMelker echoed these sentiments, adding that the typical four-year cycle in crypto markets might be experiencing an accelerated upswing due to these developments. While acknowledging the usual market corrections, he observed that the recent downturns have been milder compared to previous cycles. This could indicate a more stable growth trajectory for bitcoin and the broader crypto market, with institutional involvement providing a cushion against extreme volatility.\nNawfal concluded by noting a positive shift in market sentiment and capital inflow, bolstered by the launch of ETFs and broader acceptance of various crypto assets. Despite challenges faced by certain segments like NFTs, the overall outlook for the crypto industry appears optimistic. Both hosts agreed that the changing perceptions and increased institutional participation are setting the stage for potential all-time highs.",null,"17th Jul, 2024. 02:15 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 18211457.97 on 17 July 2024.\n1 BTC =  18211457.97 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nAs of July 16, the Bitcoin to USD exchange rate stood at...\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","17th Jul, 2024. 02:14 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 8, 2024\nAs of July 17, the Bitcoin to USD exchange rate stood at $65345.80. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 65345.80 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in...\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.",null,"Donald Trump’s growing support among prominent technology figures is a “bitcoin play,” posited billionaire Trump critic Mark Cuban, offering an arguable—and in Cuban’s words, “contrary”—theory that the potential deterioration of the American economy under Trump will make major Silicon Valley bitcoin investors even richer.\nBillionaire Mark Cuban thinks there's a reason beyond the surface behind Silicon Valley's Trump ... More tilt.\n“You can’t align the stars any better for a BTC price acceleration” than a Trump presidency, Cuban wrote in a Wednesday post on X, arguing it’s not due to Trump’s plan to regulate the cryptocurrency industry less, but rather the fallout of Trump’s broader economic vision.\nLower taxes and higher tariffs, especially on Chinese imports, will make inflation worse, Cuban predicted, and higher inflation typically causes investors to move their money into assets considered more likely to store value, such as commodities like gold or safe haven currencies, the most famous of which is the U.S. dollar.\nBut “global uncertainty as to the geopolitical role of the USA” under Trump may cause “the decline of the dollar as the reserve currency” of choice, theorized Cuban, who alluded to the prospect of “hyperinflation” in which prices quickly skyrocket in a country’s central bank-issued currency.\nThe decline of the dollar would cause the market to flood into the new de facto “global currency” bitcoin, which is not backed by a central bank and whose proponents have long argued is the ultimate safe haven due to its relative independence from the global financial and political systems, causing bitcoin prices to skyrocket due to the digital asset’s scarcity.\nThus, the many bitcoin holders, like Trump backer Elon Musk (whose companies SpaceX and Tesla own a great deal of the token) or early bitcoin investors and pro-Trump donors Cameron and Tyler Winklevoss, would become extremely rich, noted Cuban.\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\nUnsurprisingly considering Cuban admitted his theory is a “contrary opinion” and possibly “crazy,” there are plenty of holes to poke in Cuban’s argument. For one, periods of intense inflation are bad across most industries, as consumers’ diminished spending power typically brings lower profits, similarly causing companies’ valuations to decline as earnings potential shrinks. Basically, for someone to truly profit off of the scenario Cuban outlined in which bitcoin emerges while the broader economy crumbles, they would already need to have an outsized exposure in their portfolio to bitcoin and little exposure to cash or U.S. Treasuries. That isn’t true of many of the big tech Trump supporters with major investments in public and private companies, like Musk, who owns more than $100 billion worth of Tesla’s publicly traded stock, or venture capitalists like Marc Andreessen and Ben Horowitz. In simple math, Tesla held 9,720 bitcoin as of the end of 2023, worth about $6.3 billion at bitcoin’s roughly $65,000 price Wednesday. If bitcoin prices tripled, Tesla would have a stake worth almost $20 billion, a total equivalent to less than 3% of the company’s $800 billion market capitalization, hardly moving the needle.\nAsked by Forbes about the reasoning behind the apparent dissonance between the rising value of bitcoin in a high inflation scenario and the declining value of all other investments, Cuban explained via email that stakeholders in companies deal with “the uncertainty of execution and market forces” and the “incredibly hard” process of passing legislation beneficial to a company’s valuation. Yet “with BTC, you just hit the refresh button :),” wrote Cuban.\nCuban, worth $5.4 billion according to Forbes’ estimates, first grew wealthy with his sale of early streaming service Broadcast.com during the 1990s dot-com boom, and was the majority owner of the NBA’s Dallas Mavericks from 2000 to 2023. Both Cuban of “Shark Tank” and Trump (worth $6.1 billion) of “The Apprentice” grew famous for their reality television business shows, but Cuban, an ardent Biden supporter, has no plans to go into politics despite rumors of a presidential run, he told Forbes in 2020.\nHistorically left-leaning, several notable Silicon Valley products have expressed their support for Trump over the last week, including Musk on Saturday and Andreessen and Horowitz on Monday. Horowitz and Andreessen told employees of their influential Silicon Valley investment firm they intend to donate to political action committees supporting Trump’s election. Horowitz explained Trump is the “right choice” for tech due to the Biden administration’s regulation of industries like artificial intelligence and crypto.\nOne Community. Many Voices. Create a free account to share your thoughts.\nOur community is about connecting people through open and thoughtful conversations. We want our readers to share their views and exchange ideas and facts in a safe space.\nIn order to do so, please follow the posting rules in our site's Terms of Service.  We've summarized some of those key rules below. Simply put, keep it civil.\nYour post will be rejected if we notice that it seems to contain:\nUser accounts will be blocked if we notice or believe that users are engaged in:\nSo, how can you be a power user?\nThanks for reading our community guidelines.  Please read the full list of posting rules found in our site's Terms of Service."]}
{"date":"2024-07-18","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-07-19","titles":["BTC TO USD - Today’s Bitcoin price in Dollar on 19 July, 2024","BTC TO PKR - Today’s Bitcoin price in Pakistan on June 19, 2024"],"urls":["https:\/\/www.bolnews.com\/business\/2024\/07\/btc-to-usd-todays-bitcoin-price-in-dollar-on-19-july-2024\/","https:\/\/www.bolnews.com\/business\/2024\/07\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-june-19-2024\/"],"sources":["BOL News","BOL News"],"descriptions":["As of July 19, the Bitcoin to USD exchange rate stood at $64038.47. Bitcoin’s value in dollars reflects the dynamic nature","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 17818609.53 on 18 July 2024."],"article_contents":["19th Jul, 2024. 03:20 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Jan 17, 2024\nAs of July 19, the Bitcoin to USD exchange rate stood at $64038.47. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 64038.47 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","19th Jul, 2024. 03:19 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO PKR – Today’s Bitcoin price in Pakistan on Feb 1, 2024\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 17818609.53 on 18 July 2024.\n1 BTC =  17818609.53 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
{"date":"2024-07-22","titles":["Crypto surges on political respect as Donald Trump courts bitcoin enthusiasts"],"urls":["https:\/\/finance.yahoo.com\/news\/crypto-surges-on-political-respect-as-donald-trump-courts-bitcoin-enthusiasts-153720599.html"],"sources":["Yahoo Finance"],"descriptions":["The price of bitcoin surged above $68,000 as investors got more hyped about several developments, including a stamp of approval from former President Donald Trump."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCrypto is surging again on a new wave of political respect as former President Donald Trump prepares to speak this week at a bitcoin conference in Nashville.\nThe price of bitcoin (BTC-USD) is up more than 13% over the past month and surged above $68,000 in the last 24 hours, putting the world’s largest cryptocurrency within striking distance of an all-time high set earlier this year.\nThis week, crypto investors are anticipating several reasons to get more hyped, including Securities and Exchange Commission approvals for exchange-traded funds that hold ether (ETH-USD), the world’s second-largest cryptocurrency.\nThose ETFs could make ether a potential staple in 401(k)s, IRAs, and pension plans and grant the digital asset more mainstream acceptance. Many of the same money managers waiting on approval already have ETFs that invest directly in bitcoin.\nBut the big event creating the most excitement in the crypto community is this weekend, when Trump will speak at the Bitcoin 2024 conference in Nashville.\nThe stamp of approval from the Republican presidential nominee has many in the industry expecting a friendlier regulatory approach from Washington, D.C., in 2025 and beyond.\nTrump and many in his party have embraced digital assets as they seek to draw a contrast with the Biden administration, which led a crackdown on many of the industry’s major players following a market meltdown in 2022.\nThe GOP said in its 16-page party platform last week that \"Republicans will end Democrats’ unlawful and unAmerican Crypto crackdown.\"\nTrump, who in the past has called bitcoin a \"scam,\" referred to cryptocurrencies as \"amazing\" in an interview with Bloomberg published last week.\n\"It's more likely that a Trump administration would be more friendly to crypto than the Democrats have been, I think that's clear,\" Ian Katz, a managing director of Capital Alpha Partners, told Yahoo Finance.\n\"We believe the market has not priced in a positive shift in the crypto regulatory environment, and we see significant headroom from institutional investors allocating to crypto and crypto stocks,\" Bernstein analyst Gautam Chhugani added in a note Monday.\nTrump’s economic policies may also help digital assets go higher in the years to come, according to some observers.\n\"What will drive the price of BTC is lower tax rates and tariffs, which if history is any guide (and it’s not always), will be inflationary,\" Dallas Mavericks owner and entrepreneur Mark Cuban said over X last week.\nBitcoin is up more than 50% in 2024 thus far, riding a series of developments that led many in the industry to bet on higher prices.\nThey range from expectations of lower interest rates from the Federal Reserve to wider public acceptance of digital assets by some prominent figures on Wall Street.\nOne such figure is BlackRock CEO Larry Fink, who last week in an interview with CNBC referred to bitcoin as a \"hedge for optimism\" and a \"legitimate financial instrument.\"\n\"I’m a major believer that there is a role for bitcoin in portfolios,\" Fink said.\nBlackRock was among the firms that received approval in January to start issuing a spot bitcoin ETF, which turned out to be a major boon for its first half of the year. Its iShares bitcoin ETF (IBIT) saw $18 billion in net inflows over its first six months.\nIt is also expected to be among the money managers to get approval from the SEC this week to launch the first US-regulated ether ETFs. The SEC has already approved stock exchanges to list those products.\nBitcoin was created in the wake of the 2008 financial crisis as a new kind of money out of the reach of governments. That's led some in financial markets to see it as a kind of digital gold or even a safe haven store of value — even though cryptocurrencies have traded more closely with volatile technology stocks in recent years.\nInvestors have, in fact, flocked to bitcoin during sudden shifts in the monetary order, like at the outbreak of the Russia-Ukraine war, when the US and its allies began placing a number of sanctions on Russia.\nThe next chance for this to happen is when the Fed begins lowering interest rates, which investors expect to happen as early as September.\n\"Bitcoin has not had the opportunity to really shine as a safe haven store value asset,\" said Joel Kruger, a market strategist for London-based currency and crypto trading venue LMAX.\n\"Everything has been built around what is going on in the US equities market for years now and I do think there will be a rotation. Usually what triggers that is [interest] rates changing.\"\nCorrection: A previous version of this article listed an incorrect spelling of Gautam Chhugani's name. We regret the error.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for the latest crypto news, updates, and more related to ethereum and bitcoin prices, crypto ETFs, and market implications for cryptocurrencies\nRead the latest financial and business news from Yahoo Finance"]}
{"date":"2024-07-23","titles":["Cryptocurrencies fall on day 1 of ether ETFs as Mt. Gox moves more bitcoin to creditors","Initial Data Suggests That Spot Ethereum ETFs Are Attracting Around Half Of The Volumes That Spot Bitcoin ETFs Did At Launch","U.S. spot ether ETFs make market debut in another win for crypto industry","first day of trading","BTC TO USD - Today’s Bitcoin price in Dollar on 23 July, 2024","BTC TO PKR - Today’s Bitcoin price in Pakistan on June 23, 2024","Swiss Banks Aim to Plug Crypto Payments Gap Left by US Collapses"],"urls":["https:\/\/www.cnbc.com\/2024\/07\/23\/crypto-market-today.html","https:\/\/wccftech.com\/initial-data-suggests-that-spot-ethereum-etfs-are-attracting-around-half-of-the-volumes-that-spot-bitcoin-etfs-did-at-launch\/","https:\/\/www.theglobeandmail.com\/investing\/article-us-spot-ether-etfs-make-market-debut-in-another-win-for-crypto\/","https:\/\/www.cnbc.com\/2024\/07\/23\/ether-etfs-first-day-of-trading.html","https:\/\/www.bolnews.com\/business\/2024\/07\/btc-to-usd-todays-bitcoin-price-in-dollar-on-23-july-2024\/","https:\/\/www.bolnews.com\/business\/2024\/07\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-june-23-2024\/","https:\/\/www.swissinfo.ch\/eng\/swiss-banks-aim-to-plug-crypto-payments-gap-left-by-us-collapses\/84737038"],"sources":["CNBC","Wccftech","The Globe and Mail","CNBC","BOL News","BOL News","Swissinfo (EN)"],"descriptions":["Bitcoin led the crypto market lower on Tuesday – the first trading day for ether ETFs – as Mt. Gox transfers moved more bitcoin off the exchange.","As per preliminary data, spot Ethereum ETFs attracted $112 million in volume during the first 15 minutes of trading.","Offerings from major firms trading on Cboe, Nasdaq, and NYSE","The new funds come about six months after the blockbuster debut for bitcoin ETFs.","As of July 23, the Bitcoin to USD exchange rate stood at $66848.67. Bitcoin’s value in dollars reflects the dynamic nature of the","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 18617092.47 on 23 July","(Bloomberg) -- About a year-and-a-half after the collapse of crypto-friendly banks in the US, European players are pushing to reinvigorate the market for around-the-clock payments in the digital-asset sector."],"article_contents":["In this article\nBitcoin led the crypto market lower on Tuesday – the first trading day for ether ETFs – as Mt. Gox transferred more bitcoin to creditors and investors took profits following the cryptocurrency's best week since March.\nThe price of bitcoin was last lower by 3% at $65,891.50 according to Coin Metrics. Ether, was down less than 1% at $3,476.04. Investors and analysts attribute the moves to profit taking after their 22.85% and 12.75% gains, respectively, last week.\nAdditionally, Bitcoin network activity shows Mt. Gox has moved about 5,000 bitcoins off the exchange, likely as part of the creditor repayment process it began this month. The exchange, which went bankrupt after a major hack 10 years ago, has until October to return more than 140,000 bitcoins to victims of the event.\nThe market is expected to absorb the negative impact, thanks to long-term optimism on the success of ether ETFs as well as the U.S. presidential election.\n\"We are aligned with the market consensus that the adoption out of gate here will likely be relatively slow and modest compared to the bitcoin ETF adoption,\" said Devin Ryan, analyst at JMP Securities. \"Part of that is the bitcoin ETF adoption is in the early innings – a lot of the largest pools of money for that ETF have not even been turned on yet,\" he added.\nIn the meantime, however, ether could be volatile, according to Nexo co-founder Antoni Trenchev. He pointed to the launch of bitcoin ETFs in January, when bitcoin surged before plummeting 20% and then advanced to another new high.\n\"Much like the bitcoin ETF, it will take time for inflows into the ETH ETF to create enough supply shock to significantly move the markets,\" said Ben Kurland, CEO at crypto research platform DYOR.\nAdditionally, he added, the decision by President Joe Biden to drop out of the presidential race introduces uncertainty into the market.\n\"Investors [are] waiting for more concrete developments about [Vice President Kamala] Harris, her stance on crypto, and the likelihood of her taking back any ground in the polls,\" he said.\nTrenchev echoed that sentiment.\n\"Bitcoin's drop from recent highs reflects the sudden arrival of Kamala Harris into the U.S. presidential election, which adds uncertainty to a race which seemed to tilt in favor of Donald Trump and his new pro-crypto stance,\" he said.","This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy.\nIn a watershed moment for the entire crypto sphere that signifies the nascent industry's growing heft, spot Ethereum ETFs have finally commenced trading on a number of American exchanges, allowing mom-and-pop investors a convenient avenue to gain exposure to Ethereum - the second most valuable crypto ecosystem after Bitcoin.\nBack in May, the SEC granted an in-principal approval to a number of spot Ethereum ETFs, including the Grayscale Ethereum Trust, the Bitwise Ethereum ETF, the iShares Ethereum Trust, the VanEck Ethereum Trust, the ARK 21Shares Ethereum ETF, the Invesco Galaxy Ethereum ETF, the Fidelity Ethereum Fund, the Franklin Ethereum ETF.\nLast week, the SEC formally approved these investment vehicles for trading. As is evident from the above snippet sourced from ZeroHedge, the base fees of these spot Ethereum ETFs range from 0.15 percent to 2.50 percent.\nNone of the approved ETFs currently allow for staking on the Ethereum network. As a refresher, under Ethereum's PoS transaction authentication mechanism, validators lock-up or stake specific Ether balances in specialized nodes to win the chance to authenticate a particular batch of transactions, thereby receiving the transaction fee as reward.\nWhile the lack of staking will diminish the yields of spot Ethereum ETFs, this limitation appears to be a necessary opportunity cost to ensure sufficient liquidity for smooth fund operations, especially as Ethereum's standard exit queue limits the number of stakers who are allowed to exit on a given day. Nonetheless, almost all of these investment vehicles are currently searching for a feasible way to incorporate staking. As such, we would not be surprised if the SEC does allow these ETFs to stake a portion of their holdings on the Ethereum network a few months down the road.\nHere's volume after first 15 minutes of trading. Total of $112m traded for the group (which is A TON vs a normal ETF launch but only about half of what bitcoin ETFs' volume pace was on DAY ONE, altho 50% would exceed expectations IMO). Also Bitwise outperforming early. pic.twitter.com\/RoN9J1VoP1\n— Eric Balchunas (@EricBalchunas) July 23, 2024\nThis brings us to the crux of the matter. Spot Ethereum ETFs attracted $112 million in volume during the first 15 minutes of trading. Critically, this is around half of the volume that spot Bitcoin ETFs collectively managed to attract within the first 15 minutes of their own debut.\nETH is the High Quality Liquid Asset (HQLA) of crypto\nIn anticipation of the ETH ETF launch, I’ve written a mini paper explaining what an HQLA is, why we need a natively digital one, and why ETH is the most likely candidate. My analysis compares it to BTC and SOL.\nHere’s the…\n— Omid Malekan 🧙🏽‍♂️ (@malekanoms) July 22, 2024\nMeanwhile, spot Ethereum ETFs are expected to remain unconditional winners in the long run, particularly given the growing chorus around Ethereum as the crypto industry's benchmark High Quality Liquid Asset (HQLA) that is expected to underpin leverage and derivatives going forward.","This article was published more than 6 months ago. Some information may no longer be current.\nThe first U.S. exchange-traded funds (ETFs) tied to the price of ether, the world’s second-largest cryptocurrency after bitcoin, began trading on Tuesday, in another watershed event for the crypto industry’s push to go mainstream.\nEther ETFs from VanEck, Franklin Templeton, Fidelity, 21Shares and Invesco began trading on Cboe, while one from BlackRock began trading on the Nasdaq. Products from Bitwise and Grayscale Investments also started trading on the New York Stock Exchange.\n“This is a real inflection point for the industry,” said Andrew Jacobson, head of legal at 21Shares.\nComing after the launch of nine U.S. spot bitcoin ETFs in January, the ether products mark another win for the cryptocurrency industry’s campaign to push digital assets into the broader financial sector, although the products are unlikely to garner the same volume of inflows, analysts said.\nThe bitcoin ETF launches were the culmination of a decade-long tussle with the U.S. Securities and Exchange Commission, which had rejected the products because of market-manipulation concerns.\nThe agency was forced to green-light the ETFs after losing a court challenge brought by digital-asset manager Grayscale Investments, although it warned when approving them that the products were still highly risky.\nThe launch was one of the most successful in the ETF market’s history with the products attracting US$33.1-billion in net inflows as of the end of June, according to Morningstar Direct data.\nBitcoin ETF issuers competed hard on fees, with many firms offering to waive fees entirely for a certain period of time.\nThe ether ETF fees range from 0.19 per cent for Franklin Templeton’s ether ETF to a high of 2.5 per cent for Grayscale’s ethereum trust, which it is converting into an ETF, according to its public-offering documents. The rest cluster around 0.25 per cent.\nOver all, the fees are comparable to the bitcoin products, although issuers are offering fewer waivers.\nGrayscale is also rolling out a “mini” version of its ether ETF with a fee of only 0.15 per cent.\nWhile estimates on demand for the ether products vary widely, Galaxy Research – whose sister company Galaxy Asset Management has a pending ether ETF with Invesco – has projected that the ether ETFs could attract monthly inflows of US$1-billion.\n“Overall, market participants expect strong interest in ETH Spot ETFs and significant inflows in the first 3-6 months post-launch,” Matteo Greco, research analyst at Fineqia International, wrote in a note. He added that demand for the ether ETFs will be crucial in ascertaining investor appetite for digital assets beyond bitcoin.\nIssuers began filing for the ether ETFs in September. Executives initially had low hopes that the SEC would approve the products after discouraging meetings with officials.\nBut the agency surprised the industry in May when it approved rule changes required for exchanges to list the products, the first of two key regulatory hurdles.\nSEC chair Gary Gensler last month told Reuters the Grayscale ruling had influenced his thinking on approving the ether products, because the underlying market circumstances were similar.\nBe smart with your money. Get the latest investing insights delivered right to your inbox three times a week, with the Globe Investor newsletter. Sign up today.\nReport an editorial error\nReport a technical issue\nAuthors and topics you follow will be added to your personal news feed in Following.","In this article\nEther exchange-traded funds officially began trading in the U.S. on Tuesday, putting the world's second-largest crypto currency in a vehicle favored by many professional investors and advisors.\nThe new funds come from traditional fund issuers such as BlackRock and Fidelity and crypto-specific companies such as Grayscale, marking another step in the increased integration of digital assets into mainstream finance.\nEther is the native cryptocurrency on the Ethereum blockchain. While bitcoin is often pitched as a type of digital gold, ether is seen as more of a bet on the growth of the blockchain and crypto more broadly.\n\"Ethereum's appeal lies in its decentralized nature and its potential to drive digital transformation in finance and other industries,\" Jay Jacobs, U.S. head of active and thematic ETFs at BlackRock, said in a press release.\nBitcoin ETFs have raked in about $17 billion in net inflows since their launch in January, according to FactSet, a historically successful launch. The ether ETFs are widely expected to be smaller than the bitcoin funds, both because of the relative size of the two markets and the fact that ether may not be as familiar to many investors.\n\"Ethereum is just a bit more confusing and unclear for individual investors, as well as institutional investors,\" said Sam Callahan, senior analyst at Swan Bitcoin.\nThe ether ETFs also do not offer staking, which is a process that can give crypto-native investors additional yield.\nMany of the funds set to launch this week have temporary fee waivers to attract clients. After the waivers, the management fees range between 0.15% and 2.50%.\nBoth the cheapest and most expensive funds come from Grayscale, which is effectively converting its multibillion-dollar private ether fund into two ETFs with different price points.\nThe price of ether is up more than 50% year to date but is roughly flat over the past month. The cryptocurrency does not seem to have enjoyed the same runup in demand ahead of the fund launches that bitcoin saw in January.\n\"I do think that overall the balance of risk is favorable considering the markets have pulled back and the sentiment overall is in a place where there's room to be pleasantly surprised,\" said Joel Kruger, strategist at LMAX Group.\nThe price of the cryptocurrency was down less than 1% on Tuesday.\nThe U.S. Securities and Exchange Commission has long been skeptical of cryptocurrencies, but the regulator lost a legal fight last year over bitcoin ETFs that led to their introduction in January. Since bitcoin and ether both already have regulated futures markets, the ether ETFs were seen as the next logical step for the industry.\nThe SEC's decision to allow the funds has been criticized by some, including the consumer advocacy group Better Markets.\nStill, some investors and advisors could make small allocations to these crypto ETFs as a diversification play without taking on too much risk, said Wei Hu, vice president of financial research and strategy at Edelman Financial Engines.\n\"We don't believe an investor should hold a lot of either one of these,\" Hu said.","23rd Jul, 2024. 03:36 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 1, 2024\nAs of July 23, the Bitcoin to USD exchange rate stood at $66848.67. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 66848.67 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","23rd Jul, 2024. 03:35 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 18617092.47 on 23 July 2024.\n1 BTC =  18617092.47 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","(Bloomberg) — About a year-and-a-half after the collapse of crypto-friendly banks in the US, European players are pushing to reinvigorate the market for around-the-clock payments in the digital-asset sector.\nA pair of Swiss lenders — AMINA Bank AG and Sygnum Bank AG — have debuted real-time payment and settlement networks in recent weeks.\nThey are targeting a gap in the market left by the Silvergate Exchange Network (SEN) and Signature Bank’s Signet platform which, prior to their collapse in March 2023, played a crucial role in bringing liquidity to the crypto market. In the quarter before they closed, SEN facilitated $117 billion in US dollar transfers, while Signet processed $275.5 billion, according to company filings.\nThe shuttering of those networks left Bitcoin liquidity in an even worse state than after the collapse of Sam Bankman-Fried’s crypto empire — at the heart of which sat fraudulent exchange FTX and sister trading firm Alameda Research.\nOver a year on, crypto players are still searching for alternatives. The AMINA Payment Network went live in June, followed by Sygnum Connect in July. The products offer a 24\/7 network for instant transactions in both fiat currencies and cryptoassets, with no costs for transfers between network members.\nThe goal is to help crypto outfits “execute trades and settle positions more quickly,” said Kok Kee Chong, chief executive of Singapore-based crypto exchange AsiaNext, which has partnered with Sygnum Connect. “This improves market liquidity, as traders can respond to market movements in real-time without having to wait for settlement.”\nEurope and Asia\nPlugging the instant payments gap has become a more urgent priority this year due to increased institutional investment in the sector driven by the launch of spot crypto exchange-traded funds in the US, Hong Kong and Australia. Many of the solutions are springing up outside of the US.\nHong Kong-based Marco Lim, managing partner at MaiCapital, said he was running pillar-to-post last year after Signature Bank went down. He now avoids using US-based banks, preferring to work with local players.\nThe demise of Signature and Silvergate “resulted in a fragmented crypto landscape for a time, with a separation between what was happening in North America versus the rest of the world,” Myles Harrison, chief product officer at AMINA Bank, said in an interview.\nAMINA hopes to capitalize. It currently supports instant transactions in Swiss francs, euros, and US dollars but plans to add more fiat currencies soon, including in Singapore and Hong Kong, where the firm has set up subsidiaries, according to Harrison. In time, AMINA’s network will include stablecoins and on-chain settlement, he added.\nUptick in Activity\nBCB Group, which operates Blinc, another instant payment network for crypto companies that’s popular in Europe, has seen an uptick in activity on the platform’s Euro and GBP settlement rails since last year.\nMore recently, the firm launched a US dollar option on Blinc. “We have seen a significant increase in the use of dollar accounts, which the crypto industry has struggled to access,” said Ashley Pope, chief product officer at BCB Group.\nDespite such efforts, settlement and clearing continues to be a pain point. The liquidity gap in the crypto market “has still not been closed to the extent that professional market participants would’ve wished for,” Sygnum Bank’s Chief Product Officer Thomas Eichenberger said in an interview, adding that Sygnum’s service mostly targets clients in Europe and Asia.\nCrypto outfits see stablecoin regulations under Europe’s Markets in Crypto-Assets or MiCA regime as a potential growth driver for instant settlements.\nSygnum’s Eichenberger said the recent approval of Circle’s popular USDC as a MiCA compliant stablecoin is “a big step.” Sygnum’s Connect network enables users to mint and redeem stablecoins instantly, with support for USDC and MakerDAO’s Dai due to be added soon.\nBringing more tokens into the mix on settlement networks “allows firms that operate solely in crypto, as well as those that have both crypto and fiat capabilities, to seamlessly process payments,” BCB Group’s Pope said.\n©2024 Bloomberg L.P.\nEvery Swiss citizen has a Heimatort, a place of origin, but many have never visited theirs. What’s your relationship with your Heimatort? What does it mean to you?\nWhat were the circumstances of your immigration to Switzerland? And what motivated your decision to stay or leave?\nShould there be a limit to the passing on of Swiss citizenship? Or is the current practice too strict and it should still be possible to register after the age of 25?\nSWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR\nSWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR"]}
{"date":"2024-07-24","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-07-25","titles":["Bybit Australia review 2024: Fees, security, pros & cons","How Trump's re-election and market dynamics could boost bitcoin"],"urls":["https:\/\/www.canberratimes.com.au\/story\/8708478\/bybit-australia-review-2024-fees-security-pros-cons\/","https:\/\/finance.yahoo.com\/news\/trumps-election-market-dynamics-could-221208141.html"],"sources":["The Canberra Times","Yahoo Finance"],"descriptions":["Explore Bybit, Australia's leading crypto exchange, offering 280+ coins, low fees, and advanced trading features.","Bitcoin's outlook remains positive as experts discuss political catalysts, demand growth, and enhanced investment transparency."],"article_contents":["This is branded content for Marketplace Fairness.\nBybit is the #1 crypto exchange in Australia, and has gained significant traction in the global trading community with over 30 million registered users. One of Bybit's standout features is its focus on margin trading, offering up to 100x leverage on BTC\/USD and ETH\/USD trading pairs, making it an excellent choice for experienced traders looking to leverage their positions for higher returns. The platform boasts competitive trading fees, at only 0.1 per cent for spot trading and 0.02 per cent for makers and 0.055 per cent for takers in derivatives trading, which can be reduced based on trading volume.\nBybit Australia also caters to newcomers to the industry, with its user-friendly interface and straightforward navigation, making it accessible for those new to crypto trading. The exchange offers an extensive range of over 280 coins, providing ample opportunities for Australians to find their preferred trading pairs. Beyond its diverse coin offerings, Bybit provides a comprehensive trading platform that includes advanced charting tools, copy trading, demo mode and more, making it a versatile and attractive option for all types of traders. They also offer free $10 BTC and up to $30,000 in bonuses when you register with this link.\nVisit Bybit Australia website\nBybit stands out in the Australian crypto market by offering both spot trading and derivatives trading, catering to a wide range of trading preferences and strategies. If you are new to trading, you may not be familiar with the terms. In spot trading, users can buy and sell cryptocurrencies at current market prices, providing a straightforward way to trade and invest in various coins. This is the basic type of trading that you will find on many Australian crypto exchanges, such as CoinSpot or Swyftx.\nDerivatives trading is for more experienced traders, and allows users to engage in futures contracts with leverage options up to 100x for BTC\/USD and ETH\/USD pairs. This feature is particularly appealing to those who want to maximise their potential returns by leveraging their positions. However, it is important to note that this comes with much higher risk, as a small market swing can cause you to lose your entire investment. Make sure you do your research before engaging in derivatives trading.\nBybit employs an insurance fund mechanism to mitigate the risk of Auto-Deleveraging (ADL) during the liquidation process. When a liquidated order is closed at a price worse than the bankruptcy price, Bybit uses the insurance fund to cover the gap, thereby reducing the likelihood of ADL. The balance of the insurance fund fluctuates based on the price difference between the final executed price and the bankruptcy price of the liquidated position. If liquidations occur at prices better than the bankruptcy price, the remaining margin is added to the insurance fund. Conversely, if the final executed price is worse, the fund covers the contract losses.\nFor instance, if a trader's long position on ETH\/USD has a liquidation price of $5,000 and a bankruptcy price of $4,950, and the position is liquidated at $4,980, the excess margin contributes to the fund. However, if liquidated at $4,930, the insurance fund covers the shortfall. Bybit maintains transparency by displaying the insurance fund's balance and transaction records on their official website. In cases where the insurance fund is depleted and cannot cover losses, the ADL system absorbs the remaining contract losses. For USDT contracts, all trading pairs share a common insurance pool, but only BTC\/USDT contracts can access 100 per cent of the insurance funds, while other altcoins can utilise up to 20 per cent of the fund per day.\nBybit Australia is well-known for its rapid trade execution speed and reliability, making it the #1 choice for serious traders. The platform's ultra-fast matching engine can handle up to 100,000 trades per second, ensuring that users never have to worry about system overloads during high-volume trading periods. This capability is crucial for those engaging in high-frequency trading, as Bybit provides lightning-fast market updates, with data pushed every 20 milliseconds. Moreover, Bybit boasts a 99.99 per cent system functionality rate, providing Australians with the confidence that their trades will be executed smoothly and efficiently. This combination of speed and reliability underscores Bybit's commitment to delivering a robust and dependable trading experience.\nVisit Bybit Australia website\nBybit's copy trading feature allows Australians to automatically replicate the trades of experienced and successful traders, making it an excellent tool for beginners and time-saving for experienced traders. Users can browse top traders on Bybit's platform, review their performance metrics and risk profiles, and choose to follow them. Once selected, all trades executed by the chosen trader are automatically copied to the user's account in real-time, proportionate to their allocated funds.\nThis feature grants access to advanced trading strategies and helps diversify investment portfolios by allowing users to follow multiple successful traders. Bybit ensures transparency by providing detailed performance data and enabling users to manage their copy trading settings, such as adjusting trade sizes or stopping the copying process at any time. Overall, Bybit's copy trading feature offers educational value and profitable returns, making it a valuable tool for all experience levels.\nBybit Australia's demo Testnet platform is an invaluable tool, offering a risk-free environment to practice and hone their trading strategies. The Testnet simulates real market conditions, allowing users to experience the full functionality of Bybit's trading platform without risking their own money. This feature is particularly beneficial for beginners who want to familiarise themselves with the trading interface and various order types before committing real funds. Seasoned traders can also take advantage of this demo platform, as it provides an opportunity to test new strategies and refine their techniques in a controlled setting. By providing access to all trading features, including margin trading with up to 100x leverage, the Bybit demo Testnet ensures that users can build their confidence and skills, ultimately enhancing their trading performance on the live platform.\nBybit's mobile app offers a seamless and powerful trading experience for users on the go. Available for both iOS and Android devices, the app features an intuitive interface that mirrors the functionalities of the desktop site, providing access to the full range of trading options, features and cryptocurrencies.\nThe app is designed to deliver real-time data and market updates, enabling users to make informed trading decisions from anywhere. With advanced charting tools, customisable notifications, and secure login options, the Bybit mobile app ensures that traders can manage their portfolios, execute trades, and monitor market movements efficiently and securely. This level of accessibility and functionality makes the Bybit mobile app an essential tool for active traders who need to stay connected to the markets at all times.\nBybit's support team is renowned for its exceptional customer service, through its 24\/7 live chat feature. This round-the-clock availability ensures that Australians can receive immediate assistance at any time. The live chat support is staffed by knowledgeable and responsive agents who are adept at handling a wide range of inquiries, from technical issues to account management questions. This level of support is crucial for traders who need quick resolutions to their problems to maintain their trading activities without interruption. By providing continuous, reliable support, Bybit enhances the overall user experience, making the platform more accessible and user-friendly for both novice and experienced traders.\nVisit Bybit Australia website\nWhile Bybit Australia offers a comprehensive trading platform, it does have one drawback, and that is the lack of fiat withdrawals, as Bybit only supports cryptocurrency withdrawals. This means that users cannot directly withdraw AUD to their bank accounts. For traders who wish to convert their crypto earnings to AUD, this requires an additional step: transferring their funds to another exchange that supports fiat withdrawals such as CoinSpot or Swyftx. However, this process is relatively straightforward, and you can follow this easy step-by-step guide.\nBybit Australia Deposit Fee: Bybit doesn't support direct AUD deposits, but you can purchase crypto using a third-party payment processor. The fees are around 3-5 per cent, and you can use Visa, Mastercard, Apple Pay, Google Pay, or bank transfer to pay.\nBybit Australia Crypto Deposit Fee: FREE\nBybit Australia Trading Fee: 0.1 per cent for spot trading. 0.02 per cent \/ 0.055 per cent (maker\/taker) for derivatives trading.\nBybit Australia AUD Withdrawal Fee: Not supported\nBybit Australia Crypto Withdrawal Fee: Network fee\nYes, Bybit is a safe crypto exchange to use in Australia. The platform employs advanced security measures, including multi-signature wallets, two-factor authentication (2FA), and SSL encryption, to protect user funds and personal information. Bybit's system also boasts a 99.99 per cent functionality rate, ensuring reliable and uninterrupted trading experiences. Additionally, the exchange conducts regular security audits and has a transparent insurance fund to cover any potential losses from unforeseen incidents. While Bybit is not regulated by Australian financial authorities, its robust security protocols and operational reliability provide a high level of safety for Australian users.\nIn conclusion, Bybit stands out as the #1 recommended cryptocurrency exchange for Australians due to its low fees, comprehensive features, and solid security measures. Bybit's user-friendly interface and advanced trading tools cater to both novice and seasoned traders, while the 24\/7 live chat support ensures immediate assistance when needed. Despite the limitation of not supporting AUD withdrawals, the ease of transferring crypto to other exchanges eliminates this issue. Overall, Bybit's commitment to security, reliability, and user satisfaction makes it an excellent choice for any Australian looking to trade cryptocurrency.\nVisit Bybit Australia website\nDisclaimer: Marketplacefairness.org has provided this content for informational purposes only. This should not be taken as financial advice to buy, trade, or sell cryptocurrency or use any specific exchange. This is not intended for use as investment, financial or legal advice as each individual's needs will vary. This story may include affiliate links with Marketplacefairness.org partners who may provide compensation. ACM advises readers to consider their own circumstances and obtain their own advice. You should also verify the nature of any product or service and consult with the relevant regulators' website before making any decision.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe future of bitcoin is a topic of constant debate and interest among investors and crypto enthusiasts. In a recent discussion, Roundtable anchor Rob Nelson, brought together Sue Ennis, Head of Investor Relations at Hut 8, Brad Tomm, Head of ESG at Marathon Digital Holdings (MARA), and Gav Blaxberg, CEO of WOLF Financial, to share their insights on the cryptocurrency's trajectory. The conversation covered supply and demand dynamics, potential catalysts for price appreciation, and the importance of secure bitcoin custody.\nNelson opened the discussion by highlighting the increasing demand for bitcoin. He noted the impact of various factors, including the involvement of ETFs and investment advisors, as well as potential interest from sovereign wealth funds. Nelson emphasized that despite occasional selloffs, the overall demand for bitcoin continues to rise, suggesting a positive outlook for its value.\nSue Ennis pointed out significant potential catalysts for bitcoin's price appreciation. She mentioned that if Trump gets re-elected, his pro-crypto stance could positively influence bitcoin. Ennis also highlighted the possibility of a more crypto-friendly regulatory environment if certain changes in office occur. Additionally, she noted that a decrease in ultra rates could shift investors' risk appetite, leading to increased bitcoin investments.\nBrad Tomm underscored the importance of diversifying investment portfolios by including crypto assets. He emphasized bitcoin's proven track record of appreciation and its potential as an attractive investment vehicle. Tomm expressed excitement about the future of bitcoin and the opportunities it presents for investors.\nGav Blaxberg addressed the issue of bitcoin custody. He acknowledged the diversity in how individuals approach bitcoin storage, from self-custody to using platforms like Coinbase. Blaxberg stressed the importance of moving people away from dangerous practices, such as clicking on suspicious links or using unsafe staking platforms. He emphasized the need for educating users on secure practices and gradually guiding them towards self-custody.\nThe discussion concluded with Brad Tomm discussing the efforts of Marathon Digital Holdings in providing transparent communications and data reporting. He emphasized the importance of transparency in addressing fear, uncertainty, and doubt within the crypto space."]}
{"date":"2024-07-26","titles":["How Trump's support is impacting bitcoin's market value","Crypto firm Ledger hikes price of Stax crypto wallet, launches Flex","BTC TO USD - Today’s Bitcoin price in Dollar on 26 July, 2024"],"urls":["https:\/\/finance.yahoo.com\/news\/trumps-support-impacting-bitcoins-market-214322936.html","https:\/\/www.cnbc.com\/2024\/07\/26\/crypto-firm-ledger-hikes-price-of-stax-crypto-wallet-launches-flex.html","https:\/\/www.bolnews.com\/business\/2024\/07\/btc-to-usd-todays-bitcoin-price-in-dollar-on-26-july-2024\/"],"sources":["Yahoo Finance","CNBC","BOL News"],"descriptions":["Experts discuss the reasons behind bitcoin's recent volatility and what it means for investors.","Crypto firm Ledger is increasing the price of Ledger Stax, its iPod-inspired hardware wallet, and releasing a similar, cheaper device, called Flex.","As of July 26, the Bitcoin to USD exchange rate stood at $67336.31. Bitcoin’s value in dollars reflects the dynamic nature of the"],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin's recent price fluctuations have left many investors feeling uneasy, but experts urge calm. Roundtable anchor Rob Nelson discussed the issue with Aaron Arnold, host of Altcoin Daily, and Jon Najarian, co-founder of Market Rebellion. Their insights provide a clearer picture of the factors driving bitcoin's volatility and why it might not be as alarming as it seems.\nRob Nelson kicked off the discussion by highlighting the common concern about bitcoin's dramatic price movements. He pointed out that bitcoin's price can swing from $71,000 to $52,000 and back up to $60,000, reflecting significant volatility in a relatively young asset. He asked Arnold and Najarian to share their thoughts on this phenomenon.\nArnold responded by noting that bitcoin's recent price action, while volatile, is not out of the ordinary. \"Bitcoin dumped hard recently, but actually more recently bitcoin's up,\" he said. He emphasized that bitcoin has been on an upward trend in the past few weeks, rising by 25%. Arnold attributed this surge to a combination of increased buyer interest and several narrative catalysts. He mentioned prominent figures like Larry Fink and Trump's VP pick, both of whom have shown support for bitcoin, as well as the anticipated ethereum ETFs and potential rate cuts.\nNelson then turned to Jon Najarian for his perspective on how bitcoin's volatility compares to traditional financial markets. Najarian explained that those familiar with SEC-regulated products, such as the Big Seven stocks, would recognize similar volatility patterns. He pointed out that bitcoin's volatility had doubled from the June lows, moving from around 1% to over 2%. Najarian attributed this increase to the growing support for bitcoin among influential figures like Donald Trump and Silicon Valley leaders.\nNajarian predicted that if this trend continues, bitcoin could reach new highs, potentially hitting $85,000 to $90,000 per bitcoin as the election approaches. He highlighted that the surge in interest and the backing of high-profile supporters are significant drivers of bitcoin's recent performance.",null,"26th Jul, 2024. 03:37 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 1, 2024\nAs of July 26, the Bitcoin to USD exchange rate stood at $67336.31. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 67336.31 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
{"date":"2024-07-29","titles":["How Minotaur Trading Systems is looking to help Bitcoiners simplify their trades","Bitcoin’s New Role, Political Power Plays and 3000x Gains!","Here are key crypto tax rules that every bitcoin investor should know","Ethereum ETFs: A Trojan Horse or a Double-Edged Sword for Traditional Finance?","Top crypto to watch this week","Biggest stock movers today: Crypto stocks, PBI, PHG, and more","Bitcoin price hits six-week high after Trump backs cryptocurrency","Bitcoin Price at 6-Week High After Trump Says US Will Be 'Crypto Capital'"],"urls":["https:\/\/finance.yahoo.com\/news\/minotaur-trading-systems-looking-help-221029925.html","https:\/\/finance.yahoo.com\/news\/bitcoin-role-political-power-plays-200406873.html","https:\/\/www.cnbc.com\/2024\/07\/29\/key-crypto-tax-rules-for-bitcoin-investors-to-know.html","https:\/\/finance.yahoo.com\/news\/ethereum-etfs-trojan-horse-double-164340954.html","https:\/\/qz.com\/top-cryptocurrency-to-watch-this-week-1851607462","https:\/\/seekingalpha.com\/news\/4129324-biggest-stock-movers-today-pbi-phg-and-more","https:\/\/www.theguardian.com\/technology\/article\/2024\/jul\/29\/bitcoin-price-donald-trump-backs-cryptocurrency-us-election","https:\/\/markets.businessinsider.com\/news\/currencies\/bitcoin-price-reaction-trump-us-crypto-capital-planet-comments-impact-2024-7"],"sources":["Yahoo Finance","Yahoo Finance","CNBC","Yahoo Finance","Quartz India","Seeking Alpha","The Guardian","Business Insider"],"descriptions":["Bitcoin's price volatility presents challenges and opportunities; experts discuss strategies and evolving U.S. regulations.","Senator Cynthia Lummis proposes legislation to add Bitcoin as a strategic reserve asset for the Fed, potentially transforming its role in U.S. monetary policy. Meanwhile, the market for Ethereum ETFs shows mixed signals with significant inflows and outflows, and users from the 2014 Mt. Gox hack are seeing massive returns due to Bitcoin’s skyrocketing value.","With the price of bitcoin up more than 50% for the year, there are some key crypto tax rules that investors need to know, according to experts.","The SEC's decision to embrace Ethereum ETFs wasn't a sudden act of benevolence. Rather, it was likely a calculated response to the undeniable growth and influence of the cryptocurrency market. Transak’s CEO Sami Start share his two Satoshis about the good and the bad of the ETH ETF.","After Donald Trump's speech at the Bitcoin conference, the cryptocurrency market has received a boost","Stock futures edged higher in the premarket trading hours of Monday as market participants eagerly awaited earnings reports from the members of the Magnificent 7 due later this week.","Former president said he would end persecution of crypto industry if he wins US election in November","At a bitcoin conference over the weekend, Trump pledged to make the US a \"bitcoin superpower\" if elected."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin's notorious price swings are both a challenge and an opportunity for investors. In a recent discussion, Roundtable anchor Rob Nelson explored this duality with Minotaur Trading Systems CEO Kosta Ouzas and CTO Sebastian Raffaele.\nTheir conversation delved into strategic trading approaches, the flexibility of modern trading systems, and the evolving landscape of U.S. cryptocurrency regulations, providing valuable insights for managing the complexities of bitcoin investments.\nNelson kicked off the discussion by highlighting the dilemma many bitcoin investors face: Watching the value of their holdings fluctuate without ever capitalizing on the gains. Nelson expressed a common sentiment among investors who struggle with the decision to sell or hold their bitcoin, fearing missed opportunities and potential losses.\nKosta Ouzas offered a solution to this predicament, emphasizing the flexibility of their trading system. He explained that investors could either let their bitcoin holdings sit and appreciate or actively trade to generate returns. \"Our system is designed to adapt to different investor goals, whether they're conservative or aggressive,\" Ouzas noted. This approach allows investors to tailor their strategies to market conditions, maximizing potential returns while managing risk.\nThe conversation then shifted to the regulatory environment in the United States. Sebastian Raffaele acknowledged the limitations faced by U.S. investors but remained optimistic about the future. \"The regulatory landscape is evolving, and while there are restrictions now, the progress we've seen in the past five years is significant,\" he said. Raffaele likened the current state of cryptocurrency to the early days of the internet, predicting a financial revolution akin to the industrial revolution.\nDespite the challenges, Raffaele believes that the U.S. market will eventually open up to more sophisticated trading options. He highlighted the potential impact of regulatory changes and high-profile endorsements, such as potential support from figures like Donald Trump, on the mainstream adoption of cryptocurrency.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nIn a ground-breaking move, Senator Cynthia Lummis is set to propose legislation that would require the Federal Reserve to include Bitcoin as a strategic reserve asset. The new bill aims to elevate Bitcoin to the status of a mainstream financial asset, similar to the Fed’s holdings of gold and foreign currencies. This legislative push is designed to help stabilize the U.S. dollar by diversifying the types of assets held by the Fed. The official announcement is expected to take place at the Bitcoin Conference.\nIndependent presidential candidate Robert F. Kennedy Jr. has also been vocal about his support for Bitcoin and other cryptocurrencies. In an interview with Scott Melker and Caitlin Long, Kennedy emphasized Bitcoin’s potential as a hedge against inflation and a means to restore democracy and personal freedom. He suggested issuing treasury bills backed by hard assets like gold and platinum to combat inflation and proposed that the government invest in Bitcoin to match its gold reserves. Kennedy is a strong opponent of CBDCs and has accused Congress of being influenced to suppress the growth of Bitcoin within the U.S.\nAdding to the political significance of the Bitcoin Conference, David Bailey, CEO of Bitcoin Magazine and the Bitcoin Conference, announced that Democratic nominee Kamala Harris was scheduled to speak at the event, which runs from July 25 to 27. Bailey noted that this appearance could be a strategic move for Harris to align with the rapidly growing voter base interested in crypto. He commented, “It would be very savvy of her to reset the Democrat positioning on the fastest growing voter block in the country.” This suggests that the 2024 Presidential election might become known as the “crypto election” due to the heightened focus on cryptocurrency policies by major candidates. It has now been confirmed that she is no longer attending.\nThe market for spot Ethereum ETFs has seen significant activity recently. On their second trading day, the ETFs had net outflows of $113.3 million, mainly driven by large withdrawals from Grayscale’s Ethereum Trust. Despite this, seven out of eight new ETH ETFs reported net inflows. Leading the pack was the Fidelity Ethereum Fund with $74.5 million in net inflows, followed by Bitwise Ethereum ETF with $29.6 million, and BlackRock’s iShares Ethereum Trust with $17.4 million. On its first day as a spot Ethereum ETF, Grayscale’s ETHE saw outflows of $484.4 million, while the other eight collectively reported net inflows of around $106 million.\nNow for some huge Bitcoin gains. Users affected by the 2014 Mt. Gox hack are beginning to receive repayments. During the hack, Bitcoin was priced between $30 and $653. With current Bitcoin prices hovering around $66,000, customers will be seeing returns ranging from 100x to 3000x.","With the price of bitcoin hovering around $70,000 again, experts have tax advice for new and seasoned crypto investors.\nThe price of bitcoin rose to $69,982.00 on Monday before dipping below $67,000, according to Coin Metrics.\nAlthough bitcoin is down from a record high above $73,000 in mid-March, the price is still up more than 50% year-to-date as investors weigh comments from Former President Donald Trump and this week's Federal Reserve meetings.\nThe price of bitcoin fell to a two-month low in early July after the Fed's June minutes indicated they weren't yet ready to cut interest rates.\n\"For too long our government has violated the cardinal rule that every bitcoiner knows by heart: Never sell your bitcoin,\" Trump said Saturday during a keynote at the Bitcoin Conference in Nashville.\n\"If I am elected, it will be the policy of my administration, United States of America, to keep 100% of all the bitcoin the U.S. government currently holds or acquires into the future,\" Trump said.\nMore from Personal Finance:1 million people now owe more than $200,000 in federal student loansHome insurance premiums rose 21% last year, partly due to climate changeHere's how a Harris presidency could shape a key middle-class tax credit\nMeanwhile, investors are watching for signs of a possible Democratic crypto policy shift from Vice President Kamala Harris, who entered the presidential race last week after President Joe Biden dropped out. While Harris hasn't outlined policy yet, some investors hope she'll pivot from the crypto scrutiny led by Securities and Exchange Commission Chair Gary Gensler and Sen. Elizabeth Warren, D-Mass.\nWhile future crypto policy and regulation are unclear, here are some key things to know about taxes, experts say.\nWhen you trade one coin for another or sell it at a profit, it may be subject to capital gains or regular income taxes, depending on how long you owned the asset.\nAfter holding crypto for more than one year, you'll qualify for long-term capital gains of 0%, 15% or 20%, depending on taxable income. Higher earners may also owe an extra 3.8% levy, known as net investment income tax.\nBy comparison, short-term capital gains or regular income taxes apply to assets owned for one year or less.\nYour gain is the difference between your original purchase price, or \"basis,\" and the asset's value when you sell or exchange it — and without establishing basis, the IRS assumes it's zero, according to Adam Markowitz, an enrolled agent at Luminary Tax Advisors in Windermere, Florida.\nWith zero basis, you could wrongly report more capital gains to the Internal Revenue Service.\n\"The burden of proof is on the taxpayer to know what they paid,\" which can be challenging for investors with multiple exchanges and hundreds of transactions, especially when they don't know what counts as a sale, he explained.\nThe U.S. Department of the Treasury and IRS in June released final guidance for digital asset brokers, which phases in mandatory yearly reporting.\nRequired yearly reporting will phase in starting in 2026, with digital currency brokers required to cover gross proceeds from sales in 2025 via Form 1099-DA. In 2027, brokers must include cost basis for certain digital asset sales for 2026.\nWith limited past reporting on basis, crypto investors can still establish a \"reasonable allocation\" before Jan. 1, 2025, according to an IRS revenue procedure released in June.\n\"Even in the current year, in 2024, as you're selling tokens, it may make sense to speak to a tax professional about how you can specifically identify or allocate cost basis to those sales,\" said Andrew Gordon, tax attorney, certified public accountant and president of Gordon Law Group.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThere is a whirlwind of excitement around the recent approval of Ethereum Exchange Traded Funds (ETFs) by the U.S. Securities and Exchange Commission (SEC). Consequently, there’s a lot of speculation within the crypto industry — but most speculations are baseless while some seem to stem from practical insights.\nMany view this move by SEC as a landmark victory for the cryptocurrency industry, where, for the second time (after the Bitcoin ETF), a regulatory body that was traditionally averse to DLT-based digital assets has signaled “acceptance” of sorts.\nYet, it's crucial to examine the deeper implications and potential consequences for both traditional finance and the decentralized web3 ecosystem. Because, history is testament to the fact that regulatory acceptance does not always equate to positive outcomes for emerging technologies. Traditional finance has often been cautious, if not outright resistant, to disruptive innovations.\nThe introduction of ETFs, which offer a regulated and familiar investment vehicle, could be a strategic maneuver to bring the wild west of crypto under more stringent oversight. Whether that is intended for public good or mass control is debatable.\nIn my opinion, the SEC's decision to embrace Ethereum ETFs wasn't a sudden act of benevolence. Rather, it was likely a calculated response to the undeniable growth and influence of the cryptocurrency market.\nA significant portion of American households, along with numerous institutional investors, have already integrated cryptocurrencies into their portfolios. A report published earlier in 2024 by Security.org finds about 40% of Amercians to own cryptocurrencies. The SEC, recognizing this growing trend, realized that it could no longer afford to dismiss or ignore this flourishing asset class.\nThere are ample case studies to prove the point of why relying on custodians is not a good idea.\nYet, most retail crypto investors hold their assets custodially mainly because of lack of knowledge and awareness of alternatives.\nAs investors become accustomed to holding Ethereum through ETFs, they will inevitably become aware of the inherent inefficiencies and high fees associated with these [traditional finance] products. When they become more educated about the risks associated with centralized exchanges and custodians, they will likely opt out and store assets in their own wallets.\nSo, while ETFs are all the rage now, they might have triggered their own obsolescence. This shift towards self-custody could erode the dominance of traditional financial institutions, which have long relied on their role as custodians of assets.\nBut here's the rub: while ETFs may bring more money into the crypto space, they also bring a new level of centralization. By their nature, ETFs are managed by a third party, usually a financial institution. This means that the control of the assets in the ETF is not in the hands of the individual investors, but rather in the hands of a centralized entity.\nThe bigger question is, “Can self-custody take over before decentralization is shattered?”\nPublic blockchains like Bitcoin and Ethereum are deemed to be “sufficiently decentralized” — a key reason why their ETFs were approved by the US SEC.\nThe approval of ETFs has provably attracted more institutional investors than ever before in the history of the crypto industry.\nInstitutional investment, while bringing in much-needed legitimacy and financial support, often comes with strings attached. The entry of these institutions into the crypto space through ETFs could lead to a shift in power dynamics, where the influence of large financial entities begins to overshadow the decentralized nature of these networks.\nThe reason being ETFs often purchase and hold large amounts of the underlying cryptocurrency. If a few major ETFs control a significant portion of the supply, it could lead to oligopolistic behavior, where a small group of entities wield disproportionate influence over the network.\nEventually, what started off as a decentralized project could evolve into a centralized money-making machine where other fully-decentralized use cases have mostly faded away.\nWhile a dystopian viewpoint, that was the case with the evolution of the internet. The internet, initially designed as a decentralized network to facilitate free and open communication, has over time become dominated by a few large corporations. These entities now control much of the traffic, data, and infrastructure, leading to concerns about privacy, censorship, and monopolistic practices.\nThe parallels are striking: the internet began as a decentralized platform, much like blockchain technology today. However, the economic incentives and the drive for efficiency and profit led to the consolidation of power. Companies like Google, Meta, and Amazon have built vast empires that centralize control and influence, often at the expense of user autonomy and open standards. This shift has led to a less diverse ecosystem, where innovation is sometimes stifled by the dominance of these major players.\nSimilarly, as ETFs bring in more institutional money, the priorities of these large investors might overshadow the interests of the broader community. Governance decisions, network upgrades, and policy changes could increasingly reflect the preferences of these powerful stakeholders rather than the decentralized ethos that cryptocurrencies were founded on.\nIt's not all doom and gloom. There is a silver lining. The increased investment brought about by ETFs could lead to a surge in innovation and development in the crypto space. This could lead to the creation of new technologies and systems that could help further decentralize the crypto ecosystem.\nThe best way to move towards a decentralized and self-sovereign future is to buy cryptocurrency and hold it in your own wallet, where you control the keys to that wallet. Nevertheless, the Ethereum ETF is a welcome step in the right direction.","This week will be interesting for the crypto market, as former President and Republican nominee Donald Trump has promised to establish a strategic national Bitcoin reserve if he is elected president in November. In addition, the Fed’s meeting is due on Wednesday, and there is speculation that the central bank may cut interest rates in light of lower inflation.\nKeeping these factors in mind, let’s take a look at which cryptocurrencies are worth watching this week.\n2 \/ 7\nThe leading cryptocurrency nearly reached the $70,000 mark on Monday following a speech by former President Donald Trump, who promised to create a national Bitcoin reserve if elected. Speaking at the Bitcoin conference, he said would fire the SEC Chair Gary Gensler on his first day in office. Bitcoin enthusiasts applauded and welcomed Trump’s statement, hoping for crypto regulation in the country. The top cryptocurrency is 3% up from the previous week.\n3 \/ 7\nBitcoin Cash (BCH) was created in 2017 after the Bitcoin “hard fork.” A hard fork is a phenomenon in the blockchain world that happens when the community makes major changes to the blockchain network and alters the rules.\nBitcoin was hard forked — resulting in Bitcoin Cash, which featured faster transaction speeds. With its history tied to Bitcoin, Bitcoin Cash’s price often fluctuates with that of the top cryptocurrency.\nAs Bitcoin is going up after Trump’s speech, Bitcoin Cash is also following suit. The now-defunct Bitcoin exchange Mt. Gox has also finished paying its creditors in Bitcoin Cash, which may also be contributing to the crypto’s surge.\nCurrently, Bitcoin Cash is trading at $454, up over 16% from last week.\n4 \/ 7\nEther had a rough week last week due to continuous outflows from the spot Ether ETFs. The second-largest cryptocurrency has, however, picked up the pace since Sunday and will also be interesting to watch this week. As of right now, Ether is hovering around $3,300 and has gained 3.7% in the past 24 hours while dropping 3.4% in the past week.\n5 \/ 7\nThe decentralized lending platform Aave may adopt a fee switch structure. Marc Zeller, the founder of the Aave Chan Initiative, said if the proposal is adopted, it could lead to Aave protocol restacking, providing the company and its users with new revenue streams. The cryptocurrency is currently trading at $102, with over 7% increase in the past week.\n6 \/ 7\nJohn-Paul Thorbjornsen, the founder of the blockchain platform THORChain, is ready for a ‘vampire attack.’ In the crypto world, Vampire attacks occur when a new platform offers more attractive incentives to lure users and liquidity away from established rivals.\nAs a result of the news, cryptocurrency’s price has risen nearly 3% in the past seven days and is currently trading at $4.94 per coin.\n7 \/ 7",null,"Former president says he will end persecution of crypto industry if he wins US election in November\nBitcoin has hit its highest level in more than six weeks after Donald Trump said at the weekend he would end the “persecution” of the crypto industry if he wins the US presidential election.\nThe cryptocurrency’s price rose by more than 3% on Monday to peak at about $69,745, the highest since 12 June when the currency changed hands at more than $69,800.\nThe increase comes after supportive comments from Trump at the Bitcoin 2024 convention in Nashville, Tennessee, where he said on Saturday he would make the US the world’s cryptocurrency leader and embrace a more pro-bitcoin stance than his rival, Kamala Harris.\nThe former president said: “I pledge to the bitcoin community that the day I take the oath of office, Joe Biden and Kamala Harris’s anti-crypto crusade will be over … If we don’t embrace crypto and bitcoin technology, China will, other countries will. They’ll dominate, and we cannot let China dominate. They are making too much progress as it is.”\nHe also said he would sack the chair of the US financial watchdog the Securities and Exchange Commission (SEC), on the first day of his presidency if he won the election. “On day one, I will fire Gary Gensler,” Trump said, to cheers of approval from the audience.\nGensler is a noted sceptic about cryptocurrencies, despite aiding them in January by approving exchange-traded funds (ETFs) – a basket of assets that can be bought and sold like shares on an exchange – that track the price of bitcoin.\nThe SEC chair said in a statement approving the ETFs that bitcoin was a “speculative, volatile” asset used for illegal activities including ransomware and terrorist financing. Since 2023 the SEC has launched more than 40 crypto-related enforcement actions.\nSpeaking at the bitcoin convention, Trump said he would establish a crypto presidential advisory council and create a national “stockpile” of bitcoin using cryptocurrency the US government held that was largely seized in law enforcement actions.\nafter newsletter promotion\n“Never sell your bitcoin,” Trump said. “If I am elected, it will be the policy of my administration, the United States of America, to keep 100% of all the bitcoin the US government currently holds or acquires into the future.”\nThe Financial Times also reported on Saturday that Harris’s advisers had approached top crypto companies to try to “reset” the relationship between the Democratic party and the sector. Approaches had been made to the Coinbase crypto exchange, the stablecoin company Circle and the blockchain payments group Ripple Labs, the FT said.","During remarks a weekend bitcoin conference, presidential hopeful Donald Trump pledged to make the US the \"crypto capital of the planet, and the bitcoin superpower of the world\" if elected in November.\nBy Monday morning, Bitcoin climbed as much as 2.9%, reaching $69,998.26, its highest level since mid-June. The crypto erased gains around 11 a.m. Eastern and was trading about 1% lower as of 4:10 p.m.\nThe crypto has rallied in recent months, up about 60% year-to-date at earlier highs amid a flurry of spot-bitcoin ETF approvals from the SEC.\nDuring his remarks in Nashville on Saturday, Trump named a number of ways he'd support the crypto industry, including getting rid of SEC Chair Gary Gensler and ordering the government to keep all tokens confiscated in criminal cases to form a \"strategic national bitcoin stockpile.\"\nTrump's comments break from much of his prior sentiment on crypto. During his term, Trump often spoke out against the currency on Twitter, which independent presidential candidate Robert F. Kennedy Jr. was quick to point out during his own remarks.\nKennedy, a staunch crypto supporter, said Trump's policies while in office capped the currency's growth and reminded the audience that Trump once called Bitcoin \"a scam against the dollar.\"\nKennedy also called out the former president for failing to pardon Ross Ulbricht, who is serving life in prison for running the online marketplace Silk Road, where users bought illegal drugs using Bitcoin and other online currencies. Trump said he would commute Ulbricht's sentence if elected.\nTrump also announced that he's raised $25 million from cryptocurrency donations in the last two months. He's also won support from leading crypto investors like Gemini co-founders Cameron and Tyler Winklevoss, who donated $250,000 to a pro-Trump super PAC earlier this month.\nTrump's comments follow his party's recent growing support for crypto. The GOP's official 2024 platform, released earlier this month, says, \"We will defend the right to mine bitcoin, and ensure every American has the right to self-custody of their Digital Assets, and transact free from Government Surveillance and Control.\"\nCheck out Business Insider's picks for  best cryptocurrency exchanges\nCheck out Business Insider's picks for  best cryptocurrency exchanges"]}
{"date":"2024-07-30","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-07-31","titles":["Michael Saylor predicts Bitcoin could hit $49 million by 2045"],"urls":["https:\/\/finance.yahoo.com\/news\/michael-saylor-predicts-bitcoin-could-151917987.html"],"sources":["Yahoo Finance"],"descriptions":["Altcoin Daily's Austin Arnold discusses Bitcoin's future price as Michael Saylor boldly says it could hit $3 million even in a worst scenario."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMichael Saylor's recent bold predictions for bitcoin's future have captured the attention of the crypto community. Scott Melker, host of The Wolf of All Streets podcast, recently explored the idea Bitcoin could hit $49 million by 2045 with Altcoin Daily host Austin Arnold\nMelker opened the conversation by highlighting Michael Saylor's startling forecast: By 2045, bitcoin's price could be anywhere from $3 million to $49 million, with a mid-range of about $13 million. Melker remarked on the grandeur of such predictions, emphasizing the market's fascination with hyperbolic price forecasts.\nAustin Arnold shared his perspective, reflecting on Saylor's reputation as a highly knowledgeable figure in tech and crypto. Arnold stressed that Saylor backs his predictions with data, asserting that bitcoin reaching $13 million per coin is not a matter of if, but when. He pointed out that the devaluation of fiat currencies, particularly the USD, is inevitable, driving bitcoin's value up in comparison. Arnold noted the alarming statistic that 40% of all USD ever printed occurred in the last four years, underscoring the government's tendency to print more money to sustain markets. This fiscal irresponsibility, he argued, positions bitcoin to rise significantly.\nMelker then mentioned other significant predictions, such as Cathie Wood's forecast of bitcoin reaching $1 million by 2030. Arnold responded by sharing his belief that bitcoin could hit $500,000 per coin within the next decade, aligning its market cap with gold. He suggested that if bitcoin were to reach $1 million, it would indicate severe macroeconomic issues.\nIn conclusion, Melker acknowledged the staggering nature of Saylor's $49 million prediction, expressing a hope to witness such a marvel. Arnold's insights provided a grounded yet optimistic outlook on bitcoin's future, considering both market fundamentals and broader economic trends."]}
