{"date":"2024-05-01","titles":["Money latest: Bitcoin suffers nightmare month - and it's just got worse","Bitcoin drops all the way to $57,000 and into a bear market","Bitcoin Price to Crash 13% to $50k Amid Lower ETF Demand, Liquidity"],"urls":["https:\/\/news.sky.com\/story\/money-latest-bitcoin-suffers-nightmare-month-and-its-just-got-worse-13040934","https:\/\/qz.com\/bitcoin-price-drop-bear-market-1851447952","https:\/\/markets.businessinsider.com\/news\/currencies\/bitcoin-price-crash-outlook-50000-etf-outflows-liquidity-standard-chartered-2024-5"],"sources":["Sky News","Quartz India","Business Insider"],"descriptions":["Bitcoin has suffered its biggest monthly loss since June 2022 - amid signs that market euphoria is starting to cool. Read this and all the latest consumer and personal finance news below, plus leave a comment in the box.","The cryptocurrency has lost 10% of its value in the last week","Bitcoin has fallen past the ETF purchase price of around $58,000, putting over half of ETF positions underwater, Standard Chartered wrote."],"article_contents":["Welcome to Money, Sky News' consumer and financial news hub. Today we take a deep dive into Asda's live facial recognition trial. We also have our weekly Mortgage Guide. Plus: Toblerone axes a popular flavour and we have Easter open times for each supermarket.\nFriday 18 April 2025 17:00, UK\nBy Jess Sharp, Money live reporter\nFirstly, bear with us, but we're going to tell you why you shouldn't pay much attention to the biggest money news of the week.\nInflation data for March was released on Wednesday. Ostensibly, it was good news: the pace of price rises had slowed more than expected to 2.6%.\nBut here's the thing: none of the bill hikes in April, or the rise in the national minimum wage, will be reflected in the data until next month.\nAlso, Easter means a big rise in airline prices - last year Easter fell in March, this year it's in April. That skewed March's inflation data downwards... and will have the opposite impact in April.\nAll of which means we can expect a leap in the headline rate of inflation next time around - though falling oil prices over the last few weeks could ease some of the pain.\nOur business correspondent Paul Kelso produced this short video to explain what all of this means for you...\nHope on interest rates and mortgages\nThe drop in inflation, even though it's likely to be temporary, has combined with the global economic uncertainty brought on by Donald Trump's tariffs policy to heighten expectations for interest rate cuts.\nThis week, the markets upped their forecast from three to four cuts this year - if they're right, the base rate will be 3.5% when we enter 2026.\nAs we outlined in our weekly Mortgage Guide this morning, there's more positive news for first-time buyers in the shape of product availability, too.\nThe number of products available for those hoping to get on the property ladder reached a 17-year high, according to Moneyfacts.\nMany brokers suggested this could be the start of a price war between some of the biggest lenders.\nYou can read more about that in this week's Mortgage Guide...\nTrump's golden touch\nTrump's trade war has had another impact: driving investors to traditional safe havens such as gold.\nThe price of spot gold (also known as the live price or market price, for gold for immediate delivery) hit a record $3,357.40 (£2,532) per ounce on Wednesday.\nWhile prices have cooled slightly now, they're still higher than before the US president's tariffs were announced.\nYou can read more about why we are seeing the record highs here...\nA comedian, complaints and comments aplenty\nAway from all of that economic news, the topic that got you talking the most this week was how Britons complain.\nComedian John Bishop sparked a lot of comments from our readers after he praised easyJet for its great customer service.\nWhile some of you welcomed his friendly feedback, others thought it showed a \"sad reflection of the world today\"...\nYour Easter money highlights\nOther highlights here in Money included our Monday feature, What It's Really Like To Be A...\nThis week, Caroline Wood spoke about the realities of working in HR, including sacking people and dealing with bosses having affairs...\nOur round-up of all the places where children can eat for £1 or less this Easter might also be worth checking before you head out this weekend...\nWe will be back with live updates on Tuesday, but our Money features writer, Brad Young, has been speaking with a former gambling addict who lost £1m for our Saturday long-read. So look out for that this weekend.\nHave a great Easter!\nWe've been sifting through your comments on the day's top stories - and it seems Asda's decision to introduce face recognition technology in a bid to stop shoplifters has got you talking.\nMany thought the move was a breach of privacy...\nAny store operating biometric harvesting of customers' unique identifiers must be forced to vividly display that they do so. Clear signing before you enter a building must be shown. Websites must show this too. I for one will either shop elsewhere or cover my face.\nScinna\nBefore long you will be watched in everything you do and everywhere you go in the name of security. Little did George Orwell know he was writing the truth.\nDerek\n[I'll] wear a mask, hat and sunglasses in Asda from now on.\nLemmy\nOthers said it raised questions...\nWhen the system \"works by scanning images and comparing the results to a known list of individuals\" - what happens to these scans? Are they discarded immediately, within 24h, or could they be retained indefinitely and available to track innocent people in future?\nChris\nBut others thought it was a great idea...\nGood idea this face recognition - I suppose those against it are the ones committing the crime and don't want to get caught.Mouse\nMy husband and I wholeheartedly support facial recognition, it is NOT breaking our right for privacy. Once you leave your home, you are automatically presenting yourself to the world and if you are doing nothing wrong you have no need to shy away from being recognised.\nRosieglow 15\nGo for it Asda, about time they're stopped.Fed up Freda\nIf you're not going to do anything dishonest then what’s the problem? I was a store manager for Asda for 20 years, the theft and threats from people was horrendous. [It's] only [a matter of] time before someone is badly injured by these people.\nPhil\nIs a Birkin bag about to get even more expensive?\nIt certainly seems that way. Hermes has confirmed that it will be hiking its prices to deal with the impact of Donald Trump's tariffs.\nThe luxury French fashion brand said it will fully shift the burden of the tariffs to its wealthy clientele after its first-quarter sales showed a rare sign of weakness.\n\"We are going to fully offset the impact of these new duties by increasing our selling prices in the United States from 1 May, across all our business lines,\" said finance chief Eric du Halgouet.\nThe brand is known for its Kelly and Birkin handbags, which sell for at least £7,500.\nIn the three months to March, it reported sales of €4.1bn (£3.4bn).\nIf you've got a Money-related story you think we should investigate, we want to hear from you.\nYou can email moneyblog@sky.uk and our team will get back to you.\nWe're also always really keen to hear any money-saving tips, discounts or hacks you swear by - and we'd love you to send in any pearls of financial wisdom you think we should be passing on to our readers. It could be advice you wish someone had told your younger self, or a great way to save, or... you get the picture.\nThe email address is monitored throughout the day and by sending us content you're giving us permission to use.\nToblerone has risked upsetting fans by discontinuing one of its flavours.\nSweet giant Mondelez has confirmed that the 360g dark chocolate version of the bar is being axed.\nA spokesperson for the firm said it was a \"difficult decision\".\n\"We continuously adapt our product range to ensure it meets changing tastes whilst supporting growth for our customers and business, and as a result made the difficult decision to discontinue our Toblerone Dark (360g) bars in the UK,\" they told Money.\n\"While we understand that this may be disappointing for some consumers, we continue to invest in Toblerone.\"\nThe original Toblerone bar was invented in 1908, with the dark chocolate version launched in 1969.\nOne X user wrote: \"First they came for Bounty, now Toblerone...💔\"\nAnother said: \"No... it was my favourite.\"\nA third fan wrote: \"Does anyone know anywhere in the UK I can get a bar of Dark Toblerone? I've spoken to Toblerone who said its not been discontinued but I've been looking for absolutely ages and can't find them anywhere.\"\nBy Sarah-Jane Mee, lead UK news presenter\nNot all heroes wear capes… some just provide carpets.\nDid you know many local councils and housing associations across England provide homes with no flooring?\nI spent the day in St Albans with Pia Honey from NoFloorNoMore.org rescuing carpets destined for landfill to give to families living in substandard homes.\nPia first found out about this problem when she gave away her own carpet on a freecycle website - and the response was overwhelming.\n\"I helped three families with carpets from my home, but there were so many more. One woman told me that she had nowhere to open presents at Christmas, so I ripped out more carpets from my home.\"\nPia had so many enquiries, she started to ask questions. The answers shocked her into action.\nTenants told her that when a council property is reissued it is required to be stripped bare.\nProperties are stripped no matter the condition of the existing flooring.\nTenants are often unable to afford new flooring, which can leave their homes cold and miserable to live in.\nThe issue is country wide - Pia gets enquiries from all over the UK.\nWe met Sophie, who had contacted Pia for help. Sophie had waited more than a decade to move from a two-bed flat to a house big enough for her five children to have their own beds - she felt she couldn't refuse, despite the substandard condition of the floors.\nPia used carpets destined for landfill from a film studio to kit out the entire house and make it a home.\n\"No Floor No More\" is what's known as a Community Interest Company. It's currently unfunded and relies solely on donations from carpet manufacturers and big companies looking to dispose of flooring sustainably - and Pia's own savings.\nPia's aim is to support the community as best she can and eventually bring about a change in policy.\nThe Local Government Association told Sky News that councils across the country are fully committed to providing quality social housing but \"local government is under mounting pressure to find suitable homes for an ever-increasing number of people, and there are currently over 1.3 million families in England on waiting lists for social housing\".\nThe response went on: \"This means councils are having to make impossible decisions about maintaining existing housing stock and building more homes that the country seriously needs.\n\"Government needs to use the upcoming spending review to ensure that councils are sufficiently resourced and empowered to deliver the homes that the country desperately needs.\"\nRight of reply: St Albans City & District Council\nChris Traill, strategic director for community and place delivery, said: \"We are committed to ensuring our social housing properties are in the best possible condition for new tenants when they move in.\n\"In doing so, we provide all tenants with our flooring policy and our team are happy to discuss any issues they may have.\n\"As part of their tenancy agreement, tenants are asked to remove all flooring such as carpets and grippers before the property is handed back.\n\"This is because the flooring may be in a poor condition and unpleasant for the incoming tenants and because pets may have been in the house, posing a risk of flea infestations.\n\"However, exceptions are made where the flooring is in a good enough condition to be 'gifted' to the incoming tenant.\n\"Gifting is welcomed if the carpet is newly laid and where there is confirmation that there have been no pets and the carpet was treated for fleas as a precaution.\n\"We also allow for gifting where the flooring is suitable for new flooring to be laid on top.\n\"Recently, we have left flooring down in three properties that met the criteria.\"\nTopshop has hinted that its stores could be coming back to the high street this summer.\nIn several Instagram posts, the clothing brand said: \"We'll see you IRL in August.\"\nIt has been teasing its millennial fan base with a return since March, posting a number of cryptic messages on social media such as \"we missed you too\" and \"we've been listening\".\nWebsites for Topshop and Topman went live last month, both with a holding page that reads \"coming soon\".\nThe retailer disappeared from high streets in 2021 after its owner, Arcadia Group, fell into administration.\nAsos quickly acquired it for £265m and has been selling its products on its online fashion site since then.\nLast year, it sold a huge 75% stake of Topshop to Danish firm Heartland for £135m, which opened the possibility for a high street relaunch.\nThe number of people who stream sports illegally has gone \"through the roof\", the head of Britain's intellectual property crime unit has said.\nEmma Warbey said people were largely able to use illegal fire sticks or TV media boxes without the risk of being caught, with officers instead focusing their attention on organised crime groups.\nAccording to the Financial Times, she said her team at the City of London Police force were tackling \"resellers and the people at the top of the tree\", given that it's \"really hard\" to stop people from illegally streaming content.\nIllegal firesticks and boxes can be preloaded with software that can stream sporting events and channels that owners would otherwise have to pay for.\nBroadcasters have said the devices cost the industry hundreds of millions of pounds and called for more to be done to tackle pirated content.\nForgot to pick up Yukon Golds for your roast lunch this weekend?\nNot to worry - here's every major supermarket's opening hours over the Easter holiday weekend.\nThis is for \"big shops\" (not smaller Tesco Express-style shops), though many in Scotland are open on Easter Sunday - so it's worth checking if you live there.\nMorrison's\nTesco\nWaitrose\nAsda\nM&S\nAldi\nLidl\nEvery Friday, we take an overview of the mortgage market with industry experts and round up the best rates with Moneyfactscompare.co.uk.\nThere was some positive news for first-time buyers this week with data showing the number of low-deposit mortgages had reached a 17-year-high.\nThere were 442 mortgage deals available for buyers who can put down a 5% deposit on a home, according to Moneyfacts.\nFor buyers with a 10% deposit, it counted 845 available deals.\nIt means that both are at the highest point since the 2008 financial crisis, when banks were forced to tighten their lending rules.\nLenders have been under pressure to better cater for people trying to get on the housing ladder, and many have been rolling out low-deposit deals in a bid to stimulate activity in the housing market.\nOn Wednesday, Santander lowered first-time buyer rates by up to 0.21%.\nRachel Springall, finance expert at Moneyfacts, said: \"The flourishing choice of low deposit mortgages will no doubt be welcomed by borrowers who are either looking to remortgage or are a first time buyer.\n\"The government has been clear that it wants lenders to do more to boost UK growth, and so a rise in product availability for aspiring homeowners is a healthy step in the right direction.\n\"However, there is still much more room for improvement, particularly as the choice of deals at 95% loan-to-value represents just 6% of all deals available to borrowers across fixed and variable mortgages.\"\nHere are the top first-time buyer deals on the market...\nMoneyfacts also rounds up what it calls \"best buys\", which look beyond the lowest rates and take in incentives and fees...\nOverall, fixed rate mortgage reductions outweighed rises this week.\nWith inflation coming in lower than expected, analyst predictions for base rate cuts by the Bank of England this year rose from three to four, giving lenders more encouragement to make reductions.\nHSBC reduced rates by up 0.24%, The Mortgage Works by as much as 0.25% and NatWest and RBS made cuts of up to 0.13%, resulting in more deals priced below 4%.\n\"Borrowers are the winners here as the market becomes more competitive, giving them more options and encouraging more people to jump into the market rather than sitting on the fence, trying to time the market,\" said Pete Mugleston, managing director at Online Mortgage Advisor.\nWhat's going on in the housing market?\nOfficial figures released by the Office for National Statistics showed house prices jumped by 5.4% in the year to February - the fastest rate in more than two years.\nHouse price growth has been accelerating since last summer, and activity has picked up this year as buyers rushed to beat stamp duty increases.\nFrom April, first-time buyers in England and Northern Ireland started paying stamp duty on properties costing more than £300,000. They were previously exempt from paying the tax on properties up to £425,000.\n\"Official house prices will be boosted for at least another two months by the flurry of activity ahead of the stamp duty changes,\" Elliott Jordan-Doak, senior UK economist for Pantheon Macroeconomics, said.\n\"But there is genuine strength in the housing market.\"\nWe also got data from Rightmove showing asking prices rose by more than £5,000 to an average of £377,182 in April, despite less generous stamp duty discounts taking effect.\nRightmove property expert Colleen Babcock suggested people putting their homes on the market should be careful considering the number of homes for sale is at a decade high.","Bitcoin has continued its April wipeout into May, falling all the way below $57,000 on Wednesday morning and technically entering into a bear market after its worst month in almost a year-and-a-half.\nThe ongoing selloff, which sent Bitcoin’s price as low as $56,757 early Wednesday before a slight rebound, follows April’s closely watched “halving” event and comes ahead of Wednesday’s Federal Reserve decision on interest rates. Bitcoin is now more than 20% below its record high of $73,803 set in March, though it’s still up about 30% so far this year.\nBitcoin’s previous halving events, in which the reward for miners who create more Bitcoin is cut in half, have typically been followed by big rallies in the cryptocurrency’s price. But analysts had warned that might not be the case this time.\nBitcoin shed its value Tuesday as Hong Kong’s Bitcoin and Ether ETFs failed to impress investors on their debut. Recently, six crypto-related ETFs were listed on the Hong Kong exchange. Bitcoin ETFs contributed $8.5 million in volume, while Ether ETFs brought in $2.5 million. As a comparison, the issuers anticipated an initial volume of $100 million, as per media reports.\nBitcoin ETFs in the U.S. are struggling, too, with a total net inflow of $11 billion — which could have been much better if Grayscale’s GBTC had seen any inflows. According to investment firm Farside, GBTC has experienced outflows for over a month, totaling $17 billion since April 11. Over the past three days, Fidelity’s FBTC also has witnessed continuous outflows totaling $31 million.\nThe bearish sentiment spread throughout the crypto market, sending Ether, the second largest cryptocurrency, to below $3,000 after a 4% drop in the morning. Solana and Dogecoin also lost 4.4% and 8.4%, respectively.\nOur free, fast, and fun briefing on the global economy, delivered every weekday morning.","Deteriorating conditions are denting the Bitcoin rally, with this week's drop below $60,000 putting it en route for an even lower price range.\nAccording to commentary from Standard Chartered, the apex token could temporarily reach as low as $50,000, signaling an over 13% drop from current levels.\nAs of 9 a.m. ET on Wednesday, bitcoin is trading at $57,790.\nSteering this decline are both crypto and macroeconomic drivers, Head of FX Research Geoff Kendrick wrote on Wednesday. Among these are shrinking investments in spot bitcoin ETFs, funds that first sparked the rally at the year's start.\n\"On the crypto-specific, we have now had five days in a row of outflows from the US spot ETFs and, as importantly, we are now below the average ETF purchase price of around 58k,\" he said. \"This means that more than half of the spot ETF positions are under water and so the risk of liquidation of some of them must be considered as well.\"\nThe crypto industry also got no consolation from headlines in Hong Kong on Tuesday, where six bitcoin and ethereum spot ETFs were launched. Most of the news focused on the funds' low turnover volume, even though their net asset positions were promising, Kendrick said.\nAlso wearing on bitcoin are the US' falling liquidity measures, which have rapidly declined since mid-April, he noted.\n\"Of course liquidity matters when it matters, but with a backdrop of strong US inflation data and less likelihood of Fed rate cuts it matters at the moment,\" Kendrick said.\nThat's not to say that Standard Chartered is turning sour on bitcoin, which it has long forecast as rising to $150,000 by this year's end. Just last week, Kendrick published a note where he reiterated the price target, despite rising macroeconomic strains.\nAdding to his optimism was bitcoin's recent halving event, which would cut the amount of produced supply — therefore lowering how much ETF inflows were necessary to keep prices rising.\nIn March, crypto enthusiast Mike Novogratz added that bitcoin is unlikely to drop past $50,000 again, as the recent rally is driven less by macroeconomic factors, but by investor adoption of the crypto.\nIf a correction to $50,000 occurred, he's outlined that it would only be followed by a surge higher."]}
{"date":"2024-05-02","titles":["Coinbase first-quarter profits surged above $1 billion on ETF frenzy","ChatGPT advises investors with high risk appetite to invest in cryptos. Should you take the plunge?","TechCrunch Minute: Where CZ’s sentencing leaves the state of crypto","Why are so many young Indians trading in cryptocurrency, especially in tier-two cities?"],"urls":["https:\/\/finance.yahoo.com\/news\/coinbase-first-quarter-profits-surged-above-1-billion-on-etf-frenzy-204045161.html","https:\/\/www.livemint.com\/money\/personal-finance\/chatgpt-advises-investors-with-high-risk-appetite-to-invest-in-cryptos-should-you-invest-11714657383533.html","https:\/\/techcrunch.com\/2024\/05\/02\/techcrunch-minute-where-czs-sentencing-leaves-the-state-of-crypto\/","https:\/\/scroll.in\/article\/1066757\/why-are-so-many-young-indians-trading-in-cryptocurrency-especially-in-tier-two-cities"],"sources":["Yahoo Finance","Livemint","TechCrunch","Scroll.in"],"descriptions":["Coinbase posted its second consecutive quarterly profit as crypto trading surged during the first three months of 2024.","Open AI-founded chatbot tells investors with a high risk appetite to opt for cryptos since the market is highly speculative and volatile. The popular options are bitcoin, Ethereum and other altcoins.","Changpeng Zhao is going to jail for four months and set to pay a $50 million fine for allowing money laundering on his crypto-trading platform, Binance.","An excerpt from ‘Crypto Crimes: Inside India’s Best-Kept Secret’, by Mitali Mukherjee."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCoinbase Global (COIN) posted its second consecutive quarterly profit as crypto trading surged during the first three months of 2024.\nYet the stock of the largest US cryptocurrency exchange fell by almost 4% in premarket trading on Friday.\nThe stock is up more than 31% since the beginning of the year but 38% below its peak in November 2021.\nNet income rose to $1.17 billion, the highest mark in nine quarters, while net revenue rose by 115% when compared to the year-ago period.\nThis was just the second time Coinbase reported positive quarterly earnings since the fourth quarter of 2021 when the last crypto boom was still raging.\nThe boost in this year's first quarter came from a revival in digital coin trading, largely due to the launch of a series of new bitcoin ETFs in January.\nThese ETFs attracted a lot of new money, potentially widening the mainstream appeal of digital assets by allowing investors to get exposure to bitcoin without directly owning it.\nGlobal crypto trading volume for major coins reached its highest level since 2021, increasing 68% from a year ago, according to data provider CoinMarketCap.\nThis surge lifted Coinbase’s transaction revenue to $1.07 billion, nearly three times what it earned in trading fees in the first quarter of 2023 and better than consensus expectations from analysts.\nThe value of bitcoin (BTC-USD) also surged during the first quarter, climbing to a new all-time high of $73,750. It has since fallen from that peak to trade around $59,000.\nIt remains 34% higher year to date.\nCoinbase posted non-trading subscriptions and services revenue of $511 million, which rose 41% from a year ago.\nThis included higher custody fees of $32.3 million. That number was 90% higher compared with a year ago, thanks in part to partnerships with eight of the bitcoin ETFs launched in January.\nThe major exchange has benefited from having less competition than it did during the last boom.\nAnother big exchange, FTX, filed for bankruptcy, and its co-founder Sam Bankman-Fried was criminally convicted last year. He was sentenced to 25 years in prison this year.\nBinance, another Coinbase rival, also paid $4.3 billion in fines to US government agencies for violating anti-money laundering requirements.\nEarlier this week, Binance founder and CEO Changpeng Zhao was sentenced to four months in prison for his part in the violations.\nBut those blows to competition haven't helped Coinbase gain as many users as analysts had hoped. Its monthly transaction users (MTUs) for the first quarter were 8 million, a 5% decline from the same period last year. The company also suggested second quarter revenue from trading fees may not be so good. The trading platform's transaction revenue through April was over $300 million.\nAnd Coinbase has its own regulatory troubles. The firm is facing a 2023 lawsuit from the SEC alleging the company violated US federal securities laws.\nCoinbase and its CEO, Brian Armstrong, are fighting those allegations. The critical case could take years to play out.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for the latest crypto news, updates, and more related to ethereum and bitcoin prices, crypto ETFs, and market implications for cryptocurrencies\nRead the latest financial and business news from Yahoo Finance","If you ask ChatGPT, the popular artificial intelligence (AI) chatbot, about the most feasible investing option one could explore as a high-risk investor, it promptly asks you to put your money in cryptocurrencies, among other options.\nNot only does it suggest investing in cryptos, but it also shares with the inquisitive user the key reason for doing so.\nIt says that the cryptocurrency market is highly speculative and volatile, and therefore it is suitable only for the high-risk investors who are seeking substantial returns. Among the popular options are bitcoin, Ethereum and other altcoins, it further advises.\nALSO READ: Bitcoin reaches all-time high of $72,000, should you invest?\nWhatever advice ChatGPT may give, one is advised to take its advice with a pinch of salt. It is, therefore, not recommended to completely rely on a chatbot based on large language models (LLM) despite its colossal potential to answer a range of queries without skipping a beat.\n“Although ChatGPT provides recommendations, how far it works for an individual is not known. It does not understand the psychology of an investor. There are behavioural problems with people’s mindset. And the investing journey calls for a lot of handholding to handle the psychology rather than merely learning the tips to invest money,” says Sridharan Sundaram, a Sebi-registered investment advisor and founder of Wealth Ladder Direct.\nNotwithstanding the chatbot’s advice, there is no denying the fact that bitcoin and other cryptocurrencies are highly volatile. Bitcoin’s prices have declined nearly 10 per cent in the past one month alone after a bull run seen in the wake of a green signal given by the Securities and Exchange Commission (SEC) to spot bitcoin ETFs in January this year.\nOn Thursday, bitcoin traded at $58,521 (1.28 per cent up), Ethereum at $2,978 (2.37 per cent up), tether at $1 (0.10 per cent up), BNB at $560 (1.83 per cent up) and Solana at $136.63 (10 per cent up), shows CoinDesk data at 1.16 pm GMT.\nNotably, bitcoin witnessed nearly 6 per cent fall on Wednesday to trade at $57,000, registering its worst monthly performance since April 2022. This downturn can be attributed to the withdrawal of funds in anticipation of the interest rate decision from the Federal Reserve.\nBesides cryptos, the Open AI-founded chatbot also asks investors to explore other investing options such as derivatives, penny stocks, high-yield bonds and highly volatile sectors such as technology or biotech.\nDerivatives: Derivative financial instruments such as options and futures are prone to excessive gains as much as losses.\nPenny Stocks: These securities represent small companies with low market capitalisation and trade at low prices. They are extremely volatile and offer scope for substantial gains or losses.\nHigh-yield bonds: The bonds that are issued by organisations with low credit ratings usually offer higher yields but have a high degree of risk. So, investors who have a high-risk appetite are encouraged to invest in high-yield bonds.\n(Note: This story is for informational purposes only. Please speak to a SEBI-registered investment advisor before making any investment-related decision.)\nCatch all the Instant Personal Loan, Business Loan, Business News, Money news, Breaking News Events and Latest News Updates on Live Mint. Download The Mint News App to get Daily Market Updates.\nLog in to our website to save your bookmarks. It'll just take a moment.","Four months behind bars and a massive fine, that’s what CZ is getting from the government for his crypto exchange’s misdeeds. Regardless of how you view the verdict — too much, too little, just right — his sentencing is a big deal for web3. Potentially in a positive way.\nThere’s effort by some in crypto to promote the technology element of blockchains over their well-reported ability to generate new gambling opportunities. Chris Dixon of a16z frames this in “computer vs. casino” terms, which I think is reasonable.\nIf you are in favor of the computer over the casino, you probably want the crypto market to be as in line with financial norms as possible. Why? Because that means that crypto can itself sit very close to the larger world economy, and thus the computing elements of blockchain tech can shine, attract investment, and provide the most use. If you are more in favor of the casino side of the conversation — line goes up, memecoins, bitcoin maximalism, etc. — you might not be a fan. After all, to get close enough to kiss TradFi and normal business operations so that the web3 computer can reach its full potential, you might wind up with more tokens as securities than many crypto advocates wish.\nRegardless, CZ’s case is now sorted. SBF’s as well. What is the next chapter for crypto going to be?\nTopics\nSenior Reporter\nDefense tech Theseus landed Y Combinator, the US Special Forces, and $4.3M from a tweet\nOpenAI launches Flex processing for cheaper, slower AI tasks\nThe latest viral ChatGPT trend is doing ‘reverse location search’ from photos\nJudge rules Google illegally monopolized adtech, opening door to potential breakup\nChapter, a Medicare startup with links to Vance, Thiel, and Ramaswamy, just raised a round at $1.5B valuation\nMicrosoft researchers say they’ve developed a hyper-efficient AI model that can run on CPUs\nFor security, Android phones will now auto-reboot after three days","Biography: The story of Naib Subedar Chunni Lal, the most decorated Indian Army soldier in history\nMan’s best friend: A photographer encounters lonely stray dogs on Goa’s beaches during the pandemic\n‘Khauf’ review: A relentlessly dark tale of human and demonic possession\nRush Hour: Indians 50% of scrapped US student visas, US arrests Indian terror suspect & more\nIndians form 50% of US student visas cancelled by Trump government: Study\nIndia’s passport ranking drops to 148 among 199 countries\nExplained: How US bond market fury stopped Trump’s trade war\nA new book records the resilience and contributions of Bibi Sahib and other women in colonial Punjab\nWhen a young India was struggling to define modern theatre, it found inspiration in its folk culture\n‘Paddington in Peru’ review: Third time unlucky for the cuddly bear\nNew crypto users are mostly under 35, and they’re skilled – a bulk of those investing are IT professionals, MBA graduates, engineers, and start-up owners. They’re also curious to sample variety, and are investing in things like De-Fi assets and Non-Fungible Tokens or NFTs. Another happenstance through 2021 was the entry of many more women traders – local exchanges unanimously reported a rise in the share of women investors to 30-40 per cent, doubling from the previous year’s figure of 15 per cent.\nBy the end of 2021, India had 15 homegrown cryptocurrency exchange platforms, furiously working the trading and selling aspect of the with more than 1.5 crore users. According to broker discovery and comparison platform BrokerChooser, over 100 million people were trading cryptocurrencies in India, leaving the US and Russia a distant second and third. According to the Blockchain and Crypto Assets Council, part of the Internet and Mobile Association of India, not only experienced investors, but also youth from tier-2 and -3 cities are among those investing in crypto. This young subsegment has invested up to Rs 6 lakh crore in cryptocurrencies.\n“A 25-year-old can’t dream of buying Meta stock in the US. Similarly, in India, while demat holders have increased, it’s not fast enough, and doesn’t seem to have been wide or deep enough either. So, instead of putting all your income into slowmoving traffic like fixed deposits, if you start managing crypto trading, with some high-risk-high-return opportunities, young people sense a real opportunity to get rich quick here. There are instances where people have made three times more, so they figure this may be worth the risk. Once you’ve dipped your toes in, currencies can be scaled. You could, for argument’s sake, start with Rs 2 lakh, and here’s the potential to get it to 20 lakh.”\nAt CoinSwitch Kuber, the most actively traded coins were Bitcoin, Dogecoin, Ethereum, Polygon, and Cardano, while WazirX saw the most activity in Bitcoin, Tether, Shiba Inu, Dogecoin, WazirX, and Matic through 2021.\n“Of course, fluctuations are crazy,” Pahwa admits. “For those who don’t work at a deeper understanding, there is a risk in seeing it only as a get-rich-quick tool. But, the fact is that India is restrictive in the investing ecosystem it has cultivated. So, it is understandable younger people are exploring newer, easier avenues. These problems existed, and here pops up a crypto ecosystem with a range that is eye-popping. Bitcoin has one use, Ethereum works like a smart contract, while Matic is trying to make Ethereum more accessible.”\nMedha B Dey Roy is a global PR and brand evangelist, heading branding and communications at KuCoin India. She concurs with Pahwa.\n“The reason why there’s been a stunning rise in crypto trading across non-metro cities is because trading has its own syntax,” she says. “It’s a skill that doesn’t have barriers of language or location. Young traders who live in smaller cities no longer feel inhibited by their address or lack of expertise in English. Buying and selling on the over-the-counter (OTC) desk, or buying bulk crypto, are pretty easy. The difference is, instead of matching buyers and sellers, the OTC desk acts as a dealer for anybody looking to trade a given asset. This comes in handy when a given trade would not be possible on exchanges, for instance. Some of the young traders are not even banked because they don’t have enough collaterals. The pinch point is limited bank access – banks are uncomfortable providing loans or credit, and young people need to find other avenues. Crypto provides that.”\n“Most importantly, trading these coins requires no collateral,” Medha goes on to add. “A young Indian, who understands the hum and rhythm of trading, can pick up the trends of a coin, invest a small amount to begin with, and earn a passive income. States like Goa and Kerala saw an exceptional rise in trading activity because astute young traders took advantage of relatively lower electricity charges, and also jumped on to the role of peer-to-peer (P2P) merchants.”\nThe P2P route in trading involves direct cryptocurrency transactions between users without intermediaries or a third party. Unlike traditional exchanges, buying and selling crypto on a P2P marketplace does not include charts and market indicators; young traders can purchase and sell coins among themselves. This opens up the chain and brings more people into the fold.\nBy 2021, the cryptocurrency rage was at its peak. Schoolchildren were talking about it, and many were up through the night trading coins. While cryptocurrency exchanges do not allow trading for investors younger than eighteen, many teenagers found a way to dodge the rules by using their parents’ credentials.\nMedha also points to the rise in young women trading crypto, a healthy sign she believes shows the value and diversity in the crypto-trading community. But the numbers there seem to paint a glass half-empty or half-full picture, depending on one’s perspective.\nOther exchanges show similar data. At CoinDCX, only 15 per cent of current investors are women; most from metros like Delhi, Bengaluru, Hyderabad, Pune, and Lucknow. Unocoin and Coinswitch Kuber register roughly the same number, while newer platforms like Bitbns and CrossTower had only 10 per cent women investors, as of December 2021.\nBy way of market cap,12 Bitcoin makes up nearly half the total crypto universe, while Ethereum carves up a quarter. That leaves the wide and varied jungle of Altcoins occupying the remaining 40 per cent market share. These Alts are literally a dime a dozen in their range and identity. Memecoins, for instance, are named after social media jokes and puns – the Dogecoin, of course, prime among them – where the value comes from community buy-in. Then there are forks which, as the name suggests, are Altcoins born when coders make a significant change in a blockchain’s protocol. The change alters how cryptocurrencies are recorded, traded, and received. Forks can either tweak the currency slightly, branch off into a new type, or upgrade the blockchain system enough to render old forms of transactions invalid.\nExcerpted with permission from Crypto Crimes: Inside India’s Best-Kept Secret, Mitali Mukherjee, HarperCollins India."]}
{"date":"2024-05-03","titles":["Coinbase CFO Says Bitcoin Retreat Is ‘Just Another Day in Crypto’","Coinbase first quarter profits surged above $1 billion on ETF frenzy"],"urls":["https:\/\/www.livemint.com\/news\/coinbase-cfo-says-bitcoin-retreat-is-just-another-day-in-crypto-11714780890065.html","https:\/\/ca.finance.yahoo.com\/news\/coinbase-first-quarter-profits-surged-above-1-billion-on-etf-frenzy-204045161.html"],"sources":["Livemint","Yahoo Canada Finance"],"descriptions":["Coinbase Global Inc. Chief Financial Officer Alesia Haas defended the crypto exchange’s rising expenses and the volatility of the digital asset industry after the company’s stock fell despite reporting better-than-expected first quarter results.","Coinbase posted its second consecutive quarterly profit as crypto trading surged during the first three months of 2024."],"article_contents":["(Bloomberg) -- Coinbase Global Inc. Chief Financial Officer Alesia Haas defended the crypto exchange’s rising expenses and the volatility of the digital asset industry after the company’s stock fell despite reporting better-than-expected first quarter results.\n“When we see high volumes, which we saw a sharp tick-up in volumes in March, we tend to then have a lagging effect to our customer support costs as we staff up those teams to address the queues that have resulted, so a little bit of that is spilling into Q2,” Haas said in an interview Friday with Bloomberg Television.\nThe largest US crypto exchange, she said, is also experiencing higher infrastructure costs and rising expenses related to the company’s USDC stablecoin rewards program, but noted that the company would be “growing prudently.”\n“We learned our lessons hard in 2021 and 2022 when we grew too quickly,” she said. Coinbase shed 20% of its staff in January 2023, just months after a major layoff in June 2022.\nShares of San Francisco-based Coinbase fell 2.5% to $223.25 on Friday. After surging more than 50% in the first quarter, the stock slumped 23% in April. Bitcoin retreated 15% last month, after jumping 67% in the quarter.\nHaas pointed to the growth of the company’s Base layer-2 blockchain, noting that there was social and gaming applications, as well as activity for controversial, joke-themed currencies known as memecoins.\n“This is the creative content,” Haas said of memecoins. “It’s just part of the process.”\nShe also downplayed the decline of Bitcoin’s price in April following the cryptocurrency reaching a new high of more than $73,000 in March.\n“It’s just another day in crypto,” Haas said.  “It doesn’t mean that the look long-term doesn’t continue to be as rosy as it was last week.”\nCoinbase reported Thursday that revenue more than doubled to $1.58 billion, topping the $1.32 billion average estimate of analysts surveyed by Bloomberg. The company said that net income was $1.17 billion, including a benefit from an accounting change. It had a loss in the year-ago period.\n--With assistance from Sonali Basak.\n(Adds video interview and update with the final share price.)\nMore stories like this are available on bloomberg.com\n©2024 Bloomberg L.P.\nCatch all the Business News , Breaking News Events and Latest News  Updates on Live Mint. Download The Mint News App  to get Daily Market Updates.\nLog in to our website to save your bookmarks. It'll just take a moment.","Oops, something went wrong\nCoinbase Global (COIN) posted its second consecutive quarterly profit as crypto trading surged during the first three months of 2024.\nYet the stock of the largest US cryptocurrency exchange fell by almost 4% in premarket trading on Friday.\nThe stock is up more than 31% since the beginning of the year but 38% below its peak in November 2021.\nNet income rose to $1.17 billion, the highest mark in nine quarters, while net revenue rose by 115% when compared to the year-ago period.\nThis was just the second time Coinbase reported positive quarterly earnings since the fourth quarter of 2021 when the last crypto boom was still raging.\nThe boost in this year's first quarter came from a revival in digital coin trading, largely due to the launch of a series of new bitcoin ETFs in January.\nThese ETFs attracted a lot of new money, potentially widening the mainstream appeal of digital assets by allowing investors to get exposure to bitcoin without directly owning it.\nGlobal crypto trading volume for major coins reached its highest level since 2021, increasing 68% from a year ago, according to data provider CoinMarketCap.\nThis surge lifted Coinbase’s transaction revenue to $1.07 billion, nearly three times what it earned in trading fees in the first quarter of 2023 and better than consensus expectations from analysts.\nThe value of bitcoin (BTC-USD) also surged during the first quarter, climbing to a new all-time high of $73,750. It has since fallen from that peak to trade around $59,000.\nIt remains 34% higher year to date.\nCoinbase posted non-trading subscriptions and services revenue of $511 million, which rose 41% from a year ago.\nThis included higher custody fees of $32.3 million. That number was 90% higher compared with a year ago, thanks in part to partnerships with eight of the bitcoin ETFs launched in January.\nThe major exchange has benefited from having less competition than it did during the last boom.\nAnother big exchange, FTX, filed for bankruptcy, and its co-founder Sam Bankman-Fried was criminally convicted last year. He was sentenced to 25 years in prison this year.\nBinance, another Coinbase rival, also paid $4.3 billion in fines to US government agencies for violating anti-money laundering requirements.\nEarlier this week, Binance founder and CEO Changpeng Zhao was sentenced to four months in prison for his part in the violations.\nBut those blows to competition haven't helped Coinbase gain as many users as analysts had hoped. Its monthly transaction users (MTUs) for the first quarter were 8 million, a 5% decline from the same period last year. The company also suggested second quarter revenue from trading fees may not be so good. The trading platform's transaction revenue through April was over $300 million.\nAnd Coinbase has its own regulatory troubles. The firm is facing a 2023 lawsuit from the SEC alleging the company violated US federal securities laws.\nCoinbase and its CEO, Brian Armstrong, are fighting those allegations. The critical case could take years to play out.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for the latest crypto news, updates, and more related to ethereum and bitcoin prices, crypto ETFs, and market implications for cryptocurrencies\nRead the latest financial and business news from Yahoo Finance"]}
{"date":"2024-05-06","titles":["Robinhood gets new legal threat from SEC as crypto crackdown continues","Robinhood gets new legal threat from SEC as crypto crackdown continues","Robinhood’s crypto arm receives SEC warning over alleged securities violations","Robinhood Says SEC Planning Charges Against Cryptocurrency Arm"],"urls":["https:\/\/ca.finance.yahoo.com\/news\/robinhood-gets-new-legal-threat-from-sec-as-crypto-crackdown-continues-145038876.html","https:\/\/finance.yahoo.com\/news\/robinhood-gets-new-legal-threat-from-sec-as-crypto-crackdown-continues-145038876.html","https:\/\/www.theverge.com\/2024\/5\/6\/24150045\/robinhood-cryptocurrency-wells-notice-warning-sec","https:\/\/www.forbes.com\/sites\/caileygleeson\/2024\/05\/06\/robinhood-threatened-with-sec-charges-over-its-crypto-trading-platform\/"],"sources":["Yahoo Canada Finance","Yahoo Finance","The Verge","Forbes"],"descriptions":["Robinhood said it got a SEC warning that the trading platform could face an enforcement action related to its US crypto business.","Robinhood said it got an SEC warning that the trading platform could face an enforcement action related to its US crypto business.","Robinhood has received a Wells notice from the SEC’s staff, which recommends that the agency take action against the trading platform for alleged securities violations.","The trading app’s cryptocurrency arm received a notice regarding impending action from the SEC on May 4."],"article_contents":["Oops, something went wrong\nRobinhood (HOOD) said it received a Securities and Exchange Commission warning that the trading platform could face an enforcement action related to its US crypto business.\nThe so-called Wells notice that Robinhood got May 4 stated that the SEC’s staff made a \"preliminary determination\" to recommend the action due to violations of registrations as a securities broker and transfer agent.\nIts stock dropped roughly 1% by Monday's close.\nRobinhood warned in its disclosure that a potential action from the SEC could mean a civil complaint and a public court proceeding that could end in a fine, a cease-and-desist order, and other limitations on its crypto activities.\n\"After years of good faith attempts to work with the SEC for regulatory clarity including our well-known attempt to ‘come in and register,’ we are disappointed that the agency has decided to issue a Wells Notice,\" Robinhood's chief legal, compliance, and corporate affairs officer Dan Gallagher said in a blog post.\nThe SEC has gone after a number of firms that let US customers trade cryptocurrencies as part of a wide-ranging crackdown on the industry.\nLast June the agency filed a lawsuit against the largest US cryptocurrency exchange, Coinbase (COIN), alleging it was operating an unregistered exchange by allowing the sale of certain crypto tokens the agency considers to be investment securities — and therefore part of the SEC's jurisdiction.\nCurrently, Coinbase and its CEO, Brian Armstrong, are fighting those allegations. They have argued the cryptocurrencies sold through its exchange are more like baseball cards than securities.\nThe regulator made a similar argument in a separate suit against Binance, arguing that the exchange also allowed certain digital currencies to be traded on its platform that should have been registered with the SEC.\nRobinhood’s chief legal officer on Monday made the same argument that Coinbase has made, saying that \"We firmly believe that the assets listed on our platform are not securities and we look forward to engaging with the SEC to make clear just how weak any case against Robinhood Crypto would be on both the facts and the law.\"\nRobinhood has previously said its crypto business was under SEC investigation, with the trading venue having disclosed that the SEC had sent subpoenas.\nWhat could make this legal threat less severe for Robinhood is that the trading firm earns much less of its total revenue from crypto trading when compared to firms that are more crypto focused, Mizuho analyst Dan Dolev stated in a Monday research note.\nIn the fourth quarter of 2023, Robinhood earned total net revenue of $471 million, 9.13% of which came from crypto-related transaction fees.\n\"In our view, concerns regarding the notice are likely overblown,\" said Dolev, who has a Buy rating on Robinhood’s stock.\nRobinhood reports first quarter earnings Wednesday after the market closes.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for the latest crypto news, updates, and more related to ethereum and bitcoin prices, crypto ETFs, and market implications for cryptocurrencies\nRead the latest financial and business news from Yahoo Finance","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nRobinhood (HOOD) said it received a Securities and Exchange Commission warning that the trading platform could face an enforcement action related to its US crypto business.\nThe so-called Wells notice that Robinhood got May 4 stated that the SEC’s staff made a \"preliminary determination\" to recommend the action due to violations of registrations as a securities broker and transfer agent.\nIts stock dropped roughly 1% by Monday's close.\nRobinhood warned in its disclosure that a potential action from the SEC could mean a civil complaint and a public court proceeding that could end in a fine, a cease-and-desist order, and other limitations on its crypto activities.\n\"After years of good faith attempts to work with the SEC for regulatory clarity including our well-known attempt to ‘come in and register,’ we are disappointed that the agency has decided to issue a Wells Notice,\" Robinhood's chief legal, compliance, and corporate affairs officer Dan Gallagher said in a blog post.\nThe SEC has gone after a number of firms that let US customers trade cryptocurrencies as part of a wide-ranging crackdown on the industry.\nLast June the agency filed a lawsuit against the largest US cryptocurrency exchange, Coinbase (COIN), alleging it was operating an unregistered exchange by allowing the sale of certain crypto tokens the agency considers to be investment securities — and therefore part of the SEC's jurisdiction.\nCurrently, Coinbase and its CEO, Brian Armstrong, are fighting those allegations. They have argued the cryptocurrencies sold through its exchange are more like baseball cards than securities.\nThe regulator made a similar argument in a separate suit against Binance, arguing that the exchange also allowed certain digital currencies to be traded on its platform that should have been registered with the SEC.\nRobinhood’s chief legal officer on Monday made the same argument that Coinbase has made, saying that \"We firmly believe that the assets listed on our platform are not securities and we look forward to engaging with the SEC to make clear just how weak any case against Robinhood Crypto would be on both the facts and the law.\"\nRobinhood has previously said its crypto business was under SEC investigation, with the trading venue having disclosed that the SEC had sent subpoenas.\nWhat could make this legal threat less severe for Robinhood is that the trading firm earns much less of its total revenue from crypto trading when compared to firms that are more crypto focused, Mizuho analyst Dan Dolev stated in a Monday research note.\nIn the fourth quarter of 2023, Robinhood earned total net revenue of $471 million, 9.13% of which came from crypto-related transaction fees.\n\"In our view, concerns regarding the notice are likely overblown,\" said Dolev, who has a Buy rating on Robinhood’s stock.\nRobinhood reports first quarter earnings Wednesday after the market closes.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for the latest crypto news, updates, and more related to ethereum and bitcoin prices, crypto ETFs, and market implications for cryptocurrencies\nRead the latest financial and business news from Yahoo Finance","The trading platform says it received a Wells notice from the SEC — a sign of an incoming enforcement action.\nThe trading platform says it received a Wells notice from the SEC — a sign of an incoming enforcement action.\nby  Emma Roth\nRobinhood’s cryptocurrency division could soon be in trouble with the Securities and Exchange Commission. In an 8-K filing submitted on Saturday, Robinhood revealed that it received a Wells notice from the SEC’s staff recommending the agency take action against the trading platform for alleged securities violations.\nRobinhood says it received the Wells notice after cooperating with the SEC’s requests for investigative subpoenas about its crypto listings, custody of cryptocurrencies, and the platform’s operations. A Well notice is a letter from the SEC that warns a company of a potential enforcement action. The SEC’s response could include an injunction, a cease-and-desist order, disgorgement, limits on activities, and \/ or civil penalties.\nCoinbase similarly received a Wells notice just months before the SEC sued it for breaking securities law. The SEC also sued Binance on similar grounds, with the trading platform’s former CEO, Changpeng Zhao, now facing four months in prison.\n“We firmly believe that the assets listed on our platform are not securities and we look forward to engaging with the SEC to make clear just how weak any case against Robinhood Crypto would be on both the facts and the law,” Dan Gallagher, Robinhood’s chief legal, compliance, and corporate affairs officer, said in a statement.\nRobinhood says it already made the “difficult choice” to delist certain tokens — including Solana, Polygon, and Cardano — in response to the SEC’s lawsuits against other trading platforms. In the past, the SEC has argued that some cryptocurrencies are considered securities, which would require exchanges to register with the SEC. This would give the agency regulatory control over the exchanges and the registered tokens.\nRobinhood could face a long legal battle if it chooses to fight the SEC’s potential enforcement action. The company’s shares have already dipped in response to the news.","Robinhood’s cryptocurrency platform could face charges from the Securities and Exchanges Commission, the trading app said Monday, marking federal regulators’ latest action against a crypto trading platform—and the latest round of SEC scrutiny for Robinhood.\nThe trading app’s cryptocurrency arm received a notice regarding impending action from the SEC on ... More May 4.\nRobinhood received a Wells Notice from SEC staff on May 4, it said in an SEC filing, which indicated the agency had made a “preliminary determination” to file an enforcement action against Robinhood Crypto for alleged violations of federal laws governing securities brokers.\nThese notices give a company the opportunity to refute allegations, according to the SEC, but potential actions may include a cease-and-desist proceeding or civil injunction, possibly resulting in monetary penalties and censure, revocation and limitations on future activities.\nChief Legal, Compliance and Corporate Affairs Officer Dan Gallagher said in a statement the company is “disappointed” the SEC issued the notice, going on to say: “We firmly believe that the assets listed on our platform are not securities and we look forward to engaging with the SEC to make clear just how weak any case against Robinhood Crypto would be on both the facts and the law.”\nThe SEC told Forbes it “does not comment on the existence or nonexistence of a possible investigation.”\nWe estimate Robinhood co-founders Baiju Bhatt and Vlad Tenev to be worth $1.2 billion and $1.1 billion, respectively.\nThe SEC has cracked down on the largely unregulated crypto trading world in recent years. Popular crypto trading platforms—including Binance, FTX and Coinbase, among others—have all faced enforcement actions, including SEC lawsuits and criminal charges in some cases. At the heart of many of these actions is regulators’ argument that many digital currencies are securities, meaning crypto brokers must register with the SEC and follow securities laws. However, cryptocurrency platforms have largely argued the digital assets they specialize in are not securities.\nBhatt and Tenev co-founded Robinhood in 2013, expanding the trading platform to include cryptocurrency trading in 2018. The company is known for offering zero-fee trading, making it popular among younger retail traders, but some critics allege it has allowed inexperienced users to make risky investments they don’t fully understand. he trading app experienced outages in March 2020, which resulted in a proposed class action lawsuit alleging negligence, and also came under fire for temporarily restricting trading in January 2021—during a rally of Gamestop stocks. Robinhood settled the proposed class action lawsuit on undisclosed terms in May 2022, according to Reuters. The SEC opened a civil fraud probe into Robinhood in September 2020, over allegations that it failed to disclose that it was selling clients’ orders to high-frequency trading firms. Regulators charged the trading platform the following December, with the trading platform agreeing to pay $65 million to settle the claims.\nRobinhood’s stock soared to its highest level—up to 12%—since 2021 on March 14, after the trading platform reported an uptick in retail investor activity.\nRobinhood Stock Soars To Highest Level Since 2021 (Forbes)\nRobinhood Reportedly Hit By SEC Fraud Probe, Possible Fine Of Over $10 Million (Forbes)\nThe Inside Story Of Robinhood’s Billionaire Founders, Option Kid Cowboys And The Wall Street Sharks That Feed On Them (Forbes)\nOne Community. Many Voices. Create a free account to share your thoughts.\nOur community is about connecting people through open and thoughtful conversations. We want our readers to share their views and exchange ideas and facts in a safe space.\nIn order to do so, please follow the posting rules in our site's Terms of Service.  We've summarized some of those key rules below. Simply put, keep it civil.\nYour post will be rejected if we notice that it seems to contain:\nUser accounts will be blocked if we notice or believe that users are engaged in:\nSo, how can you be a power user?\nThanks for reading our community guidelines.  Please read the full list of posting rules found in our site's Terms of Service."]}
{"date":"2024-05-07","titles":["BTC TO PKR: Today’s Bitcoin price in Pakistan on 07 May, 2024","BTC TO USD: Today’s Bitcoin price in Dollar on 07 May, 2024"],"urls":["https:\/\/www.bolnews.com\/business\/2024\/05\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-07-may-2024\/","https:\/\/www.bolnews.com\/business\/2024\/05\/btc-to-usd-todays-bitcoin-price-in-dollar-on-07-may-2024\/"],"sources":["BOL News","BOL News"],"descriptions":["The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 17801450.86 on 07 May 2024.","As of May 07, the Bitcoin to USD exchange rate stood at $64031.51. Bitcoin’s value in dollars reflects the dynamic nature"],"article_contents":["07th May, 2024. 03:47 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 17801450.86 on 07 May 2024.\n1 BTC =  17801450.86 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","07th May, 2024. 03:46 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 5, 2024\nAs of May 07, the Bitcoin to USD exchange rate stood at $64031.51. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 64031.51 US Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
{"date":"2024-05-08","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-05-09","titles":["FinTRAC fines crypto firm Binance $6-million over anti-money laundering shortfalls"],"urls":["https:\/\/www.theglobeandmail.com\/business\/article-fintrac-fines-crypto-firm-binance-6-million-over-anti-money-laundering\/"],"sources":["The Globe and Mail"],"descriptions":["First monetary penalty issued by the financial intelligence unit against a virtual currency trading platform"],"article_contents":["This article was published more than 6 months ago. Some information may no longer be current.\nCanada’s anti-money-laundering agency has imposed a $6-million penalty on the world’s largest cryptocurrency exchange, Binance Holdings Ltd., the first monetary penalty issued by the financial intelligence unit against a virtual currency trading platform.\nThe Financial Transactions and Reports Analysis Centre of Canada, or FinTRAC, levied the penalty this week after finding that Binance had committed two violations of the Proceeds of Crime (Money Laundering) and Terrorist Financing Act.\nThe first violation was that it had failed to register as a foreign money services business, FinTRAC said Thursday.\nBinance pulled out of the Canadian market last year, citing new regulatory guidance for cryptocurrency trading platforms.\nHowever, FinTRAC said the company was in violation of its registration requirements before Sept. 25, when it officially ceased all of its operations in the country. Binance had been given several opportunities to register but missed its deadlines, FinTRAC said.\nThe second violation relates to large virtual currency transactions, which are a red flag for potential money laundering activity. Businesses such as banks, real estate brokers, casinos and money services businesses (MSBs) are required to report certain transactions, including suspicious ones and those involving large sums of cash or virtual currency, to the financial intelligence agency.\nFinTRAC says it analyzed the blockchain, the public ledger of all cryptocurrency transactions, and found 5,902 transactions valued at the reporting threshold of $10,000 or more that Binance had failed to report between June 1, 2021, and July 19, 2023.\nBinance did not respond to a request for comment.\nThere are hundreds of cryptocurrency companies registered with FinTRAC. Roughly 800 of the nearly 3,000 registered MSBs  provide some virtual currency services, according to the watchdog, while another 200 or so are exclusively crypto platforms.\nSouth of the border, Binance agreed to pay US$4.3-billion late last year as part of a plea deal after admitting to failures in its anti-money-laundering controls.\nJessica Davis, president and principal consultant of advisory firm Insight Threat Intelligence, said the penalties levied by FinTRAC are significantly lower than what Binance is paying in the U.S. because of differences between the two countries’ legal systems.\nIn Canada, the administrative penalties that can be issued by FinTRAC are not meant to be punitive, Ms. Davis said. Instead the regulator takes a more collaborative approach, working with businesses to ensure they are in compliance.\nEven the recent penalties paid by several of the country’s big banks – including the nearly $9.2-million penalty levied on Toronto-Dominion Bank, the largest in FinTRAC’s history – amount to a “rounding error” for businesses with billions in quarterly profits, Ms. Davis said.\nSouth of the border, TD Bank expects to pay much more. The bank announced late last month that it has set aside US$450-million to cover penalties relating to a lengthy U.S. regulatory and law enforcement investigation, although analysts are expecting the tally to go even higher.\n“There is really an upper limit to how much money we’re going to be talking about in Canada, under the regime as it is,” Ms. Davis said. That contrasts with the U.S., where the levies can be punitive, she added.\n“In really serious cases of non-compliance in Canada, instead of getting a really big fine, they would be referred for criminal non-compliance to the RCMP,” Ms. Davis said.\nHowever, she added, the RCMP has a large number of competing priorities and does not always act on those disclosures. “They’re underresourced, they’re understaffed and underskilled to do that kind of investigative work. We do sometimes see results from those non-compliance disclosures, but it’s fairly rare,” she noted.\nBinance is facing legal issues in several jurisdictions. Two Binance executives were recently detained in Nigeria on tax evasion and money-laundering charges.\nMeanwhile, the exchange’s founder, 47-year-old billionaire Changpeng Zhao, has been sentenced to four months in U.S. prison after admitting to evading anti-money-laundering rules. Prosecutors said the company failed to report suspicious transactions involving designated terrorist groups such as Hamas and Islamic State.\nMr. Zhao’s sentence comes amid a global crackdown on the cryptocurrency sector. Earlier this year, Sam Bankman-Fried received a 25-year prison sentence in the U.S. for his role in defrauding users of his now-collapsed cryptocurrency exchange FTX.\nPrior to its implosion in late 2022, FTX had plans to launch in Canada by acquiring Bitvo Inc., a Calgary-based crypto exchange regulated by all 13 provincial and territorial securities commissions in Canada.\nReport an editorial error\nReport a technical issue\nEditorial code of conduct\nAuthors and topics you follow will be added to your personal news feed in Following."]}
{"date":"2024-05-10","titles":["Bitcoin Is In a 'Bore You to Death' Phase, but Bottom Could Be Close, Analysts Say","Bitcoin falls 3% week on week as price correction continues"],"urls":["https:\/\/finance.yahoo.com\/news\/bitcoin-bore-death-phase-bottom-202633712.html","https:\/\/seekingalpha.com\/news\/4104708-bitcoin-set-risefall-marginally-week-on-week-as-price-correction-continues"],"sources":["Yahoo Finance","Seeking Alpha"],"descriptions":["The current boring crypto market could last between one to six months, and the sentiment will be the most negative right before the turnaround, one hedge fund manager said.","Bitcoin (BTC-USD) traded in a narrow range this week, as price correction in the top cryptocurrency following the halving event continues. The oldest cryptocurr"],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBTC has been sliding since reaching an all-time high in March.\nFriday's quick tumble showed less interest from dip buyers, suggesting that a bottom might be near, Santiment said.\nThe lull could continue into early summer, setting up a very bullish second half of the year, Bitfinex analysts said.\nCrypto markets are stuck in a lull with digital assets consolidating for the last few weeks, testing investors conviction whether the bull market will resume.\nAll attempts for a sustained rally over the past weeks have been sold off, the latest instance coming Friday with bitcoin {{BTC}} tumbling nearly 5% from $63,000 to just above $60,000 amid discouraging inflation expectations and hawkish commentary from Federal Reserve policymakers.\nBlockchain activity also points to low participation, with transactions on the Bitcoin network falling off a cliff and second-largest ether {{ETH}} turning inflationary.\nWe have been here before.\nThe current period resembles the action from April through September of 2023 when bitcoin was stuck in the $25,000-$30,000 range for an excruciating six months. Eventually, cryptocurrencies were able to sustain a multi-month rally, with BTC ultimately hitting an all-time high in March of this year.\n\"Bitcoin is in the 'bore you to death' phase,\" Charles Edwards, founder of crypto hedge fund Capriole Investment said in an X post Thursday.\nThis period of consolidation could last for anywhere between one to six months, he explained, during which BTC will be rangebound with low volatility until market participants lose their patience. The sentiment will be the most negative just before the consolidation ends, he added.\n\"When you are sufficiently bored from sideways chop, common symptoms will include thinking the halving is priced in, the bull market is over and selling to buy stocks at the bottom,\" Edwards said. \"Your symptoms and shorts will peak just before the mega rally.\"\nSaid bottom might be near, according to analytics firm Santiment.\n\"Traders are showing weak 'buy the dip' interest in bitcoin's latest retrace,\" Santiment said Friday monitoring social media interactions. \"Generally, the crowd's lack of faith is a strong sign of prices being close to a bottom.\"\nBitfinex analysts noted in a Friday report that bitcoin's recent weakness happened amid a surging U.S. dollar with interest rate cut expectations tempered, and said the lull could continue into early summer.\n\"We expect the market to remain uncertain over the short-term in a low volatility environment till the actual tapering of QT [quantitative tightening] takes place in June.\" The Federal Reserve announced plans to curb the pace of its balance sheet run-off starting next month, which would impact dollar liquidity positively benefitting risky assets such as cryptocurrencies that are sensitive to the global liquidity environment.\nHowever, the greenback's tumble from a six-month peak last week following the Fed meeting and weak jobs report – coinciding with BTC to rebound from near $56,000 – was a turning point in the trend, and a weaker dollar could support the next leg in the crypto rally.\n\"We believe sustained strength and a reclaim of range lows on BTC post-FOMC and job market data and the simultaneous weakness in the dollar is a sign of a new regime, which would set us up for a very bullish Q3-Q4 for bitcoin,\" the authors said.",null]}
{"date":"2024-05-13","titles":["Missed Out On Aurora Cannabis? Buy Galaxy Digital Instead"],"urls":["https:\/\/www.fool.ca\/2024\/05\/13\/missed-out-on-aurora-cannabis-buy-galaxy-digital-instead\/"],"sources":["The Motley Fool Canada"],"descriptions":["Crypto and cannabis industries have one thing in common - volatility. With the suitable bullish catalysts in place, stocks from both can offer explosive growth potential."],"article_contents":["Image source: Getty Images\nThe cannabis industry in Canada experienced a modest revival in the last few weeks, including Aurora Cannabis, which has risen by about 127% in less than two months. The bullish momentum of this and other cannabis stocks hasn’t yet waned, but it may have entered the normalization phase.\nIt’s not too late to invest in the sector, but if you have missed out on the initial growth opportunity and are looking for a stock where you can get in on the next bullish momentum right from the beginning, Galaxy Digital Holdings (TSX:GLXY) is a good pick.\nGalaxy Digital Holdings has risen about 23% since the beginning of the year. The “growth” is minimal considering its returns when the crypto market or the stock itself is appropriately bullish. However, it does indicate that the stock is still moving in the right direction. The latter half of the growth momentum started in the second half of 2023, triggered by the growth of major cryptocurrencies like Bitcoin.\nThat makes the stock quite similar to cannabis stocks, which are also currently riding the last legs of waning growth momentum, but one thing that helps Galaxy Digital stock stand apart is its valuation.\nWith a price-to-earnings ratio of just 2.5, it’s currently one of Canada’s most undervalued stocks in the crypto industry. So, if there is a modest positive push in the crypto sector, like cryptocurrencies going up in price, the stock may experience a sizable surge.\nIf you buy now, you can capture the upside of the next bullish surge from the beginning.\nOne of the reasons why Galaxy Digital is a great way to invest in cryptocurrencies in Canada or, more accurately, gain exposure to the crypto industry in Canada is its diversified business model.\nUnlike crypto mining companies, which are Canada’s most common type of crypto stocks, Galaxy Digital offers its investors a relatively sheltered exposure to the crypto market, making it a bit safer than most other crypto stocks.\nAnother factor that makes it a compelling pick is that its business model ideally positions it for a solid crypto economy. If crypto assets, investments, and holding become more mainstream and the need for crypto-related financial services increases, Galaxy Digital’s businesses will most likely thrive. This gives it more leeway to grow even when there isn’t a conventional crypto boom — i.e., the price of Bitcoin going up.\nIf you have missed out on Aurora Cannabis or other cannabis stocks as they recently surged, you may anticipate a similar growth in an equally volatile sector like crypto. Galaxy Digital can serve as a powerful candidate in this regard. You may consider adding it to your portfolio for its next bullish phase.\nApril 18, 2025 |\n        Adam Othman\nDespite being a far cry from its peak as an original giant in the smartphone market, BlackBerry (TSX:BB) stock could…\nRead more »\nApril 18, 2025 |\n        Christopher Liew, CFA\nYou can get the best deal by investing $1,000 in the TSX’s next high-growth stock today.\nRead more »\nApril 17, 2025 |\n        Amy Legate-Wolfe\nThis Canadian stock may not be the first you think of when hearing \"AI stock,\" but it should be.\nRead more »\nApril 16, 2025 |\n        Aditya Raghunath\nShopify and Magellan are two top TSX stocks you can buy right now and generate outsized gains in the upcoming…\nRead more »\nApril 15, 2025 |\n        Joey Frenette\nApple (NASDAQ:AAPL) stands out as a top Mag Seven stock for Canadian investors to buy amid tariff fears.\nRead more »\nApril 15, 2025 |\n        Aditya Raghunath\nBlackBerry is a TSX tech stock that is positioned to underperform the broader markets in the near term. Let's see…\nRead more »\nApril 15, 2025 |\n        Joey Frenette\nShopify (TSX:SHOP) stock and another tech play look like bargains right now.\nRead more »\nApril 14, 2025 |\n        Amy Legate-Wolfe\nTesla stock continues to be a majorly volatile stock, and this could be even better.\nRead more »"]}
{"date":"2024-05-14","titles":["BTC TO PKR: Today’s Bitcoin price in Pakistan on 15 May, 2024","BTC TO USD: Today’s Bitcoin price in Dollar on 15 May, 2024","Wisconsin Becomes the First State to Buy Bitcoin","BlackRock closes in on crown of world’s largest bitcoin fund","Surge in bull market: Savvy investors target these key cryptocurrencies for optimal profits"],"urls":["https:\/\/www.bolnews.com\/business\/2024\/05\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-15-may-2024\/","https:\/\/www.bolnews.com\/business\/2024\/05\/btc-to-usd-todays-bitcoin-price-in-dollar-on-15-may-2024\/","https:\/\/gizmodo.com\/bitcoin-price-pension-etf-wisconsin-sec-liquidity-btc-1851475707","https:\/\/finance.yahoo.com\/news\/blackrock-closes-crown-world-largest-040045671.html","https:\/\/www.sunstar.com.ph\/cebu\/feature\/surge-in-bull-market-savvy-investors-target-these-key-cryptocurrencies-for-optimal-profits"],"sources":["BOL News","BOL News","Gizmodo","Yahoo Finance","SunStar Philippines"],"descriptions":["The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 17,198,690.008203 on 15 May 2024.","As of May 15, Bitcoin to USD exchange rate stood at $62631.40. Bitcoin’s value in dollars reflects dynamic nature of cryptocurrency market.","The state hopes it's going to the moon with $161 Million ETF purchases. Bitcoin is down about 2% on the day, currently trading at $61,774.","The asset manager’s initial skepticism over cryptocurrencies has given way to ambitions to become a significant player in the digital asset market.","With Bitcoin threatening to fall below $60,000, the entire market was in turmoil on Thursday. But mainstream cryptocurrencies are recovering from Friday's downturn."],"article_contents":["15th May, 2024. 12:41 am\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO PKR – Today’s Bitcoin price in Pakistan on Feb 7, 2024\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 17,198,690.008203 on 15 May 2024.\n1 BTC =  17,198,690.008203 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","15th May, 2024. 12:12 am\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 6, 2024\nAs of May 15 , the Bitcoin to USD exchange rate stood at $62631.40. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 62,932.2900 US Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","Wisconsin has officially become the first state  to buy bitcoin, according to a new filing with the U.S. Securities and Exchange Commission. And while $98 million isn’t considered a lot of money for a state pension fund, it’s still a notable move given how notoriously volatile cryptocurrency investing can be.\nThe SEC filing, available online, was first reported by Coindesk, which notes the State of Wisconsin Investment Board bought 94,562 shares of BlackRock’s iShares Bitcoin Trust (IBIT) worth about $98 million and $63 million of Grayscale’s spot Bitcoin ETF (GBTC).\nBitcoin ETFs were only approved by the SEC this past January and allow institutional investors to invest in bitcoin without actually holding the crypto directly. Crypto boosters were excited by the news on Tuesday, with many suggesting this could be just the start of other state pension funds investing in crypto.\n“Normally you don’t get these big fish institutions in the 13Fs for a year or so (when the ETF gets more liquidity) but as we’ve seen these are no ordinary launches,” Eric Balchunas, an ETF analyst at Bloomberg tweeted. “Good sign, expect more, as institutions tend to move in herds.”\nThe most famous large institutional investment in bitcoin started in El Salvador in 2021 when President Nayib Bukele purchased the crypto for his country and declared the cryptocurrency to be legal tender. El Salvador currently holds about 5,748 BTC, according to Coin Telegraph, worth roughly $360 million. But bitcoin is an incredibly volatile asset. Those same holdings would have been worth about $155 million a year ago and there’s no guarantee bitcoin’s price will continue to climb steadily.\nBitcoin is currently trading at $61,774, down roughly 2% over the past 24 hours, though the crypto is up about 128% over the past year, recovering significantly since the market went into a tailspin following the implosion of Sam Bankman-Fried’s FTX. Bankman-Fried was sentenced to 25 years in prison for fraud, conspiracy, and money laundering.\nThe State of Wisconsin Investment Board didn’t immediately respond to questions emailed Tuesday morning. We’ll update this post if we hear back.\nBitcoinCoinDeskCorporate crimeCryptocurrenciesSam Bankman-Sam Bankman-Fried\nWorld will distribute money to developers who build \"mini apps\" that require users verify their humanness.\nFram2 is set to launch as early as March 31, sending four first-time astronauts into an orbit never before visited by humans.\nWorld Liberty Financial is launching USD1 backed by U.S. treasuries and dollar deposits.\nThe cryptocurrency \"mixer\" Tornado Cash is no longer blacklisted.\nSam Bankman-Fried is clearly angling for a pardon from Trump.\nThe crypto fraudster appears to be throwing a Hail Mary for a Trump pardon.\nMode\nFollow us\nMode\nFollow us","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBlackRock is closing in on the crown of running the world’s largest bitcoin fund as the asset manager’s initial skepticism over cryptocurrencies gives way to ambitions to become a significant player in the digital asset market.\nThe US group’s spot bitcoin exchange traded fund has garnered $16.7bn of assets since it launched four months ago, putting it less than $1bn behind market leader Grayscale, which enjoyed a 10-year and $28bn head start.\nAlongside that BlackRock has also launched the fastest-growing tokenised Treasury fund, which crypto hedge funds and market makers are beginning to use as collateral for trading coins and tokens.\nThe moves are a sharp change, driven by rising client interest and rapid growth in digital assets, from only seven years ago when chief executive Larry Fink called bitcoin “an index of money laundering”.\nAt the January launch of the spot ETF, Fink described himself as “very bullish on the long-term viability of bitcoin” and said its underpinnings were a crucial part of “the technological revolution in the financial market”.\n“BlackRock has always been responsive to its clients’ interests, so why would crypto be any different,” said Lee Reiners, a lecturing fellow at the Duke Financial Economics Center. “This doesn’t mean they are true believers, though. Crypto is not on their balance sheet, and if crypto goes to zero, the impact to their financials will be negligible.”\nThe asset manager has been the biggest beneficiary from the Securities and Exchange Commission’s decision in January to approve ETFs that invest directly in bitcoin, after rejecting them for years.\nFidelity has followed behind in third place, attracting $9.3bn of assets. The duo have been aided by vast outflows at Grayscale, which converted an earlier bitcoin product into an ETF and had been charging a much higher management fee of 1.5 per cent. BlackRock charges 0.25 per cent.\nIt also contrasts with the approach taken by some of BlackRock’s biggest rivals. Vanguard — like BlackRock a giant in ETFs — not only opted not to launch a bitcoin ETF, but also refused to sell any third-party bitcoin funds to its brokerage clients.\nBlackRock’s growing confidence in the digital assets market is also highlighted by its backing for Securitize, joining Tradeweb and Hamilton Lane in a $47mn fundraising round for the platform, which uses digital tokens to represent assets. BlackRock’s global head of strategic ecosystem partnerships, Joseph Chalom, now sits on the Securitize board.\n\"It’s all coming together now, but I would hope that it’s understood that it’s been a multiyear, very deliberate journey.\"BlackRock COO Rob Goldstein\nTwo years ago BlackRock took a minority investment in Circle, which runs the world’s second-largest stablecoin, USDC. A stablecoin is a type of digital currency pegged to a sovereign currency, such as the US dollar.\n“It’s all coming together now, but I would hope that it’s understood that it’s been a multiyear, very deliberate journey about bringing the same institutional quality that differentiates BlackRock to this ecosystem, and to us that’s more important than rushing,” Rob Goldstein, chief operating officer of BlackRock told the Financial Times.\nEven so, BlackRock’s arrival in other parts of the crypto market has energised investors. In March, it launched a tokenised Treasury fund on a public blockchain, ethereum, allowing all users to follow trades on a digital ledger.\nAlready the BlackRock USD Institutional Digital Liquidity fund, or Buidl, has overtaken rival Franklin Templeton’s tokenised fund as the market’s largest, attracting $382mn compared with $368mn at Franklin.\nTraders and prime brokers have begun to use Buidl as a way to source high-quality collateral for trading cryptocurrencies. Most use stablecoins such as USDC or Tether’s USDT but they do not offer holders a yield, unlike Buidl.\nBut others say that BlackRock’s long-term bet is to speed up settlement of deals and transfer of their funds, making them more attractive to investors who want to access their money immediately.\nThe asset manager had previously tested tokenisation by using a private JPMorgan blockchain to track assets and transactions involving a particular money market fund, said Robert Mitchnick, BlackRock’s head of digital assets. That private blockchain product helped lay the groundwork for Buidl.\n“That work was critically important . . . We believe the greatest opportunity in this space was around public blockchains,” Mitchnick said.\nAt the end of the month the US will start requiring the vast majority of trades to settle within one business day but executives doubt that further advances for investors can be made until large parts of the financial system are put on to blockchains, which can settle deals in a matter of minutes.\n“There will come a point when the current technology set-up is not going to work,” said Ralf Kubli, a board member at the Casper Association, a Switzerland-based blockchain project.\nLarge asset managers around the world were “thinking very deeply about what this technology can do for them”, he added.\nCopyright The Financial Times Limited 2023\n© 2023 The Financial Times Ltd. All rights reserved. Please do not copy and paste FT articles and redistribute by email or post to the web.","With Bitcoin threatening to fall below $60,000, the entire market was in turmoil on Thursday. But mainstream cryptocurrencies are recovering from Friday's downturn.\nAlthough the market remains optimistic, volatility cannot be ruled out. The halving is expected to trigger unpredictable sentiments for Bitcoin over the next few days.\nThis explains why strategic investors are hoarding pre-sale coins that remain insulated from the market's current downtrend. Their launch is planned after the market settles into a more stable bullish phase, making them immune to downturn risks.\nSlothana ($SLOTH) has become one of April's biggest meme coin sensations.\nAn analysis of the project shows that it is related to the unique theme of the project, which centers around an office sloth. It quickly went viral, following in the footsteps of non-dog meme coins like MEW (Cat in a Dogs World). MEW was another top meme coin performer in April, although it too fell victim to the recent downturn.\nThe official listing of $SLOTH on exchanges is scheduled for April 29th.\nPreviously, investors had a limited window of opportunity to purchase $SLOTH at a discounted price. The extended presale period ensures fair distribution of the token and reduces the likelihood of pump-and-dump schemes.\nAs the Slothana community grows, FOMO increases. The trend development indicates a possible price increase. It also reflects the shift in the meme coin market, which favors non-dog meme coins like Slothana.\nSlothana is an office sloth who is tired of everyday life. Because it was kept simple yet understandable, the project managed to go viral. After all, this is the key factor that drives a meme coin project. As investors move away from the popular but saturated meme coin themes, Slothana is likely here to stay for the long haul.\nThe Slothana pre-sale will remain active for a few more days. Before the DEX launch, investors can purchase the token at a price of $10,000 SLOTH per SOL.\nVISIT THE $SLOTH PRE-SALE\nHighly capitalized meme coins like Dogecoin, Shib an Inu, and Dogwifhat are going through a dark time. Most meme coins are in the red.\nInterestingly, that hasn't stopped investors from putting money into a new dog-themed coin, that is gaining traction. Dogeverse is on its way to the $8 million milestone at the time of writing.\nWhat’s behind the project’s mass appeal?\nThe growing virality and popularity are due to several factors. At the top of the list is the creative new narrative at the heart of the project. The project creates a connected multichain universe dedicated to meme coins.\nAlthough there are more dog coins than we can keep track of, Dogeverse introduces a concept that has great potential.\n● Dogeverse aims to launch on large blockchains, leveraging the unique strengths of each blockchain.\n● The approach optimizes costs, energy consumption, and transaction speeds.\n● It also allows Dogeverse to unlock the speculative appeal of different blockchains and reach different meme coin communities. The popularity of Solana meme coins and base meme coins such as BONK, WIF, MEW, and DEGEN this year shows the potential of the strategy.\nAdditionally, the multichain framework enables future expansions and integrations. It addresses a key challenge: the short lifespan that is typical of meme coins. By incorporating token utilities and integrations, Dogeverse can gain long-term significance beyond mere speculation.\nThe Dogeverse presale is structured in stages, with increasing prices and decreasing APYs.\nVISIT THE $DOGEVERSE PRE-SALE\n5thScape recently launched pre-sales of 5SCAPE tokens.\nWith this historic milestone, the project paves the way for a potential viral crypto phenomenon – VR coins. The virtual reality niche has great potential. However, it remains largely untapped due to technical and creative obstacles. 5th Scape closes the gap.\nAlthough there are many VR platforms on the crypto side of the world, most of them lack quality. 5th Scape features an expansive virtual reality universe.\nThe project will not only offer high-quality crypto games, films, and educational content but also bring VR hardware to the market. These include a VR headset and a VR chair, which feature advanced visual realism, motion tracking, and ergonomic design.\nIt will also serve as a hub for VR developers and promote innovation and collaboration in the VR space. Pre-selling $5SCAPE is the best entry point into investing.\nVISIT THE $5THSCAPE PRE-SALE\nMega Dice, one of the fastest growing crypto casino platforms, is running an even higher value airdrop promotion tied to the pre-sale of its new DICE token.\nIn total, Mega Dice has committed an incredible $2,250,000 worth of DICE tokens, which will be distributed to active players and pre-sale buyers over three “seasons.”\nThe $750,000 first season rewards those who use DICE and reach a $5,000 betting goal within three weeks.\nIn the second season, there will be an additional $750,000 for anyone who stakes from the pre-sale to the eventual DEX launch of the token.\nBut it's the third and final $750,000 airdrop season that could really catch people's attention.\nIt allows DICE holders to earn retroactive rewards simply for being consistently high rollers at Mega Dice Casino in the 21 days following the token's launch.\nWith over $330,000 now raised for the presale hard cap, DICE's momentum is gradually increasing.\nTraders have been clamoring to get involved at the current price of $0.069 per token while earning a share of this multi-million dollar airdrop. VISIT THE $DICE PRE-SALE (SPONSORED CONTENT)"]}
{"date":"2024-05-15","titles":["Bitcoin ETFs drew bets from Millenium Global, Wisconsin Retirement System in Q1","Frenzied South Korea Crypto Trading Set Stage for Bitcoin Record"],"urls":["https:\/\/finance.yahoo.com\/news\/bitcoin-etfs-drew-bets-millenium-223421396.html","https:\/\/www.livemint.com\/news\/world\/frenzied-south-korea-crypto-trading-set-stage-for-bitcoin-record-11715808586216.html"],"sources":["Yahoo Finance","Livemint"],"descriptions":["A handful of hedge funds, including Millennium Management LLC, and other asset managers are among the institutions that acquired stakes in the recently launched U.S. exchange-traded funds (ETFs) tied to the price of bitcoin in the first quarter, according to recent regulatory filings. New York-based Millenium revealed it had $2 billion invested in several of the new ETFs as of March 31.","South Korean retail investors were piling into local digital-asset exchanges in greater numbers well ahead of the global crypto boom that drove prices to record highs in early 2024."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBy Suzanne McGee and Hannah Lang\n(Reuters) - A handful of hedge funds, including Millennium Management LLC, and other asset managers are among the institutions that acquired stakes in the recently launched U.S. exchange-traded funds (ETFs) tied to the price of bitcoin in the first quarter, according to recent regulatory filings.\nNew York-based Millenium revealed it had $2 billion invested in several of the new ETFs as of March 31. That included positions in BlackRock's iShares Bitcoin Trust, the Grayscale Bitcoin Trust, and funds launched by issuers such as Bitwise Investments and ARK Investment Management.\nOther purchasers included Boston-based hedge fund manager Bracebridge Capital, which owned $262 million of shares in the ARK 21Shares Bitcoin ETF as of the end of the first quarter and $81 million in the BlackRock product.\nBracebridge, which did not return calls seeking comment, has among its clients a group of institutional investors such as the endowments of Yale University and Princeton University.\nA filing from the state of Wisconsin's investment board, which manages $156 billion in assets for the Wisconsin Retirement System, disclosed purchases of BlackRock's iShares Bitcoin Trust worth more than $99 million as of the end of March. It also disclosed holding of more than $63 million in shares in the Grayscale Bitcoin Trust.\nThe State of Wisconsin Investment Board declined to comment.\nOther hedge funds with positions in the bitcoin ETFs included some that had already invested in bitcoin before the U.S. Securities and Exchange Commission finally approved the spot bitcoin ETFs in January.\nNew York-based Hunting Hill Global Capital said it owned $29.1 million in the Fidelity Wise Origin Bitcoin ETF and $21.3 million in the Grayscale Bitcoin Trust.\nAdam Guren, founder and CEO of Hunting Hill, said the firm had been investing in Grayscale's bitcoin trust for a year or more as bitcoin's price and the value of its stake increased ahead of the ETF approval.\nInvestors have poured some $29 billion into the bitcoin ETFs since January, Morningstar Direct data showed.\nThe filings appear to confirm that while a handful of hedge funds have taken large positions, retail investors - including investment advisors - remain the largest category of purchasers by number. Hightower Advisors, one of the largest advisory firms in the country, disclosed holdings of about $68 million in the bitcoin ETFs, but declined to comment on portfolio decisions.\nThe quarterly disclosures, known as 13-F filings, are made to the Securities and Exchange Commission around 45 days after the end of each quarter and may not reflect current positions.\nMatt Hougan, chief investment officer of Bitwise, noted in a memo to clients posted on the social media platform X that he expected that by the time all the filings are processed, they will show that as many as 700 institutions own $5 billion or more in the new ETFs. Until these filings appeared, it has been difficult to determine which investors have been behind the buying in the products, which has greatly exceeded even the most bullish estimates and helped drive the price of bitcoin itself to new highs this year.\n(This May 15 story has been corrected to fix the company's name to Millennium Mgt, not Millenium Global, in the headline)\n(Reporting by Suzanne McGee and Hannah Lang; Editing by Ira Iosebashvili, Michelle Price and Richard Chang)","South Korean retail investors were piling into local digital-asset exchanges in greater numbers well ahead of the global crypto boom that drove prices to record highs in early 2024.\nActive users of registered exchanges in the country increased by 390,000 to 6.45 million by the end of 2023, according to the semi-annual report on crypto-asset businesses published by the Korea Financial Intelligence Unit .\nOf those users, which represent more than 10% of the country’s total population, 99% identified as “individual” investors and nearly 60% of them were in their 30s and 40s. Daily average crypto trading volume in the country grew 24% to 3.6 trillion won in the period, while the total value of the crypto held by registered exchanges surged 53% to 43.6 trillion won.\nThe report underscores how vital a growth organ South Korea has become in global crypto markets. The South Korean won was the most traded currency against crypto-assets globally in the first quarter of 2024, beating the US dollar. Upbit, the dominant exchange in the country, has at times ranked among the top five in the world by trading volume.\nRead more: Upbit Rides Korea Crypto Boom to Top-Five Global Exchange Spot\n“Trading volume, market capitalization, operating income of exchanges, deposits in Korean won all increased compared to the first half due to the rise in crypto prices and recovery of investor sentiment,” KOFIU said in a statement. “The number of crypto trading users rebounded from the first half of 2023,” the institution added.\nEven in aftermath of the collapse of TerraUSD, the ill-fated stablecoin created by South Korean native Do Kwon, crypto enthusiasm in the country is such that a major political party pledged to grant Koreans access to US Bitcoin ETFs during the parliamentary election last month.\nFrom July, regulators in South Korea will introduce the Virtual Asset User Protection Act, imposing strict new requirements on exchanges and tougher punishments for wrongdoing in the sector.\nThis article was generated from an automated news agency feed without modifications to text.\nCatch all the Business News , Breaking News Events and Latest News  Updates on Live Mint. Download The Mint News App  to get Daily Market Updates.\nLog in to our website to save your bookmarks. It'll just take a moment."]}
{"date":"2024-05-16","titles":["Bitcoin soars to $66,000 level, market cap hits $1.309 trillion; where are prices headed?","Delhi woman cheated of Rs 23 lakh; probe leads cops to cybercriminal network","Futures exchange CME plans to launch bitcoin trading"],"urls":["https:\/\/www.livemint.com\/market\/cryptocurrency\/bitcoin-soars-to-66-000-level-market-cap-hits-1-309-trillion-where-are-prices-headed-11715954488329.html","https:\/\/indianexpress.com\/article\/cities\/delhi\/delhi-woman-cheated-of-rs-23-lakh-probe-leads-cops-to-cybercriminal-network-9332258\/","https:\/\/finance.yahoo.com\/news\/futures-exchange-cme-plans-launch-040058571.html"],"sources":["Livemint","The Indian Express","Yahoo Finance"],"descriptions":["Looking ahead, the long-term prospects for Bitcoin remain tied to its fundamentals, including its limited supply and growing adoption as a store of value and hedge against inflation, according to Siddharta Gupta, SVP, Business and Strategic Alliances, CoinDCX.","A Delhi man was arrested on Wednesday after a woman lodged a complaint saying she had been duped after being promised lucrative returns via cryptocurrency trading.","Some of the world’s largest financial institutions have turned from bitcoin skeptics into advocates amid its growing acceptance among investors as a tradeable asset."],"article_contents":["Bitcoin prices demonstrated resilience on Friday, returning from the previous day's dip. This recovery, coupled with the positive inflows into spot bitcoin exchange-traded funds (ETFs) for the fourth consecutive day, signals a promising trend for investors.\nWhile Bitcoin was recovering, other crypto tokens, including Solana, Cardano, Polkadot, and Avalanche, also showed strength, posting gains of up to 4%. However, the global cryptocurrency market cap saw a slight dip of 0.29 per cent, reaching approximately $2.38 trillion over the past 24 hours.\nThe world’s largest cryptocurrency stayed firmly within a narrow trading range of $60,000 to $70,000 that has persisted over the past two months, encountering few triggers to break out due to a lukewarm risk appetite.\nAlso read: SEBI recommends regulators to oversee crypto trade, RBI still sees ‘macro risk’\nBitcoin is poised for a robust week amid rising hopes for US Fed rate cuts. After today's increase, Bitcoin has achieved significant gains over the past seven days, rebounding from a low of $60,000 last week.\nThe cryptocurrency is up approximately 8% from last Friday's lows, primarily driven by a weaker dollar and indications of easing U.S. inflation.\n“Bitcoin soared past the $65,000 mark, showing a remarkable 7% gain within 24 hours. In earlier times, such a jump would have attracted many newcomers to Web3. However, today's landscape suggests newcomers seek more than just price fluctuations. Perhaps it's time for the ecosystem to prioritise user-friendly applications. While prices may draw in investors, tangible use cases appeal to the broader audience,\" said Nischal Shetty, Co-founder of Shardeum.\nBitcoin's market cap soared to $1.309 trillion, and its market dominance now stands at 54.69%, as reported by CoinMarketCap. During this period, BTC's trading volume decreased by 27.4%, totalling $30.9 billion.\n“Bitcoin is in the middle of the bull cycle.  Its market cap is growing faster than its realised cap, a trend that typically lasts around two years. If this pattern continues, the bull cycle might end by April 2025. Another reason for the boost could be the ETF inflows in May that have already offset April’s outflows,” said Avinash Shekhar, co-founder and CEO of Pi42.\nAlso read: Stage set for return of Binance, Kucoin to India\nAccording to market experts, in the short term, Bitcoin's price trajectory could be influenced by technical indicators, market sentiment, and institutional investors' actions.\nAlso, the appointment of Salim Ramji, former BlackRock executive, as Vanguard's new CEO sparked speculation that the investment giant could embrace crypto.\n“Analysts are wondering whether Vanguard, under the leadership of an ETF veteran from the crypto-friendly BlackRock, would finally turn bullish on Bitcoin. This surge also followed the 13F filings revelation that 1,028 firms with over $100 million in assets under management collectively own $11 billion in Bitcoin as of March 2024, with Millennium Management emerging as the largest holder at $2 billion,” Rajagopal Menon, VP, WazirX told Livemint.\nAlso read: Why Africa is crypto’s next frontier.\nLooking ahead, the long-term prospects for Bitcoin remain tied to its fundamentals, including its limited supply and growing adoption as a store of value and hedge against inflation, according to Siddharta Gupta, SVP, Business and Strategic Alliances, CoinDCX.\n“The approval of ETF in US & Hongkong and ETN in London had bolstered its legitimacy and price stability over time. However, it's crucial to remain mindful of potential risks and uncertainties, including regulatory developments, technological advancements, and macroeconomic shifts. While historical trends and halving cycles provide valuable insights, the future trajectory of Bitcoin prices will likely be shaped by a complex interplay of factors, making precise predictions challenging,” Gupta said.\nCatch all the Business News ,  Market News , Breaking News Events and Latest News  Updates on Live Mint. Download The Mint News App  to get Daily Market Updates.\nLog in to our website to save your bookmarks. It'll just take a moment.",null,"Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCME Group, the world’s largest futures exchange, is planning to launch bitcoin trading, aiming to capitalise on surging demand this year among Wall Street money managers to gain exposure to the cryptocurrency sector.\nThe Chicago-based group has been holding discussions with traders who want to buy and sell the cryptocurrency on a regulated marketplace, according to three people with direct knowledge of the talks.\nThe plan, which has not yet been finalized, would mark a further encroachment by major Wall Street institutions into the digital assets sector following the US Securities and Exchange Commission’s approval in January of stock market funds that invest directly in bitcoin.\nCME declined to comment.\nIntroducing spot bitcoin trading on CME, which already hosts trading in bitcoin futures, would allow investors more easily to place so-called basis trades. A common strategy among professional bitcoin traders and a staple of the US Treasury market, basis trading involves borrowing money to sell futures while buying the underlying asset, and extracting gains from the small gap between the two. The bulk of the Treasury basis trade takes places on CME venues.\nSome of the world’s largest financial institutions have turned from bitcoin sceptics into advocates, thanks to its sharp rebound from a 2022 low to hit a record high earlier this year, as well as its growing acceptance among investors as a tradeable asset and a crackdown by regulators on illegal market activity.\nAlthough the token has lost one-fifth of its value since its March peak above $73,000, the exchange traded funds linked to the coin have become the fastest growing ETFs of all time.\nHedge funds, including Bracebridge Capital, and pension funds, such as Wisconsin Investment Board, are among the large investors that have poured more than $10bn of assets into vehicles run by asset managers including BlackRock, Fidelity and Ark. In March, Larry Fink, chief executive of BlackRock, said he was “long-term bullish” on bitcoin.\nCME has been one of the biggest beneficiaries of the wave of renewed institutional interest, overtaking Binance as the world’s largest bitcoin futures market, as traders try to profit from the coin’s volatility.\nCME, which caters largely to hedge funds and proprietary traders, has about 26,000 open positions, worth around $8.5bn, on its market in Chicago, more than double the amount a year ago.\nIts potential spot trading business would be run through the EBS currency trading venue in Switzerland, which has extensive regulations governing the trading and storing of crypto assets, the people said.\nLarge traditional exchange operators have a patchy record in trading spot cryptocurrencies. Deutsche Börse opened its own digital assets market this year but CBOE Global Markets, the CME’s crosstown rival, last month said it would close down its spot market business, blaming a lack of clear US regulation.\nOne crypto trading executive questioned whether CME could build significant market share if its bitcoin trading business operated as two markets, CME in Chicago and EBS in Switzerland. “I struggle to see how they would get all the efficiencies available to them,” he said.\nHe added that the biggest benefit of CME’s move was that large regulated exchanges were becoming more comfortable with the infrastructure for trading digital assets, such as keeping coins safely secured.\nThat means exchanges could soon accept crypto-related collateral, such as tokenised money market funds, to make more timely margin calls, he said.\nCopyright The Financial Times Limited 2023\n© 2023 The Financial Times Ltd. All rights reserved. Please do not copy and paste FT articles and redistribute by email or post to the web."]}
{"date":"2024-05-17","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-05-20","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-05-21","titles":["Ethereum Price up 22% on Rising ETF-Approval Odds, Bitcoin Record Possible"],"urls":["https:\/\/markets.businessinsider.com\/news\/currencies\/ethereum-etf-approval-odds-bitcoin-price-rally-record-this-week-2024-5"],"sources":["Business Insider"],"descriptions":["Odds that Ethereum ETFs will be approved this week have spiked with key decisions due from the SEC."],"article_contents":["Ethereum rocketed 22% higher on Tuesday on surging confidence that ETFs pegged to the cryptocurrency could be approved as soon as this week.\nJust as was done for bitcoin in January, efforts have been underway to establish an ethereum spot exchange-traded fund, making the cryptocurrency available to a wider array of investors.\nThough investors have long anticipated regulatory pushback, the Securities and Exchange Commission recently asked potential issuers to update their filings, Bloomberg reported. That's a positive sign ahead of decision deadlines for at least two spot ETFs, one from VanEck and the other from Ark 21Shares.\nThe odds of approval, according to Bloomberg Intelligence ETF analyst Eric Balchunas, jumped to 75% from 25% in a single day on Monday. Meanwhile, odds of approval by May 31 have risen to 61% from 10% on the Polymarket betting platform.\nAccording to Standard Chartered Head of FX Research Geoff Kendrick, ETF approvals would cement ether's chances of reaching $8,000 by this year's end.\nThe bullish forecast is one he's held since March, arguing that the funds' approval would drive $15 billion to $45 billion worth of inflows into the token. Eventually, ether could hit $14,000 by end-2025, he reiterated in new research on Tuesday.\nFurther, the ETFs would largely avoid the same situation as bitcoin funds, which have seen outflows and considerable price swings after an initial boom period, he added.\nFor one, Kendrick says inflow volatility will be minimal because ether lacks investment alternatives that could compete with the ETFs, such as a Microstrategy equivalent. This company's massive hoard of bitcoin means that its stock move in line with the token.\nSecondly, big outflows are also less likely to be an issue for ether, Kendrick pointed out. This was a challenge for bitcoin after its ETFs hit markets, as the funds became as major competitor to the pre-existing Grayscale Bitcoin Trust, leading to a bout of selling.\n\"The ETH Grayscale trust is smaller in percent of market cap than the BTC one was, so any forced selling as occurred with BTC post ETF approval should be less important,\" Kendrick said in written commentary.\nOnce ether funds are established, the price highs that it can achieve bode well for bitcoin, Kendrick added. Already, the apex token has jumped as much as 6.7% this week on the back of ether's gains.\n\"An ETH ETF approval will further legitimise the sector and therefore be BTC positive as well. I would expect a fresh all-time high in BTC by the weekend (through the 14 March USD 73,798 level),\" Kendrick wrote."]}
{"date":"2024-05-22","titles":["BTC TO USD: Today’s Bitcoin price in Dollar on 23 May, 2024","BTC TO PKR: Today’s Bitcoin price in Pakistan on 23 May, 2024"],"urls":["https:\/\/www.bolnews.com\/business\/2024\/05\/btc-to-usd-todays-bitcoin-price-in-dollar-on-23-may-2024\/","https:\/\/www.bolnews.com\/business\/2024\/05\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-23-may-2024\/"],"sources":["BOL News","BOL News"],"descriptions":["As of May 23, Bitcoin to USD exchange rate stood at $69,719.58. Bitcoin’s value in dollars reflects dynamic nature of cryptocurrency market.","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 18,556,889.88 on 23 May 2024."],"article_contents":["23rd May, 2024. 12:20 am\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 6, 2024\nAs of May 23, the Bitcoin to USD exchange rate stood at $69,719.58. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 69,719.58 US Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","23rd May, 2024. 12:05 am\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO PKR – Today’s Bitcoin price in Pakistan on Feb 7, 2024\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 19,437,221.19 on 23 May 2024.\n1 BTC =  19,437,221.19 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
{"date":"2024-05-23","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-05-24","titles":["Remembering Kabosu: The Dog Behind Dogecoin","Ether ETF gets surprise approval from regulators in boost for crypto"],"urls":["https:\/\/www.devdiscourse.com\/article\/entertainment\/2949329-remembering-kabosu-the-dog-behind-dogecoin","https:\/\/nypost.com\/2024\/05\/23\/business\/ether-etf-gets-surprise-approval-from-regulators-in-boost-for-crypto\/"],"sources":["Devdiscourse","New York Post"],"descriptions":["Kabosu, the Japanese Shiba Inu who became a global meme and the face of Dogecoin, has passed away at 18. Known for her uncanny role in boosting the alternative cryptocurrency, Kabosu's image helped push Dogecoin's market value and gained the attention of Tesla's Elon Musk, amplifying its popularity worldwide.","The Securities and Exchange Commission on Thursday approved applications from Nasdaq, CBOE and NYSE to list exchange-traded funds tied to the price of ether, potentially paving the way for the products to begin trading later this year."],"article_contents":["Kabosu, the Japanese dog that became a global meme and the face of alternative cryptocurrency Dogecoin has died at 18, her owner announced in a blog post on Friday. The Japanese Shiba Inu passed away while sleeping, her owner Atsuko Sato wrote.\nKabosu became recognizable as the face of Dogecoin, an alternative cryptocurrency that began as a satirical critique of the 2013 crypto frenzy. But the token jumped in value after Tesla boss Elon Musk, a proponent of cryptocurrencies, began tweeting about it in 2020. Since then the billionaire has repeatedly promoted the coin.\nDogecoin added as much as $4 billion to its market value last year when the billionaire, who bought social media site Twitter in 2022, briefly replaced Twitter's blue bird logo with an image of Kabosu. Musk subsequently renamed Twitter X. With a market capitalization of around $23.6 billion, Dogecoin is now the ninth biggest cryptocurrency, according to data site Coingecko.com. \"The impact this one dog has made across the world is immeasurable,\" Dogecoin posted on social media site X on Friday.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)\nEmail: info@devdiscourse.com Phone: +91-720-6444012, +91-7027739813, 14, 15\n© Copyright 2025","The Securities and Exchange Commission  on Thursday approved applications from Nasdaq, CBOE and NYSE to list exchange-traded funds tied to the price of ether, potentially paving the way for the products to begin trading later this year.\nWhile the ETF issuers also have to get the green light before the products can launch, Thursday’s approval is a major surprise win for those firms and the cryptocurrency industry, which until Monday had expected the SEC to reject the filings.\nNine issuers including VanEck, ARK Investments\/21Shares and BlackRock hope to launch ETFs tied to the second-largest cryptocurrency after the SEC in January approved bitcoin ETFs in a watershed moment for the industry.\n“This is an exciting moment for the industry at large,” said Andrew Jacobson, vice president and head of legal at 21Shares, noting it was “a significant step” towards getting the products trading.\nThursday was the deadline for the SEC to decide on VanEck’s filing. Market participants were bracing for the thumbs-down because the SEC had not engaged with them on the applications.\nBut in a surprise move, SEC officials on Monday asked the exchanges to quickly fine-tune the filings, sending the industry scrambling to complete weeks of work in just days, sources said.\nReuters could not ascertain why the SEC appeared to have a change of heart.\n“The introduction of spot bitcoin ETFs has already demonstrated significant benefits for the digital assets and ETF space, and we believe that spot ether ETFs will similarly provide safeguards for US investors,” said Rob Marrocco, global head of ETP listings at Cboe Global Markets.\nNasdaq and NYSE declined to comment.\nWhen asked about the ether ETFs by reporters at an industry event earlier on Thursday, SEC Chair Gary Gensler – a crypto skeptic – declined to comment. An SEC spokesperson said in an email announcing the approval that the agency would not comment further.\nThe exchange applications had sought SEC approval for a rule change required to list new products, but the issuers still need the SEC to approve ETF registration statements detailing investor disclosures before they can start trading.\nUnlike the exchange filings, there is no set time frame in which the SEC has to decide on those statements. Industry participants said it was unclear how long that would take. Two sources familiar with the process said many issuers are ready to launch, but the corporate finance division of the SEC has indicated it is likely to request changes and updates in the coming days and weeks.\nThe SEC rejected spot bitcoin ETFs for more than a decade over market manipulation worries but was forced to approve them after Grayscale Investments won a court challenge last year.\nSui Chung, CEO of CF Benchmarks, the index-provider for several of the bitcoin and ether ETFs, said ether is more complex than bitcoin and it could take months for the SEC to review the statements. But since the bitcoin ETFs offer an established template, “there’s only so much slow rolling” the SEC can do, he said.\nAn array of investors, including hedge funds, wealth advisors and retail investors, have poured more than $30 billion into the crypto ETFs.\nThursday’s decision is another tailwind for cryptocurrency industry efforts to push into mainstream finance. This week the UK regulator also approved listed cryptocurrency products while the  House of Representatives passed a landmark bill seeking to provide regulatory clarity for cryptocurrencies.\nWhile that bill still needs to pass the Senate, its extensive bipartisan support marks a major endorsement for the industry.\nAdvertisement"]}
{"date":"2024-05-27","titles":["Crypto Traders Eye Ether Record, Rising Volatility From US ETF Hype","BTC TO USD: Today’s Bitcoin price in Dollar on 27 May, 2024","BTC TO PKR: Today’s Bitcoin price in Pakistan on 27 May, 2024"],"urls":["https:\/\/www.livemint.com\/news\/world\/crypto-traders-eye-ether-record-rising-volatility-from-us-etf-hype-11716854978601.html","https:\/\/www.bolnews.com\/business\/2024\/05\/btc-to-usd-todays-bitcoin-price-in-dollar-on-27-may-2024\/","https:\/\/www.bolnews.com\/business\/2024\/05\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-27-may-2024\/"],"sources":["Livemint","BOL News","BOL News"],"descriptions":["Bets on more Ether gains are intensifying following a surprise US regulatory pivot toward allowing exchange-traded funds for the digital asset, even as questions swirl about the strength of demand for the products.","As of May 27, Bitcoin to USD exchange rate stood at $68408.12. Bitcoin’s value in dollars reflects dynamic nature of cryptocurrency market.","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 19,214,532.785503 on 27 May 2024."],"article_contents":["Bets on more Ether gains are intensifying following a surprise US regulatory pivot toward allowing exchange-traded funds for the digital asset, even as questions swirl about the strength of demand for the products.\nThe shift by the US Securities & Exchange Commission catalyzed a 26% jump in the second-largest token in the seven days through Sunday, the biggest weekly advance since the 2021 crypto bull market, data compiled by Bloomberg shows.\nRead more: US Paves Way for Ether ETFs in Test of Demand Beyond Bitcoin\nSpeculators may be taking heart from the record-breaking January debut of US spot-Bitcoin ETFs, which have amassed $59 billion in assets. But Ether is less well known than Bitcoin, making investor appetite for exposure harder to parse.\nIn addition, spot-Ether ETFs won’t partake in staking, the process of earning rewards by pledging tokens to maintain the Ethereum blockchain. The omission threatens to undercut interest in the funds compared with holding the tokens.\nFurther SEC approvals are still needed before issuers such as BlackRock Inc. and Fidelity Investments can launch products, for which the timeline is unclear. Ether was steady at $3,890 as of 7:43 a.m. Tuesday in Singapore, while Bitcoin dipped to $69,308.\n“The risk in Ether remains to the upside and pullbacks are a buying opportunity,” Pepperstone Group Head of Research Chris Weston wrote in a note.\nThe charts below round up scenarios for Ether after its 70% climb this year.\nBets on $5,000\nThe highest concentrations of bullish options bets signal some traders see Ether climbing to $5,000 or even higher, according to figures from the Deribit trading platform. The current spot-Ether record is $4,866 from November 2021.\nVolatility Ahead\nThe gap between the T3 Ether Volatility Index — which uses options prices to give a sense of expected 30-day swings in the token — and a similar gauge for Bitcoin is around the widest since at least the start of 2023. That indicates speculators expect bigger swings in Ether than in the largest digital asset.\nClues on Demand\nSome analysts view demand for futures hosted by Chicago-based CME Group Inc. as a window into US institutional appetite for regulated crypto exposure. The level of open interest — or outstanding contracts — is increasing for CME Ether futures but is much smaller than for CME Bitcoin futures, suggesting less institutional engagement with Ether and perhaps, by extension, the prospective Ether ETFs.\n“The relatively low participation from the same institutions that will probably be expected to pour into the Ether spot ETF upon launch, suggests that the initial inflows could be disappointing,” wrote Noelle Acheson, author of the Crypto Is Macro Now newsletter.\nThis article was generated from an automated news agency feed without modifications to text.\nCatch all the Business News , Breaking News Events and Latest News  Updates on Live Mint. Download The Mint News App  to get Daily Market Updates.\nLog in to our website to save your bookmarks. It'll just take a moment.","27th May, 2024. 05:49 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 6, 2024\nAs of May 27, the Bitcoin to USD exchange rate stood at $68408.12. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 68408.12 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","27th May, 2024. 05:17 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO PKR – Today’s Bitcoin price in Pakistan on Feb 7, 2024\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 19,214,532.785503 on 27 May 2024.\n1 BTC =  19,214,532.785503 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
{"date":"2024-05-28","titles":["21Shares launches crypto exchange traded notes on London Stock market","Bitcoin falls below $68,000 after Mt.Gox transfers $9 billion","BTC TO USD: Today’s Bitcoin price in Dollar on 28 May, 2024","BTC TO PKR: Today’s Bitcoin price in Pakistan on 28 May, 2024","Ethereum Price to Surge 500% This Cycle Amid ETF Approval: Crypto Expert"],"urls":["https:\/\/www.standard.co.uk\/business\/21shares-launches-cryptoasset-exchange-traded-notes-on-london-stock-exchange-b1160651.html","https:\/\/qz.com\/bitcoin-mt-gox-transfers-9-billion-1851503386","https:\/\/www.bolnews.com\/business\/2024\/05\/btc-to-usd-todays-bitcoin-price-in-dollar-on-28-may-2024\/","https:\/\/www.bolnews.com\/business\/2024\/05\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-28-may-2024\/","https:\/\/markets.businessinsider.com\/news\/currencies\/ether-ethereum-crypto-price-outlook-forecast-etf-approval-regulation-supply-2024-5"],"sources":["Evening Standard","Quartz India","BOL News","BOL News","Business Insider"],"descriptions":["The launch marks 21Shares entrance into the UK market","The transfer of more than 140,000 Bitcoin by what was once the world's largest Bitcoin exchange has added pressure to the crypto market","As of May 28, Bitcoin to USD exchange rate stood at $68,199.17. Bitcoin’s value in dollars reflects dynamic nature of cryptocurrency market.","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 18,976,760.336553 on 28 May 2024.","\"All indicators indicate a massive ETH bull run in the coming months,\" said the CEO of SynFutures."],"article_contents":["Business\nThe London Stock Exchange’s embrace of crypto securities went up a gear today after the world’s largest issuer of crypto exchange-traded products added four new listings in the UK.\n21Shares, which launched the world’s first physically backed crypto exchange-traded notes in 2018, has listed the four Bitcoin and Ethereum ETNs in London, marking the firm’s entrance into the UK market in the latest step on its global expansion.\nCo-founder Hany Rashwan told the Standard: “The UK has been on our list since the very beginning and was one of the first three markets we had conversations with when we started.\n“As the UK has started warming up to crypto investments we have had very positive engagement with the regulators and we hope to use London as a base to attract global investors.”\nThe listings follow a decision by the UK’s financial watchdog to permit cryptoasset exchange traded notes amid a softening in stance towards the securities, which it said was because “increased insight and data due to a longer period of trading history” meant that “investors should now be able to better establish whether CETNs meet their risk appetite.”\nHowever, the FCA has so far restricted trading of the CETNs to professional investors because it said they are “ill-suited for retail consumers due to the harm they pose.”\n\n“We’ve seen a lot of institutional interest including professional traders, family offices and in some cases pension funds and insurance companies [but] we want to work with regulators to expand to as many people as possible,” Rashwan said.\nMORE ABOUT","After rising to over $70,000 on Monday, the price of Bitcoin dropped below $68,000 Tuesday morning as the now-defunct Bitcoin exchange Mt. Gox transferred more than $9 billion worth of Bitcoin to an unknown wallet, possibly to repay its creditors.\nThe transfer of over 140,000 Bitcoin added pressure to the crypto market, causing the top cryptocurrency to drop by 1.4% to as low as $67,680 early Tuesday morning.\nTokyo-based Mt. Gox, once the world’s largest Bitcoin exchange, lost hundreds of thousands of Bitcoin after a hack and declared bankruptcy in 2014, owing creditors 45 billion yen ($414 million). Creditors have been waiting for the repayment of their holdings ever since.\nWith the latest Bitcoin transfer, Mt. Gox made its first transaction in over five years. This is likely part of a plan to distribute the assets back to creditors before October 31, 2024.\nOverall, the crypto market was sluggish Tuesday morning, with Ether hovering around $3,900, down 0.33%. Dogecoin and Cardano fell by 2.4% and 1%, respectively. Meanwhile, Solana jumped 2.6% following the news that its validators would receive additional fees.\nMeanwhile, Bernstein is bullish on Bitcoin and Ether ETFs. In a report published Tuesday, the brokerage firm  stated that the Bitcoin and Ether exchange-traded fund (ETF) markets are expected to experience substantial growth, potentially reaching a combined value of $450 billion, CoinDesk reports. Bernstein said the Ether spot ETF approved by the U.S. has positive implications for rival tokens such as Solana, per the report.\nEarlier this month, analysts at Bernstein predicted that Bitcoin would reach $150,000 in 2025 and that by the end of the year, the top cryptocurrency would reach $90,000.\nOur free, fast, and fun briefing on the global economy, delivered every weekday morning.","28th May, 2024. 05:21 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 6, 2024\nAs of May 28, the Bitcoin to USD exchange rate stood at $68,199.17. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 68,199.17Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","28th May, 2024. 05:11 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO PKR – Today’s Bitcoin price in Pakistan on Feb 7, 2024\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 18,976,760.336553 on 28 May 2024.\n1 BTC =  18,976,760.336553 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","The positive verdict on spot ether ETFs last week will kickstart a price rally, according to Rachel Lin, the CEO of SynFutures.\nAccording to commentary published after the funds' approval on Thursday, Lin expects that ether could reach between $15,000 to $22,500 this cycle. The high-end forecast implies a 503% gain from current prices levels of around $3,890.\n\"Ethereum ETF approval is one of the most significant bullish events for Ethereum and the entire ecosystem,\" Lin wrote, adding: \"Even if ETH ETF does not gain as much traction as bitcoin in the initial weeks and months, it will still likely attract a staggeringly large amount of capital in the long run.\"\nA few reasons back her thesis, but generally, it's that ethereum is a tough contender against bitcoin.\nFor one, ether offers an annual yield through staking, and is more than just a store of value asset. The ethereum blockchain is exposed to technologies such as DeFi and NFTs, offering it more functionality than bitcoin.\n\"Bitcoin could become the Dow Jones of crypto ETFs, while Ethereum becomes its NASDAQ,\" Lin said.\nUpside will also follow from a well-established correlation between bitcoin and ether pricing, which should actually tighten, Lin said. Not only is this because of the tech crypto's rising demand, but also due to a major supply shift that occurred in September 2022:\n\"The 20-month period before that date saw ETH supply increase from 114 million to 120 million, an increase of 5%. Today, 20 months since that date, ETH supply remains at the same 120 million,\" Lin said. \"Bitcoin, on the other hand, has seen its supply increase by 2.9% during the same period.\"\nIn that case, ether could reach the $22,500 target if bitcoin manages to climb to $150,000 this year, an estimate frequently published by Standard Chartered. The asset is currently trading at over $68,000.\n\"Overall, I know the market is bullish on Ethereum right now, but it's not bullish enough. Now the spot ETH ETF is approved, all indicators indicate a massive ETH bull run in the coming months,\" Lin wrote.\nAlthough it could still take weeks before the new ETFs start trading, their approval sparked a slew of bullish excitement, though few see prices reach as high as Lin's forecast. For instance, Standard Chartered, expects ether to hit $8,000 by this year's end.\nCheck out Business Insider's picks for  best cryptocurrency exchanges\nCheck out Business Insider's picks for  best cryptocurrency exchanges"]}
{"date":"2024-05-29","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-05-30","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-05-31","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
