{"date":"2024-08-01","titles":["Coinbase posts third consecutive quarterly profit despite crypto price retreat","This Crypto Stock Is the Only One I'd Buy"],"urls":["https:\/\/finance.yahoo.com\/news\/coinbase-posts-third-consecutive-quarterly-profit-despite-crypto-price-retreat-212055645.html","https:\/\/www.fool.ca\/2024\/08\/01\/this-crypto-stock-is-the-only-one-id-buy\/"],"sources":["Yahoo Finance","The Motley Fool Canada"],"descriptions":["The largest US cryptocurrency exchange eked out its third consecutive quarterly profit even as crypto prices retreated during the second quarter.","Bitcoin is back on the rise, but instead of dishing out for the volatile price, maybe consider this top crypto stock instead."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCoinbase Global (COIN) eked out its third consecutive quarterly profit even as crypto prices retreated during the second quarter.\nNet income rose to $36 million, compared with a net loss of $97 million a year ago. Net revenue more than doubled to $1.4 billion. Analysts expected slightly higher revenue and more sizable profits.\nCoinbase’s stock rose in after-hours trading after falling more than 5% Thursday. Since the start of 2024 the stock of the largest US cryptocurrency exchange is up more than 20%.\nCoinbase's results were once again affected by a fairly new accounting change that requires it to value its crypto holdings based on end-of-period prices.\nThat worked in its favor during the first quarter when Coinbase recorded a $737 million pretax gain as prices surged. Bitcoin (BTC-USD) hit a record high near $74,000, largely due to excitement surrounding the launch of a series of new bitcoin ETFs.\nBut in the second quarter, as the price of bitcoin fell 12%, Coinbase took a $319 million impairment on the value of its digital asset holdings. Its crypto trading volume also pulled back.\nIn turn, Coinbase's profits and net revenue fell a respective 97% and 13% from the previous quarter.\nMicroStrategy (MSTR), the world’s largest publicly traded holder of bitcoin, also wrote down the value of its crypto holdings for the second quarter, with an impairment of $180 million and a net loss of $102 million.\nIts stock was down more than 6% Thursday and continued to sell off in after-market trading. It's still up more than 130% year to date.\nCoinbase did have plenty of bright spots in the second quarter.\nIt posted better-than-expected revenue on transaction fees, subscriptions, and services business lines.\nTransaction fees of $781 million rose 139% from a year ago. Subscriptions and services revenue was $599 million, 78.6% higher than last year.\nCoinbase also said it expects third quarter subscription and services revenue to be within a range of $530 million-$600 million.\nIts custodial fees, which it earns partly from partnerships with some of the new bitcoin ETFs, also rose by 7% from the first quarter and doubled from the year-ago period to $34.5 million.\nIt could earn more from a new series of ETFs that hold the world's second-largest cryptocurrency, Ether (ETH-USD), which just launched last week.\n\"Execution is really strong over here at Coinbase,\" Coinbase CFO Alesia Haas told Yahoo Finance in an interview.\n\"We're really pleased with our results despite the continued volatility of crypto and the ebbing and flowing market that we always find ourselves in.\"\nCoinbase still has some regulatory troubles it needs to solve despite making some progress.\nThe firm's biggest headache is a 2023 lawsuit from the Securities and Exchange Commission alleging the company violated US federal securities laws.\nCoinbase and its CEO, Brian Armstrong, are fighting those allegations. The critical case could take years to play out.\nThe company is also trying to influence how the US regulates crypto by helping to amass a lobbying war chest during a critical election year.\nFairshake, the crypto industry's largest super-PAC, currently has raised $203 million, according to data tracked by Open Secrets. That is more than any other super-PAC.\nAnd 93% of that money hasn’t yet been spent, meaning its impact could be deeply felt in the months ahead.\n\"Crypto legislation has become a mainstream issue in the US, garnering bipartisan support, and there is real energy within both the House and the Senate to pass meaningful legislation,\" the company said in a release.\nThe company also said it would \"continue to invest in policy initiatives throughout the 2024 election cycle to help elect pro-crypto candidates.\"\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for the latest crypto news, updates, and more related to ethereum and bitcoin prices, crypto ETFs, and market implications for cryptocurrencies\nRead the latest financial and business news from Yahoo Finance","Image source: Getty Images\nCryptocurrency remains a pretty tricky field when it comes to investing. We’ve seen this time and again over the last few years. The price of Bitcoin (CRYPTO:BTC), in particular, has been staggering, practically making it to US$100,000 before falling backwards.\nYet these days, it seems like there have been more upward movements rather than downward. This comes down to a few recent moves in the United States. So, let’s get into them and why there is only one crypto stock I would buy in support of them.\nThere were two major announcements this week that could be influencing the price of crypto, specifically Bitcoin. First, former president Donald Trump stated several pro-Bitcoin items.\nAt the Bitcoin 2024 Conference, he expressed strong support for Bitcoin, including a pledge to halt the sale of Bitcoin held by the U.S. government and advocating for a favourable regulatory framework. He also promised to support Bitcoin mining in the U.S. and uphold the right to self-custody for Bitcoin holders if re-elected. These statements are seen as part of his broader strategy to appeal to the cryptocurrency community​.\nFurthermore, there was another item that caused the price to move. The U.S. government recently seized a significant amount of Bitcoin connected to the Silk Road, and the possibility of auctioning off these assets could influence market dynamics. Less Bitcoin on the market can contribute to a price increase. When the supply of Bitcoin decreases, and demand remains constant or increases, it can create upward pressure on the price. The recent seizure of Bitcoin by the U.S. government and its potential removal from the market, even temporarily, can reduce the available supply.\nWith more exchange-traded funds (ETF), positive momentum, and statements from the U.S. government in support of cryptocurrency, Bitcoin does look like a good investment — at least, if you can afford it.\nThe price as of writing stands at US$66,460, far from what most investors can afford. And while you could get into some ETFs, I would perhaps wait until the Bitcoin halving event occurs before diving in.\nYet, instead, there is another area of the cryptocurrency market to buy into, and that’s mining. Investing in Bitcoin mining companies can be a good idea for several reasons. Bitcoin mining can be highly profitable, especially during bull markets when Bitcoin prices are high. Mining companies often benefit from economies of scale, reducing costs, and increasing margins.\nThe demand for Bitcoin continues to grow, and mining companies are well-positioned to capitalize on this trend. Mining companies offer exposure to the cryptocurrency market without directly holding volatile assets. And when it comes to diversification, there is really just one I would pick up.\nEarnings are due this month for Hut 8 (TSX:HUT), and it’s why I would get in before the probable rise in price. Hut stock is a great investment for a variety of reasons. Hut 8 has secured significant investments, such as the recent $150 million from Coatue, to develop next-generation artificial intelligence (AI) infrastructure, enhancing its growth prospects.\nFurthermore, it is a leading operator in large-scale energy infrastructure and has shown resilience and growth in the crypto-mining sector. Hut 8 is actively expanding its operations, including new sites and increased energy capacity.\nAs for earnings, the company continues to demonstrate strength. During the first quarter, Hut 8 stock reported revenue of $51.7 million, a net income attributable to Hut 8 of $250.9 million, and adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA) of $297.0 million.\nThese results reflect significant profitability and operational efficiency improvements. The company highlighted its strategic investments in AI infrastructure and expansion plans as key drivers for future growth. This strong financial performance underscores Hut 8’s position as a leading player in the cryptocurrency mining sector.\nBitcoin is on the rise, but its price right now looks far out of reach. Meanwhile, the price can still be quite volatile. That’s why mining companies like Hut 8 stock are a great option, especially when they offer more diversification as well.\nSo, with shares up 6% this week, now could be a great time to get in on this crypto stock.\nApril 18, 2025 |\n        Adam Othman\nBoasting solid growth prospects, these two TSX stocks are my top picks for investors with a stronger stomach for market…\nRead more »\nApril 18, 2025 |\n        Amy Legate-Wolfe\nThis AI stock might not be the first you think of, but honestly, it should be.\nRead more »\nApril 18, 2025 |\n        Adam Othman\nDespite being a far cry from its peak as an original giant in the smartphone market, BlackBerry (TSX:BB) stock could…\nRead more »\nApril 18, 2025 |\n        Christopher Liew, CFA\nYou can get the best deal by investing $1,000 in the TSX’s next high-growth stock today.\nRead more »\nApril 17, 2025 |\n        Amy Legate-Wolfe\nThis Canadian stock may not be the first you think of when hearing \"AI stock,\" but it should be.\nRead more »\nApril 16, 2025 |\n        Aditya Raghunath\nShopify and Magellan are two top TSX stocks you can buy right now and generate outsized gains in the upcoming…\nRead more »\nApril 15, 2025 |\n        Joey Frenette\nApple (NASDAQ:AAPL) stands out as a top Mag Seven stock for Canadian investors to buy amid tariff fears.\nRead more »\nApril 15, 2025 |\n        Aditya Raghunath\nBlackBerry is a TSX tech stock that is positioned to underperform the broader markets in the near term. Let's see…\nRead more »"]}
{"date":"2024-08-02","titles":["BTC TO USD - Today’s Bitcoin price in Dollar on 2 August, 2024","BTC TO PKR - Today’s Bitcoin price in Pakistan on August 2, 2024"],"urls":["https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-usd-todays-bitcoin-price-in-dollar-on-2-august-2024\/","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-august-2-2024\/"],"sources":["BOL News","BOL News"],"descriptions":["As of August 2, the Bitcoin to USD exchange rate stood at $64445.92. Bitcoin’s value in dollars reflects the dynamic nature of the","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 17950820.89 on 2 August 2024"],"article_contents":["02nd Aug, 2024. 03:01 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 1, 2024\nAs of August 2, the Bitcoin to USD exchange rate stood at $64445.92. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 64445.92 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","02nd Aug, 2024. 02:59 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 17950820.89 on 2 August 2024.\n1 BTC =  17950820.89 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
{"date":"2024-08-05","titles":["Bitcoin's shellacking in markets decline stirs 'safe haven' doubts","Biggest stock movers today: AAPL, NVDA, crypto stocks, and more","Bitcoin Price Tanks Hours After Trump Floats Using it as US Reserve Asset","Bitcoin price drops to $50,000","Bitcoin tumbles as risk assets plunge in global market rout","Bitcoin Falls Nearly 8%"],"urls":["https:\/\/www.cnbc.com\/2024\/08\/05\/bitcoins-shellacking-during-global-markets-decline-calls-into-question-safe-haven-theory-again.html","https:\/\/seekingalpha.com\/news\/4133756-biggest-stock-movers-today-aapl-crypto-stocks-and-more","https:\/\/www.newsweek.com\/bitcoin-price-tanks-donald-trump-1934587","https:\/\/qz.com\/bitcoin-bloodbath-price-drops-50-000-1851613015","https:\/\/markets.businessinsider.com\/news\/currencies\/bitcoin-price-today-selloff-ether-economy-recession-jobs-fed-rates-2024-8","https:\/\/www.forbes.com\/sites\/brianbushard\/2024\/08\/05\/bitcoin-plummets-amid-wider-market-selloff\/"],"sources":["CNBC","Seeking Alpha","Newsweek","Quartz India","Business Insider","Forbes"],"descriptions":["Bitcoin and related stocks tumbled with the stock market Monday, causing some investors to doubt whether or not the cryptocurrency is really a safe haven.","Stock futures are getting hammered in premarket trading, led by a selloff in contracts linked to the Nasdaq. Read more details on the biggest stock movers here.","The cryptocurrency plummeted amid global market turmoil after the former president suggested it could be used to pay off U.S. national debt.","Ether dropped 22% in a single day, as spot Ether ETFs are witnessing substantial outflows","Bitcoin and ethereum dropped amid a global market rout on Monday, fueled by US economic worries following a series of weak data reports.","The price of Bitcoin hit its lowest mark since February, reversing months of gains."],"article_contents":[null,null,"Alia Shoaib is a freelance news reporter for Newsweek based between London, UK and Abuja, Nigeria. She primarily reports on U.S. politics and current affairs. Alia joined Newsweek in 2024 from Business Insider, where she reported extensively on U.S. politics, far-right extremism, the war in Ukraine and other global events. She is a graduate of the University of Bristol and City, University of London. You can get in touch with Alia by emailing a.shoaib@newsweek.com. Languages: English and Urdu\nBased on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\nNewsweek AI is in beta. Translations may contain inaccuracies—please refer to the original content.\n🎙️ Voice is AI-generated. Inconsistencies may occur.\nBitcoin prices plummeted after former President Donald Trump suggested that the cryptocurrency could be used to pay off the country's $35 trillion national debt.\nThe cryptocurrency market has plunged in recent days amid global uncertainty that has led to investors selling out of risky assets. Monday's global turmoil across stock markets came amid fears of a possible U.S. recession.\nWhile speaking to Fox Business on Friday, Trump said: \"Who knows? Maybe we'll pay off our $35 trillion, hand them a little crypto check, right?\"\n\"We'll hand them a little bitcoin and wipe out our $35 trillion,\" he said.\nBitcoin dropped 12 percent in the past 24 hours and ether plunged by 21 percent in the same time period.\nThe price of bitcoin has been dropping since Friday, and briefly dropped to below $50,000 on Monday. This was the first time it had dropped below these levels since February.\nThe cryptocurrency market has experienced losses in value of about $500 billion in a three-day period, according to CoinTelegraph, a cryptocurrency news site.\nIn recent weeks Trump has been attempting to position himself firmly as pro-crypto.\nSpeaking at a bitcoin conference in Nashville, Tennessee on July 27, the Republican presidential candidate unveiled his plans to make the U.S. the \"crypto capital of the planet\" if he is elected for a second term.\nHe also spoke about the U.S. creating a \"strategic national bitcoin reserve.\" This is an idea currently being championed by Republican Senator Cynthia Lummis, and one that has long been hoped for among the cryptocurrency community.\n\"I am announcing that if I am elected, it will be the policy of my administration, United States of America, to keep 100 percent of all the bitcoin the U.S. government currently holds or acquires into the future, we'll keep 100 percent,\" Trump said.\n\"I hope you do well, please. This will serve, in effect, as the core of the strategic national bitcoin stockpile.\"\nMonday's dramatic plunge marked a major reversal to this trend.\nTrump's position on cryptocurrencies has radically changed over the years. In 2019 he described the market as being \"highly volatile and based on thin air\" and said he was \"not a fan.\"\nNewsweek reached out to the Trump campaign for comment via email outside of regular working hours.\nThe sell-off in the crypto market occurred alongside a plunge in stocks across Asia-Pacific markets.\nThis stock market decline was partly triggered by weak U.S. jobs data released on Friday, several weak earnings reports from major technology firms last week, and rising tensions in the Middle East.\nAlia Shoaib is a freelance news reporter for Newsweek based between London, UK and Abuja, Nigeria. She primarily reports on U.S. politics and current affairs. Alia joined Newsweek in 2024 from Business Insider, where she reported extensively on U.S. politics, far-right extremism, the war in Ukraine and other global events. She is a graduate of the University of Bristol and City, University of London. You can get in touch with Alia by emailing a.shoaib@newsweek.com. Languages: English and Urdu\nAlia Shoaib is a freelance news reporter for Newsweek based between London, UK and Abuja, Nigeria. She primarily reports on U.S. politics and current affairs. Alia joined Newsweek in 2024 from Business Insider, where she reported extensively on U.S. politics, far-right extremism, the war in Ukraine and other global events. She is a graduate of the University of Bristol and City, University of London. You can get in touch with Alia by emailing a.shoaib@newsweek.com. Languages: English and Urdu\nAlia Shoaib is a freelance news reporter for Newsweek based between London, UK and Abuja, Nigeria. She primarily reports on                                    ...\nRead more","A broad weekend selloff continued on Monday morning, causing widespread panic in the crypto market as Bitcoin’s price plummeted from $70,000 to $50,000 in just a week. In the past 24 hours, the leading cryptocurrency has declined by over 15%, and over 26% in the past week.\nNot only that, but Ether, the second largest cryptocurrency by market capitalization, dropped to $2,200 – a level it has not seen since December 2023. The performance of Ether has worsened as spot Ether ETFs have experienced significant outflows in the past few days, totaling a net outflow of $511 million since its launch.\nAmong major cryptocurrencies, Solana, Dogecoin, and Cardano have dropped over 19%, 21%, and 17% in the past 24 hours. The global cryptocurrency market cap has fallen to $1.78 trillion, marking a decrease of over 17%.\nThe bloodbath in the crypto market has been caused by several factors, including renewed concerns about a potential recession in the U.S. due to rising unemployment rates. Moreover, the Bank of Japan’s decision to raise its benchmark interest rate has caused the value of the yen to rise, and Japanese stocks have suffered their biggest fall since 1987. The country’s Nikkei stock index dropped by over 12% on Monday.\nThe crypto market’s decline seems like it will continue for the foreseeable future. While the downturn in the crypto market might appear worrisome, some experts are suggesting that now is the time to buy.\nOur free, fast, and fun briefing on the global economy, delivered every weekday morning.","Bitcoin dropped on Monday amid the broad sell-off across financial markets that kicked off last week.\nThe world's biggest cryptocurrency was down as much as 19% over the weekend, though it pared that loss to about 7% shortly after noon on Monday. The token was trading at $54,934 at 12:24 p.m. ET.\nEthereum, the world's second-largest crypt, was also down, trading 12% lower at $2,488.\nThe sell-off in crypto comes as risk assets plunge in a global market rout caused by worries over the state of the US economy.\nA disappointing jobs report and weak manufacturing data last week raised concerns that the Federal Reserve has waited too long to cut rates.\nSome market observers have said that the historic market rout could prompt an emergency rate cut from the central bank in the next week. Such a move would be a rare acknowledgment by the Fed of the dire conditions facing the economy. Historically, an emergency cut has been reserved for \"black swan\" events like the pandemic and the terror attacks of September 11.\nThe bout of stock market volatility is the strongest since the onset of COVID-19 in 2020. Japan's Nikkei 225 index dropped 12% early Monday in its worst single-day decline since 1987, and markets in South Korea and Europe also plunged.\nWith weaker job growth than expected, \"financial markets indicate that the risk is no longer balanced between growth and inflation,\" analysts from Bank of America said in a Sunday note.\nThe analysts aren't optimistic that new data in the coming weeks could sway markets.\n\"Recent data suggests growth is slowing faster than expected and there are no major data releases or earnings over the coming weeks that could reverse the narrative,\" they said.\nThe upcoming release of consumer price index data on August 14 could \"be a major downside catalyst if it comes in hot,\" they added.\"\nSome crypto experts remain optimistic that the sell-off is a stopover before further gains materialize.\n\"Judging from historical trends in the crypto market, before the market forms a true bullish drive, it needs to experience a sharp decline to reduce the long positions of the contract in order to reduce the selling pressure for future rises,\" Gracy Chen, CEO of crypto exchange company Bitget, said in a Monday note.\nCheck out Business Insider's picks for  best cryptocurrency exchanges\nCheck out Business Insider's picks for  best cryptocurrency exchanges","Cryptocurrencies bitcoin and ethereum took a tumble on Monday, dropping to near-six-month lows and ending months of gains as investors once again turn away from the crypto market—and as stocks fall amid renewed fears of a recession.\nThe price of Bitcoin hit its lowest mark since February, reversing months of gains.\nBitcoin fell to a daily low of $49,443 Monday morning, a 15% drop and its lowest point since late February, before rising narrowly to just over $53,800.\nCompeting cryptocurrencies also tumbled Monday morning: Ethereum fell over 11% to just over $2,386, a six-month low, while dogecoin fell over 10% to a six-month low just below 10 cents.\nBitcoin has been hit hard by investor outflows over the past week, with the cryptocurrency seeing $400 million in outflows in the week ending Aug. 3, following five straight weeks of gains, according to data from CoinShares—Ethereum lost $146 million in that same period.\nThe drop also coincides with a plunge on Wall Street: Dow Jones dropped over 2.5% on Monday—its worst loss by percentage since September 2022—to a two-month low, while the tech-heavy Nasdaq fell nearly 3% on the day and the S&P 500 fell 3%, even as the Federal Reserve indicates interest rate reductions are in store.\nThat downturn was led by a group of tech giants that saw major losses on the morning, with Apple shares opening down 8%, along with Nvidia (14%), Amazon (8%), Meta (7%) and Google parent company Alphabet (6%), which all saw a decline on the heels of a disappointing jobs report on Friday with unemployment hitting a near-three-year high.\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\nMonday’s drop marks a complete turnaround from bitcoin’s record high of $69,000 from March, the culmination of a months-long rally fueled by a drive in spot bitcoin exchange-traded funds (ETF). The Securities and Exchange Commission had approved ETFs from a group of firms—including BlackRock and Fidelity—opening the door for ETF trading in a historic move that expands bitcoin investment for a wider audience.\nBitcoin was created in 2008 as a decentralized alternative to national currencies, though it did not take off until 2017, reaching the $10,000 mark for the first time. After spiking during the first year of the COVID-19, the crypto giant was hit hard again in 2022 amid stubbornly high inflation, fears of a looming recession, spooking investors of the possibility of a dreaded so-called crypto winter. In August 2022, bitcoin dropped below $20,000, coinciding with the Federal Reserve’s repeated interest rate hikes designed to combat rising inflation. The price of bitcoin fell again in December 2022, hitting a near-two-year-low. Adding insult to injury was the collapse of Sam Bankman-Fried’s crypto exchange FTX (Bankman-Fried was sentenced to 25 years in March on a fraud and conspiracy conviction over a scheme to divert FTX customer funds—he appealed that conviction in April).\nOne Community. Many Voices. Create a free account to share your thoughts.\nOur community is about connecting people through open and thoughtful conversations. We want our readers to share their views and exchange ideas and facts in a safe space.\nIn order to do so, please follow the posting rules in our site's Terms of Service.  We've summarized some of those key rules below. Simply put, keep it civil.\nYour post will be rejected if we notice that it seems to contain:\nUser accounts will be blocked if we notice or believe that users are engaged in:\nSo, how can you be a power user?\nThanks for reading our community guidelines.  Please read the full list of posting rules found in our site's Terms of Service."]}
{"date":"2024-08-06","titles":["How Bitcoin's own arbitrage trade helped crypto evolve to survive Japan's","Bitcoin rebounds after market volatility, reaching a price of over $56,000","Guelph man taken for $70K in cryptocurrency scam","Cryptoverse: Trump’s bitcoin stockpile plan stirs debate","CNBC Daily Open: Dow sheds 1,000 points"],"urls":["https:\/\/finance.yahoo.com\/news\/bitcoins-own-arbitrage-trade-helped-225859000.html","https:\/\/finance.yahoo.com\/news\/bitcoin-rebounds-market-volatility-reaching-212733491.html","https:\/\/www.guelphtoday.com\/police\/guelph-man-taken-for-70k-in-cryptocurrency-scam-9314446","https:\/\/indianexpress.com\/article\/technology\/tech-news-technology\/trumps-bitcoin-stockpile-plan-stirs-debate-9497673\/","https:\/\/www.cnbc.com\/2024\/08\/06\/cnbc-daily-open-dow-sheds-1000-points.html"],"sources":["Yahoo Finance","Yahoo Finance","GuelphToday","The Indian Express","CNBC"],"descriptions":["The maturation of bitcoin's financial products attracts institutional investors, reducing market volatility, according to BlockFill's John Divine","\"Looking ahead, bitcoin may find support in the $49,500 to $55,000 range, with potential for recovery tied to upcoming rate cuts,\" one analyst told TheStreet Crypto.","Man believed he was investigating in a legitimate online trading company","Donald Trump, along with other political figures, proposes a national bitcoin reserve, sparking debate about its feasibility and impact on the crypto market.","S&P 500 posts worst day since 2022 in global market sell-off. Google loses antitrust case. Bitcoin tumbles"],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe cryptocurrency landscape has dramatically evolved over the past decade, transforming from a niche market to an arena attracting significant institutional interest.\nOn the way up, it was a juicy so-called \"widowmaker\" trade that has been well-documented. Arbitragers piled into Grayscale's bitcoin trust and were able to earn a premium. The trade attracted billions of dollars and continued to work — up until it didn't. In a way, it revealed an incredible need for market infrastructure and the upside down fact that many institutional players had to overpay for exposure to crypto via a locked trust before Bitcoin ETFs existed.\nThis week, another popular trade — the so-called Japan carry trade — also laid bare the market ramification of a crowded trade working until it doesn't. It creates a rush for arbitragers to unwind things and avoid being the last person caught in a losing position.\nIn a recent discussion, Scott Melker, host of The Wolf of All Streets Podcast, and John Divine, head of OTC trading at BlockFills, reflected on how far the Bitcoin and crypto markets have come since the end of the \"widowmaker\" trade — and how it attracted institutional players to crypto.\nJohn Divine provided a historical perspective, tracing the market's development from its inception in 2009 with the bitcoin protocol. He explained how the market transitioned from peer-to-peer transactions to the establishment of centralized exchanges like Kraken and Coinbase. This shift facilitated the use of bitcoin as collateral for borrowing dollars, leading to the creation of a forward market and eventually the introduction of perpetual swaps and futures contracts.\nDivine elaborated on the \"cash and carry trade,\" a strategy where investors buy spot bitcoin and sell it forward in a contango market structure. This trade, once yielding 25-30% annualized returns, attracted institutional capital familiar with similar strategies in traditional markets like gold and oil. Although the returns have stabilized to around 10% annualized, the trade remains a significant draw for institutional investors.\nThe conversation also touched on the approval of bitcoin ETFs and the potential for options on these ETFs. Divine expressed surprise at the rapid approval of ethereum ETF before bitcoin ETF options. These options could dampen bitcoin's volatility, making the market more attractive to institutional investors.\nMelker and Divine discussed the broader implications of bitcoin's growing acceptance among institutional investors. Melker noted that institutional involvement could lead to reduced volatility, citing the decreased drawdowns in recent cycles compared to previous ones. Divine emphasized the benefits of increased market participation, arguing that it would help spread the message of bitcoin and its potential as a decentralized, sound money alternative to fiat currencies.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe price of bitcoin rebounded on Tuesday, hitting more than $56,000, a day after the world’s largest cryptocurrency tumbled to a six-month low – representing the worst decline since 2021.\nThis week, bitcoin’s drop in valuation was catalyzed by several factors, including fears of a looming U.S. economic recession, ongoing tensions in the Middle East, and other macroeconomic variables.\nBitcoin’s “fear and greed” index is currently sitting at “extreme fear,” a rapid shift from a relatively calmer status of “neutral” a week ago. Market sentiments often shift rapidly in response to political and economic events, and investors’ worries about an ongoing bitcoin market crash have not quelled, the index shows.\nHowever, many bitcoin investors use the “extreme fear” mark as a prime opportunity to buy more bitcoin – and even alternatives to the leading cryptocurrency, such as ethereum and Solana – given what they see as an undervaluation of the digital assets.\nEither way, some market analysts are optimistic about bitcoin making a strong recovery. “Looking ahead, bitcoin may find support in the $49,500 to $55,000 range, with potential for recovery tied to upcoming rate cuts that could boost liquidity, and positive political news about crypto assets,” Gracy Chen, the CEO of the crypto exchange Bitget, told TheStreet Crypto.\n“Overall, in August, crypto is likely to remain in the same ranges, with the risk of a further decrease in market capitalization if the geopolitical factor plays a role,” she added.\nFurthermore, the recent influx of institutional investors into the bitcoin space is another trend keeping bitcoin on an upward trajectory, according to analysts. “ETFs help dampen volatility by bringing more investors into the market, providing additional liquidity for buying and selling the asset,” Ryan Rasmussen, head of research at Bitwise, told Decrypt.\n“The increased presence of institutional investors provides more stable capital flows into the market, mitigating the harm caused by crashes,” Patrick Pan, chairman and executive director at OSL, told Decrypt.","Guelph police are once again warning residents to use caution when interacting online after a Guelph man reportedly lost $70,000 in a cryptocurrency scam.\nOn Saturday officers were dispatched to an address in the south end. A man in his 60s reported he opened an account with what he believed was a legitimate trading company and over the course of several months deposited tens of thousands of dollars into his online wallet, only to later discover the funds had been withdrawn by an unknown party.\nPolice say cryptocurrency scams are very difficult to investigate and recouping losses is nearly impossible due to the anonymous nature of the transactions. Residents are strongly urged to be cautious when dealing online with parties unknown to them.",null,"In this article\nThis report is from today's CNBC Daily Open, our international markets newsletter. CNBC Daily Open brings investors up to speed on everything they need to know, no matter where they are. Like what you see? You can subscribe here.\nWall Street sinksThe Dow Jones Industrial Average and the S&P 500 suffered their sharpest declines in nearly two years, as growing concerns about the U.S. economy rocked global stock markets. The Dow plummeted over 1,000 points, while the S&P 500 and Nasdaq Composite fell 3% and 3.4%, respectively. Tech stocks were hit hard, with Nvidia and Tesla losing 6.4% and 4.2%. Apple's shares also declined 4.8% after Berkshire Hathaway slashed its stake. The yield on the 10-year Treasury note reached its lowest point since June 2023, while U.S. oil prices slipped to their lowest settle since Feb. 5.\nGoogle monopolyA federal judge ruled Google holds an illegal monopoly in the search and text advertising markets. The decision focused on Google's exclusive search arrangements on Android and Apple devices, which the court said reinforced its dominance. \"Google is a monopolist, and it has acted as one to maintain its monopoly,\" Judge Amit Mehta wrote in the decision. The ruling stems from combined antitrust suits filed by the Department of Justice and several states in 2020.\nEmergency rate cut?Wharton finance professor Jeremy Siegel urged the Federal Reserve to make an emergency 75-basis-point cut in the federal funds rate following Friday's disappointing jobs data. He also suggested another 75-basis-point cut at the September meeting. Siegel believes the current fed funds rate \"should be somewhere between 3.5% and 4%,\" citing the higher-than-expected unemployment rate and declining inflation as reasons for the cuts. \"How much have we moved the fed funds rate? Zero,\" he said. \"That makes absolutely no sense whatsoever.\"\nFed will 'fix it'Chicago Federal Reserve President Austan Goolsbee said the central bank would react to signs of weakness in the economy and indicated that interest rates could be too restrictive now. \"The Fed's job is very straightforward: maximize employment, stabilize prices and maintain financial stability. That's what we're going to do,\" Goolsbee told CNBC's \"Squawk Box.\" \"We're forward-looking about it. So if the conditions collectively start coming in like that on the through line, there's deterioration on any of those parts, we're going to fix it.\"\nBitcoin tumblesAmid global recession fears, cryptocurrencies plummeted with bitcoin experiencing its worst day since June 2022, dropping as much as 15% to a low of $49,111.10 on Monday. Bitcoin has lost nearly 15% since Saturday. \"Thirty percent slumps, as scary as they are, are par for the course during bull markets and it's encouraging bitcoin bounced back above $50,000,\" said Nexo co-founder Antoni Trenchev. \"But make no mistake, we are in a choppy, volatile market environment… the moment to turn bullish will be when bitcoin retakes its 200-day moving average, which typically tells us if we are in a bull or bear market, at $61,500.\"\n[PRO] Don't panicDespite a global stock market rout, several investors and strategists advised against panicking at this point. That said, JPMorgan's top charts analyst thinks this could be the \"start of something bigger.\" Here's what top investors are saying.\nMonday's massive sell-off was the result of a perfect storm of factors, including carry trades, U.S. jobs data, recession fears and concerns about the Fed's slowness in cutting rates. The global rout included $1 trillion in mega tech losses. Despite calls for an emergency rate cut to stabilize the market, not everyone is convinced and this could be a buying opportunity.\nBrian Belski, BMO chief equity strategist, considers the market correction to be normal and healthy. He advised investors to pick up high-quality tech stocks.\n\"You have been provided a gift here the last couple days, in terms of your Amazons, Apples, Googles, Microsofts,\" Belski said. \"You absolutely, positively have to have exposure to these names.\"\n\"Now these names obviously got too cocky on the upside, with respect to their valuations, and now they have been humbled. Everybody needs a little humility in their life and we're seeing that in these names. We believe it's short term and reactionary to be chasing consumer staples and utilities now.\"\nMain Street Research CIO James Demmert agreed that a \"healthy correction\" was \"overdue\" given recent high valuations.\nHe added, \"Market fundamentals have actually improved in recent weeks, particularly the Federal Reserve's assurance that interest rate cuts are coming.\"\nChicago Fed President Austan Goolsbee's comments that the Fed would \"fix it\" if economic conditions deteriorate significantly could provide assurance for a jittery market. Wall Street's fear gauge spiked to as high as 65 during Monday's pullback, though later slipped to about 38.\nIf futures are any indication, calmer minds could be taking hold. S&P 500 futures rose 1.3% Monday evening as Nasdaq 100 futures gained 1.8%.\n\"It's too early to say the low is in,\" wrote Keith Lerner, Truist's co-chief investment officer. \"There has been damage done, and the repair process will likely take time. However, the risk\/reward appears to be gradually improving as the market's bar for positive surprises resets lower.\"\n— CNBC's Hakyung Kim, John Melloy, Sarah Min, Jeff Cox, Michelle Fox, Tanaya Macheel and Rohan Goswami contributed to this report."]}
{"date":"2024-08-07","titles":["Bitcoin is no digital gold safehaven","BTC TO USD - Today’s Bitcoin price in Dollar on 7 August, 2024","BTC TO PKR - Today’s Bitcoin price in Pakistan on August 7, 2024"],"urls":["https:\/\/www.cnbc.com\/2024\/08\/07\/bitcoin-is-no-digital-gold-safehaven.html","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-usd-todays-bitcoin-price-in-dollar-on-7-august-2024\/","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-august-7-2024\/"],"sources":["CNBC","BOL News","BOL News"],"descriptions":["The market chaos this week has revived the debate about how to value bitcoin: Is it a risk asset or a hedge?","As of August 7, the Bitcoin to USD exchange rate stood at $57515.56. Bitcoin’s value in dollars reflects the dynamic nature of the","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16057806.71 on 7 August 2024"],"article_contents":[null,"07th Aug, 2024. 03:39 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 1, 2024\nAs of August 7, the Bitcoin to USD exchange rate stood at $57515.56. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 57515.56 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","07th Aug, 2024. 03:36 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16057806.71 on 7 August 2024.\n1 BTC =  16057806.71 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
{"date":"2024-08-08","titles":["Why the Bitcoin Crash Sets Up Next Bullish Move","FTX ordered to pay $12.7B to customers after SBF's massive fraud","Sam Bankman-Fried's FTX to pay over 12 billion to creditors","Bitcoin's volatility makes it a risky investment, experts say"],"urls":["https:\/\/finance.yahoo.com\/news\/why-bitcoin-crash-sets-next-192713967.html","https:\/\/nypost.com\/2024\/08\/08\/business\/ftx-ordered-to-pay-12-7b-to-customers-after-sbfs-massive-fraud\/","https:\/\/qz.com\/ftx-to-pay-12-billion-to-creditors-1851616516","https:\/\/www.cnbc.com\/2024\/08\/08\/bitcoins-volatility-makes-it-a-risky-investment-experts-say.html"],"sources":["Yahoo Finance","New York Post","Quartz India","CNBC"],"descriptions":["Bitcoin market signals show this pullback is a reset before the next major push up.","A US court has ordered bankrupt cryptocurrency exchange FTX to pay $12.7 billion in relief to its customers, the Commodity Futures Trading Commission said in a statement on Thursday.","Crypto exchange FTX and its sister concern Alameda Research are banned from trading digital assets","Bitcoin's rollercoaster price movements are a reminder why it shouldn't be a big part of your investment strategy, financial planners say."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWhy did Bitcoin Crash... Some are arguing the \"TOP IS IN!\" Nonsense; Here's why:\nThe pullback just experienced in Bitcoin & Crypto markets did not happen in a vacuum. Global markets collective had a major shakeout this week. Furthermore, key data signals that would outline a cycle top are not yet flashing.\nThe BTC & crypto markets are still tied to the risk-asset narrative and regularly can be seen to be the first to react to speculative uncertainty in markets. Why is this?\nBitcoin is a 24\/7 liquid market and thus is not bound by the confining & now arbitrary limits of a 9-5 trading day.\nConsidering the global liquidity just pushed up into new all-time highs, one must wonder what is underlying this broader global market drop. Is the BULL over? Or is this a pit stop along the road higher?\nSome will point to the Japanese yen carry trade unwinding & others will suggest a major correction is long overdue. We already see the BOJ capitulate which is reflected in the recent TradFi market rebound. However, markets are also deciphering a confounding mix global conflict escalations, an election year, a forecast of an impending interest rate cuts, and exponential increase in demand for Bitcoin.\nThe point is, the markets have resiliently pushed to new highs in the past 24 months, and a drawdown to test support was due. I believe this was just that, not a sign that a larger crash is looming in the near term.\nConsidering Bitcoin: The fundamental developments over the past 12 months have only strengthened the \"bullish\" case forward\nBitcoin Spot ETFs launched, with IBIT and FBTC both breaking records for any asset EVER to see $10Billion EACH in only a matter of weeks. (Previous record took nearly 3 years)\nBitcoin a focus of discussion in all levels of government\nThe demand for bitcoin in July showed ETFs purchasing over 51,104 Bitcoin with only 13,950 Bitcoin being produced.\nIn any investment thesis, the concern is what is the demand vs. supply ratio, and how can we capitalize on how that impacts price.\nThe answer here is this:Bitcoin is arguably the most a-symmetric REWARD\/risk opportunity of a generation. It is outpacing the rate of adoption the internet saw in the 1990s, new capital channels to Bitcoin are being unlocked, adoption is exploding bringing in higher demand, while recent clarity in regulations has only increased integrations by individual, corporate bodies, & government investment strategies.\nThis pullback was not a crash by any measure. This is among the last opportunities we will ever see for Bitcoin at these price levels.","A US court has ordered bankrupt cryptocurrency exchange FTX to pay $12.7 billion in relief to its customers, the Commodity Futures Trading Commission said Thursday.\nFTX drew customers in with “an illusion that it was a safe and secure place to access crypto markets,” then misappropriated their customer deposits to make its own risky investments, CFTC Chairman Rostin Behnam said in a statement.\nThe repayment order implements a settlement between the CFTC and the bankrupt crypto exchange, which has committed to a bankruptcy liquidation that will repay customers whose deposits were locked during its late 2022 collapse.\nFTX has said that its customers will receive 100% recovery on their claims against the company, based on the value of their accounts at the time the company filed for bankruptcy.\nThe CFTC agreement resolves a potential roadblock to that repayment, ensuring that the government’s lawsuit against FTX will not reduce the funds available to its customers. The CFTC agreed not to collect any payment from FTX until all its customers are repaid, with interest.\nThe CFTC settlement requires FTX to pay $8.7 billion in restitution and $4 billion in disgorgement, which will be used to further compensate victims for losses suffered during the exchange’s collapse.\nFTX did not immediately respond to a request for comment.\nIn March, FTX founder Sam Bankman-Fried was sentenced to 25 years in prison for stealing $8 billion from customers.  He has appealed the conviction.\nFTX has used its bankruptcy to reach settlements with US regulators and former business partners and to sell assets that had been purchased with misappropriated customer funds, including real estate and investments in crypto and other tech companies.\nFTX is currently soliciting votes on its bankruptcy proposal but faces opposition from some customers who feel short-changed by the decision to repay them based on much-lower cryptocurrency prices from November 2022. Votes are due on Aug. 16, and FTX intends to seek final approval of its wind-down plan on Oct. 7.","Sam Bankman-Fried’s defunct cryptocurrency exchange FTX and its affiliate Alameda Research will pay $12.7 billion to creditors following the approval of a consent order by a New York judge. This resolves a long-running lawsuit filed by the Commodity Futures Trading Commission (CFTC), marking a significant development in the collapse of FTX.\nIn the ruling, United States District Judge Peter Castel did not impose any civil penalties on FTX or Alameda, and the focus was solely on financial restitution. The companies are now prohibited from trading digital assets and serving as intermediaries in the market, effectively ending their involvement in the crypto space. This action is viewed as an effort to prevent further fallout from one of the most dramatic collapses in crypto history.\nCrypto exchange FTX collapsed in November 2022 due to its poor balance sheet and liquidity crisis, resulting in a $10 billion fraud committed against customer funds. This had a ripple effect on other crypto companies, throwing them into financial turmoil. Several companies with direct or indirect connections to FTX — including BlockFi, Voyager, Celsius, Genesis, and Gemini — went bankrupt in a matter of weeks. The cryptocurrency market saw its darkest period to date, resulting in a loss of more than $1 trillion, and Bitcoin’s price dropped below $18,000.\nThe CFTC filed a lawsuit against FTX and Alameda, alleging fraud and misrepresentations in publicizing FTX as a digital commodity asset platform.\nSam Bankman-Fried, co-founder of both crypto exchange FTX and trading firm Alameda Research, was sentenced to 25 years in prison and ordered to forfeit $11 billion in March 2024. He was convicted of seven counts of fraud, conspiracy, and money laundering. The young financier was once the poster boy for the emerging crypto industry before he joined the likes of Bernie Madoff as one of America’s biggest financial fraudsters ever.\nOur free, fast, and fun briefing on the global economy, delivered every weekday morning.","Related Stories\nBitcoin's price has been particularly volatile as of late.\nThe coin both rose and fell this week, at one point dropping by about 7% in a single hour alone. It has since bounced back somewhat, hovering near $59,000 as of Thursday morning, but that's still down from a $71,000 peak in June.\nThese recent movements in bitcoin's price serve as a stark reminder of how erratic the cryptocurrency can be and why financial planners often consider it a discretionary investment.\nAlthough bitcoin's price has roughly doubled in value since August 2023, it's not an appropriate investment for everyone, especially those with a lower risk tolerance. Bitcoin's frequent price fluctuations undermine its reliability as a store of value or as a hedge against inflation, at least in the short term.\nAnd without wider acceptance of bitcoin as a currency, its value seems to largely hinge on speculation and market sentiment, rather than intrinsic value. This makes it a risky asset compared with other investments, like stocks or bonds, which carry their own risks.\nSo, should it be part of your overall investment strategy? Financial planners differ in their opinions on if or how to incorporate it into your portfolio, but tend to agree it's a risky bet that shouldn't be the basis for your retirement savings.\nDespite the risks involved, some financial planners see value in purchasing bitcoin as a speculative asset, but only with money you'd be comfortable losing.\nUnlike other cryptocurrencies, bitcoin has a limited supply, which is why it's often seen as a commodity similar to scarce resources like gold. However, gold has a long history as a reliable store of value, as well as various uses in electronics, dentistry and jewelry. In contrast, bitcoin — which was created in 2008 — is much more speculative as a commodity.\n\"It's important to distinguish between essential and discretionary investments,\" says R.J. Weiss, a certified financial planner and founder of The Ways to Wealth. \"Bitcoin or other cryptocurrencies should not be the cornerstone of your retirement plan.\"\nFor most investors, a well-diversified portfolio that includes stocks and bonds will likely \"provide the steady growth needed for retirement,\" says Weiss.\nThat said, a small allocation to crypto — about 1% to 2% of your portfolio — can be considered \"if you have a strong interest and understand the risks,\" he says.\nIf you already have bitcoin holdings and the recent downturn in crypto prices is making you queasy, it might suggest your \"investment was too large or not well-aligned with your risk tolerance,\" says Weiss.\nOther experts take a hard line against cryptocurrency.\n\"I don't include bitcoin or any other cryptocurrencies in my clients' portfolios,\" says Jing Zheng, a CFP in Virginia. \"I view bitcoin as a commodity heavily influenced by market sentiment, without backing by tangible assets or government support. In that regard, how does one even predict its value and volatility?\"\nBitcoin is so risky that it shouldn't even be considered an investment — instead, it's simply speculation, says Jason Dall'Acqua, a CFP in Maryland.\n\"While speculating may be appropriate for small sums of money, investing is a more disciplined, prudent way to building wealth over time,\" says Jason Dall'Acqua, a CFP in Maryland.\n\"'Just say no' should be the mantra for investors when considering adding bitcoin to a portfolio,\" says Robert Johnson, professor of finance at Creighton University's Heider College of Business. \"It's pure, unadulterated speculation.\"\nWant to stop worrying about money? Sign up for CNBC's new online course Achieve Financial Wellness: Be Happier, Wealthier & More Financially Secure. We'll teach you the psychology of money, how to manage your stress and create healthy habits, and simple ways to boost your savings, get out of debt and invest for the future. Start today and use code EARLYBIRD for an introductory discount of 30% off through September 2, 2024.\nPlus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life."]}
{"date":"2024-08-09","titles":["CleanSpark posts $236M loss in fiscal Q3; partners with Coinbase on $50M credit line","Bitcoin bounces back after market jitters: Arthur Hayes forecasts $1 million","Bitcoin rallies back to $60,000 as tech stocks end their selloff","BTC TO USD - Today’s Bitcoin price in Dollar on 9 August, 2024","BTC TO PKR - Today’s Bitcoin price in Pakistan on August 9, 2024","Think the ASX has been volatile this week? Wait until you see the Bitcoin price"],"urls":["https:\/\/seekingalpha.com\/news\/4138362-cleanspark-posts-236m-loss-in-fiscal-q3-partners-with-coinbase-on-50m-credit-line","https:\/\/finance.yahoo.com\/news\/bitcoin-bounces-back-market-jitters-185248593.html","https:\/\/qz.com\/bitcoin-rebounds-to-60-0000-from-50-000-1851617756","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-usd-todays-bitcoin-price-in-dollar-on-9-august-2024\/","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-august-9-2024\/","https:\/\/www.fool.com.au\/2024\/08\/09\/think-the-asx-has-been-volatile-this-week-wait-until-you-see-the-bitcoin-price\/"],"sources":["Seeking Alpha","Yahoo Finance","Quartz India","BOL News","BOL News","Motley Fool Australia"],"descriptions":["CleanSpark (CLSK) reported a loss of $236.2M for fiscal Q3 2024 due to mark-to-market losses on bitcoin holdings and impairment on miners.","Despite fears of an impending recession earlier this week, analysts are again optimistic that bitcoin can reach $1 million.","The recovery of the stock market has had a positive impact on the crypto market, as fears of a potential recession have diminished","As of August 9, the Bitcoin to USD exchange rate stood at $60680.45. Bitcoin’s value in dollars reflects the dynamic nature of the","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16914262.54 on 9 August 2024","ASX 200 investors have endured a volatile week. But the ASX 200's movements pale against the Bitcoin (CRYPTO: BTC) price."],"article_contents":[null,"Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe price of bitcoin, the world’s largest cryptocurrency, briefly jumped above $62,000 on Friday morning, a marked upturn for a cryptocurrency that plunged below $50,000 on Monday as global markets were jolted by worries over a possible global recession.\nThe surge in bitcoin's performance was owed to better-than-expected U.S. unemployment insurance figures that were released this week. According to the U.S. Labor Department, last week only saw 233,000 unemployment claims, despite economist projections that the number would be higher.\nBitcoin also saw at least $91 billion in traded in trades, according to recent data from Coinglass.\nDespite Goldman Sachs increasing its U.S. recession forecast in 2025 to 25% from 15%, many analysts believe Monday’s jittery market might have been an overreaction, with the Federal Reserve likely to prop up the economy next month through interest rate cuts.\nMoreover, crypto entrepreneur and BitMEX’s ex-CEO Arthur Hayes predicts that bitcoin might even spike all the way up to $1 million during the current market cycle.\n“The bitcoin price in this cycle is going to go very, very high,” Hayes told DL News recently. “Hundreds of thousands of dollars, maybe $1 million.”\n“There’s so much debt that needs to be rolled over. We’re entering a period where the global monetary architecture is completely changing,” Hayes said. “We don’t know what it’s going to be, but the people who have made the most of the last 80 years are going to be very resistant to change.”\nHayes, however, pointed out that former president Donald Trump's bitcoin reserve proposal seemed improbable. \"I find it almost impossible that that will get done, even if Trump is elected,\" he said. \"You’re going to need to have a certain amount of people vote for this and if, you know, this is going to somehow negatively impact the U.S. Treasury or Fed or visibility to maintain a U.S. Treasury market.\"","Bitcoin has been experiencing extreme volatility recently, and it seems like the rollercoaster ride is not going to stop anytime soon. Earlier this week, the leading cryptocurrency’s price dropped from $70,000 to around $50,000. However, in less than a week, Bitcoin’s price has rebounded back to $60,000.\nOn Friday morning, the leading cryptocurrency was trading at around $60,000, marking a 4.5% increase in the past 24 hours. This recovery had a positive impact on the entire cryptocurrency market, with the second-largest cryptocurrency, Ether, gaining over 5.5% and reaching $2,600. Other major cryptocurrencies, such as BNB, Toncoin, and Dogecoin, also experienced recoveries, with gains of 3%, 3.5%, and 2.6%, respectively, in the past 24 hours.\nThe recovery in the cryptocurrency market is mainly attributed to the stock market’s resurgence on Thursday, which rallied after the release of better-than-expected job reports, alleviating concerns about a potential recession. The recent data indicates that the economic situation is not as dire as it appears, and the significant selloffs that occurred earlier this week were exaggerated.\nThe focus is now on the Federal Reserve, which might consider lowering interest rates if the positive economic data persists. This potential move could also affect the crypto market, as cryptocurrency is increasingly gaining acceptance in the mainstream. The recent resurgence in Bitcoin’s value has reignited speculation that it could reach $100,000 this year.\nOur free, fast, and fun briefing on the global economy, delivered every weekday morning.","09th Aug, 2024. 04:16 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 1, 2024\nAs of August 9, the Bitcoin to USD exchange rate stood at $60680.45. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 60680.45 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","09th Aug, 2024. 04:10 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16914262.54 on 9 August 2024.\n1 BTC = 16914262.54 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","Image source: Getty Images\nYou’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More\nYou might have thought the performance of the Australian share market was exceptionally volatile over the past week or so. But wait until you see what happened with the Bitcoin (CRYPTO: BTC) price.\nThings have certainly quietened down on the stock market over the past few trading days. But last Friday and this Monday's sessions were some of the most dramatic days the S&P\/ASX 200 Index (ASX: XJO) had seen in many years. After all, it's quite unusual to see the ASX 200 drop by more than 1.5%, let alone the 3.7% it crashed down on Monday.\nBut that's nothing compared to what happened to the Bitcoin price.\nOn Thursday last week, the flagship cryptocurrency was going for just under US$65,300.\nBut, after losing 5.94% on Friday, another 5.34% over the weekend, and then a horrid 7.1% on Monday, the Bitcoin price got to a low of US$49,825.\nThat's a four-day swing worth 23.69%.\nIn Australian dollar terms, this four-day journey saw Bitcoin go from $100,537 a coin on Thursday to a low of $76,900 by Monday. In AUD pricing, that's only a slightly less wild turnaround of 23.51%.\nBut since Monday, the Bitcoin price has rebounded almost as dramatically as it fell. Since that US$49,825 low point, Bitcoin has surged ever since, reaching a peak of US$62,353 earlier this morning. That's $92,652 in AUD pricing, representing a 23.1% improvement on what we saw back on Monday.\nThis journey that the Bitcoin price has been on over the past week alone underscores the intense volatility by which the cryptocurrency continues to be defined.\nFor comparison, the stock market hardly ever falls by more than 20% top to bottom. When it does, it is usually over a period of months, not days. The only times it has come close to experiencing what the Bitcoin price has in the past week was arguably back in the 1987 market crash and, before that, the 1929 crash that preceded the great depression.\nBitcoin's proponents often argue that virtual coins represent 'digital gold' of sorts. That's thanks to the artificially scarce supply of the coins themselves and the limited production capabilities that miners are constrained by.\nYet it seems that Bitcoin is a long way from becoming the 'safe-haven' asset that gold is often touted as. That's judging by the eye-watering volatility that was on display these past seven days.\nLet's see what the rest of August brings for the Bitcoin price.\nApril 9, 2025 |\n        Bernd Struben\nYou may have heard Bitcoin referred to as ‘digital gold’. But is it really a haven asset?\nRead more »\nMarch 31, 2025 |\n        Laura Stewart\nInterested in cryptocurrency?\nRead more »\nMarch 25, 2025 |\n        James Mickleboro\nWanting to gain exposure to the cryptocurrency? Check out these two options.\nRead more »\nMarch 8, 2025 |\n        Sebastian Bowen\nBitcoin has been a fantastic investment for me, but not without its pitfalls.\nRead more »\nMarch 5, 2025 |\n        Bernd Struben\nThe Bitcoin price hit all-time highs of US$109,115 on the day Trump was sworn into office.\nRead more »\nFebruary 12, 2025 |\n        Dominic Basulto\nBitcoin soared by 150% in 2023 and 120% in 2024, so many crypto investors are expecting it to once again…\nRead more »\nJanuary 16, 2025 |\n        Chris MacDonald\nToday's CPI report turns out to mean a great deal to crypto investors.\nRead more »\nDecember 17, 2024 |\n        Bernd Struben\nBitcoin just soared to new all-time highs. But why?\nRead more »\nNotifications\nScott Phillips just released his 5 best stocks to buy right now and you could grab the names of these stocks instantly!"]}
{"date":"2024-08-12","titles":["B.C. Securities Commission finds $13M in fraud by crypto trading platform","As macroeconomic fears mount, bitcoin faces another test","B.C. Securities Commission finds $13-million in fraud by crypto trading platform","B.C. Securities Commission finds $13M in fraud by crypto trading platform","B.C. Securities Commission finds $13M in fraud by crypto trading platform","B.C. Securities Commission finds $13M in fraud by crypto trading platform","B.C. Securities Commission finds $13M in fraud by crypto trading platform","B.C. Securities Commission finds $13M in fraud by crypto trading platform","B.C. Securities Commission finds $13M in fraud by crypto trading platform","B.C. Securities Commission finds $13M in fraud by crypto trading platform"],"urls":["https:\/\/www.caledoniacourier.com\/news\/bc-securities-commission-finds-13m-in-fraud-by-crypto-trading-platform-7482847","https:\/\/finance.yahoo.com\/news\/macroeconomic-fears-mount-bitcoin-faces-193310385.html","https:\/\/www.theglobeandmail.com\/business\/article-bc-securities-commission-finds-13-million-in-fraud-by-crypto-trading\/","https:\/\/www.baytoday.ca\/business\/bc-securities-commission-finds-13m-in-fraud-by-crypto-trading-platform-9340785","https:\/\/ca.finance.yahoo.com\/news\/b-c-securities-commission-finds-184715492.html","https:\/\/www.guelphtoday.com\/national-business\/bc-securities-commission-finds-13m-in-fraud-by-crypto-trading-platform-9340785","https:\/\/www.elliotlaketoday.com\/national-business\/bc-securities-commission-finds-13m-in-fraud-by-crypto-trading-platform-9340785","https:\/\/www.bradfordtoday.ca\/national-business\/bc-securities-commission-finds-13m-in-fraud-by-crypto-trading-platform-9340785","https:\/\/www.sootoday.com\/national-business\/bc-securities-commission-finds-13m-in-fraud-by-crypto-trading-platform-9340785","https:\/\/www.thestar.com\/news\/canada\/b-c-securities-commission-finds-13m-in-fraud-by-crypto-trading-platform\/article_0a9db832-0252-5e65-9919-41a6a3f9c383.html"],"sources":["Caledonia Courier","Yahoo Finance","The Globe and Mail","BayToday","Yahoo Canada Finance","GuelphToday","ElliotLakeToday.com","BradfordToday","SooToday","Toronto Star"],"descriptions":["Panel finds crypto assets deposited with ezBtc diverted to gambling sites or personal accounts","Rising volatility is challenging bitcoin's potential to serve as a hedge against swings in traditional assets","The panel found about a third of all the crypto assets that customers deposited with the platform between 2016 and 2019 were diverted","VANCOUVER — A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to gambling and personal accounts.","VANCOUVER — A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to gambling and personal accounts.","VANCOUVER — A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to gambling and personal accounts.","VANCOUVER — A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to gambling and personal accounts.","VANCOUVER — A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to gambling and personal accounts.","VANCOUVER — A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to gambling and personal accounts.","VANCOUVER - A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to"],"article_contents":[null,"Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAs economic uncertainties loom over traditional financial markets, the intersection of crypto and traditional finance is becoming more crucial than ever.\nRoundtable anchor, Rob Nelson, recently led a discussion featuring Jon Najarian, Co-Founder at Market Rebellion, and David Gokhshtein, Founder and Executive Chairman of Gokhshtein Media, where they explored this dynamic. While Najarian highlighted the Federal Reserve's role and the potential warning signs of a recession, Gokhshtein emphasized bitcoin's historical role as a hedge against financial instability. Recently, however, it appears that role might be breaking down.\nNelson kicked off the conversation by probing Najarian on the possible convergence between traditional finance and crypto markets. This year, bitcoin has usually sold off along with stocks whenever vocality has struck the market. Perhaps that shouldn't be surprising as Wall Street giants embrace Bitcoin via ETFs.\nNajarian pointed out that the Federal Reserve's transparency has evolved, with more vocal members than in the past. However, this hasn't quelled recession fears, especially with the yield curve inversion — often a harbinger of recession. \"The panic now is that when we saw the two-year versus 10-year invert as it did... that's supposed to signal that a recession is a possibility,\" Najarian noted.\nHe also underscored the market's current jitters, particularly with the yield on the 10-year Treasury bond dropping below 3.7%, also signaling a potential recession. Najarian believes that the less yield available, the better it could be for bitcoin, as investors might seek refuge in digital assets amid declining confidence in traditional markets.\nNelson then shifted the discussion to whether the U.S. is indeed headed for a recession. Najarian expressed uncertainty but stressed that any downturn might not be directly caused by the Fed. Instead, he argued, the prolonged yield curve inversion indicates deep-rooted concerns about the economy, concerns that are only now getting the attention they deserve.\nTurning to Gokhshtein, Nelson explored the idea of bitcoin as a hedge against traditional financial turmoil. Gokhshtein echoed the thesis from notable investor Cathie Wood — that investors should consider bitcoin as a portfolio hedge, especially if economic conditions worsen. He argued that as traditional markets become more volatile, the role of digital assets like bitcoin could become increasingly appealing.","This article was published more than 6 months ago. Some information may no longer be current.\nA panel of the British Columbia Securities Commission says the company operating under the name ezBtc and incorporated by then-B.C. resident David Smillie told customers their bitcoins would be held in 'cold storage,' a more secure method of keeping digital assets offline.Kin Cheung\/The Associated Press\nA panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13-million in assets to gambling and personal accounts.\nThe commission says the company operating under the name ezBtc and incorporated by then-B.C. resident David Smillie told customers their bitcoins would be held in “cold storage,” a more secure method of keeping digital assets offline.\nInstead, the panel found about a third of all the crypto assets that customers deposited with the platform between 2016 and 2019 were diverted to gambling sites or to Mr. Smillie’s personal accounts on other crypto trading platforms.\nThe commission says in a statement issued Monday that it hired a forensic data analytics firm to determine what happened to the cryptocurrency, and some of it was “quickly transferred” either to Mr. Smillie’s accounts or two gambling websites.\nIt says the panel found that Mr. Smillie directed the affairs of ezBtc, and by authorizing the company’s misconduct, he committed the same misconduct as the platform.\nThe commission says the company was dissolved in 2022 and didn’t take part in the hearing, and while Mr. Smillie didn’t attend, he was represented by a lawyer.\nIt says the panel will next consider what sanctions to impose, which could be monetary or bans from market participation.\nReport an editorial error\nReport a technical issue","VANCOUVER — A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to gambling and personal accounts.\nThe commission says the company operating under the name ezBtc and incorporated by then-B.C. resident David Smillie told customers their bitcoins would be held in \"cold storage,\" a more secure method of keeping digital assets offline.\nInstead, the panel found about a third of all the crypto assets that customers deposited with the platform between 2016 and 2019 were diverted to gambling sites or to Smillie's personal accounts on other crypto trading platforms.\nThe commission says in a statement issued Monday that it hired a forensic data analytics firm to determine what happened to the cryptocurrency, and some of it was \"quickly transferred\" either to Smillie's accounts or two gambling websites.\nIt says the panel found that Smillie directed the affairs of ezBtc, and by authorizing the company's misconduct, he committed the same misconduct as the platform.\nThe commission says the company was dissolved in 2022 and didn't take part in the hearing, and while Smillie didn't attend, he was represented by a lawyer.\nIt says the panel will next consider what sanctions to impose, which could be monetary or bans from market participation.\nThis report by The Canadian Press was first published Aug. 12, 2024.\nThe Canadian Press\nCheck out Village Report - the news that matters most to Canada, updated throughout the day.  Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.\nSubscribe",null,"VANCOUVER — A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to gambling and personal accounts.\nThe commission says the company operating under the name ezBtc and incorporated by then-B.C. resident David Smillie told customers their bitcoins would be held in \"cold storage,\" a more secure method of keeping digital assets offline.\nInstead, the panel found about a third of all the crypto assets that customers deposited with the platform between 2016 and 2019 were diverted to gambling sites or to Smillie's personal accounts on other crypto trading platforms.\nThe commission says in a statement issued Monday that it hired a forensic data analytics firm to determine what happened to the cryptocurrency, and some of it was \"quickly transferred\" either to Smillie's accounts or two gambling websites.\nIt says the panel found that Smillie directed the affairs of ezBtc, and by authorizing the company's misconduct, he committed the same misconduct as the platform.\nThe commission says the company was dissolved in 2022 and didn't take part in the hearing, and while Smillie didn't attend, he was represented by a lawyer.\nIt says the panel will next consider what sanctions to impose, which could be monetary or bans from market participation.\nThis report by The Canadian Press was first published Aug. 12, 2024.\nThe Canadian Press\nCheck out Village Report - the news that matters most to Canada, updated throughout the day.  Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.\nSubscribe","VANCOUVER — A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to gambling and personal accounts.\nThe commission says the company operating under the name ezBtc and incorporated by then-B.C. resident David Smillie told customers their bitcoins would be held in \"cold storage,\" a more secure method of keeping digital assets offline.\nInstead, the panel found about a third of all the crypto assets that customers deposited with the platform between 2016 and 2019 were diverted to gambling sites or to Smillie's personal accounts on other crypto trading platforms.\nThe commission says in a statement issued Monday that it hired a forensic data analytics firm to determine what happened to the cryptocurrency, and some of it was \"quickly transferred\" either to Smillie's accounts or two gambling websites.\nIt says the panel found that Smillie directed the affairs of ezBtc, and by authorizing the company's misconduct, he committed the same misconduct as the platform.\nThe commission says the company was dissolved in 2022 and didn't take part in the hearing, and while Smillie didn't attend, he was represented by a lawyer.\nIt says the panel will next consider what sanctions to impose, which could be monetary or bans from market participation.\nThis report by The Canadian Press was first published Aug. 12, 2024.\nThe Canadian Press\nCheck out Village Report - the news that matters most to Canada, updated throughout the day.  Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.\nSubscribe","VANCOUVER — A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to gambling and personal accounts.\nThe commission says the company operating under the name ezBtc and incorporated by then-B.C. resident David Smillie told customers their bitcoins would be held in \"cold storage,\" a more secure method of keeping digital assets offline.\nInstead, the panel found about a third of all the crypto assets that customers deposited with the platform between 2016 and 2019 were diverted to gambling sites or to Smillie's personal accounts on other crypto trading platforms.\nThe commission says in a statement issued Monday that it hired a forensic data analytics firm to determine what happened to the cryptocurrency, and some of it was \"quickly transferred\" either to Smillie's accounts or two gambling websites.\nIt says the panel found that Smillie directed the affairs of ezBtc, and by authorizing the company's misconduct, he committed the same misconduct as the platform.\nThe commission says the company was dissolved in 2022 and didn't take part in the hearing, and while Smillie didn't attend, he was represented by a lawyer.\nIt says the panel will next consider what sanctions to impose, which could be monetary or bans from market participation.\nThis report by The Canadian Press was first published Aug. 12, 2024.\nThe Canadian Press\nCheck out Village Report - the news that matters most to Canada, updated throughout the day.  Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.\nSubscribe","VANCOUVER — A panel of the British Columbia Securities Commission has found a cryptocurrency trading platform and its owner lied to customers and diverted about $13 million in assets to gambling and personal accounts.\nThe commission says the company operating under the name ezBtc and incorporated by then-B.C. resident David Smillie told customers their bitcoins would be held in \"cold storage,\" a more secure method of keeping digital assets offline.\nInstead, the panel found about a third of all the crypto assets that customers deposited with the platform between 2016 and 2019 were diverted to gambling sites or to Smillie's personal accounts on other crypto trading platforms.\nThe commission says in a statement issued Monday that it hired a forensic data analytics firm to determine what happened to the cryptocurrency, and some of it was \"quickly transferred\" either to Smillie's accounts or two gambling websites.\nIt says the panel found that Smillie directed the affairs of ezBtc, and by authorizing the company's misconduct, he committed the same misconduct as the platform.\nThe commission says the company was dissolved in 2022 and didn't take part in the hearing, and while Smillie didn't attend, he was represented by a lawyer.\nIt says the panel will next consider what sanctions to impose, which could be monetary or bans from market participation.\nThis report by The Canadian Press was first published Aug. 12, 2024.\nThe Canadian Press\nCheck out Village Report - the news that matters most to Canada, updated throughout the day.  Or, subscribe to Village Report's free daily newsletter: a compilation of the news you need to know, sent to your inbox at 6AM.\nSubscribe",null]}
{"date":"2024-08-13","titles":["Bitcoin on exchanges falls to a new low and may signal a major price spike","HIVE Digital unexpectedly swings to profit in fiscal Q1 as hashrate climbs","Coinbase resumes operations in Hawaii after seven-year absence","A US Bitcoin reserve would do much for Bitcoin and little for taxpayers","Crypto markets on edge as Harris victory odds rise above Trump: Bernstein","The Impact of Cryptocurrency on the Energy Market and Environment","BTC TO PKR - Today’s Bitcoin price in Pakistan on August 13, 2024","Will Bitcoin Halving Influence iGaming? SOFTSWISS H1'2024 Overview"],"urls":["https:\/\/finance.yahoo.com\/news\/bitcoin-exchanges-falls-low-may-225747745.html","https:\/\/seekingalpha.com\/news\/4139380-hive-digital-unexpectedly-swings-to-profit-in-fiscal-q1-as-hashrate-climbs","https:\/\/seekingalpha.com\/news\/4139322-coinbase-resumes-operations-in-hawaii-after-seven-year-absence","https:\/\/thehill.com\/opinion\/finance\/4824059-senator-lummis-proposal-bitcoin-reserve\/","https:\/\/seekingalpha.com\/news\/4139160-crypto-markets-on-edge-as-harris-victory-odds-climb-bernstein","https:\/\/finance.yahoo.com\/news\/impact-cryptocurrency-energy-market-environment-130200655.html","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-august-13-2024\/","https:\/\/jimmyspost.com\/will-bitcoin-halving-influence-igaming-softswiss-h12024-overview"],"sources":["Yahoo Finance","Seeking Alpha","Seeking Alpha","The Hill","Seeking Alpha","Yahoo Finance","BOL News","Jimmys Post"],"descriptions":["A record low amount of bitcoin on exchanges indicates a bullish trend, potentially leading to new all-time highs.","HIVE Digital Technologies exceeded analyst estimates with strong Q1 earnings, boosted by increased bitcoin hashrate and higher BTC price.","Coinbase Global (COIN) announces the restart of cryptocurrency trading and staking services for Hawaii residents after a seven-year hiatus.","Once the facts are understood, no U.S. taxpayer without Bitcoins would support a proposal to use their tax dollars to bolster its price.","Investor sentiment in the crypto market shifts as Vice President Kamala Harris's odds of winning the presidential election surpass those of Donald Trump.","While cryptocurrency has had a negative impact on energy consumption through its existence, recent years show large progress in becoming energy efficient.","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16407544.65 on 14 August 2024","The second quarter of 2024 was marked by a historical event: the Bitcoin halving. Did this event affect the iGaming market? SOFTSWISS shares insights in its"],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin's presence on centralized exchanges has hit a historic low, signaling a shift that could set the stage for a significant price surge. Austin Arnold, Host of Altcoin Daily, recently highlighted this critical development, suggesting that this trend might indicate a bullish future for the leading cryptocurrency.\nArnold pointed out that the sharp decline in bitcoin's presence on exchanges is a strong indicator of a bullish market. When investors move their bitcoin off exchanges, they are typically signaling an intent to hold rather than sell. This movement of bitcoin into cold storage suggests that holders are confident in the asset's long-term value and are not looking to liquidate in the near future.\nThe data backing this trend comes from CoinGlass, a reputable blockchain data aggregator. Arnold explained that following a recent dip where bitcoin briefly dropped to just under $50,000, a swift recovery to around $60,000 occurred as investors quickly bought the dip. This rapid bounce back indicates that the selling pressure may have been exhausted, leaving the market ripe for a potential supply shock.\nArnold emphasized that institutional interest in bitcoin is at an unprecedented level. For the first time, large entities are not only buying in but are also required to disclose their purchases. This transparency reveals a steady accumulation of bitcoin, further reducing the available supply on exchanges. While not every buyer needs to disclose their holdings, the visible trend is clear: Bitcoin is being moved off exchanges in significant quantities.\nThis decreasing supply on exchanges, coupled with continued institutional buying, sets the stage for what Arnold predicts could be a major price increase. As supply tightens and demand remains strong, the market could experience a supply squeeze, driving bitcoin's price beyond its previous all-time highs. Arnold forecasts that this could propel bitcoin to new heights, possibly surpassing the $100,000 mark in the near future.",null,null,null,null,"Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nHey there! My name is Logical Thesis and I'm a writer for WOLF Financial. If you are looking for more investing related content, I guarantee you’ll enjoy my content on 𝕏, @LogicalThesis. Thanks for reading!\nCryptocurrency, especially Bitcoin, has significantly impacted the energy market and the environment. The process of mining, which validates transactions and secures the blockchain, consumes vast amounts of electricity. In 2021, Bitcoin's energy usage was comparable to that of entire nations like Argentina, raising concerns about its environmental footprint. This energy-intensive process primarily relies on fossil fuels, thereby increasing greenhouse gas emissions and contributing to climate change.\nEnvironmental Concerns\nThe environmental ramifications of cryptocurrency mining go beyond mere energy consumption. Mining hardware, such as ASIC (Application-Specific Integrated Circuit) devices, has a limited lifespan, which contributes to electronic waste. Additionally, the mining process generates substantial heat, necessitating cooling systems that further escalate energy use.\nImprovements in Cryptocurrency Mining\nThe cryptocurrency community and industry stakeholders have made several improvements over the years:\nTransition to Renewable Energy: A growing number of mining operations are now powered by renewable energy sources such as hydro, solar, and wind. This shift is partly driven by economic incentives, as renewable energy can be cheaper and more sustainable in the long term. Initiatives like the Crypto Climate Accord aim to make blockchains run on 100% renewable energy by 2025 and achieve net-zero emissions by 2040.\nMore Efficient Mining Hardware: Advances in mining technology have led to more energy-efficient hardware. Modern ASIC miners consume less power per hash, reducing the overall energy consumption for the same amount of computational work.\nProof-of-Stake (PoS) Mechanism: Some cryptocurrencies, like Ethereum, are transitioning from the energy-intensive Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoS). PoS significantly reduces energy consumption by selecting validators based on the number of coins they hold and are willing to \"stake\" as collateral, rather than through computational work. Ethereum's transition to proof-of-stake (PoS) in 2022 reduced its energy consumption by approximately 99.95%​​.\nSecond-Layer Solutions: Technologies like the Lightning Network for Bitcoin aim to reduce the number of on-chain transactions by enabling faster and cheaper transactions off-chain, thus lowering the overall energy consumption associated with the network.\nFuture Outlook\nThe future of cryptocurrency in relation to energy and the environment appears promising, thanks to ongoing innovations and heightened sustainability awareness. As more mining operations transition to renewable energy, the carbon footprint of cryptocurrencies is expected to decrease. The broader adoption of PoS and other less energy-intensive consensus mechanisms will continue to mitigate environmental concerns.\nFurthermore, regulatory frameworks are set to play a crucial role in shaping the industry. Governments and international bodies are increasingly acknowledging the need for sustainable practices within the crypto sector and may introduce regulations that encourage or mandate the use of green energy and efficient technologies.\nIn conclusion, although cryptocurrency has presented significant challenges to the energy market and the environment, concerted efforts to adopt sustainable practices and technological advancements are paving the way for a greener future. The ongoing evolution of the industry suggests a more balanced and environmentally conscious approach to digital currencies in the years ahead.\nDisclaimer: This service is for general informational and educational purposes only and is not intended to constitute legal, tax, accounting or investment advice. These are my opinions and observations only. I am not a financial advisor.","13th Aug, 2024. 03:07 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16407544.65 on 13 August 2024.\n1 BTC = 16407544.65 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.",null]}
{"date":"2024-08-14","titles":["Staying patient during bitcoin market swings is crucial, experts say","Trump's election chances could drive bitcoin's price to $85,000, says Jon Najarian"],"urls":["https:\/\/finance.yahoo.com\/news\/staying-patient-during-bitcoin-market-142105896.html","https:\/\/finance.yahoo.com\/news\/trumps-election-chances-could-drive-140931912.html"],"sources":["Yahoo Finance","Yahoo Finance"],"descriptions":["As Bitcoin's volatility raises questions, experts advise new investors educate themselves to understand market dynamics","The battle between Kamala Harris and Donald Trump is directly impacting bitcoin's price, says Jon Najarian"],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin's recent market fluctuations have left many retail investors questioning their market exposure and the broader implications for their portfolios.\nIn a recent discussion, Roundtable anchor Rob Nelson, David Duong from Coinbase, Noah Newton from Moby Media, and Kelly Kellam from BitLab Academy shared insights on the current state of the crypto market. Their discussion highlighted the importance of understanding market dynamics, staying patient, and maintaining a long-term perspective for those managing the unpredictable world of crypto investments.\nNelson kicked off the conversation by addressing the recent market activity surrounding bitcoin. He noted that while the last few weeks have been tumultuous, those familiar with the space might view it differently than new investors who may be experiencing their first taste of volatility. Rob then turned to Coinbase's David Duong to shed light on what’s happening at the exchange level.\nDuong explained that the initial chaos in August was driven more by macroeconomic factors than by anything specifically related to crypto. Events like the Bank of Japan hiking rates and fears of a global recession triggered strong reactions across various markets, including cryptocurrencies. However, Duong observed that the market is beginning to stabilize as extreme leverage and positioning are being unwound, suggesting a more moderate climate ahead.\nNoah Newton provided advice for those new to the crypto space, emphasizing a long-term perspective. He shared that among friends and family, he only recommends bitcoin and ethereum due to his strong conviction in their value. Newton advised that if one does not have a five to ten-year time horizon, they should reconsider investing in these assets. He also highlighted the importance of not getting too caught up in daily price movements and instead focusing on the bigger picture.\nKelly Kellam echoed Newton’s sentiment, stressing the importance of education and patience. He pointed out that many investors lock themselves into short-term thinking, which only heightens stress and emotional reactions to market movements. Kellam recommended that investors zoom out and look at the market cycles over the last 14 years to gain perspective. He advised against overanalyzing every price movement and instead suggested focusing on long-term trends, such as the 200 moving average on a weekly basis.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAs the 2024 election approaches, bitcoin's future remains a key topic of debate.\nIn a recent discussion led by Roundtable anchor Rob Nelson, Jon Najarian, Co-Founder at Market Rebellion and Gokhshtein Media founder David Gokhshtein, a trio of experts discussed bitcoin’s potential year-end performance.\nWith the U.S. presidential election on the horizon, they highlighted how political outcomes could significantly impact bitcoin's trajectory in the coming months.\nNelson began the discussion by asking Jon Najarian whether recent price movements had altered his earlier predictions. Najarian confidently maintained his forecast, suggesting that bitcoin could reach approximately $85,000 by the end of the year. He emphasized the role of the political climate, particularly the potential impact of a Trump victory, as a significant factor that could drive bitcoin’s value higher. Najarian pointed to the stark differences between the candidates on their stance toward bitcoin, noting that a pro-bitcoin Trump presidency could significantly influence the market.\nDavid Gokhshtein echoed Najarian's outlook, estimating that bitcoin could rise to between $80,000 and $85,000, with a lower bound of $70,000. Gokhshtein also stressed the influence of Trump’s stance, asserting that the former president's bullish and unfiltered attitude toward crypto could be a major catalyst for bitcoin. He highlighted that Trump’s support for bitcoin, free from external influence, could play a crucial role in shaping market sentiment.\nVice President Kamala Harris has yet to make a formal policy position clear. Democrats who are pro-crypto say that she too will announce a pro-crypto shift ahead of the election.\nAs the year unfolds, the intersection of bitcoin and politics will be closely watched, with many hoping for a significant rally in the digital currency despite the unpredictable landscape ahead."]}
{"date":"2024-08-15","titles":["Billionaires Are Buying This Cryptocurrency That Could Soar 20,000%, According to MicroStrategy Executive Chairman Michael Saylor","What's happening with the Bitcoin price amid the stock market volatility?"],"urls":["https:\/\/finance.yahoo.com\/news\/billionaires-buying-cryptocurrency-could-soar-093000855.html","https:\/\/www.fool.com.au\/2024\/08\/15\/whats-happening-with-the-bitcoin-price-amid-the-stock-market-volatility\/"],"sources":["Yahoo Finance","Motley Fool Australia"],"descriptions":["Bitcoin could soar in price over the next decade. But that's not the only reason billionaires are buying Bitcoin.","The Bitcoin (CRYPTO: BTC) price hasn’t been immune to the volatility roiling global stock markets. Here’s what you need to know."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nDespite the price of Bitcoin (CRYPTO: BTC) struggling to stay above $60,000 these days, many top investors remain confident that the world's most popular cryptocurrency will eventually reach a price of $1 million or higher. In fact, at last month's Bitcoin 2024 conference in Nashville, Tennessee, MicroStrategy (NASDAQ: MSTR) Executive Chairman Michael Saylor predicted that Bitcoin could hit a price of $13 million by the year 2045.\nAt current prices, that would represent an eye-popping gain of more than 20,000%. Against this backdrop, it's perhaps not surprising that billionaires -- including some who were once longtime crypto skeptics -- are now lining up to buy more Bitcoin. But the opportunity for huge returns is not their only incentive.\nWho wouldn't want to buy a digital asset that could soar in value by 20,000% during the next decade or two?\nYou might want to take Saylor's recent Bitcoin price predictions with a grain of salt. He is one of the biggest Bitcoin bulls, and he has a vested interest in getting as many investors as possible excited about the future growth potential of Bitcoin. After all, the company that he runs is now the largest corporate holder of Bitcoin in the world.\nBut Saylor is not alone. A growing number of high-profile investors have put out price forecasts of $1 million or higher for Bitcoin. Cathie Wood of Ark Invest, for example, now thinks that Bitcoin is headed to $3.8 million by 2030. Investment firm Bernstein has put out a $1 million price forecast for Bitcoin for the year 2033. And plenty of smart folks in Silicon Valley are attracted to Bitcoin's underlying digital technology and are now suggesting that Bitcoin could hit $1 million or more.\nAnd investors are looking beyond Bitcoin's value as a speculative asset. They also view it as a potential hedge against political, economic, and geopolitical risk. Billionaire hedge fund manager Paul Tudor Jones, for example, has likened Bitcoin to gold for this reason. If investors are concerned about what's going to happen next, he says, they should think about buying Bitcoin.\nAccording to Jones, there are two reasons to be particularly concerned right now. One is the geopolitical situation in the Middle East and the risks of a regional war. The other is the domestic macroeconomic situation. As he sees it, U.S. government debt levels are reaching unsustainable levels, and investing in Bitcoin is one way to insulate your portfolio from a worst-case economic scenario.\nFinally, billionaire investors are looking to Bitcoin as a long-term store of value. For example, billionaire hedge fund manager Stanley Druckenmiller now views Bitcoin as being similar to gold in this regard. In fact, he refers to Bitcoin as an upstart that could displace gold as the market leader.\nWill Bitcoin eventually displace gold as the preferred long-term store of value? A lot of smart people on Wall Street seem to think so. In 2022, Wall Street investment bank Goldman Sachs suggested that Bitcoin might eventually control as much as half of the store-of-value market. And Cathie Wood's bullish crypto forecasts also call for Bitcoin winning a rising share of the store-of-value market.\nOf course, there's always a chance that the billionaires are wrong. After the recent crypto flash crash in early August, when Bitcoin lost 15% of its value overnight, all the usual critics were out in force.\nThey suggested that Bitcoin had a better chance of going to zero than of going to $1 million. They suggested that investors putting their money into the new spot Bitcoin ETFs are engaged in a massive speculative frenzy. They suggested that Bitcoin was a risk asset just like every other risk asset, offering no particular safety during a market meltdown.\nFair enough. Those are all legitimate arguments. If you are investing in Bitcoin, you should at least be aware of what the Bitcoin bears are saying.\nBut over the long run, my money is with the billionaires. They are the ones now creating new investment products for Bitcoin, and they are the ones helping to build the regulatory and legal framework that will enable Bitcoin to thrive.\nBefore you buy stock in Bitcoin, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bitcoin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $711,657!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of August 12, 2024\nDominic Basulto has positions in Bitcoin. The Motley Fool has positions in and recommends Bitcoin. The Motley Fool has a disclosure policy.\nBillionaires Are Buying This Cryptocurrency That Could Soar 20,000%, According to MicroStrategy Executive Chairman Michael Saylor was originally published by The Motley Fool","Image source: Getty Images\nYou’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More\nThe Bitcoin (CRYPTO: BTC) price hasn't been immune to the volatility roiling global stock markets.\nTo say the least.\nOver the last 24 hours, Bitcoin is down 4.0% to US$58,316 (AU$88,161), according to data from CoinMarketCap. That gives the world's biggest cryptocurrency a market cap of US$1.15 trillion.\nWhile the Bitcoin price is up 103% since this time last year, it's down 21% from the all-time high of US$73,750, notched on 14 March this year.\nEthereum (CRYPTO: ETH), the second-biggest crypto with a market cap of US$319 billion, is holding up a little better today. The Ethereum price is down 1.7% over 24 hours, trading for US$2,654.\nThis sees the Ethereum price up 47% over 12 months. But the world's number two crypto is still down 46% from its own all-time high of US$4,892, which it reached all the way back on 16 November 2021.\nDespite the sizeable 24-hour retrace, the Bitcoin price remains up 1.5% over the past seven days. That trailed the 7.9% one-week gain delivered by the Ethereum price.\nAs for that volatility, over the past 30 days Bitcoin has traded at lows of US$49,121 and highs of US$69,988.\nSo, while the one-year gains may be impressive, the token is certainly not living up to its billing as digital gold.\nOver the past 30 days the gold price, by comparison, traded at a low of US$2,365 per ounce and a high of US$2,473 per ounce. The yellow metal is currently fetching US$2,452 per ounce.\nAs you'd expect, some of the wildest volatility for crypto investors came in early August. That's when the S&P\/ASX 200 Index (ASX: XJO) and global stock markets were whipsawing by several percentage points on a daily basis.\nNow, when we're talking about the ASX 200 or the S&P 500 Index (SP: .INX) a daily move of 3% to 4% is considered huge.\nNot so for cryptos.\nOn 5 August, a day that saw the ASX 200 plunge by 3.7%, the Bitcoin price dropped from US$60,873 to US$49,843 over a 24-hour period. That's an 18.1% loss in a single day.\nWhile Bitcoin has since rebounded 17.0% from that low, investors looking for exposure will need to be able to stomach these kinds of outsized price swings.\nASX 200 investors looking for exposure to the Bitcoin price without buying the crypto themselves might want to consider the VanEck Bitcoin ETF (ASX: VBTC).\nThe exchange-traded fund (ETF) made its debut on the ASX in June.\nThe VanEck Bitcoin spot ETF is intended to mimic the Bitcoin market price.\nVanEck Asia Pacific CEO Arian Neiron explained said VBTC \"makes Bitcoin more accessible by managing all the back-end complexity\".\nNeiron added that \"understanding the technical aspects of acquiring, storing and securing digital assets is no longer necessary\".\nApril 9, 2025 |\n        Bernd Struben\nYou may have heard Bitcoin referred to as ‘digital gold’. But is it really a haven asset?\nRead more »\nMarch 31, 2025 |\n        Laura Stewart\nInterested in cryptocurrency?\nRead more »\nMarch 25, 2025 |\n        James Mickleboro\nWanting to gain exposure to the cryptocurrency? Check out these two options.\nRead more »\nMarch 8, 2025 |\n        Sebastian Bowen\nBitcoin has been a fantastic investment for me, but not without its pitfalls.\nRead more »\nMarch 5, 2025 |\n        Bernd Struben\nThe Bitcoin price hit all-time highs of US$109,115 on the day Trump was sworn into office.\nRead more »\nFebruary 12, 2025 |\n        Dominic Basulto\nBitcoin soared by 150% in 2023 and 120% in 2024, so many crypto investors are expecting it to once again…\nRead more »\nJanuary 16, 2025 |\n        Chris MacDonald\nToday's CPI report turns out to mean a great deal to crypto investors.\nRead more »\nDecember 17, 2024 |\n        Bernd Struben\nBitcoin just soared to new all-time highs. But why?\nRead more »\nNotifications\nScott Phillips just released his 5 best stocks to buy right now and you could grab the names of these stocks instantly!"]}
{"date":"2024-08-16","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-08-19","titles":["Bitcoin is poised for $250,000 despite volatility, per analyst","Is this the beginning of the end for Bitcoin's dominance in crypto?"],"urls":["https:\/\/finance.yahoo.com\/news\/bitcoin-poised-250-000-despite-205211114.html","https:\/\/finance.yahoo.com\/news\/beginning-end-bitcoins-dominance-crypto-135244649.html"],"sources":["Yahoo Finance","Yahoo Finance"],"descriptions":["This market cycle, bitcoin's price has already moved more quickly in a positive direction than in previous cycles.","Bitcoin's share of the overall crypto market might be reaching a local top, according to one of crypto's leading investment firms"],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin's ongoing volatility has long been a point of concern for investors, but swings to the downside can be just as intense to the upside. If prior cycles are any indication, a blow-off-the-top rally could have $250,000 in play over the coming years.\nFirst of all, bitcoin's price movement this cycle has already moved more quickly in a positive direction this year than in previous cycles. This is thanks, in part, to the U.S. Securities and Exchange Commission's (SEC) approval of bitcoin exchange-traded funds (ETFs) this January, which have driven record inflows to the world's largest cryptocurrency by market cap. Institutional adoption of bitcoin ETFs has mushroomed, with major Wall Street players like Goldman Sachs entering the bitcoin investment scene.\nGoldman Sachs, for example, now maintains a $418 million exposure to bitcoin ETFs, and other institutions on Wall Street are expected to closely follow in its footsteps as growth accelerates.\nIt's not far-fetched for bitcoin to break $250,000 in the coming years, given the macroeconomic factors driving positive price momentum of the world's largest cryptocurrency and renewed confidence around bitcoin. Surging political interest in bitcoin – from former president Donald Trump and other political heavyweights – will also keep focused attention on bitcoin and alternative cryptocurrencies, potentially influencing its price over the election cycle.\nBitcoin's low this cycle has been $15,000, but in 2021, bitcoin broke past $65,000, stunning investors worldwide. On the whole, bitcoin will likely scale a similar upward price trajectory this year, making potential price apexes of $250,000 reasonable. In previous cycles, it took approximately 200 to 250 days to break through, but 2024 has already been a transformative year, and could continue on a positive price path.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin's run in consolidating its share of the overall crypto market might be losing steam, according to one of crypto's top investing firms.\nThe largest crypto by market cap, Bitcoin, has enjoyed a nice boost from the debut of Bitcoin ETFs this year, but Pantera Capital Portfolio Manager Cosmo Jiang says now might be the time to watch for a rotation into the coins beyond Bitcoin.\nBitcoin currently accounts for about 57% of crypto's $2 trillion market cap — the highest level since March of 2021.\n\"Bitcoin dominance has continued to go up, if we look at prior cycles the reality is Bitcoin dominance usually does go up,\" Jiang said, pointing out Bitcoin's surge of 19 percentage points of dominance is in line with prior cycles. \"I do think we're at a point where we are closer certainly to the longer tail tokens taking off and really outperforming. But again this all hinges on the fundamentals of these protocols.\"\nHistorically, it takes time during a bull cycle for interest in Bitcoin to trickle down to other crypto projects. As Jiang pointed out, that trickle could be larger if excitement from Bitcoin ETFs continues to play out. Portfolio managers at big banks like Morgan Stanley recently got the green light to start selling Bitcoin ETFs to clients, and that could further boost attention into other crypto projects.\nPantera, for its part, has bet heavily on Telegram's TON coin — making it its largest investment into a blockchain's coin in history. Part of the bet is that Telegram already has millions of users, and simply by putting blockchain tech on the backend could result in even higher usage. Other projects are pursuing similar strategies by abstracting away the need for users to even need tokens or crypto wallets.\n\"It's the fact that if we do believe that these protocols are going from tens of millions of users to billions of users over time, those tokens will be worth more over time and almost definitionally worth way more than Bitcoin, which has already grown penetration by quite a lot,\" Jiang said. \"I'm hopeful that these green shoots on the altcoins will start to bear fruit in the form of better fundamentals, which should translate to price action. We just have to be patient and wait to see that play out.\""]}
{"date":"2024-08-20","titles":["Senator Lummis proposes U.S. purchase of 5% bitcoin supply","BTC TO PKR - Today’s Bitcoin price in Pakistan on August 20, 2024","BTC TO USD - Today’s Bitcoin price in Dollar on 20 August, 2024"],"urls":["https:\/\/finance.yahoo.com\/news\/senator-lummis-proposes-u-purchase-235034744.html","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-august-20-2024\/","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-usd-todays-bitcoin-price-in-dollar-on-20-august-2024\/"],"sources":["Yahoo Finance","BOL News","BOL News"],"descriptions":["As the U.S. considers a bitcoin reserve, concerns about market control and decentralization arise.","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16911142.94 on 20 August 2024.","As of August 20, the Bitcoin to USD exchange rate stood at $60870.72. Bitcoin’s value in dollars reflects the dynamic"],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nSen. Lummis' proposal to create a strategic bitcoin reserve has sparked an intriguing debate among financial experts.\nDuring a recent discussion, Roundtable anchor, Rob Nelson, was joined by Noah Newton, CEO of Moby Media, and Ben Weiss, CEO of CoinFlip, to explore the potential implications of such a move. The idea, which emerged alongside discussions at the Nashville Bitcoin Conference featuring figures like Donald Trump and RFK Jr., suggests the U.S. government could acquire up to 5% of the total bitcoin supply, mirroring its gold reserves.\nNelson introduced the topic by expressing his initial concern about the U.S. government controlling a significant portion of bitcoin. The idea of a government holding 5% of all bitcoin raised questions about the potential impact on the decentralized nature of the cryptocurrency. However, Nelson acknowledged the strategic value in establishing such a reserve, considering the parallels to the U.S. gold reserves.\nNoah Newton shared his perspective, emphasizing that while the implications for bitcoin's ethos might be unclear, the move could benefit the U.S. economy. Newton highlighted that bitcoin's growth over the past decade and its projected trajectory suggest that this reserve could help pay down the national debt. He also pointed out that the U.S. already holds bitcoin from confiscated activities and suggested adding these to the treasury rather than selling them.\nBen Weiss added that creating a bitcoin reserve is a logical step, given the precedent of holding strategic reserves in other assets like gold and oil. He argued that owning bitcoin is less risky than not holding any at all, especially when other countries might be considering similar moves. Weiss reassured that holding 5% of the bitcoin supply, much like the U.S. does with gold, wouldn't necessarily disrupt the market but could strengthen the nation's financial strategy.","20th Aug, 2024. 03:05 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16911142.94 on 20 August 2024.\n1 BTC = 16911142.94 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","20th Aug, 2024. 03:05 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 6, 2024\nAs of August 20, the Bitcoin to USD exchange rate stood at $60870.72. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 60870.72 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
{"date":"2024-08-21","titles":["Bitcoin’s Bull Run Far From Over, Here's Why"],"urls":["https:\/\/finance.yahoo.com\/news\/bitcoin-bull-run-far-over-135448971.html"],"sources":["Yahoo Finance"],"descriptions":["Key signals show Bitcoin bull run far from over despite market fear, Bitcoin’s price action mirrors past patterns, signaling potential for a continued bull run. Here’s why savvy investors are paying attention."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin Bull Run: Current Cycle Patterns Mirror Past Trends\nAs Bitcoin’s price consolidates near previous all-time highs, many are asking if the bull run is over. However, historical data suggests otherwise. The market is currently testing support at the \"fair value band\" (chart here) for the second time since the post-halving period began. This pattern mirrors the 2016 and 2020 cycles when Bitcoin similarly moved sideways before a major breakout. With only 124 days post-halving, and Bitcoin sitting at $55,000, it’s too early to declare the bull run finished. Historically, a price surge typically follows after around 160 days post-halving.\nWhale Accumulation and Global Liquidity Indicate Strength\nInstitutional investors, particularly Bitcoin whales, are signaling confidence. Wallets holding between 100 to 1,000 Bitcoin have accumulated an additional 100,000 Bitcoin in just the last six weeks. This accumulation comes as Bitcoin consolidates at its fair value, indicating that large investors are positioning themselves for a future upswing. Additionally, global liquidity is rising, which has historically been a precursor to major Bitcoin price action. This pattern of liquidity driving price increases is one we’ve seen before, and current trends suggest that a significant upward move could be imminent.\nInstitutional Adoption and Dollar Weakness: Key Drivers Ahead\nBeyond individual whale activity, institutional adoption is accelerating. A staggering 60% of the largest U.S. hedge funds now hold Bitcoin exposure, further legitimizing its role in traditional finance. Companies like MicroStrategy, which shifted its strategy to holding Bitcoin as treasury, saw exponential growth since 2021. Moreover, the strength of the U.S. dollar is another crucial factor to watch. Historically, Bitcoin’s price surges when the dollar weakens, and the current dollar index shows signs of a potential breakdown. This, coupled with institutional and retail adoption ramping up, suggests that Bitcoin’s bull market is not only intact but likely to accelerate in the coming months."]}
{"date":"2024-08-22","titles":["BTC TO PKR - Today’s Bitcoin price in Pakistan on August 22, 2024","BTC TO USD - Today’s Bitcoin price in Dollar on 22 August, 2024"],"urls":["https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-august-22-2024\/","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-usd-todays-bitcoin-price-in-dollar-on-22-august-2024\/"],"sources":["BOL News","BOL News"],"descriptions":["The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16987842.32 on 22 August 2024.","As of August 22, the Bitcoin to USD exchange rate stood at $60952.32. Bitcoin’s value in dollars reflects the dynamic nature of the"],"article_contents":["22nd Aug, 2024. 01:09 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO PKR – Today’s Bitcoin price in Pakistan on Feb 10, 2024\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16987842.32 on 22 August 2024.\n1 BTC = 16987842.32 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","22nd Aug, 2024. 01:09 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Jan 17, 2024\nAs of August 22, the Bitcoin to USD exchange rate stood at $60952.32. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 60952.32 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
{"date":"2024-08-23","titles":["How Bitcoin's value is changing in the face of market trends"],"urls":["https:\/\/finance.yahoo.com\/news\/bitcoins-value-changing-face-market-153857748.html"],"sources":["Yahoo Finance"],"descriptions":["Bitcoin's evolving role as digital gold highlights its surprising correlations with traditional financial markets and global events."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nGold has been a cornerstone of value for centuries, revered for its scarcity and enduring worth. However, as digital assets like bitcoin gain prominence, questions arise about how these newer forms of value compare to traditional ones.\nIn a recent discussion, Roundtable anchor, Rob Nelson, and David Mass, co-founder of Hydrogen Labs, examined bitcoin's evolving role, especially its correlation with traditional financial markets.\nRob Nelson initiated the conversation by drawing a parallel between gold and bitcoin. He noted that while gold is a hard and scarce asset, bitcoin's finite nature and technological flexibility make it unique. Unlike traditional assets, bitcoin's value extends beyond mere scarcity, encompassing utility and technological innovation.\nDavid Mass expanded on this by considering bitcoin as the digital gold standard, highlighting its finite supply. However, he pointed out an unexpected development: Bitcoin's increasing correlation with traditional markets. He noted that as global payments evolve, bitcoin's role as a hedge in capital market downturns is still being defined. Mass emphasized that bitcoin's price movements are becoming more intertwined with broader economic indicators like unemployment and market volatility.\nNelson delved deeper into this correlation issue, questioning why bitcoin, which was expected to be a non-correlated asset, seems to mirror traditional market movements. He suggested that bitcoin might be reacting more to global events and currency fluctuations than to traditional financial market trends. Despite this, Nelson acknowledged that bitcoin's behavior continues to challenge traditional expectations.\nMass agreed, explaining that the introduction of bitcoin and ethereum ETFs has led to increased overlap between crypto and capital markets. He pointed out that investors who diversify across both crypto and traditional ETFs contribute to this growing correlation. This, he argued, is a natural evolution as digital assets become more integrated into mainstream investment strategies."]}
{"date":"2024-08-26","titles":["How Bitcoin ETFs can send Bitcoin prices to the moon in five years","Bitcoin and Presidential Elections: A Predictable Pattern?","How AI and Machine Learning are Enhancing Player Experience in Crypto Casinos"],"urls":["https:\/\/www.livemint.com\/market\/cryptocurrency\/gold-gold-etfs-gold-prices-bitcoin-bitcoin-etfs-bitcoin-prices-cryptocurrencies-stock-markets-11724656806164.html","https:\/\/finance.yahoo.com\/news\/bitcoin-presidential-elections-predictable-pattern-181618736.html","https:\/\/techstartups.com\/2024\/08\/26\/how-ai-and-machine-learning-are-enhancing-player-experience-in-crypto-casinos\/"],"sources":["Livemint","Yahoo Finance","TechStartups.com"],"descriptions":["Various funds started holding ETFs in bonds, currencies, gold, real estate investment trusts and volatility, but none caused the storm as Bitcoin spot ETFs in 2024.","Every four years, as the U.S. gears up for a presidential election, Bitcoin seems to follow a distinct and somewhat predictable pattern. Whether it was 2012, 2016, or even 2020, Bitcoin's price has historically responded to the election cycle in a strikingly similar manner. In this article, we’ll ...","Crypto casinos are now a thing among crypto lovers and avid players alike and are making their mark on the online gambling niche, although they aren't mainstream yet. According to a report by CasinoRix researchers, the crypto gambling market now has a value of $250 million, and will still grow bigger. As projected, they are"],"article_contents":["This is a Mint Premium article gifted to you. Subscribe to enjoy similar stories.\nLet’s start with examining gold prices from 1971 to 2023:\nBesides the 1980 peak, from 1979 to 2001, the price was as though nothing happened in a 20-year time frame. If Rip Wan Winkle had gone to sleep in 1979 and woken up in 2002, it would have been like nothing had happened to gold prices despite being the favourite asset class of billions of people.\nAfter 2009, there was the global financial crisis and quantitative easing. We knew at that time gold prices would go up, and they did as easy money was being printed. The next spike happened in 2020 with the covid-19 outbreak and another massive round of fiat currency printing.\nBut let us take a peek into gold prices from 2002 to 2009, which is a fascinating time frame:\n1. The US was coming out of the dot-com bubble\n2. It was after the recession in the aftermath of 9\/11\n3. Interest rates were increasing\n4. The economy was doing good\n5. The housing bubble was forming across the US\nDespite the interest rates going up and the economy doing great, gold prices were also going higher.\nSo, what was happening here?The first gold exchange-traded fund (ETF) was launched on the Australian Stock Exchange in 2003.\n\nAlso Read: The $230 million WazirX hack: How safe are your cryptocurrenciesIt was followed by the US launch of Gold ETF (GLD) by State Street Advisors. They both started with modest assets under management (AUM), but by the end of 2005, the GLD ETF had reached almost $5 billion in AUM. By the end of 2006, it reached nearly $10 billion in AUM; by the end of 2007, it reached $16 billion in AUM.\n\n     \n      The price of gold doubled to almost $700 by this time. Towards the end of 2008 and the beginning of the financial crisis, the AUM reached $21 billion. By March 2009, when the financial crisis was in full swing, the AUM went to $30 billion, and by September, gold prices were at $1,200.\n\n     \n      In 2024, the AUM for GLD by State Street Advisors has hit $60 billion-plus, and the next largest gold ETF, iShares Gold Trust by BlackRock, had $30 billion in assets.\n\nHow did the Gold ETF cause this rally in gold prices despite gold being an asset that was available for investment for 3,000 years?With stocks, there are individual investors and large pension funds, as well as hedge funds, who buy stocks. You never get to possess the physical stock certificate in hand like in the old days, when the exchange would send you share certificates in your name. Nowadays, it’s held with a central custodian like Depository Trust and Clearing Corporation (DTCC) in the US for the New York Stock Exchange. \n\n     \n      Large financial institutional investors like hedge funds and pensions are regulated by state and federal legislation on what kind of assets they can buy and who should hold the assets they buy. These regulations are out there to protect the investors’ money.\n\nAlso Read: Our approach to the regulation of cryptocurrency needs clarityA portfolio manager with expertise in picking stocks wants to avoid being boggled with custody issues and security risks associated with his investments. As a fund manager, they would rather utilize their time analyzing investments rather than focusing on how to secure the assets procured.\n\n     \n      It is prudent for large financial institutions and family offices to have diversified assets in their portfolio. That is the strategy to protect their wealth when one asset class takes a massive hit in the market. Gold is an asset class considered a safe haven during inflationary times. Many funds could not buy physical gold due to the risks associated with custody. They could purchase mutual fund trusts that invested in gold.\n\n     \n      ETFs made it possible for pension funds, hedge funds and large family offices to invest in gold and trade it like a stock. Before that, they could only buy mutual funds or trusts that invested in gold or companies involved in mining and refining gold.\n\n     \n      Compared to mutual funds, ETFs have huge advantages like:\n\n     \n      1. ETFs trade like stocks all day; mutual funds can trade only at closing prices. If the market crashed 8% at the opening, you placed an order, and the market rallied by 10% by the closing time, you would not be able to buy the massive dip\n\n     \n      2. ETFs have much lower costs associated with them, and your fees are much lower\n\n     \n      3. If the ETFs are trading below the net asset value of the underlying assets you can redeem your ETF via authorized partners and brokers to receive the underlying and sell it at market prices. With mutual funds, you must wait till the price of the mutual fund reaches the net asset value of the underlying asset.\n\nThe history of Bitcoin ETFsThe journey towards a Bitcoin ETF in the US has been long and complex, marked by regulatory concerns, legal challenges, and growing investor demand. While futures-based Bitcoin ETFs have been approved and traded successfully from 2021, the spot was only given a green light by 2024. The history of Bitcoin ETFs in America since 2017 is a story of persistence in the face of regulatory challenges.\n\n     \n      The Winklevoss twins made the first major attempt to launch a Bitcoin ETF in March 2017, proposing the Winklevoss Bitcoin Trust. The US Securities and Exchange Commission (SEC) rejected their application, citing concerns about market manipulation, lack of regulation in Bitcoin markets, and the potential for fraud.\n\nAlso Read: The cryptocurrency industry should use innovation to regain lost trustIn July 2018, the SEC rejected the Winklevoss twins' second attempt and several other Bitcoin ETF proposals, including those from ProShares and Direxion. The primary reasons were consistent: Concerns about market manipulation and insufficient investor protection.\n\n     \n      Multiple companies, including VanEck and SolidX, continued to submit Bitcoin ETF proposals. VanEck SolidX Bitcoin Trust was notable for attempting to address the SEC's concerns by proposing a physically backed ETF, meaning it would hold actual Bitcoin. However, the proposal was postponed several times and eventually withdrawn due to continued regulatory uncertainty.\n\n     \n      In October 2021, after years of rejections, the SEC finally approved the first Bitcoin-related ETF, but with a significant caveat: It was a Bitcoin futures-based ETF rather than a physically backed one. This ETF, the ProShares Bitcoin Strategy ETF (BITO), was launched on 19 October 19 2021, marking a historic moment for Bitcoin in traditional financial markets. The ProShares Bitcoin Strategy ETF invests in Bitcoin futures contracts rather than directly in Bitcoin. Futures-based ETFs are generally considered safer from a regulatory perspective because they are based on regulated futures contracts rather than the underlying, less-regulated asset.\n\nAlso Read: Law schools put AI, crypto, climate courses in motion The immediate impact was that the ProShares Bitcoin Strategy ETF saw a strong reception, with over $1 billion in AUM in just a few days. It was the second-most heavily traded new ETF on its first day in history.\n\n     \n      In 2022, Grayscale launched a lawsuit against the SEC after its application to convert its Bitcoin Trust into a spot Bitcoin ETF was rejected. Grayscale argued that the SEC acted arbitrarily by approving futures-based ETFs but not spot ETFs. The case gained significant attention and highlighted the ongoing struggle between crypto advocates and regulators.\n\n     \n      The D.C. Circuit Court of Appeals closed the books on a dispute between the SEC and Grayscale with a final ruling that ordered the agency to scrap its rejection of the asset manager's spot Bitcoin ETF application in October 2023.\n\n     \n      On 10 January 2024, the SEC eventually approved 11 new spot Bitcoin ETFs. A spot Bitcoin ETF is an ETF that tracks Bitcoin's spot or current price.\n\n     \n      Various funds started holding ETFs in bonds, currencies, gold, real estate investment trusts and volatility, but none caused the storm as Bitcoin spot ETFs in 2024.\n\n     \n      In six months, the top Bitcoin ETFs had an aggregate AUM of $42 billion, something the Gold ETF achieved in six years. The price rose after the court verdict from $27,000 in October 2023 to $45,000 until the first ETF approval date. From the first ETF trading date of January 2024, it went to $70,000 by March 2024.\n\n\n\n\n\n\n\n\nView Full Image\n\n\nBitcoin prices \n\t\t\t\n\n\n\n     \n      Suppose history is something we can learn from with respect to other ETFs, their AUMs and their correlation to underlying asset prices over a five-year period, then it would not be farfetched to imagine the price of Bitcoin is headed for the moon in the next five years.\n\nNithin Eapen is a seasoned speaker, technologist and entrepreneur with a deep passion for finance, cryptocurrencies and technology. With a computer science and finance background, Nithin has spent over two decades in the tech and financial industry, working with cutting-edge technologies and innovative startups. \n\nNote: The purpose of this article is only to share an opinion. It is not a recommendation. If you wish to consider an investment, you are strongly advised to consult your adviser. This article is strictly for educational and informational purposes only.\nThe first gold exchange-traded fund (ETF) was launched on the Australian Stock Exchange in 2003.\nAlso Read: The $230 million WazirX hack: How safe are your cryptocurrenciesIt was followed by the US launch of Gold ETF (GLD) by State Street Advisors. They both started with modest assets under management (AUM), but by the end of 2005, the GLD ETF had reached almost $5 billion in AUM. By the end of 2006, it reached nearly $10 billion in AUM; by the end of 2007, it reached $16 billion in AUM.\n\n     \n      The price of gold doubled to almost $700 by this time. Towards the end of 2008 and the beginning of the financial crisis, the AUM reached $21 billion. By March 2009, when the financial crisis was in full swing, the AUM went to $30 billion, and by September, gold prices were at $1,200.\n\n     \n      In 2024, the AUM for GLD by State Street Advisors has hit $60 billion-plus, and the next largest gold ETF, iShares Gold Trust by BlackRock, had $30 billion in assets.\n\nHow did the Gold ETF cause this rally in gold prices despite gold being an asset that was available for investment for 3,000 years?With stocks, there are individual investors and large pension funds, as well as hedge funds, who buy stocks. You never get to possess the physical stock certificate in hand like in the old days, when the exchange would send you share certificates in your name. Nowadays, it’s held with a central custodian like Depository Trust and Clearing Corporation (DTCC) in the US for the New York Stock Exchange. \n\n     \n      Large financial institutional investors like hedge funds and pensions are regulated by state and federal legislation on what kind of assets they can buy and who should hold the assets they buy. These regulations are out there to protect the investors’ money.\n\nAlso Read: Our approach to the regulation of cryptocurrency needs clarityA portfolio manager with expertise in picking stocks wants to avoid being boggled with custody issues and security risks associated with his investments. As a fund manager, they would rather utilize their time analyzing investments rather than focusing on how to secure the assets procured.\n\n     \n      It is prudent for large financial institutions and family offices to have diversified assets in their portfolio. That is the strategy to protect their wealth when one asset class takes a massive hit in the market. Gold is an asset class considered a safe haven during inflationary times. Many funds could not buy physical gold due to the risks associated with custody. They could purchase mutual fund trusts that invested in gold.\n\n     \n      ETFs made it possible for pension funds, hedge funds and large family offices to invest in gold and trade it like a stock. Before that, they could only buy mutual funds or trusts that invested in gold or companies involved in mining and refining gold.\n\n     \n      Compared to mutual funds, ETFs have huge advantages like:\n\n     \n      1. ETFs trade like stocks all day; mutual funds can trade only at closing prices. If the market crashed 8% at the opening, you placed an order, and the market rallied by 10% by the closing time, you would not be able to buy the massive dip\n\n     \n      2. ETFs have much lower costs associated with them, and your fees are much lower\n\n     \n      3. If the ETFs are trading below the net asset value of the underlying assets you can redeem your ETF via authorized partners and brokers to receive the underlying and sell it at market prices. With mutual funds, you must wait till the price of the mutual fund reaches the net asset value of the underlying asset.\n\nThe history of Bitcoin ETFsThe journey towards a Bitcoin ETF in the US has been long and complex, marked by regulatory concerns, legal challenges, and growing investor demand. While futures-based Bitcoin ETFs have been approved and traded successfully from 2021, the spot was only given a green light by 2024. The history of Bitcoin ETFs in America since 2017 is a story of persistence in the face of regulatory challenges.\n\n     \n      The Winklevoss twins made the first major attempt to launch a Bitcoin ETF in March 2017, proposing the Winklevoss Bitcoin Trust. The US Securities and Exchange Commission (SEC) rejected their application, citing concerns about market manipulation, lack of regulation in Bitcoin markets, and the potential for fraud.\n\nAlso Read: The cryptocurrency industry should use innovation to regain lost trustIn July 2018, the SEC rejected the Winklevoss twins' second attempt and several other Bitcoin ETF proposals, including those from ProShares and Direxion. The primary reasons were consistent: Concerns about market manipulation and insufficient investor protection.\n\n     \n      Multiple companies, including VanEck and SolidX, continued to submit Bitcoin ETF proposals. VanEck SolidX Bitcoin Trust was notable for attempting to address the SEC's concerns by proposing a physically backed ETF, meaning it would hold actual Bitcoin. However, the proposal was postponed several times and eventually withdrawn due to continued regulatory uncertainty.\n\n     \n      In October 2021, after years of rejections, the SEC finally approved the first Bitcoin-related ETF, but with a significant caveat: It was a Bitcoin futures-based ETF rather than a physically backed one. This ETF, the ProShares Bitcoin Strategy ETF (BITO), was launched on 19 October 19 2021, marking a historic moment for Bitcoin in traditional financial markets. The ProShares Bitcoin Strategy ETF invests in Bitcoin futures contracts rather than directly in Bitcoin. Futures-based ETFs are generally considered safer from a regulatory perspective because they are based on regulated futures contracts rather than the underlying, less-regulated asset.\n\nAlso Read: Law schools put AI, crypto, climate courses in motion The immediate impact was that the ProShares Bitcoin Strategy ETF saw a strong reception, with over $1 billion in AUM in just a few days. It was the second-most heavily traded new ETF on its first day in history.\n\n     \n      In 2022, Grayscale launched a lawsuit against the SEC after its application to convert its Bitcoin Trust into a spot Bitcoin ETF was rejected. Grayscale argued that the SEC acted arbitrarily by approving futures-based ETFs but not spot ETFs. The case gained significant attention and highlighted the ongoing struggle between crypto advocates and regulators.\n\n     \n      The D.C. Circuit Court of Appeals closed the books on a dispute between the SEC and Grayscale with a final ruling that ordered the agency to scrap its rejection of the asset manager's spot Bitcoin ETF application in October 2023.\n\n     \n      On 10 January 2024, the SEC eventually approved 11 new spot Bitcoin ETFs. A spot Bitcoin ETF is an ETF that tracks Bitcoin's spot or current price.\n\n     \n      Various funds started holding ETFs in bonds, currencies, gold, real estate investment trusts and volatility, but none caused the storm as Bitcoin spot ETFs in 2024.\n\n     \n      In six months, the top Bitcoin ETFs had an aggregate AUM of $42 billion, something the Gold ETF achieved in six years. The price rose after the court verdict from $27,000 in October 2023 to $45,000 until the first ETF approval date. From the first ETF trading date of January 2024, it went to $70,000 by March 2024.\n\n\n\n\n\n\n\n\nView Full Image\n\n\nBitcoin prices \n\t\t\t\n\n\n\n     \n      Suppose history is something we can learn from with respect to other ETFs, their AUMs and their correlation to underlying asset prices over a five-year period, then it would not be farfetched to imagine the price of Bitcoin is headed for the moon in the next five years.\n\nNithin Eapen is a seasoned speaker, technologist and entrepreneur with a deep passion for finance, cryptocurrencies and technology. With a computer science and finance background, Nithin has spent over two decades in the tech and financial industry, working with cutting-edge technologies and innovative startups. \n\nNote: The purpose of this article is only to share an opinion. It is not a recommendation. If you wish to consider an investment, you are strongly advised to consult your adviser. This article is strictly for educational and informational purposes only.\nIt was followed by the US launch of Gold ETF (GLD) by State Street Advisors. They both started with modest assets under management (AUM), but by the end of 2005, the GLD ETF had reached almost $5 billion in AUM. By the end of 2006, it reached nearly $10 billion in AUM; by the end of 2007, it reached $16 billion in AUM.\nThe price of gold doubled to almost $700 by this time. Towards the end of 2008 and the beginning of the financial crisis, the AUM reached $21 billion. By March 2009, when the financial crisis was in full swing, the AUM went to $30 billion, and by September, gold prices were at $1,200.\nIn 2024, the AUM for GLD by State Street Advisors has hit $60 billion-plus, and the next largest gold ETF, iShares Gold Trust by BlackRock, had $30 billion in assets.\nHow did the Gold ETF cause this rally in gold prices despite gold being an asset that was available for investment for 3,000 years?With stocks, there are individual investors and large pension funds, as well as hedge funds, who buy stocks. You never get to possess the physical stock certificate in hand like in the old days, when the exchange would send you share certificates in your name. Nowadays, it’s held with a central custodian like Depository Trust and Clearing Corporation (DTCC) in the US for the New York Stock Exchange. \n\n     \n      Large financial institutional investors like hedge funds and pensions are regulated by state and federal legislation on what kind of assets they can buy and who should hold the assets they buy. These regulations are out there to protect the investors’ money.\n\nAlso Read: Our approach to the regulation of cryptocurrency needs clarityA portfolio manager with expertise in picking stocks wants to avoid being boggled with custody issues and security risks associated with his investments. As a fund manager, they would rather utilize their time analyzing investments rather than focusing on how to secure the assets procured.\n\n     \n      It is prudent for large financial institutions and family offices to have diversified assets in their portfolio. That is the strategy to protect their wealth when one asset class takes a massive hit in the market. Gold is an asset class considered a safe haven during inflationary times. Many funds could not buy physical gold due to the risks associated with custody. They could purchase mutual fund trusts that invested in gold.\n\n     \n      ETFs made it possible for pension funds, hedge funds and large family offices to invest in gold and trade it like a stock. Before that, they could only buy mutual funds or trusts that invested in gold or companies involved in mining and refining gold.\n\n     \n      Compared to mutual funds, ETFs have huge advantages like:\n\n     \n      1. ETFs trade like stocks all day; mutual funds can trade only at closing prices. If the market crashed 8% at the opening, you placed an order, and the market rallied by 10% by the closing time, you would not be able to buy the massive dip\n\n     \n      2. ETFs have much lower costs associated with them, and your fees are much lower\n\n     \n      3. If the ETFs are trading below the net asset value of the underlying assets you can redeem your ETF via authorized partners and brokers to receive the underlying and sell it at market prices. With mutual funds, you must wait till the price of the mutual fund reaches the net asset value of the underlying asset.\n\nThe history of Bitcoin ETFsThe journey towards a Bitcoin ETF in the US has been long and complex, marked by regulatory concerns, legal challenges, and growing investor demand. While futures-based Bitcoin ETFs have been approved and traded successfully from 2021, the spot was only given a green light by 2024. The history of Bitcoin ETFs in America since 2017 is a story of persistence in the face of regulatory challenges.\n\n     \n      The Winklevoss twins made the first major attempt to launch a Bitcoin ETF in March 2017, proposing the Winklevoss Bitcoin Trust. The US Securities and Exchange Commission (SEC) rejected their application, citing concerns about market manipulation, lack of regulation in Bitcoin markets, and the potential for fraud.\n\nAlso Read: The cryptocurrency industry should use innovation to regain lost trustIn July 2018, the SEC rejected the Winklevoss twins' second attempt and several other Bitcoin ETF proposals, including those from ProShares and Direxion. The primary reasons were consistent: Concerns about market manipulation and insufficient investor protection.\n\n     \n      Multiple companies, including VanEck and SolidX, continued to submit Bitcoin ETF proposals. VanEck SolidX Bitcoin Trust was notable for attempting to address the SEC's concerns by proposing a physically backed ETF, meaning it would hold actual Bitcoin. However, the proposal was postponed several times and eventually withdrawn due to continued regulatory uncertainty.\n\n     \n      In October 2021, after years of rejections, the SEC finally approved the first Bitcoin-related ETF, but with a significant caveat: It was a Bitcoin futures-based ETF rather than a physically backed one. This ETF, the ProShares Bitcoin Strategy ETF (BITO), was launched on 19 October 19 2021, marking a historic moment for Bitcoin in traditional financial markets. The ProShares Bitcoin Strategy ETF invests in Bitcoin futures contracts rather than directly in Bitcoin. Futures-based ETFs are generally considered safer from a regulatory perspective because they are based on regulated futures contracts rather than the underlying, less-regulated asset.\n\nAlso Read: Law schools put AI, crypto, climate courses in motion The immediate impact was that the ProShares Bitcoin Strategy ETF saw a strong reception, with over $1 billion in AUM in just a few days. It was the second-most heavily traded new ETF on its first day in history.\n\n     \n      In 2022, Grayscale launched a lawsuit against the SEC after its application to convert its Bitcoin Trust into a spot Bitcoin ETF was rejected. Grayscale argued that the SEC acted arbitrarily by approving futures-based ETFs but not spot ETFs. The case gained significant attention and highlighted the ongoing struggle between crypto advocates and regulators.\n\n     \n      The D.C. Circuit Court of Appeals closed the books on a dispute between the SEC and Grayscale with a final ruling that ordered the agency to scrap its rejection of the asset manager's spot Bitcoin ETF application in October 2023.\n\n     \n      On 10 January 2024, the SEC eventually approved 11 new spot Bitcoin ETFs. A spot Bitcoin ETF is an ETF that tracks Bitcoin's spot or current price.\n\n     \n      Various funds started holding ETFs in bonds, currencies, gold, real estate investment trusts and volatility, but none caused the storm as Bitcoin spot ETFs in 2024.\n\n     \n      In six months, the top Bitcoin ETFs had an aggregate AUM of $42 billion, something the Gold ETF achieved in six years. The price rose after the court verdict from $27,000 in October 2023 to $45,000 until the first ETF approval date. From the first ETF trading date of January 2024, it went to $70,000 by March 2024.\n\n\n\n\n\n\n\n\nView Full Image\n\n\nBitcoin prices \n\t\t\t\n\n\n\n     \n      Suppose history is something we can learn from with respect to other ETFs, their AUMs and their correlation to underlying asset prices over a five-year period, then it would not be farfetched to imagine the price of Bitcoin is headed for the moon in the next five years.\n\nNithin Eapen is a seasoned speaker, technologist and entrepreneur with a deep passion for finance, cryptocurrencies and technology. With a computer science and finance background, Nithin has spent over two decades in the tech and financial industry, working with cutting-edge technologies and innovative startups. \n\nNote: The purpose of this article is only to share an opinion. It is not a recommendation. If you wish to consider an investment, you are strongly advised to consult your adviser. This article is strictly for educational and informational purposes only.\nWith stocks, there are individual investors and large pension funds, as well as hedge funds, who buy stocks. You never get to possess the physical stock certificate in hand like in the old days, when the exchange would send you share certificates in your name. Nowadays, it’s held with a central custodian like Depository Trust and Clearing Corporation (DTCC) in the US for the New York Stock Exchange.\nLarge financial institutional investors like hedge funds and pensions are regulated by state and federal legislation on what kind of assets they can buy and who should hold the assets they buy. These regulations are out there to protect the investors’ money.\nAlso Read: Our approach to the regulation of cryptocurrency needs clarityA portfolio manager with expertise in picking stocks wants to avoid being boggled with custody issues and security risks associated with his investments. As a fund manager, they would rather utilize their time analyzing investments rather than focusing on how to secure the assets procured.\n\n     \n      It is prudent for large financial institutions and family offices to have diversified assets in their portfolio. That is the strategy to protect their wealth when one asset class takes a massive hit in the market. Gold is an asset class considered a safe haven during inflationary times. Many funds could not buy physical gold due to the risks associated with custody. They could purchase mutual fund trusts that invested in gold.\n\n     \n      ETFs made it possible for pension funds, hedge funds and large family offices to invest in gold and trade it like a stock. Before that, they could only buy mutual funds or trusts that invested in gold or companies involved in mining and refining gold.\n\n     \n      Compared to mutual funds, ETFs have huge advantages like:\n\n     \n      1. ETFs trade like stocks all day; mutual funds can trade only at closing prices. If the market crashed 8% at the opening, you placed an order, and the market rallied by 10% by the closing time, you would not be able to buy the massive dip\n\n     \n      2. ETFs have much lower costs associated with them, and your fees are much lower\n\n     \n      3. If the ETFs are trading below the net asset value of the underlying assets you can redeem your ETF via authorized partners and brokers to receive the underlying and sell it at market prices. With mutual funds, you must wait till the price of the mutual fund reaches the net asset value of the underlying asset.\n\nThe history of Bitcoin ETFsThe journey towards a Bitcoin ETF in the US has been long and complex, marked by regulatory concerns, legal challenges, and growing investor demand. While futures-based Bitcoin ETFs have been approved and traded successfully from 2021, the spot was only given a green light by 2024. The history of Bitcoin ETFs in America since 2017 is a story of persistence in the face of regulatory challenges.\n\n     \n      The Winklevoss twins made the first major attempt to launch a Bitcoin ETF in March 2017, proposing the Winklevoss Bitcoin Trust. The US Securities and Exchange Commission (SEC) rejected their application, citing concerns about market manipulation, lack of regulation in Bitcoin markets, and the potential for fraud.\n\nAlso Read: The cryptocurrency industry should use innovation to regain lost trustIn July 2018, the SEC rejected the Winklevoss twins' second attempt and several other Bitcoin ETF proposals, including those from ProShares and Direxion. The primary reasons were consistent: Concerns about market manipulation and insufficient investor protection.\n\n     \n      Multiple companies, including VanEck and SolidX, continued to submit Bitcoin ETF proposals. VanEck SolidX Bitcoin Trust was notable for attempting to address the SEC's concerns by proposing a physically backed ETF, meaning it would hold actual Bitcoin. However, the proposal was postponed several times and eventually withdrawn due to continued regulatory uncertainty.\n\n     \n      In October 2021, after years of rejections, the SEC finally approved the first Bitcoin-related ETF, but with a significant caveat: It was a Bitcoin futures-based ETF rather than a physically backed one. This ETF, the ProShares Bitcoin Strategy ETF (BITO), was launched on 19 October 19 2021, marking a historic moment for Bitcoin in traditional financial markets. The ProShares Bitcoin Strategy ETF invests in Bitcoin futures contracts rather than directly in Bitcoin. Futures-based ETFs are generally considered safer from a regulatory perspective because they are based on regulated futures contracts rather than the underlying, less-regulated asset.\n\nAlso Read: Law schools put AI, crypto, climate courses in motion The immediate impact was that the ProShares Bitcoin Strategy ETF saw a strong reception, with over $1 billion in AUM in just a few days. It was the second-most heavily traded new ETF on its first day in history.\n\n     \n      In 2022, Grayscale launched a lawsuit against the SEC after its application to convert its Bitcoin Trust into a spot Bitcoin ETF was rejected. Grayscale argued that the SEC acted arbitrarily by approving futures-based ETFs but not spot ETFs. The case gained significant attention and highlighted the ongoing struggle between crypto advocates and regulators.\n\n     \n      The D.C. Circuit Court of Appeals closed the books on a dispute between the SEC and Grayscale with a final ruling that ordered the agency to scrap its rejection of the asset manager's spot Bitcoin ETF application in October 2023.\n\n     \n      On 10 January 2024, the SEC eventually approved 11 new spot Bitcoin ETFs. A spot Bitcoin ETF is an ETF that tracks Bitcoin's spot or current price.\n\n     \n      Various funds started holding ETFs in bonds, currencies, gold, real estate investment trusts and volatility, but none caused the storm as Bitcoin spot ETFs in 2024.\n\n     \n      In six months, the top Bitcoin ETFs had an aggregate AUM of $42 billion, something the Gold ETF achieved in six years. The price rose after the court verdict from $27,000 in October 2023 to $45,000 until the first ETF approval date. From the first ETF trading date of January 2024, it went to $70,000 by March 2024.\n\n\n\n\n\n\n\n\nView Full Image\n\n\nBitcoin prices \n\t\t\t\n\n\n\n     \n      Suppose history is something we can learn from with respect to other ETFs, their AUMs and their correlation to underlying asset prices over a five-year period, then it would not be farfetched to imagine the price of Bitcoin is headed for the moon in the next five years.\n\nNithin Eapen is a seasoned speaker, technologist and entrepreneur with a deep passion for finance, cryptocurrencies and technology. With a computer science and finance background, Nithin has spent over two decades in the tech and financial industry, working with cutting-edge technologies and innovative startups. \n\nNote: The purpose of this article is only to share an opinion. It is not a recommendation. If you wish to consider an investment, you are strongly advised to consult your adviser. This article is strictly for educational and informational purposes only.\nA portfolio manager with expertise in picking stocks wants to avoid being boggled with custody issues and security risks associated with his investments. As a fund manager, they would rather utilize their time analyzing investments rather than focusing on how to secure the assets procured.\nIt is prudent for large financial institutions and family offices to have diversified assets in their portfolio. That is the strategy to protect their wealth when one asset class takes a massive hit in the market. Gold is an asset class considered a safe haven during inflationary times. Many funds could not buy physical gold due to the risks associated with custody. They could purchase mutual fund trusts that invested in gold.\nETFs made it possible for pension funds, hedge funds and large family offices to invest in gold and trade it like a stock. Before that, they could only buy mutual funds or trusts that invested in gold or companies involved in mining and refining gold.\nCompared to mutual funds, ETFs have huge advantages like:\n1. ETFs trade like stocks all day; mutual funds can trade only at closing prices. If the market crashed 8% at the opening, you placed an order, and the market rallied by 10% by the closing time, you would not be able to buy the massive dip\n2. ETFs have much lower costs associated with them, and your fees are much lower\n3. If the ETFs are trading below the net asset value of the underlying assets you can redeem your ETF via authorized partners and brokers to receive the underlying and sell it at market prices. With mutual funds, you must wait till the price of the mutual fund reaches the net asset value of the underlying asset.\nThe history of Bitcoin ETFsThe journey towards a Bitcoin ETF in the US has been long and complex, marked by regulatory concerns, legal challenges, and growing investor demand. While futures-based Bitcoin ETFs have been approved and traded successfully from 2021, the spot was only given a green light by 2024. The history of Bitcoin ETFs in America since 2017 is a story of persistence in the face of regulatory challenges.\n\n     \n      The Winklevoss twins made the first major attempt to launch a Bitcoin ETF in March 2017, proposing the Winklevoss Bitcoin Trust. The US Securities and Exchange Commission (SEC) rejected their application, citing concerns about market manipulation, lack of regulation in Bitcoin markets, and the potential for fraud.\n\nAlso Read: The cryptocurrency industry should use innovation to regain lost trustIn July 2018, the SEC rejected the Winklevoss twins' second attempt and several other Bitcoin ETF proposals, including those from ProShares and Direxion. The primary reasons were consistent: Concerns about market manipulation and insufficient investor protection.\n\n     \n      Multiple companies, including VanEck and SolidX, continued to submit Bitcoin ETF proposals. VanEck SolidX Bitcoin Trust was notable for attempting to address the SEC's concerns by proposing a physically backed ETF, meaning it would hold actual Bitcoin. However, the proposal was postponed several times and eventually withdrawn due to continued regulatory uncertainty.\n\n     \n      In October 2021, after years of rejections, the SEC finally approved the first Bitcoin-related ETF, but with a significant caveat: It was a Bitcoin futures-based ETF rather than a physically backed one. This ETF, the ProShares Bitcoin Strategy ETF (BITO), was launched on 19 October 19 2021, marking a historic moment for Bitcoin in traditional financial markets. The ProShares Bitcoin Strategy ETF invests in Bitcoin futures contracts rather than directly in Bitcoin. Futures-based ETFs are generally considered safer from a regulatory perspective because they are based on regulated futures contracts rather than the underlying, less-regulated asset.\n\nAlso Read: Law schools put AI, crypto, climate courses in motion The immediate impact was that the ProShares Bitcoin Strategy ETF saw a strong reception, with over $1 billion in AUM in just a few days. It was the second-most heavily traded new ETF on its first day in history.\n\n     \n      In 2022, Grayscale launched a lawsuit against the SEC after its application to convert its Bitcoin Trust into a spot Bitcoin ETF was rejected. Grayscale argued that the SEC acted arbitrarily by approving futures-based ETFs but not spot ETFs. The case gained significant attention and highlighted the ongoing struggle between crypto advocates and regulators.\n\n     \n      The D.C. Circuit Court of Appeals closed the books on a dispute between the SEC and Grayscale with a final ruling that ordered the agency to scrap its rejection of the asset manager's spot Bitcoin ETF application in October 2023.\n\n     \n      On 10 January 2024, the SEC eventually approved 11 new spot Bitcoin ETFs. A spot Bitcoin ETF is an ETF that tracks Bitcoin's spot or current price.\n\n     \n      Various funds started holding ETFs in bonds, currencies, gold, real estate investment trusts and volatility, but none caused the storm as Bitcoin spot ETFs in 2024.\n\n     \n      In six months, the top Bitcoin ETFs had an aggregate AUM of $42 billion, something the Gold ETF achieved in six years. The price rose after the court verdict from $27,000 in October 2023 to $45,000 until the first ETF approval date. From the first ETF trading date of January 2024, it went to $70,000 by March 2024.\n\n\n\n\n\n\n\n\nView Full Image\n\n\nBitcoin prices \n\t\t\t\n\n\n\n     \n      Suppose history is something we can learn from with respect to other ETFs, their AUMs and their correlation to underlying asset prices over a five-year period, then it would not be farfetched to imagine the price of Bitcoin is headed for the moon in the next five years.\n\nNithin Eapen is a seasoned speaker, technologist and entrepreneur with a deep passion for finance, cryptocurrencies and technology. With a computer science and finance background, Nithin has spent over two decades in the tech and financial industry, working with cutting-edge technologies and innovative startups. \n\nNote: The purpose of this article is only to share an opinion. It is not a recommendation. If you wish to consider an investment, you are strongly advised to consult your adviser. This article is strictly for educational and informational purposes only.\nThe journey towards a Bitcoin ETF in the US has been long and complex, marked by regulatory concerns, legal challenges, and growing investor demand. While futures-based Bitcoin ETFs have been approved and traded successfully from 2021, the spot was only given a green light by 2024. The history of Bitcoin ETFs in America since 2017 is a story of persistence in the face of regulatory challenges.\nThe Winklevoss twins made the first major attempt to launch a Bitcoin ETF in March 2017, proposing the Winklevoss Bitcoin Trust. The US Securities and Exchange Commission (SEC) rejected their application, citing concerns about market manipulation, lack of regulation in Bitcoin markets, and the potential for fraud.\nAlso Read: The cryptocurrency industry should use innovation to regain lost trustIn July 2018, the SEC rejected the Winklevoss twins' second attempt and several other Bitcoin ETF proposals, including those from ProShares and Direxion. The primary reasons were consistent: Concerns about market manipulation and insufficient investor protection.\n\n     \n      Multiple companies, including VanEck and SolidX, continued to submit Bitcoin ETF proposals. VanEck SolidX Bitcoin Trust was notable for attempting to address the SEC's concerns by proposing a physically backed ETF, meaning it would hold actual Bitcoin. However, the proposal was postponed several times and eventually withdrawn due to continued regulatory uncertainty.\n\n     \n      In October 2021, after years of rejections, the SEC finally approved the first Bitcoin-related ETF, but with a significant caveat: It was a Bitcoin futures-based ETF rather than a physically backed one. This ETF, the ProShares Bitcoin Strategy ETF (BITO), was launched on 19 October 19 2021, marking a historic moment for Bitcoin in traditional financial markets. The ProShares Bitcoin Strategy ETF invests in Bitcoin futures contracts rather than directly in Bitcoin. Futures-based ETFs are generally considered safer from a regulatory perspective because they are based on regulated futures contracts rather than the underlying, less-regulated asset.\n\nAlso Read: Law schools put AI, crypto, climate courses in motion The immediate impact was that the ProShares Bitcoin Strategy ETF saw a strong reception, with over $1 billion in AUM in just a few days. It was the second-most heavily traded new ETF on its first day in history.\n\n     \n      In 2022, Grayscale launched a lawsuit against the SEC after its application to convert its Bitcoin Trust into a spot Bitcoin ETF was rejected. Grayscale argued that the SEC acted arbitrarily by approving futures-based ETFs but not spot ETFs. The case gained significant attention and highlighted the ongoing struggle between crypto advocates and regulators.\n\n     \n      The D.C. Circuit Court of Appeals closed the books on a dispute between the SEC and Grayscale with a final ruling that ordered the agency to scrap its rejection of the asset manager's spot Bitcoin ETF application in October 2023.\n\n     \n      On 10 January 2024, the SEC eventually approved 11 new spot Bitcoin ETFs. A spot Bitcoin ETF is an ETF that tracks Bitcoin's spot or current price.\n\n     \n      Various funds started holding ETFs in bonds, currencies, gold, real estate investment trusts and volatility, but none caused the storm as Bitcoin spot ETFs in 2024.\n\n     \n      In six months, the top Bitcoin ETFs had an aggregate AUM of $42 billion, something the Gold ETF achieved in six years. The price rose after the court verdict from $27,000 in October 2023 to $45,000 until the first ETF approval date. From the first ETF trading date of January 2024, it went to $70,000 by March 2024.\n\n\n\n\n\n\n\n\nView Full Image\n\n\nBitcoin prices \n\t\t\t\n\n\n\n     \n      Suppose history is something we can learn from with respect to other ETFs, their AUMs and their correlation to underlying asset prices over a five-year period, then it would not be farfetched to imagine the price of Bitcoin is headed for the moon in the next five years.\n\nNithin Eapen is a seasoned speaker, technologist and entrepreneur with a deep passion for finance, cryptocurrencies and technology. With a computer science and finance background, Nithin has spent over two decades in the tech and financial industry, working with cutting-edge technologies and innovative startups. \n\nNote: The purpose of this article is only to share an opinion. It is not a recommendation. If you wish to consider an investment, you are strongly advised to consult your adviser. This article is strictly for educational and informational purposes only.\nIn July 2018, the SEC rejected the Winklevoss twins' second attempt and several other Bitcoin ETF proposals, including those from ProShares and Direxion. The primary reasons were consistent: Concerns about market manipulation and insufficient investor protection.\nMultiple companies, including VanEck and SolidX, continued to submit Bitcoin ETF proposals. VanEck SolidX Bitcoin Trust was notable for attempting to address the SEC's concerns by proposing a physically backed ETF, meaning it would hold actual Bitcoin. However, the proposal was postponed several times and eventually withdrawn due to continued regulatory uncertainty.\nIn October 2021, after years of rejections, the SEC finally approved the first Bitcoin-related ETF, but with a significant caveat: It was a Bitcoin futures-based ETF rather than a physically backed one. This ETF, the ProShares Bitcoin Strategy ETF (BITO), was launched on 19 October 19 2021, marking a historic moment for Bitcoin in traditional financial markets. The ProShares Bitcoin Strategy ETF invests in Bitcoin futures contracts rather than directly in Bitcoin. Futures-based ETFs are generally considered safer from a regulatory perspective because they are based on regulated futures contracts rather than the underlying, less-regulated asset.\nAlso Read: Law schools put AI, crypto, climate courses in motion The immediate impact was that the ProShares Bitcoin Strategy ETF saw a strong reception, with over $1 billion in AUM in just a few days. It was the second-most heavily traded new ETF on its first day in history.\n\n     \n      In 2022, Grayscale launched a lawsuit against the SEC after its application to convert its Bitcoin Trust into a spot Bitcoin ETF was rejected. Grayscale argued that the SEC acted arbitrarily by approving futures-based ETFs but not spot ETFs. The case gained significant attention and highlighted the ongoing struggle between crypto advocates and regulators.\n\n     \n      The D.C. Circuit Court of Appeals closed the books on a dispute between the SEC and Grayscale with a final ruling that ordered the agency to scrap its rejection of the asset manager's spot Bitcoin ETF application in October 2023.\n\n     \n      On 10 January 2024, the SEC eventually approved 11 new spot Bitcoin ETFs. A spot Bitcoin ETF is an ETF that tracks Bitcoin's spot or current price.\n\n     \n      Various funds started holding ETFs in bonds, currencies, gold, real estate investment trusts and volatility, but none caused the storm as Bitcoin spot ETFs in 2024.\n\n     \n      In six months, the top Bitcoin ETFs had an aggregate AUM of $42 billion, something the Gold ETF achieved in six years. The price rose after the court verdict from $27,000 in October 2023 to $45,000 until the first ETF approval date. From the first ETF trading date of January 2024, it went to $70,000 by March 2024.\n\n\n\n\n\n\n\n\nView Full Image\n\n\nBitcoin prices \n\t\t\t\n\n\n\n     \n      Suppose history is something we can learn from with respect to other ETFs, their AUMs and their correlation to underlying asset prices over a five-year period, then it would not be farfetched to imagine the price of Bitcoin is headed for the moon in the next five years.\n\nNithin Eapen is a seasoned speaker, technologist and entrepreneur with a deep passion for finance, cryptocurrencies and technology. With a computer science and finance background, Nithin has spent over two decades in the tech and financial industry, working with cutting-edge technologies and innovative startups. \n\nNote: The purpose of this article is only to share an opinion. It is not a recommendation. If you wish to consider an investment, you are strongly advised to consult your adviser. This article is strictly for educational and informational purposes only.\nThe immediate impact was that the ProShares Bitcoin Strategy ETF saw a strong reception, with over $1 billion in AUM in just a few days. It was the second-most heavily traded new ETF on its first day in history.\nIn 2022, Grayscale launched a lawsuit against the SEC after its application to convert its Bitcoin Trust into a spot Bitcoin ETF was rejected. Grayscale argued that the SEC acted arbitrarily by approving futures-based ETFs but not spot ETFs. The case gained significant attention and highlighted the ongoing struggle between crypto advocates and regulators.\nThe D.C. Circuit Court of Appeals closed the books on a dispute between the SEC and Grayscale with a final ruling that ordered the agency to scrap its rejection of the asset manager's spot Bitcoin ETF application in October 2023.\nOn 10 January 2024, the SEC eventually approved 11 new spot Bitcoin ETFs. A spot Bitcoin ETF is an ETF that tracks Bitcoin's spot or current price.\nVarious funds started holding ETFs in bonds, currencies, gold, real estate investment trusts and volatility, but none caused the storm as Bitcoin spot ETFs in 2024.\nIn six months, the top Bitcoin ETFs had an aggregate AUM of $42 billion, something the Gold ETF achieved in six years. The price rose after the court verdict from $27,000 in October 2023 to $45,000 until the first ETF approval date. From the first ETF trading date of January 2024, it went to $70,000 by March 2024.\nSuppose history is something we can learn from with respect to other ETFs, their AUMs and their correlation to underlying asset prices over a five-year period, then it would not be farfetched to imagine the price of Bitcoin is headed for the moon in the next five years.\nNithin Eapen is a seasoned speaker, technologist and entrepreneur with a deep passion for finance, cryptocurrencies and technology. With a computer science and finance background, Nithin has spent over two decades in the tech and financial industry, working with cutting-edge technologies and innovative startups.\nNote: The purpose of this article is only to share an opinion. It is not a recommendation. If you wish to consider an investment, you are strongly advised to consult your adviser. This article is strictly for educational and informational purposes only.\nLog in to our website to save your bookmarks. It'll just take a moment.\nYou are just one step away from creating your watchlist!\nOops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image.\nYour session has expired, please login again.\nYou are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder.\nThis is a subscriber only feature Subscribe Now to get daily updates on WhatsApp\nOur team will get back to you shortly","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nEvery four years, as the U.S. gears up for a presidential election, Bitcoin seems to follow a distinct and somewhat predictable pattern. Whether it was 2012, 2016, or even 2020, Bitcoin's price has historically responded to the election cycle in a strikingly similar manner. In this article, we’ll explore these patterns, examine the current market trends, and discuss what you can expect from Bitcoin as we approach the 2024 election.\nBitcoin’s price behavior leading up to presidential elections has shown a consistent trend: a significant dip approximately 2-3 months before the election. Let's break down the data:\n2020: Two months before the election, Bitcoin experienced a sharp 16% drop. This downturn occurred almost to the day, two months ahead of the election.\n2016: The pre-election dip was even more pronounced, with a 30% drop occurring about three months before the election.\n2012: The first of these patterns saw the most dramatic dip—a staggering 57% drop about 80 days before the election.\nAs we look at the current cycle, Bitcoin has once again followed suit with a 30% decline occurring just within the expected timeframe, 2-3 months ahead of the 2024 election.\nWhile the pre-election dip may cause concern for some investors, history shows that Bitcoin tends to rally significantly after the election. Here’s what happened in the past:\n2020: Post-election, Bitcoin went on an incredible run, gaining approximately 320% over the next 160 days.\n2016: Following the election, Bitcoin surged by over 2,000% within 400 days. Even in the short term, Bitcoin saw a 300% increase within 200 days.\n2012: After the election, Bitcoin skyrocketed by another 2,000% in just 154 days.\nGiven these patterns, it’s reasonable to expect a similar bullish trend following the 2024 election. The market is more mature now, which might moderate the gains, but the potential for significant upside remains strong.\nLooking ahead, there’s considerable speculation about Bitcoin’s potential to reach $100,000 or more in 2024. Recent market analysis shows Bitcoin is respecting key technical levels within a parallel channel that has guided its price movements over the past few months. If Bitcoin breaks out of this channel, historical data suggests we could see a surge similar to previous election cycles.\nHere’s what the chart tells us:\nIf Bitcoin follows the current pattern, we could see it pushing towards $100,000 between Thanksgiving and Christmas of 2024.\nA potential high of $116,000 by October is also on the table, although this might be optimistic.\nThis prediction aligns with historical patterns, where post-election periods have triggered substantial bullish movements in Bitcoin’s price.\nAs we approach the 2024 presidential election, Bitcoin is likely to continue following its established pattern of pre-election dips followed by strong post-election rallies. For investors, understanding this pattern can be crucial for making informed decisions.\nWhile past performance doesn’t guarantee future results, the consistent behavior of Bitcoin during election cycles provides a blueprint that can guide your investment strategy. Stay informed, keep an eye on the charts, and be prepared for both the dip and the potential surge that could follow.Disclaimer\nThis article is for informational purposes only and should not be considered financial advice. Cryptocurrency investments are highly speculative and come with risks. Always do your own research before making any investment decisions.","Crypto casinos are now a thing among crypto lovers and avid players alike and are making their mark on the online gambling niche, although they aren’t mainstream yet. According to a report by CasinoRix researchers, the crypto gambling market now has a value of $250 million, and will still grow bigger. As projected, they are even going to get better with artificial intelligence (AI) and machine learning (ML) on the scene. We’ll see how these innovations help players have the best experiences in crypto casinos. But first, let’s take a sneak peek into what these casinos are all about\nThink of crypto casinos as an online platform where anyone can hope to win big on various games. But instead of fiat currency, players can use their favourite type of crypto coin or token. Besides this, they can enjoy the security that blockchain technology brings to the table, lower fees and fast and seamless transaction processing. With these in mind, it’s safe to say that crypto casinos are innovative in themselves.\nTherefore, seeing the numerous benefits crypto offers, it isn’t surprising that a lot of gamblers now want to find a great crypto casino and make them benefit the most from this digital goldmine. These dynamic crypto casino platforms have so many games that anyone can play and enjoy using the cryptocurrency of their choice, whether BTC, MATIC, ETH, BNB, CHP, or USDT. The icing on the cake is the various bonuses that players can benefit from when on these platforms.\nThanks to AI and ML algorithms that go through lots of data analysis, players can now have the best experiences at crypto casinos. You may be wondering how this would be possible. Let’s delve into various ways these two keep players glued to these casino platforms.\nImagine gambling in a crypto casino where everything screams “you” – this is what AI can do. Thanks to this technology, anyone on crypto platforms can now enjoy a more personalized gambling experience; AI can closely look out for a player’s real-time data, and recommend strategies that are well suited to their gameplay. This, in turn, increases their chances of winning big. But it gets even better – it can also suggest specific games (based on past choices), adjust difficulty settings and themes, and offer promotions and bonuses, all of which are specifically tailored to each player.\nIt’s no news that gambling can quickly get out of hand and cause an addiction, but AI can help a player avoid it by drawing their attention to risky behaviours and suggesting responsible gambling measures. This is possible because AI critically follows player data and observes patterns that could suggest that an addiction is lurking around. To add to this, AI-powered chatbots can quickly give players all the support they need without causing unnecessary downtime. Not only will these provide a better user experience, but they can also increase their loyalty and patronage.\nWhat’s the point in visiting crypto casinos when there’s no guarantee of fair play, and you can get scammed at any time? Fortunately, with machine learning, you would worry less about these two when playing various games on these platforms. Crypto casinos with machine learning models will give players a better chance at fair play by closely following game outcomes and pointing out cheating attempts and other manipulative schemes. This way, every player will have an even chance of winning, and those who do can be proud of their efforts and skills.\nAI-powered security systems on crypto casinos can also discover and stop fraudulent activities, keeping their players safe. This is because machine learning algorithms can use historical data to single out strange patterns that could suggest that something’s wrong, including unauthorized access, hacking attempts, and the like. Aside from this, AI-inspired biometric verification like voice and facial recognition ensures that only the players can use their accounts.\nBecause of AI, crypto casinos would no longer be limited to mobile phones. After all, why not gamble in real time at your favourite crypto casino using virtual reality (VR) or augmented reality (AR)? With AI, players can now interact with virtual dealers and other players, just like what happens at brick-and-mortar casinos. This makes the experience more exciting, winning more players over. But that’s not all! Developers can use AI to create new game content periodically, which means players can always expect fresh environments and challenges when they visit crypto casinos.\nThere’s no denying the fact that AI and machine learning in crypto casinos can make the experience more enjoyable for players. There’s safety and security, fair play, and even more personalised gaming recommendations that anyone can take advantage of. However, it’s not perfect yet; there’s still the issue of integrating blockchain technology and AI. This is because blockchain thrives on anonymity, and AI is all about monitoring players’ behaviour, which isn’t exactly respecting their privacy. But as technology evolves, this issue will get the needed solution, along with other groundbreaking innovations that crypto casino users will benefit from.\nGet in front of thousands of founders, investors, PE firms, tech executives, decision makers, and tech readers by submitting your story to TechStartups.com."]}
{"date":"2024-08-27","titles":["BTC TO USD - Today’s Bitcoin price in Dollar on 27 August, 2024","BTC TO PKR - Today’s Bitcoin price in Pakistan on August 27, 2024","Telegram’s Possible Ban In India Triggers Memes Online; Internet Asks ‘Ab Mai Web Series Kese Dekhunga?’","Trump Selling NFT Trading Cards To Court Crypto Votes"],"urls":["https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-usd-todays-bitcoin-price-in-dollar-on-27-august-2024\/","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-august-27-2024\/","https:\/\/in.mashable.com\/tech\/81144\/telegrams-possible-ban-in-india-triggers-memes-online-internet-asks-ab-mai-web-series-kese-dekhunga","https:\/\/www.forbes.com\/sites\/maryroeloffs\/2024\/08\/27\/trump-selling-more-nft-trading-cards-as-he-courts-crypto-voters\/"],"sources":["BOL News","BOL News","Mashable India","Forbes"],"descriptions":["As of August 27, the Bitcoin to USD exchange rate stood at $62827.83. Bitcoin’s value in dollars reflects the dynamic nature","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 17503137.07 on 27 August 2024.","Crypto bros and trading bois crying in the corner","Donald Trump has been on a summer-long mission to court the cryptocurrency community ahead of the election this fall."],"article_contents":["27th Aug, 2024. 02:38 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 10, 2024\nAs of August 27, the Bitcoin to USD exchange rate stood at $62827.83. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 62827.83 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","27th Aug, 2024. 02:38 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 17503137.07 on 27 August 2024.\n1 BTC = 17503137.07 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","Telegram’s co-founder and boss Pavel Durov was arrested by the French authorities on Sunday for allegedly enabling illegal content and activities on the platform to go unchecked, including money laundering, terrorism, drugs, cyberbullying, and other offenses. Amid all the cacophony, the Indian government is conducting its own investigation into the matter, which may lead to a suspension or ban of the messaging app in India. More details are awaited on the matter.\n#Telegram CEO’s arrest: Did messaging platform become a petri dish in India for financial frauds, exam scams, and more? Read 👇https:\/\/t.co\/0DIU7DSV6Y\n— Mint (@livemint) August 27, 2024\n#Indian authorities are probing #Telegram over extortion and gambling concerns. The investigation could result in a ban.https:\/\/t.co\/sMVOWDOCAS\n— Hindustan Times (@htTweets) August 26, 2024\nFounder and CEO of #Telegram #PavelDurov was detained in France owing to investigation focused on a lack of moderators on the messaging app.\n\nKnow more about him here: https:\/\/t.co\/wuFZHjiguW pic.twitter.com\/RUfj77iwH4\n— Hindustan Times (@htTweets) August 26, 2024\nMeanwhile, reactions poured in with a wave of memes online.\nAfter hearing #Telegram ban news\nIndian Aspirants :- pic.twitter.com\/MiMUkHL8JA\n— Shrikant 🇮🇳 (@ShrikantGMagar) August 26, 2024\nCharo taraf dukh ka mahaul. #Telegram pic.twitter.com\/qUS26CbPNq\n— Prayag (@theprayagtiwari) August 27, 2024\n#Telegram might get banned in India* pic.twitter.com\/hNcOSvgupC\n— Wellu (@Wellutwt) August 26, 2024\nIndian government has banned #Telegram\nMe & my Bois: pic.twitter.com\/Vwqaxab77O\n— Sid (@mishrasid007) August 26, 2024\n#Telegram Banned in india !\nNon- users : pic.twitter.com\/5EldfwRtTQ\n— Deepanshu :) (@ParasharVibes) August 26, 2024\n#Telegram ban hone ka sabse bada reason kya h ?\n\nAns) Bhai link de de pic.twitter.com\/cOLb50ngSD\n— Kumar M (@OldYaade) August 26, 2024\nJust Modi Govt things 👇#Telegram pic.twitter.com\/DSXehNqmR7\n— Sugam Tripathi (@Sugamcasm) August 27, 2024\nSeveral users pleaded the case for not banning the app as it has been mighty useful for students, especially UPSC aspirants in towns and villages with no access to proper resources. However, other users highlighted how many lost their savings because the app allowed free reign for swindlers. A few took a jibe on how the ban will wreck the lives of traders on the platform, besides the consumers of banned content online, including pirated movies, web series, and even porn. Meanwhile, a handful of users reasoned why to ban Telegram while gambling apps are openly being promoted, which has destroyed so many lives and families.\nTelegram should not be #BANNED in India. It is the only source for middle class students to get study material and can do quizzes free of cost. #Telegram @telegram @smstelegram\n— Raman Kaur (@rmnkaurKA) August 26, 2024\nअब मैं Web Series कैसे देखूँगा। 😞 #Telegram手机号码 #Telegram\n— Tarachand Meena (@TarachandSihra) August 27, 2024\nDon't ban #Telegram, instead ban the illegal stuff there, millions of students are depend on that one app not only for pirated study material but there are many such helpful bots and people out there. Indian Government could not do anything GOOD for students at least bare this.\n— प्रशिक ☸ (@EnigmatSphinx8) August 27, 2024\nIf telegram is taken down, stock market will crash😂😂. People wont get multibeggar ideas on telegram 😂😂\n— Global Statistics (@Globalstats11) August 27, 2024\nWhy just Telegram? Gambling activities are everywhere, and there are gambling apps being promoted openly.😂\n— 47Sha (@47Sha_) August 27, 2024\nMany have lost millions of their savings because @telegram allowed a free hand to swindlers..\n— DelhiMuse (@DelhiMuse) August 27, 2024\nSee Also:  Musk Reacts To Telegram's Billionaire Founder Pavel Durov’s Arrest In France; Asks Why Zuck Is Not Arrested Instead\nSee Also: Telegram's Massive Revenge Porn Problem Has Made These Women’s Lives Hell\nAs the Russia-born billionaire has citizenship of the UAE, the Emirati government, along with the Russian embassy, are pushing to get Durov consular services. Besides the Emirati citizenship, the 39-year-old is also a citizen of France, Russia, and the Caribbean island nation of St. Kitts and Nevis. Born in Russia, Durov spent a major chunk of his childhood in Italy. Meanwhile, even as Durov’s custody has been extended under French law, wherein authorities will question him for up to four days, post which the judges will take a call on pressing charges or his release. Elon Musk slammed the arrest, campaigning for the release of Pavel and slamming the puppeteers behind the powers of curtailing free speech. French President Emmanuel Macron took to X\/Twitter and posted that Durov’s arrest is not political but rather “part of an ongoing judicial investigation.” Responding to Macron, the Tesla billionaire asked for “more details” on the Telegram boss’s arrest so that “it would be helpful to the global public to understand.”\nI have seen false information regarding France following the arrest of Pavel Durov.\n\nFrance is deeply committed to freedom of expression and communication, to innovation, and to the spirit of entrepreneurship. It will remain so.\n\nIn a state governed by the rule of law,…\n— Emmanuel Macron (@EmmanuelMacron) August 26, 2024\nIt would be helpful to the global public to understand more details about why he was arrested\n— Elon Musk (@elonmusk) August 27, 2024\nSee Also: Telegram’s Billionaire Founder Reveals He Has Fathered Over 100 Biological Kids; Plans To Open-Source His DNA!\nSee Also: ‘Stop Using WhatsApp, It’s A Surveillance Tool’ Warns Telegram Founder Pavel Durov\nSee Also: Telegram Is The New Breeding Ground For Crypto Hackers","Former President Donald Trump has released a fourth batch of the digital trading cards he says have generated millions of dollars with each launch, his latest merchandise sale—as he continues an attempt to court crypto-friendly voters ahead of November’s election.\nDonald Trump on August 26, 2024 in Detroit, Michigan.(Photo by Emily Elconin\/Getty Images)\nTrump on Tuesday announced the release of $99 \"Series 4: The America First Collection\" non-fungible tokens (or NFTs).\nThis round of cards feature Trump posing as a \"sneakerhead\" wearing his own line of golden shoes, wearing an Iron Man-esque suit with the title \"SuperTrump\" and several with the label \"crypto president,\" a moniker he gave himself while speaking at a tech fundraiser in June.\nThe release includes pricy packages that promise physical gifts to buyers: Customers who hit a minimum spend could get autographed shoes from Trump's sneaker line, a piece of his suit from his debate with President Joe Biden and dinner with the former president, and up to 25 people who spend $24,750 (using only crypto) are promised tickets to a Trump gala in Florida next month and cocktails with the former president.\nIn the past, Trump has said the drops of his digital trading cards, which sell for $99 each, have generated more than $4 million in total revenue per release—though his cut isn’t clear.\nThe launch of the new NFT cards comes less than a week after Trump promoted an \"official\" cryptocurrency project using his name on Truth Social and linked to a group in the Telegram messaging app run by his sons Eric and Don Jr. called \"The DeFiant Ones\" (a nod to DeFi, short for decentralized finance).\nThe group has since been renamed “World Liberty Financial\" and has almost 50,000 subscribers, though little is known about the project.\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here: joinsubtext.com\/forbes.\nTrump has sold sneakers, t-shirts and other merchandise to fans for months, a push that comes as he faces a tight race against Vice President Kamala Harris, legal bills and some $450 million in civil court judgements. The new crypto project and release of more NFT trading cards are part of a larger push from Trump to court the crypto community, despite having ripped cryptocurrencies like bitcoin in the past as a “scam against the dollar.\" While in the White House, Trump was openly critical of cryptocurrency and called the values of bitcoin and others “highly volatile and based on thin air.\" He said in 2021 that bitcoin “just seems like a scam,\" but has since reversed his position and ditched the skepticism he had for years. In May, Trump spoke at the Libertarian Party's national convention and vowed to “stop Joe Biden’s crusade to crush crypto.” Trump met with bitcoin miners at his Mar-a-Lago estate in Florida and said he wants all future bitcoin to be minted in the U.S. In June, he dubbed himself the \"crypto president\" and, in July, gave a keynote address at Bitcoin 2024 in Nashville, Tennessee, the world’s largest bitcoin conference. Trump's running mate Sen. JD Vance, R-Ohio,)is also largely seen as a pro-crypto candidate thanks to his background in venture capital and a plan he introduced in June that would overhaul how regulatory agencies police the crypto market. In addition, Trump has courted some crypto-friendly billionaire donors including Tyler and Cameron Winklevoss, Marc Andreessen, Ben Horowitz and Elon Musk.\nTrump’s comment on Biden’s “crusade to crush crypto” came as the current administration grew stricter on cryptocurrency, taking action against several large exchanges—including Coinbase and Binance—that they allege operated illegally. Last year, the Biden administration warned Congress against tying cryptocurrency to the nation's broader financial system and said to do so could undermine the country's financial stability. The White House has said it is not working to harm the industry but instead wants to \"ensure a comprehensive and balanced regulatory framework for digital assets.\"\n$100 million. That's how much BTC Inc. CEO David Bailey told CNBC the larger crypto industry was aiming to raise to support Trump, as well as a plan to help turn out more than 5 million voters.\nFurther regulation of cryptocurrency is a top issue for the industry in the 2024 election. Leading up to November, crypto companies have accounted for nearly half of all donations made by corporations this election cycle, a Public Citizen report found, and such corporations have spent more than $119 million. The money is largely being used to support pro-crypto candidates, the report found, and on “attacking crypto skeptics.”\nOne Community. Many Voices. Create a free account to share your thoughts.\nOur community is about connecting people through open and thoughtful conversations. We want our readers to share their views and exchange ideas and facts in a safe space.\nIn order to do so, please follow the posting rules in our site's Terms of Service.  We've summarized some of those key rules below. Simply put, keep it civil.\nYour post will be rejected if we notice that it seems to contain:\nUser accounts will be blocked if we notice or believe that users are engaged in:\nSo, how can you be a power user?\nThanks for reading our community guidelines.  Please read the full list of posting rules found in our site's Terms of Service."]}
{"date":"2024-08-28","titles":["Global Market Fluctuations: Dollar, Cryptocurrencies, and More"],"urls":["https:\/\/www.devdiscourse.com\/article\/business\/3065655-global-market-fluctuations-dollar-cryptocurrencies-and-more"],"sources":["Devdiscourse"],"descriptions":["The dollar neared a yearly low, while sterling traded near multi-year highs. Markets focused on potential U.S. interest rate cuts. Bitcoin dropped over 4%, and the Australian dollar rose. Muted movements were observed as traders awaited economic clues. A strong upside PCE surprise is needed to alter multiple Fed cut expectations."],"article_contents":["The dollar held near its lowest point in more than a year against a basket of peers on Wednesday, with sterling just off multi-year highs. Markets concentrated on clues regarding the potential size of a widely anticipated U.S. interest rate cut next month.\nCryptocurrency bitcoin took the spotlight in Asia, plummeting over 4% after breaking below support around $60,000. Meanwhile, the Australian dollar surged to an eight-month high after data indicated domestic inflation slowed to a four-month low in July. However, the general progress on tempering price gains was disappointing. \"The Reserve Bank of Australia is unlikely to pivot in the September meeting, which might strengthen the AUD temporarily,\" said Charu Chanana, Saxo's head of FX strategy.\nElsewhere, overall movements in the foreign exchange market were muted as traders awaited new signals about the state of the world's largest economy. Markets are fully priced for a 25-basis point cut, with a preliminary estimate for U.S. GDP and core PCE index data due later this week. A strong PCE upside surprise is needed to counter expectations of multiple Fed cuts. The dollar index was last 0.2% higher at 100.78, hovering above a 13-month low.\n(With inputs from agencies.)\nEmail: info@devdiscourse.com Phone: +91-720-6444012, +91-7027739813, 14, 15\n© Copyright 2025"]}
{"date":"2024-08-29","titles":["BTC TO PKR - Today’s Bitcoin price in Pakistan on August 29, 2024","BTC TO USD - Today’s Bitcoin price in Dollar on 29 August, 2024"],"urls":["https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-august-29-2024\/","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-usd-todays-bitcoin-price-in-dollar-on-29-august-2024\/"],"sources":["BOL News","BOL News"],"descriptions":["The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16605192.88 on 29 August 2024.","As of August 29, the Bitcoin to USD exchange rate stood at $59658.55. Bitcoin’s value in dollars reflects the dynamic nature"],"article_contents":["29th Aug, 2024. 12:03 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO PKR – Today’s Bitcoin price in Pakistan on Nov 25, 2024\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16605192.88 on 29 August 2024.\n1 BTC = 16605192.88 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","29th Aug, 2024. 12:03 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Jan 17, 2024\nAs of August 29, the Bitcoin to USD exchange rate stood at $59658.55. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 59658.55 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
{"date":"2024-08-30","titles":["Could Bitcoin hit $150K before 2024 ends?","Why Bitcoin can still hit $115K, according to one of crypto's top analysts","Elon Musk, Tesla win dismissal of lawsuit by dogecoin investors","BTC TO USD - Today’s Bitcoin price in Dollar on 30 August, 2024","BTC TO PKR - Today’s Bitcoin price in Pakistan on August 30, 2024"],"urls":["https:\/\/finance.yahoo.com\/news\/could-bitcoin-hit-150k-2024-224205734.html","https:\/\/finance.yahoo.com\/news\/why-bitcoin-still-hit-115k-223457710.html","https:\/\/nypost.com\/2024\/08\/30\/business\/elon-musk-tesla-win-dismissal-of-lawsuit-by-dogecoin-investors\/","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-usd-todays-bitcoin-price-in-dollar-on-30-august-2024\/","https:\/\/www.bolnews.com\/business\/2024\/08\/btc-to-pkr-todays-bitcoin-price-in-pakistan-on-august-30-2024\/"],"sources":["Yahoo Finance","Yahoo Finance","New York Post","BOL News","BOL News"],"descriptions":["Experts explore the possibility of bitcoin reaching $150K, debating its year-end price potential","Historically weak summer trading action doesn't have one of crypto's top analysts feeling any less bullish","Elon Musk and his electric vehicle company Tesla won the dismissal of a federal lawsuit accusing them of defrauding investors by hyping the cryptocurrency dogecoin and conducting insider trading, causing billions of dollars of losses.","As of August 30, the Bitcoin to USD exchange rate stood at $59448.50. Bitcoin’s value in dollars reflects the dynamic nature","The rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16570549.48 on 30 August 2024."],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAs bitcoin continues to trade in a range-bound fashion this summer, analysts are looking ahead to a volatile end to 2024.\nRoundtable anchor Rob Nelson recently discussed price targets with experts, including George Tung, host of CryptosRUs. George confidently stated that there's “a really good shot” Bitcoin could break $100,000 by year's end.\nGav Blaxberg, CEO of WOLF Financial, offered a more conservative view, predicting Bitcoin might reach $80,000, though he remained bullish on the overall market, acknowledging, “Maybe I'm a little bit more conservative, but I like George's optimism.”\nRob Nelson also brought in Rob Chang, CEO of Gryphon Digital Mining, who provided an ambitious perspective. He suggested that $100,000 is “definitely doable” and, depending on market volatility, Bitcoin could even reach “125K, 150K.” Though it may seem like a stretch, he pointed out that such growth is possible given Bitcoin's history.\nThose estimations are roughly in-line with what Fundstrat's Sean Farrell has predicted for bitcoin in 2024. In 2023, the crypto analyst nearly perfectly called bitcoin's price path.\nEach panelist provided a mix of cautious optimism, reflecting the unpredictable yet exciting future of Bitcoin.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nIn a year that continues to demonstrate crypto's volatility and uncertainty, the prospects for Bitcoin remain strong despite a historically normal summer of stagnation, according to Fundstrat’s Head of Digital Asset Strategy Sean Farrell.\nFarrell joined Coinage this week to reiterate his bullish outlook, forecasting that Bitcoin could still hit $115,000 by the end of 2024. This optimism is grounded in a mix of historical patterns, current market dynamics, and the evolving landscape of digital assets.\n\"Everybody's pretty bearish, but it does seem to me like the bull case is pretty straightforward,\" he said. \"The Fed has pivoted, we have inflation falling, employment and jobs data is still non-recessionary, so in my view the bull case is more easily explained than the bear case.\"\nOf course, Bitcoin’s recent price action has been choppy, with the cryptocurrency sliding from around $62,000 to $58,000 in a matter of days. Farrell attributes this volatility largely to seasonality and a low-liquidity environment that has persisted through much of the summer.\n\"We've seen a lot of choppy price action,\" he explains, noting that the summer months typically bring lower trading volumes, which can exaggerate price movements. This seasonal sluggishness, he suggests, is not entirely unexpected and aligns with Bitcoin’s historical performance, where September often proves to be a challenging month.\nDespite the current lull, Farrell remains confident about Bitcoin's trajectory. His optimism is bolstered by several factors, including the ongoing influx of stablecoins into the market. Stablecoin issuance, often seen as a precursor to capital inflows into the broader crypto market, has been on the rise, hitting new all-time highs.\nFarrell points out that while the impact of these inflows on Bitcoin's price has yet to fully materialize, the underlying trend is positive. \"Stablecoin inflows are a huge, high-signal variable,\" he says, emphasizing that these movements from fiat into the crypto economy are often a harbinger of future price appreciation.\nHowever, Farrell acknowledges that there are risks on the horizon. These include potential geopolitical tensions, the possibility of a stag-flationary environment re-emerging, and the ongoing challenges within the Ethereum ecosystem, particularly concerning Layer 2 solutions. Yet, even with these concerns, he believes the overall market structure remains supportive of higher Bitcoin prices.\nAs the year progresses, Farrell advises keeping an eye on the seasonal patterns and macroeconomic indicators that could influence Bitcoin's price. He suggests that the latter part of the year, particularly after the summer doldrums, could bring renewed momentum. \"We're not yet in the months where we historically have seen that happen, but we’re getting closer,\" he says, hinting at a potential rally as traders return from the summer break.\nUltimately, Farrell’s thesis hinges on the idea that while Bitcoin may face short-term headwinds, the long-term outlook remains robust. His forecast of $115,000 by year-end reflects a blend of cautious optimism and data-driven analysis, underscoring his belief that Bitcoin’s best days in 2024 could still be ahead.","Elon Musk and his electric vehicle company Tesla won the dismissal of a federal lawsuit accusing them of defrauding investors by hyping the cryptocurrency dogecoin and conducting insider trading, causing billions of dollars of losses.\nThe decision was issued on Thursday night by US District Judge Alvin Hellerstein in Manhattan.\nInvestors accused the world’s richest person of using Twitter posts, a 2021 appearance on NBC’s “Saturday Night Live” and other publicity stunts to trade profitably at their expense through several dogecoin wallets that he or Tesla controlled.\nThey also said Musk deliberately drove up dogecoin’s price more than 36,000% over two years and then let it crash, with he and Tesla often timing trades to Musk’s public statements and activities concerning dogecoin.\nInvestors said this included when Musk sold dogecoin in April 2023 after replacing Twitter’s blue bird logo with the dogecoin Shiba Inu dog logo, causing dogecoin’s price to rise 30%.\nHellerstein, however, said Musk’s tweets that dogecoin was the future currency of Earth, and could be used to buy Teslas or literally flown to the moon by his company SpaceX were “aspirational and puffery, not factual and susceptible to being falsified.”\nThe judge said that meant no reasonable investor could rely on the tweets to pursue a securities fraud claim. He also said it was “not possible to understand” the investors’ market manipulation and insider trading claims.\nHellerstein dismissed the lawsuit with prejudice, meaning it cannot be brought again.\nInvestors originally sought $258 billion and had amended their complaint four times in two years.\nLawyers for the investors did not immediately respond to requests for comment.\nMusk’s lawyer Alex Spiro said in an emailed statement: “It’s a very good day for dogecoin.”\nIn seeking a dismissal, Musk’s lawyers said there was nothing wrong his “innocuous and often silly tweets.”\nThey also said there was no proof Musk owned two wallets for conducting suspicious trading, or that he or Tesla ever sold dogecoin.\nOn “Saturday Night Live,” Musk called dogecoin a “hustle” while playing a fictitious financial expert on a segment of “Weekend Update.”\nMusk bought Twitter in October 2022 and rebranded it X. He is worth $239.3 billion according to Forbes magazine.\nThe case is Gorog et al v. Musk et al, U.S. District Court, Southern District of New York, No. 22-05037.","30th Aug, 2024. 01:20 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO USD – Today’s Bitcoin price in Dollar on Feb 5, 2024\nAs of August 30, the Bitcoin to USD exchange rate stood at $59448.50. Bitcoin’s value in dollars reflects the dynamic nature of the cryptocurrency market. Investors and enthusiasts closely monitor these fluctuations to make informed decisions regarding buying, selling, or holding Bitcoin.\nBitcoin to USD Rate: 59448.50 Dollar\nThe price of Bitcoin fluctuates constantly due to various factors such as market demand, investor sentiment, regulatory changes, and macroeconomic trends. The crypto community closely monitors these fluctuations as Bitcoin remains a prominent player in the financial landscape.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News.","30th Aug, 2024. 01:19 pm\nShare\nListen\nFont size\nDark Mode\nSave\nPrint\nBTC TO PKR – Today’s Bitcoin price in Pakistan on Feb 10, 2024\nThe rate of Bitcoin (BTC) in Pakistani Rupee (PKR) will Bitcoin (BTC) in Pakistani Rupee (PKR) is Rs 16570549.48 on 30 August 2024.\n1 BTC = 16570549.48 Pakistani rupees.\nDisclaimer: All data and information are provided for informational purposes only. The data has not been provided for trading purposes or financial, investment, tax, legal, accounting, or other advice. In the case of trading, it is advised to consult your broker or financial representative to verify pricing before executing any trade. The exchange rate does not constitute investment advice. Further, it is not a recommendation to buy, sell or hold any security or financial product.\nCatch all the \n\t\t\t\t\t\t\t\t\t\t\tBusiness News, \t\t\t\t\t\t\t\t\t\t\tBreaking News Event and Latest News Updates on The BOL News\nDownload The BOL News App to get the Daily News Update & Follow us on Google News."]}
