{"date":"2024-05-01","titles":["Exploring Crypto Giants and a Rising Star: Bitcoin (BTC), Solana (SOL), and the Explosive Potential of Furrever Token (FURR)","Digihost Announces Month-Over-Month Increase in Cash and Crypto Position and Provides April 2024 Production Update"],"urls":["https:\/\/www.globenewswire.com\/news-release\/2024\/05\/01\/2873691\/0\/en\/Exploring-Crypto-Giants-and-a-Rising-Star-Bitcoin-BTC-Solana-SOL-and-the-Explosive-Potential-of-Furrever-Token-FURR.html","https:\/\/www.globenewswire.com\/news-release\/2024\/05\/01\/2873018\/0\/en\/Digihost-Announces-Month-Over-Month-Increase-in-Cash-and-Crypto-Position-and-Provides-April-2024-Production-Update.html"],"sources":["globenewswire.com","globenewswire.com"],"descriptions":["New York, NY, May  01, 2024  (GLOBE NEWSWIRE) --          In the ever-evolving landscape of cryptocurrencies, where giants like Bitcoin (BTC)...","HOUSTON, May  01, 2024  (GLOBE NEWSWIRE) -- Digihost Technology Inc. (“Digihost” or the “Company”) (Nasdaq: DGHI; TSXV: DGHI), an innovative U.S. based...."],"article_contents":["May 01, 2024 16:30 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nNew York, NY, May  01, 2024  (GLOBE NEWSWIRE) --\nIn the ever-evolving landscape of cryptocurrencies, where giants like Bitcoin (BTC) and Solana (SOL) dominate the scene with their established presence and fluctuating performances, a new contender emerges with the promise of excitement and potential for explosive growth. Introducing Furrever Token (FURR), a token that brings a refreshing dose of charm and innovation to the crypto market. As we delve into the recent performances of BTC and SOL, we'll also explore the unique features and promising trajectory of FURR, offering investors the opportunity to venture into a new realm of possibility and potentially remarkable returns.\nBouncing Back: Analyzing Bitcoin's (BTC) Price Movements Amidst Consolidation\nBitcoin (BTC) is currently priced at around $61,758.88, marking a 1.5% decrease from previous levels. Despite enduring market pessimism, BTC maintains stability above $60,000. However, the prospect of reaching $95,000 remains uncertain amidst ongoing consolidation. Technical analysis indicates a potential bullish breakout, contingent on surpassing the critical resistance at $71,800. Failure to breach this level might trigger further downside towards $58,000. Nonetheless, sustained bullish momentum could signal a resurgence towards new all-time highs, in line with historical patterns. While the current period of consolidation may seem tedious, previous cycles have shown that such phases often precede significant upward movements.\nSolana (SOL) Facing Challenges Amidst Market Volatility: A Comprehensive Analysis\nSolana, one of the largest smart contract platforms, maintains prominence with its robust ecosystem. However, the recent market downturn significantly impacted it. Starting from March 20, when the journey towards a new ATH began, both Solana-based meme coins and SOL Coin prices had to pause their rally.\nAs of writing, Bitcoin trades at $63,375, and SOL Coin at $135. Last week's momentum in negativity deepened the bearish outlook further. The RSI dipping below the neutral zone brought the potential for overselling. If Bitcoin initiates another test below $60,000, SOL Coin investors might react swiftly with selling pressure.\nAdditionally, the decreasing Sharpe ratio is noteworthy. This metric measures the risk-adjusted return, with lower values indicating a weaker reward appetite among investors. With a Sharpe Ratio of -4.27, investor appetite is already low, and a sharp drop could push the rapidly rising price into double-digit levels.\nWhile hovering around $134-135, SOL Coin price has been trapped within the ascending triangle formation for about 15 days as altcoins descend gradually and steadily, a death cross forms on the chart. This bearish signal occurs when the 50-day Exponential Moving Average (EMA) falls below the long-term 200-day EMA, typically becoming apparent during significant sell-offs.\nIf the signal proves correct, SOL Coin's price may lose support at $126, potentially reaching $100 and $85 levels. Nonetheless, rapid reversals above $85 will likely maintain the uptrend.\nUnleashing Cuteness: Furrever Token (FURR) - Revolutionizing the Crypto Space\nFurrever Token (FURR) has swiftly captured the attention of crypto enthusiasts with its unique blend of innovation and cuteness, aiming to revolutionize the crypto space. Unlike traditional projects, Furrever Token injects joy and whimsy into the world of blockchain, centered around the universal appeal of adorable kitties. Its mission is to foster a warm and friendly community, creating a delightful crypto ecosystem where users can engage with cute cat imagery and share in the joy of the lighter side of crypto.\nThe tokenomics of FURR are designed to ensure a fair and transparent distribution, with 65% available during the presale, 25% allocated for DEXs, and 10% for the team, locked for a year. This strategic allocation has contributed to its remarkable success, with Furrever Token raising over $1 million in just two months during its presale stages.\nOne of the key features of Furrever Token is its ability to transform everyday experiences into adorable moments, integrating cute cat-themed stickers and visuals for users to enjoy. The community engagement is further enhanced through regular challenges, launches, and growth initiatives, fostering a sense of shared joy among its members.\nWith a focus on security and compliance, Furrever Token ensures a secure and enjoyable experience for all users. The smart contract has been audited by Securi Lab, and the team's commitment to transparency is evident through their active presence on social channels, with nearly 4k organic members on Telegram.\nFurrever Token's journey towards widespread adoption continues, with its launch set to take place on DEX (PancakeSwap). With its appealing features, up to 15X returns, and a current price of $0.000648, FURR presents an exciting opportunity for investors looking to join a vibrant and growing community. To purchase Furrever Token, visit the official website at furrevertoken.com.\nDiscover the Most Exclusive Presale Opportunity of 2024 Now:\nFurrever Token Official Website Visit Furrever Token Presale Join Official Telegram Group       Follow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support@furrevertoken.comDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.","May 01, 2024 06:00 ET\n\n\n | Source:\r\n            \nDigihost Technology Inc.\n\n\n\n\nDigihost Technology Inc.\nHOUSTON, May  01, 2024  (GLOBE NEWSWIRE) -- Digihost Technology Inc. (“Digihost” or the “Company”) (Nasdaq: DGHI; TSXV: DGHI), an innovative U.S. based blockchain technology and computer infrastructure company, is pleased to provide unaudited comparative Bitcoin (“BTC”) production results for the month ended April 30, 2024, combined with an operations update. All monetary references are expressed in USD unless otherwise indicated.\nMichel Amar, Chairman and CEO of Digihost, commented, “The Company is pleased to announce that it has been able to increase and secure its overall cash and cryptocurrency position over the course of the last few months. Even though Digihost is facing similar challenges as other miners post-halving, the recent steps taken by the Company to diversify its revenue streams and partner on hosting agreements will allow it to pursue additional opportunities to enhance its computing power in an environmentally conscious manner.”\nMonthly Production Highlights for April 2024\nOperations Update\nPresently, Digihost’s consolidated operating capacity across its three sites represents approximately 90MW of available power and is mining at hashrate of 2 EH\/s.\nAbout Digihost\nDigihost is a growth-oriented technology company focused on the blockchain industry. The Company operates from three sites in the U.S. and, in addition to managing its own operations, provides hosting arrangements at its facilities.\nFor further information, please contact:\nDigihost Technology Inc.www.digihost.caMichel Amar, Chief Executive Officer T: 1-818-280-9758Email: michel@digihost.ca\nCautionary StatementTrading in the securities of the Company should be considered highly speculative. No stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\nForward-Looking StatementsExcept for the statements of historical fact, this news release contains “forward-looking information” and “forward-looking statements” (collectively, “forward-looking information”) that are based on expectations, estimates and projections as at the date of this news release and are covered by safe harbors under Canadian and United States securities laws. Forward-looking information in this news release includes information about potential further improvements to profitability and efficiency across mining operations, including, as a result of the Company’s expansion efforts, potential for the Company’s long-term growth, and the business goals and objectives of the Company. Factors that could cause actual results to differ materially from those described in such forward-looking information include, but are not limited to: future capital needs and uncertainty of additional financing; share dilution resulting from equity issuances; risks relating to the strategy of maintaining and increasing Bitcoin holdings and the impact of depreciating Bitcoin prices on working capital; effects on Bitcoin prices as a result of the most recent Bitcoin halving; development of additional facilities and installation of infrastructure to expand operations may not be completed on the timelines anticipated by the Company, or at all; ability to access additional power from the local power grid; a decrease in cryptocurrency pricing, volume of transaction activity or generally, the profitability of cryptocurrency mining; further improvements to profitability and efficiency may not be realized; development of additional facilities to expand operations may not be completed on the timelines anticipated by the Company; ability to access additional power from the local power grid; an increase in natural gas prices may negatively affect the profitability of the Company’s power plant; the digital currency market; the Company’s ability to successfully mine digital currency on the cloud; the Company may not be able to profitably liquidate its current digital currency inventory, or at all; a decline in digital currency prices may have a significant negative impact on the Company’s operations; the volatility of digital currency prices; and other related risks as more fully set out in the Annual Information Form of the Company and other documents disclosed under the Company’s filings at www.sedarplus.ca. The forward-looking information in this news release reflects the current expectations, assumptions and\/or beliefs of the Company based on information currently available to the Company. In connection with the forward-looking information contained in this news release, the Company has made assumptions about: the current profitability in mining cryptocurrency (including pricing and volume of current transaction activity); profitable use of the Company’s assets going forward; the Company’s ability to profitably liquidate its digital currency inventory as required; historical prices of digital currencies and the ability of the Company to mine digital currencies on the cloud will be consistent with historical prices; the ability to maintain reliable and economical sources of power to run its cryptocurrency mining assets; the negative impact of regulatory changes in the energy regimes in the jurisdictions in which the Company operates; and there will be no regulation or law that will prevent the Company from operating its business. The Company has also assumed that no significant events occur outside of the Company's normal course of business. Although the Company believes that the assumptions inherent in the forward-looking information are reasonable, forward-looking information is not a guarantee of future performance and accordingly undue reliance should not be put on such information due to the inherent uncertainties therein. The Company undertakes no obligation to revise or update any forward-looking information other than as required by law.\nMIAMI, April  01, 2025  (GLOBE NEWSWIRE) -- Digi Power X Inc. (“Digi Power X” or the “Company”) (Nasdaq: DGXX \/ TSXV: DGX), an innovative energy infrastructure company that develops cutting-edge data...\nMIAMI, March  31, 2025  (GLOBE NEWSWIRE) -- Digi Power X Inc. (“Digi Power X” or the “Company”) (Nasdaq: DGXX \/ TSXV: DGX), an innovative energy infrastructure company that develops cutting-edge data..."]}
{"date":"2024-05-02","titles":["Furrever Token (FURR) Shines with $10,000 Reward Competition Amid Bitcoin (BTC) and Ethereum (ETH) Recovery Efforts","HUT 8: A Cryptocurrency Stock With High Growth Potential (NASDAQ:HUT)","Pinterest and Tesla have been highlighted as Zacks Bull and Bear of the Day"],"urls":["https:\/\/www.globenewswire.com\/news-release\/2024\/05\/02\/2874799\/0\/en\/Furrever-Token-FURR-Shines-with-10-000-Reward-Competition-Amid-Bitcoin-BTC-and-Ethereum-ETH-Recovery-Efforts.html","https:\/\/seekingalpha.com\/article\/4688525-hut-8-a-cryptocurrency-stock-with-high-growth-potential","https:\/\/finance.yahoo.com\/news\/pinterest-tesla-highlighted-zacks-bull-110000130.html?.tsrc=rss"],"sources":["globenewswire.com","seekingalpha.com","finance.yahoo.com"],"descriptions":["New York City, NY, May  02, 2024  (GLOBE NEWSWIRE) --    Today in the crypto world, Bitcoin (BTC) and Ethereum (ETH) are on a mission to reclaim lost...","Hut 8 is in a stronger position with a new CEO focused on efficiency and regaining shareholder trust. Read why HUT stock is an attractive investment in my view.","Pinterest and Tesla have been highlighted as Zacks Bull and Bear of the Day."],"article_contents":["May 02, 2024 18:00 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nNew York City, NY, May  02, 2024  (GLOBE NEWSWIRE) --\nToday in the crypto world, Bitcoin (BTC) and Ethereum (ETH) are on a mission to reclaim lost ground following a recent dip. As these top two coins strive for recovery, Furrever Token (FURR) emerges as a beacon of excitement, offering enthusiasts the chance to partake in a limited-time competition with a staggering $10,000 in rewards. Amidst the tumultuous market conditions, FURR's innovative approach injects a sense of enthusiasm, promising both fun and potential rewards for participants.\nBitcoin (BTC) Price Analysis: Investors Eye Volatility Amid Market Turbulence\nBitcoin (BTC) currently trades around $57,765.00, showing a modest 1% increase since yesterday. However, recent fluctuations in the cryptocurrency market have captured the attention of investors, who perceive significant swings in Bitcoin as potential indicators of broader shifts in global market sentiment. Over the past two days, Bitcoin has experienced a 4% decline following a sharp 16% drop in April, marking its worst monthly performance since November 2022, when Sam Bankman-Fried's FTX digital-asset empire faced challenges.\nSome investors closely monitor Bitcoin's movements for insights into evolving liquidity dynamics that could impact other asset classes. The recent decline in Bitcoin coincides with signals from the Federal Reserve indicating a prolonged period of higher interest rates, tightening financial conditions through increased Treasury yields and a stronger dollar. Despite this, analysts like ByteTree Asset Management's Chief Investment Officer Charlie Morris view Bitcoin as a reliable indicator of potential trouble ahead in financial markets, anticipating a rebound at some point.\nEthereum (ETH) Price Analysis: Bearish Trend Persists Despite Short-Term Recovery\nEthereum (ETH) is currently trading around $2,929.09, marking a 3% increase since yesterday. However, recent price movements indicate continued downward pressure, with ETH struggling to surpass the psychological barrier of $3,000. Despite expectations of a potential recovery, weakness in Bitcoin and other altcoins exacerbates the bearish sentiment, suggesting further downside potential for ETH in the near term.\nAlthough Ethereum briefly rebounded from April 2024 lows, the overall trend remains bearish, with sellers maintaining control. With ETH trading below $3,000 and within a bearish formation initiated in mid-April, the likelihood of the coin reaching new lows for Q2 2024 is high. Currently, ETH is experiencing a 3% decline over the past day and a 9% decrease over the previous week, accompanied by diminishing participation and increasing selling pressure. Unless ETH sees a significant uptick above $3,000, the possibility of a drop below $2,600 remains considerable, with further downside potential to $2,200 if selling pressure persists.\nFurrever Token (FURR) Offers You to Earn $10K Worth of Tokens\nFurrever Token (FURR) stands out in the cryptocurrency landscape with its unique blend of charm and functionality. At its core, FURR offers more than just a financial instrument; it provides users with a whimsical ecosystem that celebrates the universal appeal of adorable cat imagery. From playful cat-themed stickers to charming visuals, FURR transforms mundane interactions into delightful experiences, adding a touch of joy to every transaction.\nOne of the key pillars of FURR's mission is community building. By fostering a warm and inclusive environment, the token aims to cultivate a sense of shared camaraderie among its users. Through regular engagement activities, such as challenges and events, FURR encourages members to come together and celebrate their mutual love for all things cute and cuddly.\nIn the fast-paced world of cryptocurrency investing, FURR offers a refreshing change of pace with its promise of significant returns. With the potential for up to 15X returns, FURR has caught the attention of savvy investors looking to capitalize on emerging opportunities in the market. The success of its presale, which raised over $1 million in just two months, is a testament to the growing interest in FURR's unique value proposition.\nCurrently trading at $0.000648, FURR is exclusively available for purchase on its official website, furrevertoken.com. This ensures that investors have direct access to the token, without the need to navigate through third-party platforms or exchanges. By maintaining control over its distribution channels, FURR can provide users with a secure and seamless buying experience, further enhancing its appeal in the market.\nIn addition to its enticing features and investment potential, Furrever Token presents an exciting opportunity with its $10,000 Frenzy Bonanza Competition. Open to members of the Furrever community, the competition invites participants to complete various tasks on the Gleam platform to earn points. The more tasks completed, the greater the chance of being selected as one of three random winners.\nThe competition runs for seven days, starting from 02\/05\/2024 at 12:00 pm (UTC +1) and ending on 09\/05\/2024 at 12:00 pm (UTC +1). The lucky winners will share a total prize pool of $10,000 worth of FURR, with the first-place winner receiving $5,000, the second-place winner receiving $3,000, and the third-place winner receiving $2,000. With exciting rewards up for grabs, the Furrever Token Frenzy Bonanza Competition offers participants a chance to add a touch of cuteness to their wallets while engaging with the vibrant Furrever community.\nOverall, Furrever Token (FURR) represents a refreshing and innovative approach to cryptocurrency, combining the allure of cute cat imagery with the potential for significant financial gains. With its vibrant community, promising returns, and user-friendly platform, FURR is poised to leave a lasting paw print in the world of digital assets.Discover the Most Exclusive Presale Opportunity of 2024 Now:Furrever Token Official Website  Visit Furrever Token Presale Join Official Telegram GroupFollow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support@furrevertoken.comDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.",null,"Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nChicago, IL – May 2, 2024 – Zacks Equity Research shares Pinterest PINS as the Bull of the Day and Tesla TSLA as the Bear of the Day. In addition, Zacks Equity Research provides analysis on Coinbase Global, Inc. COIN, Robinhood Markets, Inc. HOOD, and NVIDIA Corp. NVDA.\nHere is a synopsis of all five stocks:\nPinterest became a Zacks #1 Rank in early April as analysts started to raise estimates ahead of their quarterly report this week.Pinterest reported strong first-quarter 2024 results on Tuesday, with the bottom and top lines surpassing their respective Zacks Consensus Estimate.The big story is that lots of architecture solutions for advertising and marketing technology are paying off and providing sustained ROI to sellers, such as bottom-of-funnel direct response ads and supporting ad-tech.You can get all the quarterly numbers and growth metrics in this article we published Wednesday. Today I want to focus on the analyst reactions.\nSeveral investment bank analysts were impressed by the quarter and management's ability to turn the levers of growth -- especially capitalizing on key relationships with Google and Amazon.RBC Capital found that PINS' strong Q1 performance was driven by the effectiveness of direct links that resulted in increased advertiser spending due to improved return on ad spend.\"Direct Links is working, with advertisers spending more as they see better ROAS,\" said the RBC led by Brad Erickson.\"From here, we think Direct Links has only just begun enabling PINS's value-capture from higher conversions,\" they said, adding that Amazon and Google are open-ended contributors that have only just started.Erickson also highlighted upcoming artificial intelligence (AI) measurement tools that could provide tailwinds for several years.RBC raised their price target on PINS to $52 from $48 and reiterated their Outperform rating.Goldman Sachs analyst Eric Sheridan liked the \"very strong\" results for Q1, and noted \"broad-based upside.\"\"In many ways, we see this quarterly report as evidence of management progress across its mix of product initiatives (shoppable content, direct response\/bottom-funnel ad budgets and partnerships aiding in wider scaled monetization).\"Sheridan maintained his Buy rating while raising his price target from $41 to $44 and he added that the company's partnerships with Amazon and Alphabet \"are contributing revenue momentum that should continue to build throughout 2024.\"JPMorgan analyst Doug Anmuth wrote that Pinterest \"shifted into a higher gear of growth with broad-based strength across users & monetization.\"Anmuth reiterated a Neutral rating while raising his price target from $38 to $44.Wedbush analyst Scott Devitt wrote in a note to clients that the PINS results reflected \"broad-based strength stemming from ongoing initiatives to improve monetization as well as healthy MAU (monthly active users) and engagement growth.\"Devitt observed that Pinterest has started to benefit from the \"ongoing adoption of lower funnel advertising tools and new ad surfaces, which are driving monetization improvements.\"He maintained a Neutral rating while raising his price target from $38 to $44.Piper Sandler analyst Thomas Champion wrote that while users accelerated across all geographies, with total MAUs of 512MM (+12% year-over-year), management referred to an \"aging down\" of the user base and rightly bragged that \"Gen-Z now ~40%+ of the user base and growing fastest.\"Champion reaffirmed an Overweight rating while lifting his price target from $48 to $50.Bottom line on PINS: With 17% topline growth expected this year and next to cross $4 billion, PINS only trades at 6 times forward sales. Since it looks like estimates will continue to rise from here, I'd be a buyer of this stylish social-shopping platform that continues to innovate and attract new, and younger, users and advertisers.\nTesla became a Zacks #5 Rank again on April 12 when shares were still trading above $170 and estimates were still dropping ahead of the EV maker's Q1 report on Tuesday 4\/23.My colleague Shaun Pruitt described the situation in his April 15 article...In the two months prior, the Zacks EPS Consensus fell over 20% from $3.44 to $2.73.And next year plunged nearly 24% from $4.61 to $3.52.These downward analyst revisions ahead of the company report cause TSLA shares to drop under $140 on Monday 4\/22, the eve of judgment day.But with the news on 4\/23 the market seemed to breathe a collective sigh of relief that things were not worse than delivered.While investors have been debating the company numbers, statements, and plans, here we'll just focus on why TSLA shares will remain in the cellar of the Zacks Rank.Since the report, this year's EPS projection has fallen to $2.48, representing a 20% annual drop in profits.Investors knew that Tesla was aggressively cutting the prices of its cars to gain a dominant position in the EV market.What they might not have counted on was how hard it would be for the top maker to also cut costs.\nThe faithful got a welcome surprise this past Monday when it was announced that China was ready to partner with Full-Self Driving (FSD) initiatives.\nThis shot TSLA shares back above $190. But it remains to be seen if this is a near-term driver in 2024 of sales and profits.As many debates rage about the best strategic moves for Tesla going forward -- FSD, the charging network, China imperatives -- the stock will likely remain hostage to the sales growth outlook tempered strongly by the profit metrics.Since the profit peak in 2022, every quarter that goes by without a stabilization of net income gives investors reason to believe that the EV revolution of mass adoption may be farther away than they once believed.\nThe cryptocurrency market didn’t have a memorable April after a solid rally in the first quarter that saw Bitcoin (BTC) hitting an all-time high of $73,750.\nThe world’s most popular cryptocurrency has since pulled back and was trading around $62,900 on Apr 30. One of the major reasons behind the decline in Bitcoin price was the halving event, which took place last month. The Bitcoin halving event happens once in four years.\nHowever, with the April Bitcoin (BTC) halving event now concluded, there is widespread speculation that the reduction in the supply of Bitcoins will result in a scarcity-driven price increase for the digital asset in the upcoming months.\nMiners who validate and record transactions receive rewards from the Bitcoin network and transaction fees. Halving reduces the block reward by half, aiming to cap Bitcoin's global circulation at 21 million. Consequently, demand for new Bitcoins increases, driving up prices.\nHowever, analysts argue that because halving occurs every four years and is anticipated, its effects are priced in and not disruptive. Miners may sell to boost cash flows, leading to large BTC transfers to exchanges as part of risk management strategies.\nThe ongoing volatility in the cryptocurrency market is temporary. The ongoing geopolitical tensions in the Middle East between Iran and Israel are also weighing on cryptocurrency prices.\nGiven that cryptocurrencies are traded round the clock and globally, they exhibit immediate and sometimes more pronounced reactions compared to stocks.\nTheir decentralized nature allows for swift responses to geopolitical events, as traders quickly buy or sell digital assets to navigate uncertainty. This agility in the cryptocurrency market enables rapid adjustments to changing circumstances, reflecting the dynamic and interconnected nature of the digital asset ecosystem.\nWe have narrowed our search to four crypto-oriented stocks that have strong potential for 2024. Each of our picks carries either a Zacks Rank #1 (Strong Buy) or 2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nCoinbase Global, Inc. offers financial infrastructure and technology to support the global cryptocurrency economy. COIN provides a main financial account for consumers in the crypto space, a marketplace with liquidity for institutional crypto asset transactions, and technology and services for developers to build crypto-based applications and accept cryptocurrencies securely as payment.\nCoinbase Global’s expected earnings growth rate for next year is 559.5%. The Zacks Consensus Estimate for current-year earnings has improved 141.6% over the last 60 days. Coinbase currently sports a Zacks Rank #1.\nRobinhood Markets, Inc. operates a financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds, options, gold and cryptocurrencies. HOOD buys and sells Bitcoin, Ethereum, Dogecoin and other cryptocurrencies using its Robinhood Crypto platform.\nRobinhood Markets’ expected earnings growth rate for the current year is 147.5%.The Zacks Consensus Estimate for current-year earnings has improved 45% over the last 60 days. Robinhood Markets currently has a Zacks Rank #2.\nNVIDIA Corp. is a major player in the semiconductor industry and has been one of the standout success stories of 2023. As a leading designer of graphic processing units (GPUs), the value of the NVDA stock tends to surge in a thriving crypto market. This is primarily due to the crucial role that GPUs play in data centers, artificial intelligence and the mining or production of cryptocurrencies.\nNVIDIA’s expected earnings growth rate for the current year is 84.7%. The Zacks Consensus Estimate for current-year earnings has improved 3.1% over the last 60 days. Currently, NVIDIA has a Zacks Rank #2.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nhttps:\/\/www.zacks.com\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com\/disclaimer.\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https:\/\/www.zacks.com\/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nTesla, Inc. (TSLA) : Free Stock Analysis Report\nPinterest, Inc. (PINS) : Free Stock Analysis Report\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\nRobinhood Markets, Inc. (HOOD) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research"]}
{"date":"2024-05-03","titles":["Crypto Trader Warns Bitcoin Not ‘Out of the Woods Yet,’ Maps Path Forward for Solana and Ethena","Cryptocurrency Price on May 3: Bitcoin rebounds above $59,000 ahead of U.S. jobs data; Solana, Toncoin jump up to 11%","Gold Stable, Euro Rises Ahead of NFP Report; Bitcoin Plunges Amidst Legal Struggle"],"urls":["https:\/\/dailyhodl.com\/2024\/05\/03\/crypto-trader-warns-bitcoin-not-out-of-the-woods-yet-maps-path-forward-for-solana-and-ethena\/","https:\/\/economictimes.indiatimes.com\/markets\/cryptocurrency\/cryptocurrency-price-on-may-3-bitcoin-rebounds-above-59000-ahead-of-u-s-jobs-data-solana-toncoin-jump-up-to-11\/articleshow\/109809878.cms","https:\/\/www.investing.com\/analysis\/gold-stable-euro-rises-ahead-of-nfp-report-bitcoin-plunges-amidst-legal-struggle-200648130"],"sources":["dailyhodl.com","economictimes.indiatimes.com","investing.com"],"descriptions":["A closely followed crypto strategist is warning that Bitcoin (BTC) may not yet be done correcting. Pseudonymous analyst Altcoin Sherpa tells his 215,800 followe...","Ahead of the U.S. nonfarm payrolls data later in the day, major cryptocurrencies rallied on Friday, recovering from recent declines. Concurrently, the global cr...","Market Overview Analysis by Octa covering: EUR\/USD, XAU\/USD, US Dollar Index Futures, Gold Futures. Read Octa's latest article on Investing.com"],"article_contents":["A closely followed crypto strategist is warning that Bitcoin (BTC) may not yet be done correcting.\nPseudonymous analyst Altcoin Sherpa tells his 215,800 followers on the social media platform X that only after Bitcoin reclaims the $60,000 level will he have more confidence a bullish reversal is occurring.\n“BTC: don’t think we’re out of the woods at all yet. We still need to reclaim some levels. [May 2nd’s] altcoin action is nice but I would not go all in at these current levels. Wait for BTC to show more strength first and break $60,000+ in my opinion.”\nThe analyst also says that Bitcoin’s sudden drop below $58,000 this week is similar to other corrections this cycle. He shares a chart of when Bitcoin declined from $47,000 to below $39,000 in January before continuing to the upside.\n“BTC: for what it’s worth, this price action is super normal and there’s a lot of volatility while bottoms are formed. Not necessarily saying this is ‘the bottom’ but this is common to see. Expecting more chop\/etc. over the next few days. Don’t get chopped to shit.”\nBitcoin is trading for $59,389 at time of writing, up 2.5% in the last 24 hours.\nNext up, the analyst says that Ethereum (ETH) competitor Solana (SOL) may correct in the near term to as low as $116 based on his chart of Fibonacci retracement levels, but could rally within months.\n“SOL: you just dollar-cast average in and don’t worry about it. wait there to 12 months and then sell it higher.”\nSolana is trading for $139.15 at time of writing, up more than 4% in the last 24 hours.\nLastly, the analyst says says that the governance token of the decentralized finance protocol Ethena (ENA) appears likely extend its upward momentum after retesting the Fibonacci retracement level at $0.76.\n“ENA: I’m out of this one but I think it looks solid. .618 Fibonacci + support\/resistance level and market looking ok.”\nEthena is trading for $0.80 at time of writing, up 1% in the last 24 hours.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","Did you Know?\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors.\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\nThe Ambani, Adani, Tata twist to India’s nuclear energy playbook\nTrade gap: Can India do a Trump to China?\nAsian Paints is trading at P\/E lower than pandemic levels. Is it still a value buy?\nTurning the tables, how Air India Express plans to do an IndiGo on IndiGo\nInside Siddharth Jain’s bold bet to get INOX a seat at global green energy high table\nOpportunities at a macro level: 5 stocks of companies which help in managing a scarce resource called ‘water’\nWorry not. You’re just a step away.\nIt seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account  and log in again using your ET Prime credentials  to enjoy all member benefits.\nOffer Exclusively For You\nSave up to Rs. 700\/-\nON ET PRIME MEMBERSHIP\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet Flat 40% Off\nThen  ₹ 1749 for 1 year\nOffer Exclusively For You\nET Prime at ₹ 49 for 1 month\nThen  ₹ 1749 for 1 year\nSpecial Offer\nGet flat 40% off on ETPrime\n90 Days Prime access worth Rs999 unlocked for you\nStories you might be interested in",null]}
{"date":"2024-05-06","titles":["Solana and Bitcoin Stabilize While Furrever Token Approaches $1.1 Million in Presale Funding","VanEck Crypto Monthly Recap For April 2024","Blowing Bubbles: Market Pumps Up Marathon Digital Stock Ahead of Earnings"],"urls":["https:\/\/www.globenewswire.com\/news-release\/2024\/05\/06\/2876084\/0\/en\/Solana-and-Bitcoin-Stabilize-While-Furrever-Token-Approaches-1-1-Million-in-Presale-Funding.html","https:\/\/seekingalpha.com\/article\/4689842-vaneck-crypto-monthly-recap-for-april-2024","https:\/\/www.valuewalk.com\/market-pumps-up-marathon-digital-stock\/"],"sources":["globenewswire.com","seekingalpha.com","valuewalk.com"],"descriptions":["New York City, NY, May  06, 2024  (GLOBE NEWSWIRE) --    In the ever-dynamic world of cryptocurrencies, where market fluctuations are the norm,...","In April, March’s euphoria faded into a downward price grind for digital assets and produced Bitcoin’s first negative return in eight months. Click to read.","Marathon Digital Holdings (NASDAQ:MARA) stock caught a huge bid on Monday, with the share price up 19% in afternoon trading."],"article_contents":["May 06, 2024 14:15 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nNew York City, NY, May  06, 2024  (GLOBE NEWSWIRE) --\nIn the ever-dynamic world of cryptocurrencies, where market fluctuations are the norm, Solana (SOL) and Bitcoin (BTC)  have been holding steady, offering stability amidst the volatility.  However, amidst these stalwarts, a newcomer is making waves: Furrever Token (FURR).  While SOL and BTC maintain their positions, FURR has been steadily  gaining momentum, approaching a remarkable $1.1 million in presale  funding within just two months. This impressive feat not only highlights  FURR's rapid ascent but also underscores its potential to disrupt the  crypto landscape. As investors seek promising projects with innovative  approaches, FURR emerges as a compelling contender, poised to capture  the attention and investment of enthusiasts worldwide.\nNavigating Through Challenges: Solana (SOL)'s Price Analysis\nSolana  (SOL) currently holds steady at around $146.18, showing minimal  deviation from yesterday's levels. However, the cryptocurrency has been  grappling with a significant downtrend since April, retracting from its  previous highs near $200. Presently, SOL faces a challenging phase, but  signs hint at a potential easing in its bearish momentum.\nA  notable indicator signaling a shift in SOL's trajectory is the  diminishing trading volume, suggesting a decline in selling activity.  This reduction often precedes a trend reversal, indicating wavering  conviction among traders. SOL's recent price action reinforces this,  struggling to sustain its downward trend, hinting at a tentative shift  in market sentiment.\nCurrently, SOL tests a crucial support level  around $130, pivotal for its future trajectory. Maintaining stability  above this level could signal a potential reversal, possibly forming a  higher low—a bullish sign.\nYet, SOL encounters formidable  challenges. The 26-day Exponential Moving Average (EMA) poses a robust  resistance, along with a visible trend line resistance. Overcoming these  barriers is crucial for a convincing bullish reversal. Additionally,  the $140 mark, coinciding with the 100-day EMA, serves as the next  immediate support level after $130, offering further reinforcement.\nSOL's  future depends on its ability to hold above these support levels and  breach key resistances. A successful breakthrough could reignite  interest, potentially leading to a recovery phase.\nNavigating Bitcoin (BTC)'s Path Amidst Whales and Economic Indicators\nBitcoin  (BTC) maintains its stability around $63,703.73, echoing yesterday's  levels. Yet, beneath this apparent tranquility, significant activity  unfolds among BTC whale addresses—wallets with at least 100 BTC. Over  the past 24 hours, these whales have bolstered their holdings by over  47,000 BTC, valued at $2.9 billion, excluding wallets tied to exchanges,  mining pools, and ETFs.\nThis accumulation coincides with a price  correction, briefly dipping BTC below $60,000, perceived as a buying  opportunity by institutional investors. Technical analysis suggests a  weekly close above $60,000 would solidify this level as robust support  for BTC's price.\nMacro-economic indicators further support  potential BTC appreciation. The U.S. Federal Reserve hints at monetary  easing, beneficial for risky assets like BTC. Additionally, the U.S.  employment report suggests a weak job market, potentially prolonging  accommodative monetary policies.\nTraders remain watchful,  particularly concerning the critical $60,000 level. A breach could  trigger liquidation of leveraged long positions exceeding $700 million.  Despite this, whales' substantial BTC accumulation amidst the recent  price dip, alongside favorable economic indicators, hints at a potential  upward trajectory. A weekly close above $60,000 would solidify this  outlook, though investors remain cautious of liquidation risks if  support wavers.\nFurrever Token (FURR): Pioneering Joy and Innovation in the Crypto Landscape\nFurrever Token (FURR)  emerges as a captivating presence within the cryptocurrency landscape,  infusing the meme coin arena with its distinct charm and innovative  spirit. Unlike traditional projects that often prioritize utility or  financial gains, FURR transcends the norm by fostering a vibrant  community centered around the universal appeal of adorable cat imagery.\nThe  project's commitment to community engagement is evident through its  whimsical platform adorned with cute cat-themed stickers, emojis, and  visuals, transforming mundane interactions into delightful experiences.  By prioritizing user experience and fostering a warm and friendly  environment, FURR establishes itself as more than just a  cryptocurrency—it becomes a place where users can find joy and  connection amidst the often turbulent crypto landscape.\nIn terms  of tokenomics, FURR operates on the BNB-20 blockchain under the ticker  symbol FURR, boasting a total token supply of approximately 9 billion  tokens. During its presale phase, which is currently in stage 8 out of  10, FURR has already raised over $1 million in just two months,  showcasing strong community interest and support for its vision. Priced  at $0.000648, FURR offers investors the potential for up to 15X returns,  attracting those seeking a project that seamlessly integrates fun with  financial prospects.\nMoreover, FURR prioritizes safety and  transparency, evident through its smart contract audit by Securi Lab and  active community engagement on platforms like Telegram. This commitment  to safety and accountability further enhances FURR's credibility and  trustworthiness among investors and users alike.\nAdding to the excitement, FURR recently launched its $10,000 Frenzy Bonanza Competition,  offering participants the chance to win a grand prize of $10,000 worth  of FURR tokens. With only three days left to join, the competition not  only incentivizes community participation but also generates buzz and  enthusiasm surrounding the project. Hosted on the Gleam platform,  participants can complete various tasks to accumulate points, increasing  their chances of being randomly selected as winners and fostering  engagement and camaraderie within the FURR community. Join Furrever Token Presale Now:  Furrever Token Official Website    Visit Furrever Token Presale   Join Furrever Token  $10,000 Bonanza Competition  Join Official Telegram Group   Follow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support@furrevertoken.comDisclaimer:  The information provided in this press release is not a solicitation  for investment, nor is it intended as investment advice, financial  advice, or trading advice. It is strongly recommended you practice due  diligence, including consultation with a professional financial advisor,  before investing in or trading cryptocurrency and securities.",null,null]}
{"date":"2024-05-07","titles":["JPMorgan ‘struggles to find the next catalyst for’ Bitcoin and crypto market By Investing.com","Bitcoin Rebound Has Crypto Options Traders Anticipating $100K"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/jpmorgan-struggles-to-find-the-next-catalyst-for-bitcoin-and-crypto-market-3425163","https:\/\/finance.yahoo.com\/news\/bitcoin-rebound-crypto-options-traders-063226283.html"],"sources":["investing.com","finance.yahoo.com"],"descriptions":["JPMorgan ‘struggles to find the next catalyst for’ Bitcoin and crypto market","The number of active bitcoin call contracts is significantly higher than puts, indicating bullish market sentiment."],"article_contents":[null,"Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin rebound spurs demand for out-of-the-money calls at strikes from $70,000 to $100,000.\nAnalysts said the path of least resistance for bitcoin is on the higher side.\nBitcoin's {{BTC}} renewed price upswing has options traders reconsidering the possibility of the cryptocurrency reaching the $100,000 level at some point this year.\nThe leading cryptocurrency by market value has risen over 12% to $63,470 since Federal Reserve Chairman Jerome Powell ruled out additional tightening or rate hikes as the next policy move last Wednesday, CoinDesk data show. Friday's disappointing U.S. nonfarm payrolls (NFP) data validated Powell's stance, accelerating BTC's recovery.\nAs such, there has been a notable increase in demand for bitcoin call options on leading cryptocurrency exchange Deribit and over-the-counter (OTC) networks. These options are specifically targeting a rally to new highs, potentially surpassing $75,000 and even reaching $100,000.\n\"We are seeing some bullish follow-through in volatility and rates following the reversal bounce from Friday and into the weekend. BTC risk reversals have gone positive (calls more expensive than puts), and [there has been a] renewed demand for BTC Sep expiry $75,000 and $100,000 calls,\" QCP Capital said in a note on Monday.\nA call option gives the right to purchase the underlying asset at a predetermined price on or before a specific date. A call buyer is implicitly bullish on the market and a put option buyer is bearish.\nOTC institutional cryptocurrency trading network Paradigm made a similar observation Monday, stating increased demand for out-of-the-money (OTM) calls or those at strikes well above BTC's going market rate.\n\"The options market seemed to anticipate a short-term leg higher up earlier this morning with top BTC and ETH trades on Paradigm consisting of OTM calls bought in size. We noticed the previous March 25 [expiry] $200,000 call buyer closing his position to buy the July 2024 [expiry] $85,000 strike,\" Paradigm said in a Telegram broadcast.\nData from Deribit show traders have locked in over $688 million in the $100,000 strike call options across different maturities. That's the highest notional open interest among all options listed on the exchange.\nAs of writing, more than 150,000 call option contracts worth $9.5 billion were active on Deribit. That's more than two times the open interest in put options, a sign of bullish market expectations.\nNotional open interest refers to the dollar value locked in the number of active or open contracts. On Deribit, one options contract represents one BTC or one ether {{ETH}}.\nBoth fundamental and technical analysts are again coalesced around on the idea that the path of least resistance for bitcoin is on the higher side.\n\"Bitcoin continues to be supported by the U.S. election cycle and ongoing deficit spending. This is why we have adjusted our 'line in the sand' from 68,300 to 62,000 in our report from May 3 — the market could trade (tactically) bullish above 62,000,\" 10X Research said.\nSiwssblock Insights expects the dollar index (DXY) to remain defensive unless Powell's stance is challenged. A weaker DXY is usually good for risk assets, including cryptocurrencies.The DXY has declined by 1.2% to 105.20 since Wednesday's Federal Reserve meeting.\n\"The dollar's weaker position is likely to persist as long as economic data remains supportive of that direction and as long as Federal Reserve officials don't counter Powell's stance. The labor market is showing signs of loosening, but more hawkish Fed voices could still push for keeping rates higher for longer, which may impact the dollar's trajectory,\" Swissblock Insights latest newsletter said.\nMeanwhile, Elliot wave analysis by John Glover, chief investment officer of Ledn, suggests bitcoin's could rise to 92,000.\n‘The BTC price action continues to track my expected path for Wave 4 as can be seen in the chart below. Although the dip to $56.5k may have completed the correction, I still expect to see a price of $52-55k before Wave 4 completes, 2\/ Once the 4th wave is completed I expect that the Wave 5 push to circa $92k will ensue,\" Glover said in an email to CoinDesk.\nRalph Nelson Elliott introduced the Elliot wave theory in 1938 in his book The Wave Principle. The theory assumes that asset price movements can be predicted by observing and identifying a repetitive wave pattern.\nTrends unfold in five waves, of which 1,3 and 5 are impulse waves, representing the primary trend, while 2 and 4 show temporary retracements of the preceding impulse waves."]}
{"date":"2024-05-08","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-05-09","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-05-10","titles":["Top 3 Cryptocurrency to Invest Now According to Reddit: Bitcoin, Ethereum, Furrever Token","Veteran Trader Peter Brandt Warns Of Impending Regulatory Crackdown On Crypto Staking: 'It's Going To Be A Bloodbath'","Bitcoin: Recovery Attempt Fails, Summer Doldrums Loom (Cryptocurrency:BTC-USD)"],"urls":["https:\/\/www.globenewswire.com\/news-release\/2024\/05\/10\/2879679\/0\/en\/Top-3-Cryptocurrency-to-Invest-Now-According-to-Reddit-Bitcoin-Ethereum-Furrever-Token.html","https:\/\/www.benzinga.com\/analyst-ratings\/analyst-color\/24\/05\/38754228\/veteran-trader-peter-brandt-warns-of-impending-regulatory-crackdown-on-crypto-staki","https:\/\/seekingalpha.com\/article\/4691811-bitcoin-recovery-attempt-fails-summer-doldrums-loom-btcusd-crypto"],"sources":["globenewswire.com","benzinga.com","seekingalpha.com"],"descriptions":["New York, NY, May  10, 2024  (GLOBE NEWSWIRE) --      In the midst of Bitcoin and Ethereum experiencing declines, Furrever Token emerges with an enticing....","Veteran trader Peter Brandt has sparked a discussion within the cryptocurrency community with his recent remarks on X. What Happened: On Thursday, Brandt predic...","Bitcoin topped out in mid-March at USD 73,793 and has pulled back significantly since then. Explore more details here."],"article_contents":["May 10, 2024 09:50 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nNew York, NY, May  10, 2024  (GLOBE NEWSWIRE) --\nIn the midst of Bitcoin and Ethereum experiencing declines, Furrever Token emerges with an enticing proposition: a limited-time $20,000 giveaway. This offer presents a unique opportunity for investors seeking to diversify their portfolios and capitalize on potential gains. As the crypto market experiences turbulence, Furrever Token's giveaway stands out as a beacon of opportunity, offering participants the chance to win substantial rewards while the industry giants face downward trends.\nBitcoin Social Activity Declines Amid Market Volatility\nBitcoin (BTC) is currently priced at around $60,991.88, reflecting a 2.3% decrease from yesterday's rates. Recent data reveals that Bitcoin has experienced a notable decline in social activity, marking its lowest level of engagement this year. Despite this downturn, Bitcoin maintains a significant presence in discussions within the crypto space, indicating ongoing engagement and participation.\nThe decrease in social activity surrounding Bitcoin is attributed to its recent struggles to maintain the $61,000 price range. Social metrics, however, show that Bitcoin continues to dominate discussions within the cryptocurrency space. BTC's Social Dominance remains within the 26% range, with a slight shift from 26.21% to 26.42%. The Social Volume on May 8th concluded with a count of 4,622, suggesting that Bitcoin maintains a substantial presence in cryptocurrency discussions despite the reported decline in social activity.\nAdditionally, Bitcoin's 24-hour active addresses chart indicates a recent decline compared to activity levels observed earlier in the month and the previous month. Nonetheless, with around 721,000 active addresses as of this writing, Bitcoin continues to demonstrate significant activity on its network despite the recent market dip.\nEthereum Faces Regulatory Hurdles: It Is Still Declining\nEthereum (ETH) is currently priced at around $2,971.87, maintaining stability with a slight downturn from yesterday's prices. However, regulatory challenges loom large for the popular cryptocurrency. On May 6, 2024, the United States Securities and Exchange Commission (SEC) announced a delay in its decision regarding the proposed rule change to list and trade shares of the Invesco Galaxy Ethereum ETF. This delay underscores the uncertainty surrounding the approval of spot Ether ETFs, as the SEC persists in viewing Ethereum as a security.\nDespite resistance from entities like Consensys, which argues Ethereum's classification as a global computing platform akin to commodities like Bitcoin and Gold, the SEC remains firm in its stance. John Reed Stark, a senior law lecturer and former chief of Internet Enforcement at the SEC, emphasized the regulatory body's commitment to protecting crypto investors from predatory practices during his testimony before the US House of Representatives Financial Service Committee.\nAmidst speculation surrounding Ethereum's price action, the cryptocurrency has rebounded approximately 3 percent in the past week, trading around $3,070 on Monday. However, Ethereum faces a technical challenge as it aims for an all-time high (ATH) in the coming weeks, contingent upon consistently closing above $3,380. Additionally, the daily 50 MA serves as a formidable resistance level, adding complexity to Ethereum's price trajectory amidst regulatory uncertainties.\nFurrever Token (FURR) Aims to Pull More Investors with a $20,000 Giveaway\nFurrever Token is not your average cryptocurrency. It's a breath of fresh air in the crypto world, infusing irresistible cuteness into every aspect of its platform. With its adorable cat-themed stickers and visuals, Furrever Token offers users a delightful and charming experience, creating a whimsical and heartwarming crypto ecosystem.\nIn addition to its enchanting features, Furrever Token has seen remarkable success with its recent presale, raising over $1 million within just two months. This impressive achievement is a testament to the platform's growing popularity and investor confidence.\nBut the excitement doesn't stop there. Furrever Token recently announced a limited-time competition that has the crypto community buzzing with anticipation. Running from May 9th, 2024, at 17:00 UTC +0 to May 27th, 2024, at 12:00 UTC +0, this competition offers participants the chance to win substantial prizes based on their total buys over the specified period. With a staggering $20,000 up for grabs, the competition prizes range from $1,000 to $5,000, enticing investors looking to capitalize on this unique opportunity. Not only does this competition add an extra layer of excitement to the Furrever Token ecosystem, but it also serves as a clever marketing tactic to increase awareness and engagement with the platform.\nMoreover, Furrever Token offers the potential for significant returns, with promises of up to 15X returns for investors. With its current price reflecting its promising outlook, Furrever Token presents an attractive investment opportunity for both seasoned investors and newcomers alike.\nIn summary, Furrever Token stands out in the crypto landscape with its charming features, successful presale, and enticing limited-time competition. As it continues to capture the hearts of investors and cat lovers alike, Furrever Token is poised for continued success in the world of cryptocurrency.Join Furrever Token Presale Now: Furrever Token Official Website Join $20,000 Furrever Token GiveawayJoin Official Telegram GroupFollow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support@furrevertoken.comDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.","Benzinga Rankings give you vital metrics on any stock – anytime.\nVeteran trader Peter Brandt has sparked a discussion within the cryptocurrency community with his recent remarks on X.\nWhat Happened: On Thursday, Brandt predicted a severe regulatory crackdown on crypto staking, describing the future landscape as a “bloodbath.”\n“If the crypto community is upset over the @SECGov treatment of $XRP, $ETH et al as securities, Prediction: Wait until the @USOCC @SECGov @USTreasury do a full assault attack over staking It’s going to be a bloodbath,” he wrote.\nIf the crypto community is upset over the @SECGov treatment of $XRP, $ETH et al as securities,Prediction:Wait until the @USOCC @SECGov @USTreasury do a full assault attack over stakingIt's going to be a bloodbathhttps:\/\/t.co\/CnXEusSAvG\nBrandt’s comments reflect concerns over potential aggressive actions from not only the SEC but also the Office of the Comptroller of the Currency (OCC) and the U.S. Treasury.\nSee Also: Bitcoin, Ethereum, Dogecoin Trade Sideways, Trader Asks: ‘Does It Matter If You Buy Bitcoin At $62,000 Or\nWhy It Matters: Ethereum co-founder Joseph Lubin has accused the SEC of hampering the growth of the crypto sector. His company, Consensys, is embroiled in a legal battle with the SEC over Ethereum’s classification.\nThis aggressive stance by the SEC seems linked to the regulator's concerns over the growing influence and capital within the crypto ecosystem, particularly following the approval of spot Bitcoin ETFs.\nAmid these developments, there have been a series of legal challenges and regulatory actions that have heightened tensions within the crypto market. A recent court ruling against Coinbase Global Inc. COIN largely dismissed the company’s motion to fend off SEC allegations of unregistered securities activity, particularly concerning its staking program.\nFurthermore, the market has seen significant volatility with major cryptocurrencies like Bitcoin BTC\/USD and Ethereum ETH\/USD experiencing price dips following regulatory scrutiny. Notably, Robinhood Markets Inc. HOOD reported a substantial increase in crypto trading volume despite receiving a Wells notice from the SEC, indicating a complex and defiant landscape.\nThe U.S. House of Representatives has taken a stand against the SEC’s crypto custody rules, a move that President Joe Biden has vowed to block, further highlighting the contentious regulatory environment.\nRead Next: Here’s How Much $1,000 Invested In Dogecoin Would be Worth If You Invested When Elon Musk First Tweeted About DOGE\nImage via Shutterstock\nEngineered by Benzinga Neuro, Edited by \nPooja Rajkumari\nThe GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more.\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.",null]}
{"date":"2024-05-13","titles":["Riding the Rollercoaster with Bitcoin and Ethereum as the Crypto Market Navigates Volatile Waters","Bitcoin Navigates 0.65% Gain in Danger Zone, Ethereum Drops 0.25% Amid Market Pressures, Furrever Token Launches $20,000 Competition to Boost Presale"],"urls":["https:\/\/financefeeds.com\/riding-the-rollercoaster-with-bitcoin-and-ethereum-as-the-crypto-market-navigates-volatile-waters\/","https:\/\/www.globenewswire.com\/news-release\/2024\/05\/13\/2880310\/0\/en\/Bitcoin-Navigates-0-65-Gain-in-Danger-Zone-Ethereum-Drops-0-25-Amid-Market-Pressures-Furrever-Token-Launches-20-000-Competition-to-Boost-Presale.html"],"sources":["financefeeds.com","globenewswire.com"],"descriptions":["From the outside looking in, it is quite clear that the crypto market has experienced considerable volatility in recent weeks","New York City, NY, May  13, 2024  (GLOBE NEWSWIRE) --      In the ever-changing landscape of the cryptocurrency market, major tokens such as Bitcoin and..."],"article_contents":["As can be seen from the chart below, both BTC and ETH have experienced major price swings since the start of the year, with both assets seeing red over the past 30-day stretch (i.e. 9% and 13%, respectively).\nAnd, while Bitcoin has given some indications of stepping into a phase of relative stability, the same cannot be said for Ethereum, an asset that has been painting a contrasting picture of uncertainty, particularly within its associated options market.\nTo elaborate, the divergence has been especially highlighted by the sustained high levels of implied volatility associated with Ethereum options, signaling a cautious outlook among investors regarding its future price movements. To better unpack these bearish prospects, Ryan Lee, chief analyst at cryptocurrency exchange Bitget, recently highlighted:\n\n“From the perspective of the options market, the implied volatility of BTC and ETH has dropped significantly in the past month, especially for options expiring within one month, indicating that traders do not expect a significant increase in volatility in the market. It is likely that BTC will fluctuate in a wide range between $58,000 and $72,000 in the next 1-2 months.”\nTaking a look at BTC ETFs, Lee elaborated that there has been continuous outflow over the past two weeks, indicating short-term profit-taking. That said, he did note that the Grayscale Bitcoin ETF (GBTC) recently saw its first net inflow, so from the perspective of BTC ETF fund flows, the short-term selling pressure on the market may have temporarily eased. “There is clear support for BTC at the lower levels,” Lee opined.\nOver the past month alone, the total capitalization of the crypto market has dipped from $2.75 trillion to $2.29 trillion, signaling a drop of more than 16%. Providing more context on this downturn, Lee believes the slippage can be in part attributed to the decline in the Federal Reserve’s Net Liquidity Index, which allows analysts to forecast market trends and identify short-selling opportunities.\nMoreover, he believes that the receding growth of the stablecoin sector could also be playing a major role in the correction. However, judging from the results of the Fed’s recently concluded interest rate meeting,  it will be intriguing to see how Chairman Powell addresses the declining trend in inflation, the rise in the unemployment rate to 4.5%, and other lingering liquidity risks — particularly because these factors stand to play a crucial role in determining the possibility of another rate cut this year. On the subject, Lee added:\n“This indicates that the Fed is considering a rate cut path, while the market believes that there will only be one rate cut this year, indicating a deviation. It is expected that there is room for the crypto market to anticipate an earlier and larger interest rate cut. We expect the next peak of the bull market to be around September.”\nAdditionally, Lee anticipates notable financial gains for several key crypto sectors over the coming year or so. For the Bitcoin ecosystem, he expects the growth to be driven by new asset protocols such as Runes, ARC20, as well as the various BTC layer-2 (L2) innovations (such as Stacks, RSK, Omni, etc) permeating this space.\nSimilarly, when it comes to memecoins — hailed as the most profitable crypto sector of Q1 2024 —  Lee believes the continuing wealth effect is likely to keep retail investors’ enthusiasm high, fueling more trading activities. Lastly, he believes that AI tokens will also “remain hot,” with their ability to capture value in the secondary market continuing to “influence the valuation of primary market financing.”\nAs the digital asset market continues to mature and be faced with a slew of unpredictable macroeconomic factors, it will be interesting to see how things shape out for this yet-evolving sector. And with the Federal Reserve planning to implement a few new rule changes over the next couple of months, it will be interesting to see how crypto reacts and adapts to these developments. Interesting times ahead!\nThe subject matter and the content of this article are solely the views of the author. FinanceFeeds does not bear any legal responsibility for the content of this article and they do not reflect the viewpoint of FinanceFeeds or its editorial staff.\nUnit No: BA857 DMCC Business Centre Level No 1 Jewellery & Gemplex 3 Dubai, United Arab Emirates.\nInternational House, 10 Admirals Way, London, England, E14 9XL.","May 13, 2024 07:26 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nNew York City, NY, May  13, 2024  (GLOBE NEWSWIRE) --\nIn the ever-changing landscape of the cryptocurrency market, major tokens such as Bitcoin and Ethereum are undergoing significant fluctuations, presenting both challenges and opportunities for investors. Amidst this dynamic environment, the Furrever Token (FURR) emerges with an innovative marketing strategy aimed at attracting Bitcoin and Ethereum holders, further diversifying the crypto ecosystem with its unique thematic focus and competitive initiatives.\nNavigating Bitcoin's \"Danger Zone\": Market Dynamics and Speculations\nBitcoin (BTC) has been experiencing considerable volatility, currently trading at approximately $61,229.50, marking a slight increase of 0.65% from the previous day. This instability is particularly evident as BTC recently tested the critical $60,000 support level, a move that has heightened caution among investors. This phase is often described as the \"danger zone,\" a term used to denote the turbulent period following Bitcoin's halving events.\nDuring trading on May 10, Bitcoin's price momentarily dipped to an intraday low of $60,190 on Bitstamp, down from attempts to stabilize around $63,000. This sudden decrease has sparked widespread speculation among traders and analysts. Many believe that large-volume institutional actions, coupled with the temporary closure of the BTC ETF market, might have driven the drop.\nDespite this recent dip, market experts like Rekt Capital remain optimistic, suggesting that the end of this challenging \"danger zone\" could be in sight. Historically, such periods have been marked by sharp downturns followed by eventual stabilizations. The current market scenario of BTC demonstrates the complex interplay between market sentiment and institutional influences, which continues to dictate the cryptocurrency's price movements. As Bitcoin navigates through these fluctuations, the broader crypto community watches closely, anticipating the cryptocurrency's next moves in this unpredictable market landscape.\nEthereum Faces Market Headwinds and Analyst Scrutiny\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, has recently been trading at $2,927.63, marking a slight decrease of 0.25% from the previous day. This modest drop is part of a broader trend of challenges that have caught the attention of investors and analysts alike.\nA significant event stirring the market was a major sell-off by an Ethereum whale who liquidated 6,714 ETH at a price of $2,903 each, culminating in a loss of approximately $6.5 million. This large-scale transaction has intensified concerns over Ethereum's future price direction. Market indicators are not promising, with the Relative Strength Index (RSI) showing a decrease in investor interest and key averages indicating a bearish outlook.\nDespite Ethereum's substantial trading volume of $10.1 billion over the last 24 hours, the price has declined by 4.07%, fluctuating between $2,935.95 and $2,894.15. Analysts have pinpointed the $3,017 level as a crucial resistance point; surpassing this could potentially shift the momentum to a bullish trend and help Ethereum break out of its current descending channel pattern.\nHowever, several factors are complicating this outlook. The cryptocurrency has been in a descending channel since mid-March, and the delayed approval of a Spot Ethereum ETF by the U.S. Securities and Exchange Commission (SEC) has added to the bearish sentiment. Moreover, the recent Dencun hard fork, which was intended to enhance Ethereum's scalability, did not have the expected positive impact on its price, leading to further speculation about its effectiveness and future impact on Ethereum's market performance.\nThese developments paint a complex picture for Ethereum as it navigates through ongoing market challenges and investor scrutiny.\nFurrever Token Launches $20,000 Competition to Attract Bitcoin and Ethereum Investors\nThe Furrever Token (FURR) has introduced an exciting $20,000 competition, targeting holders of Bitcoin (BTC) and Ethereum (ETH) to diversify into its presale phase, which prominently features cat-themed imagery and an engaging, playful ecosystem. Operating on the BNB-20 blockchain, Furrever Token is currently offering 65% of its approximately 9 billion token supply to early investors, signaling a strong start with over $1 million raised in just two months.\nAs the presale progresses, Furrever Token continues to captivate the community's interest, with its current price set at a modest $0.000648. A notable aspect of this token is its absence of buy and sell taxes, which enhances its accessibility and affordability, appealing especially to new entrants in the cryptocurrency market.\nThe centerpiece of Furrever Token's promotional activities is the \"Furrever Token $20,000 Highest Total Buys Competition.\" This contest is designed to spur enthusiasm and investment by rewarding the top 10 participants who purchase the most FURR tokens during an 18-day period from May 9, 2024, at 17:00 UTC, to May 27, 2024, at 12:00 UTC. The top purchaser will be awarded $5,000, with descending prize amounts for the other top buyers.\nThis initiative not only underscores Furrever Token's commitment to building a robust and engaged community but also positions the token as a potentially lucrative opportunity for investors in major cryptocurrencies like BTC and ETH, looking to leverage their holdings into new and promising digital assets.\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support@furrevertoken.com to avoid potential scams.\nJoin Furrever Token Presale Now:  Furrever Token Official Website    Join $20,000 Furrever Token Giveaway  Join Official Telegram Group         Follow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support@furrevertoken.comDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities."]}
{"date":"2024-05-14","titles":["Unlocking Potential: The Investment Case For Grayscale Ethereum Classic Trust (ETCG)"],"urls":["https:\/\/seekingalpha.com\/article\/4693047-unlocking-potential-the-investment-case-for-etcg"],"sources":["seekingalpha.com"],"descriptions":["ETCG offers shares that reflect a stake in Ethereum Classic, making it accessible to a wider range of investors. Find out my recommendation on ETCG."],"article_contents":[null]}
{"date":"2024-05-15","titles":["The World’s Best Crypto Exchanges And Marketplaces","Bitcoin Stays Strong, Ethereum Revamps Gas Fees, and Furrever Token Boosts Engagement with $20,000 Contest"],"urls":["https:\/\/www.forbes.com\/sites\/javierpaz\/2024\/05\/15\/the-worlds-best-crypto-exchanges-and-marketplaces\/","https:\/\/www.globenewswire.com\/news-release\/2024\/05\/15\/2882301\/0\/en\/Bitcoin-Stays-Strong-Ethereum-Revamps-Gas-Fees-and-Furrever-Token-Boosts-Engagement-with-20-000-Contest.html"],"sources":["forbes.com","globenewswire.com"],"descriptions":["After years of turbulence, including jail time for the founders of the two biggest cryptocurrency exchanges, many providers are getting serious about controls a...","New York City, NY, May  15, 2024  (GLOBE NEWSWIRE) --  In the dynamic realm of cryptocurrencies, each token tells its own tale of market challenges and..."],"article_contents":["ByJavier Paz\nWith the sentencing of former industry kingpins Sam Bankman-Fried and Changpeng Zhao, the cryptocurrency exchange business is by necessity moving toward a more transparent and compliant model.\nThe transformation has been made easier by a doubling in the price of bitcoin over the past year–it is now trading at $61,568-powered in part by the influx of about $11.8 billion into newly allowed U.S. exchange-traded funds based on the spot price of the cryptocurrency. These ETFs, offered by sponsors including BlackRock and Fidelity, are bringing new credibility to the digital-assets industry, whose reputation had been sullied by a string of bankruptcies in 2022 that culminated in the failure of Bankman-Fried’s FTX exchange. FTX was run in a criminally haphazard way, leading to the former CEO’s conviction on seven counts of fraud, money laundering and campaign-finance violations and a 25-year prison sentence.\nZhao’s Binance ran afoul of U.S. authorities and pleaded guilty to breaking anti-money laundering laws, as well as to unlicensed money transmitting and sanctions violations. The exchange had to pay $4.3 billion of restitution and Zhao himself admitted to a single charge of failing to implement an effective anti-money laundering program at Binance, for which he was fined $50 million and sentenced to four months in prison.\nBinance remains the world’s largest cryptocurrency exchange by average daily trading volume, but you will not find it among the firms we ranked. We excluded Binance and Bitmex from our 2024 ranking because of their legal and regulatory infractions. Aside from its problems with the U.S., Binance was expelled from at least 17 countries in the past three years, including India, the U.K. and Japan. One of its reputational issues has to do with not having a fixed headquarters and therefore no home regulator for the majority of its business. Other large exchanges excluded from our ranking include OKX, MEXC and Kucoin due to lack of credible regulatory oversight and what we perceived to be weak internal controls.\nMost of our 20 trustworthy exchanges are based in nations with significant oversight of their financial markets; the top three are all in the United States. We considered 646 exchanges and other kinds of marketplaces that allow investors to trade crypto and narrowed down the list based on nine different criteria (See full methodology at bottom).\nLeading the 2024 ranking is publicly traded Coinbase, which is not only an exchange but a top cryptocurrency custodian. It has been entrusted with 13% of the world’s bitcoin and ethereum supply and 40% of all crypto assets held on exchanges, a key indicator of trustworthiness. It gets the highest possible score for regulation, although it is not without issues with government overseers. It is currently embroiled in court actions with the Securities and Exchange Commission, which considers almost all digital currencies other than bitcoin to be securities. It therefore considers Coinbase, which makes markets in no fewer than 260 tokens, to be an unlicensed broker dealer. But Coinbase’s issues are civil, not criminal, and it also gets top marks for the quality of its audits and for its acceptance among institutional investors. Coinbase also topped our 2022 list.\nThe runner-up is not properly a crypto exchange at all. CME Group is the largest regulated crypto marketplace and the closest thing to the arbiter of official bitcoin and ethereum prices. With roots in the old-school Chicago commodities markets, it has more than $2 trillion in U.S. Treasury futures, trillions in other asset classes, and more than $9 billion worth of regulated crypto futures contracts outstanding, the most in the world. ETF issuers such as ProShares as well as retail traders and hedge funds use the CME for hedging and speculating on future prices of bitcoin and ethereum.\nIn the world of cryptocurrencies, the difference between exchanges and brokers can often appear to be a matter of semantics. For most investors, cryptocurrency exchanges are indistinguishable from securities brokers. They are the middlemen you go through to buy or sell digital assets. With this in mind we have included discount stock broker Robinhood and Fidelity on our list. Robinhood’s has zero fees on crypto transactions compared to Coinbase, which charges a $6 to $17 fee per $1,000 of bitcoin purchased (price takers). Most other crypto exchanges on our list charge transaction fees, ranging up to 0.2%. Robinhood would have scored even higher but was held back by its lack of institutional traders and derivatives. Like Coinbase, it has come under scrutiny by the SEC.\nThe robust regulation in the U.S. stems from existing financial law supported by a legal court system, but Washington has been unable to pass any crypto-specific legislation. That is not the case in countries like Germany and Japan. Nations that have grown tired of companies asking for forgiveness rather than permission are taking steps to ban bad actors. Since the collapse of FTX, no fewer than 10 countries have passed crypto legislation seeking to identify unlicensed exchanges and create basic disclosure requirements and consumer protections. The 2023 Markets in Crypto Assets (MiCA) directive, the first piece of crypto legislation from a major economy, is going into effect this year in the European Union, with rules to ensure fair and orderly trading and objective criteria for the efficient execution of orders. Dubai launched its Virtual Assets Regulatory Authority (VARA) in 2023, administering spot and derivatives licenses that require exchanges to share information about large market exposure.\nForbes last ranked crypto exchanges in March 2022, and at the time CoinGecko indicated there were about 6,500 tokens. Today, the crypto count surpasses 13,000. Our ranking began with 646 exchanges identified by CryptoCompare, CoinMarketCap, CoinGecko and CryptoRank. We cut the list to 20 companies from 60 in 2022 with our main focus on compliance, solvency and security.\nWe also wanted to emphasize that market attention is primarily on bitcoin and ether, two assets that make up a combined 66% of crypto’s $2.36 trillion market capitalization. Bitcoin and ether represent roughly 76% of the $444 billion in assets held in custody by the exchanges and dealers on our list, while the remainder came from hundreds of smaller tokens. The opposite is true for many large exchanges that did not make the cut, like the unregulated MEXC and Gate.io, based in the Seychelles and Cayman Islands, respectively. For these excluded exchanges, bitcoin and ether represent just 33% of the assets they held in custody.\nIn an industry that is largely unregulated and unaudited and in which hacks are common, the most important job for exchanges is to keep tokens safe for investors. Our methodology reflects this goal. Each exchange had to meet a high regulatory threshold for inclusion, earning at least seven out of 10 possible points. (Note: Each category is graded on a scale from 1-10). There are seven U.S.-domiciled firms in our 20 exchange ranking, four each from Europe and Japan, two based in South Korea and one each from Singapore, Dubai and Hong Kong. The list includes firms across the board on pricing strategies and services offered. Some, such as Coinbase and Bitpanda, have relatively high transaction fees for retail traders, while others have employed low-cost strategies.\nWe included derivatives exchanges that specialize in trading options and futures, that give exposure to crypto assets via regulated financial contracts to reflect the growing importance of these products for bitcoin trading. We did not include decentralized exchanges, which operate without human intervention.\nThe 2024 Forbes list began with a multi-month study of 646 crypto exchanges listed by sources including CoinMarketCap and CryptoCompare. We concluded that 74% of them lacked sufficient assets under custody to be considered for our list, using data from analytics specialists like Arkham and Defillama. Additional checks for those vetted more thoroughly included products offered on their websites, trading volume, traffic volume and regulatory history, if any. Forbes then evaluated each firm on the list in nine categories on a scale from 1 to 10. The scores were then tallied and weighted by the percentages in the second row of the ranking table above to obtain a composite final score.","May 15, 2024 07:27 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nNew York City, NY, May  15, 2024  (GLOBE NEWSWIRE) --\nIn the dynamic realm of cryptocurrencies, each token tells its own tale of market challenges and innovative breakthroughs. Bitcoin (BTC) demonstrates resilience amidst market volatility, Ethereum (ETH) proposes a transformative update to its gas fee structure, and Furrever Token (FURR) captivates its community with significant competition. This article delves into the latest developments affecting these cryptocurrencies, exploring how they adapt and thrive in the ever-changing financial landscape.\nBitcoin's Robust Fundamentals Signal Potential Growth Despite Market Challenges\nDespite the prevailing market volatility, Bitcoin's underlying fundamentals remain strong, as highlighted in the latest Bitfinex Alpha report. This resilience is evident from the steadfast behavior of long-term holders and a significant drop in mining difficulty, suggesting a promising outlook for the cryptocurrency’s value appreciation.\nA significant development within the Bitcoin network is the 6% decline in mining difficulty, the largest since December 2022. Mining difficulty, which adjusts every two weeks, reflects the computational effort required to validate new blocks. This recent reduction suggests a decrease in competition among miners, thereby making it easier and potentially more profitable to mine Bitcoin. According to Bitfinex analysts, this decrease could mean approximately a six percent increase in Bitcoin earnings for the remaining miners, compensating for the same level of computational effort.\nDespite these positive indicators, Bitcoin faces challenges in maintaining stability above the $63,000 price level, influenced by adverse economic indicators from the United States. At the time of reporting, Bitcoin had experienced a slight decline, trading just below $61,600.\nIn conclusion, while Bitcoin navigates through turbulent market conditions, its strong fundamentals, bolstered by the commitment of its long-term investors and eased mining conditions, position it for potential future gains. Investors and market observers continue to watch closely, gauging the interplay of internal network strengths against external economic pressures.\nEthereum's Gas Fee Overhaul: Vitalik Buterin Proposes Revolutionary EIP 7706\nVitalik Buterin, the co-founder of Ethereum, has put forward a significant proposal aimed at refining the platform's gas fee structure. Dubbed EIP 7706, this initiative seeks to optimize how transaction costs are handled, particularly focusing on the data component critical for smart contract interactions. This proposal marks a potential turning point in managing Ethereum’s network resources more efficiently.\nCurrently, Ethereum's gas fee system is bifurcated into two main categories: execution gas and storage gas. Execution gas accounts for the computational power needed to process transactions, while storage gas relates to the costs of storing data on the blockchain. This model, though effective in managing the demands of Ethereum's growing complexity, has shown potential areas for enhancement.\nEIP 7706 proposes a radical shift by introducing a third category of gas fees dedicated to 'call data'—the part of the transaction that transmits crucial information to smart contracts. Under Buterin’s proposal, this new category would allow for separate charging for the data transferred during transactions, independent from execution and storage fees. Such a change could streamline transactions that are data-intensive but not necessarily computationally intensive, enabling a more nuanced billing of network services.\nThis proposed method aims to refine how transaction fees are categorized and adjusted by incorporating max_basefee and priority_fee components as vectors, allowing for a unified fee adjustment mechanism across different types of transaction costs. This could enhance the efficiency of transaction processing and potentially reduce overall costs for network users.\nAdditionally, managing various forms of gas through a dynamic model that responds to real-time network conditions could optimize fee structures, making them more cost-effective for users. This would not only benefit developers but also end-users who interact with Ethereum's vast array of decentralized applications.\nFurrever Token Invites You to Participate in a $20,000 Competition: An Opportunity Not to be Missed!\nIn the ever-evolving world of cryptocurrencies, Furrever Token (FURR) has emerged as an intriguing new player, captivating the market with its charming features and a lucrative $20,000 competition. This article explores the ascent of FURR in the cryptocurrency realm and highlights the unique opportunities it offers to its community.\nFurrever Token has quickly carved a niche for itself, appealing to the crypto community with its delightful cat-themed aesthetics and the potential for significant financial gains. Currently priced at $0.000648, Furrever Token presents an enticing opportunity for investors looking to enter at a point that promises substantial growth. The presale phase of FURR was notably successful, rewarding early investors with returns of up to 15 times their initial stake.\nThe excitement around Furrever Token recently escalated with the announcement of a $20,000 competition, stirring interest among those looking to combine financial opportunities with active community involvement. This competition challenges participants to maximize their Furrever Token purchases over an 18-day period, with the top 10 purchasers winning prizes ranging from $1,000 to $5,000. This initiative not only encourages investment but also enhances the sense of community and excitement among participants.\nAs Furrever Token continues to attract attention with its innovative offerings and engaging community initiatives, it stands out as a promising investment. By joining the Furrever Token community and participating in the $20,000 competition, investors have the opportunity to contribute to and benefit from the project’s success. This is a call to action for those looking to engage with a dynamic and rewarding cryptocurrency project. Dive into the world of Furrever Token and seize the chance to win big in a community-focused competition. Don’t miss your opportunity to be part of this exceptional venture—invest in Furrever Token now and embark on an exciting journey filled with potential and camaraderie.\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support@furrevertoken.com to avoid potential scams.\nJoin Furrever Token Presale Now: Furrever Token Official Website    Join $20,000 Furrever Token Giveaway  Join Official Telegram Group Follow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support@furrevertoken.comDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities."]}
{"date":"2024-05-16","titles":["SEC approval of spot ethereum ETFs would benefit all investors"],"urls":["https:\/\/www.americanbanker.com\/opinion\/sec-approval-of-spot-ethereum-etfs-would-benefit-all-investors"],"sources":["americanbanker.com"],"descriptions":["The Securities and Exchange Commission, having already approved spot bitcoin ETFs, ought to follow through and grant the same approval to spot ethereum funds. D..."],"article_contents":["Opinions vary widely on the potential approval of spot ethereum exchange-traded funds, or ETFs, by the U.S. Securities and Exchange Commission. Despite mounting uncertainty about when or if the regulator will approve the new financial instrument, there is optimism ahead pertaining to the prospects of an ethereum ETF approval — akin to the fervor for the once long-awaited bitcoin ETF.\nThe BTC ETF proved pivotal in driving institutional interest in the digital asset class, particularly in regions like Hong Kong, Singapore and Dubai, where investors sought new growth opportunities after missing out on the stock market surge. Its success was the impetus to drive investors that once shunned cryptocurrencies to finally make the leap in a more secure fashion.\nAs the second-largest digital asset, ethereum boasts a vast ecosystem that positions it as a front-runner in the digital economy. Regulatory clarity, coupled with institutional investment, is poised to propel ethereum to unprecedented heights. Beyond mere price action, the approval of ethereum ETFs holds symbolic importance, solidifying crypto's status as a legitimate asset class and reinforcing its role in the evolving financial landscape.\nThe trend toward regulatory clarity is unmistakable, evidenced by the SEC's acknowledgement of ethereum's non-security status in permitting futures trading. This sets a clear precedent for the approval of a spot ethereum ETF. To deviate from this path would not only highlight regulatory ambiguity but also undermine market confidence. Moreover, proactive regulatory initiatives in various jurisdictions like Hong Kong, where plans for spot bitcoin and ethereum ETFs have just been greenlit, highlights the growing global acceptance and recognition of the potential of ethereum-based financial instruments. These developments underscore the urgent need for the SEC to align its regulatory framework with evolving market dynamics and maintain competitiveness in the global landscape.\nUndoubtedly, market demand from institutional investors serves as a driving force behind the push for ethereum ETF approval. The lineup of heavyweight players eagerly awaiting the green light — BlackRock, Fidelity, Invesco with Galaxy, Grayscale, VanEck, 21Shares with Ark and Hashdex, and most recently Bitwise — underscores the potential for ethereum ETFs to unlock new avenues for investment and liquidity. This influx of institutional capital could not only boost ethereum's market profile but also catalyze the development of more sophisticated products and services within the ethereum ecosystem.\nThe House advanced a resolution that would roll back a Securities and Exchange Commission resolution that banks argue cuts them out of the crypto custodying business, but President Biden said he would veto it if it passes the Senate.\nMoreover, the fact that the global ETF assets under management, or AUM, have exceeded $11 trillion suggests that investors are increasingly turning to ETFs as a preferred investment vehicle. While ETFs represent 13% of equity assets in the United States, indicating a significant adoption rate, their penetration is comparatively lower in Europe (8.8%) and the Asia-Pacific region (4.6%). The lower penetration rates of ETFs in Europe and the Asia-Pacific region suggest potential opportunities for growth. As more ETF products become available tailored to regional preferences and regulatory requirements, we may see a further expansion of the ETF market globally.\nConsidering the lessons learnt from BTC ETFs and the increasing recognition of crypto as a viable alternative asset, especially in a cooling economy, ETFs offer a less burdensome and tax-efficient means of exposure to cryptocurrencies. They simplify the complexities associated with owning crypto outright and broaden accessibility from individual retirement accounts all the way to large institutional accounts.\nThe broader impact of ethereum ETF approval reverberates across both short and long-term horizons. In the short term, we can expect increased trading activity and price volatility for ethereum and altcoins in the days leading up to the SEC's decision. However, in the long run, institutional adoption facilitated by ethereum ETFs could spur ecosystem growth, paving the way for a more robust and diverse range of financial instruments. Moreover, approval would provide much-needed regulatory clarity, particularly for ethereum-based financial products, mitigating uncertainty and fostering a conducive environment for innovation.\nIn light of the regulatory precedent, global trends and market demand, it appears increasingly likely that the SEC will grant approval for ethereum ETFs, notwithstanding delays and regulatory hurdles. I confidently predict that this will propel prices of bitcoin and ethereum to new heights. These milestones will reflect the growing confidence in cryptocurrencies and herald a new era of mainstream adoption and acceptance.\nA federal judge issued an order blocking the Trump administration from firing hundreds of Consumer Financial Protection Bureau employees, saying agency leadership had 'thumbed their noses' at the court's earlier injunction.\nThe FDIC has streamlined requirements for large banks' emergency resolution plans, eliminating some costly strategies and offering more flexibility in light of 2023's bank failures.\nBoth the Federal Reserve and the Office of the Comptroller of the Currency signed off on the $35 billion transaction, which has faced opposition since it was announced last February.\nThe Federal Reserve proposed a rule to average individual banks' stress test results over two years, a measure the central bank says would reduce volatility in bank capital requirements from year to year.\nWith swipe payments heading toward the exit in a few years, issuers have an opportunity now to prepare.\nA federal judge will determine if the leadership of the Consumer Financial Protection Bureau should be held in contempt after firing 90% of the bureau's staff and dismantling all offices."]}
{"date":"2024-05-17","titles":["Bitcoin’s Price Is Likely To Rise Based on the Basic Laws of Supply and Demand, Predicts Crypto Analyst","Crypto Watch: Market consolidates as Bitcoin, Ethereum decline slightly","Bitcoin Rises 1.5%, Ethereum's Breakthrough to $5,000, and Why Furrever Token Is the Next Big Thing"],"urls":["https:\/\/dailyhodl.com\/2024\/05\/17\/bitcoins-price-is-likely-to-rise-based-on-the-basic-laws-of-supply-and-demand-predicts-crypto-analyst\/","https:\/\/www.businesstoday.in\/technology\/news\/story\/crypto-watch-market-consolidates-as-bitcoin-ethereum-decline-slightly-429964-2024-05-17","https:\/\/www.globenewswire.com\/news-release\/2024\/05\/17\/2884125\/0\/en\/Bitcoin-Rises-1-5-Ethereum-s-Breakthrough-to-5-000-and-Why-Furrever-Token-Is-the-Next-Big-Thing.html"],"sources":["dailyhodl.com","businesstoday.in","globenewswire.com"],"descriptions":["The","Despite a potential short-term pullback, few analysts anticipate new record highs for the cryptocurrency.","New York City, NY, May  17, 2024  (GLOBE NEWSWIRE) --    The crypto market is buzzing with excitement as Bitcoin experiences a 1.5% rise, signaling strong..."],"article_contents":["The “basic laws of supply and demand” are primed to act in Bitcoin’s (BTC) favor, according to a popular crypto analyst.\nThe trader Ali Martinez tells his 62,300 followers on the social media platform X that Bitcoin flooded the market after the top crypto asset hit an all-time high of more than $73,700 in March, putting most long-term holders in profits.\n“The rising supply of BTC on the market surpassed the demand levels, leading to a corrective phase that saw the price of Bitcoin dip below $57,000. This drop brought Bitcoin below its Short-Term Holder Realized Price, creating a sense of fear in the market, given that short-term holders are more prone to sell based on price volatility.\nThe Short-Term Holder Realized Price, which currently stands at $60,500, served as an accumulation point despite investors’ fears. Indeed, long-term holders felt comfortable adding more than 70,000 BTC to their positions at these levels after realizing profits in March.”\nThe realized price is the average price of Bitcoin in circulation calculated based on the price at which they were last moved. The short-term holder realized price is the average acquisition price of all the Bitcoin acquired in the past 155 days.\nMartinez predicts that demand for Bitcoin will begin to outstrip supply.\n“Observing Bitcoin’s Balance on Exchanges can corroborate these supply and demand dynamics. Since early May, more than 30,000 BTC have moved to private wallets for long-term holding, showing confidence among holders in Bitcoin’s future value.”\nBTC is trading at $65,411 at time of writing.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","Home\nMarket\nBT TV\nReels\nMenu\nIn the past 24 hours, Bitcoin (BTC) hit a high of $66,750 before falling to $65,408, marking a 0.82 per cent decline. This surge caused a wave of liquidations, yet the overall outlook for Bitcoin remains optimistic. Despite a potential short-term pullback, analysts anticipate new record highs for the cryptocurrency.\nEthereum (ETH) has managed to surpass its 20-day Exponential Moving Average (EMA) but is struggling with Bitcoin's volatility. According to Rajagopal Menon, VP, WazirX, the social sentiment around ETH is cautiously positive. However, the Elder-Ray Index signals a buyer's market. He suggests ETH faces potential bearish trends, with a significant drop to $2,864 possible. He said, “ETH is trading within a descending triangle, signaling potential bearish trends. A significant drop to $2,864 is possible. Breaking the upper trend line could target $3,100. Next week's SEC decision on ETH ETFs is crucial.”\nParth Chaturvedi, Investments Head at CoinSwitch Ventures, highlighted that the overall crypto market has been relatively stable, trading in a narrow range despite the U.S. Senate voting against an SEC accounting rule. President Joe Biden has indicated he might veto the resolution.\nBitcoin and Ethereum are currently trading around $65.4k and $2.9k, respectively, down 0.8% and 1.9%. He said, “Trading around $65.4k and $2.9k, BTC and ETH are down by 0.8% and 1.9% respectively. While the broader market is in the red, a clear outlier amidst the leading cryptos is LINK (+13.6%). The Depository Trust and Clearing Corporation (DTCC) in the U.S., along with Chainlink and major US banks, completed a successful pilot to accelerate the tokenization of funds. This collaboration is a step further towards the adoption of blockchain technology in the traditional asset management sector.”\nHe further said that on the policy front, both Turkey and India have made strides in developing crypto regulations. The Securities and Exchange Board of India (SEBI) has proposed the appointment of multiple regulators to oversee crypto trading, moving towards a more structured regulatory framework. This recommendation has been submitted to a government panel advising the finance ministry on policy formulation.\nShivam Thakral, CEO of BuyUcoin, noted that recent Consumer Price Index (CPI) data shows signs of cooling inflation, which has sparked optimism in financial markets. This optimism has been fueled by the possibility of a rate cut by the US Federal Reserve if inflation continues to decrease. He said, “ The crypto market reacted immediately as BTC touched the $66,000 mark while ETH is hovering around the $3,000 mark. As per the media reports, India’s market regulator SEBI also suggested crypto trade oversight which brings us a step closer to regulated crypto trading in one of the major digital asset markets in the world.”\nDisclaimer: The information provided on the website does not constitute investment advice, financial advice, trading advice, or any other sort of advice and you should not treat any of the website's content as such. Do conduct your own due diligence and consult your financial advisor before making any investment decisions.\nFor Unparalleled coverage of India's Businesses and Economy – Subscribe to Business Today Magazine","May 17, 2024 07:00 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nNew York City, NY, May  17, 2024  (GLOBE NEWSWIRE) --\nThe crypto market is buzzing with excitement as Bitcoin experiences a 1.5% rise, signaling strong momentum for the leading cryptocurrency. Meanwhile, Ethereum is on the cusp of a significant breakthrough, with analysts predicting it could soon reach the $5,000 mark. Amid these developments, a new and captivating player, Furrever Token, is emerging as a potential game-changer in the crypto space. Combining the charm of cat-themed content with blockchain technology, Furrever Token offers a unique investment opportunity with the promise of astronomical returns. As Bitcoin and Ethereum continue to capture headlines, don't overlook the irresistible appeal and innovative potential of Furrever Token—the next big thing in cryptocurrency.\nBitcoin Surges 2%: Institutional Investments in Bitcoin ETFs Skyrocket\nBitcoin (BTC) is currently trading at around $65,738.46, experiencing a nearly 2% increase since yesterday. Over the past week, more than 600 firms have disclosed substantial investments in spot Bitcoin exchange-traded funds (ETFs) in their 13F filings with the United States Securities and Exchange Commission (SEC).\nAccording to the filing data, professional investment firms have reported owning $3.5 billion worth of Bitcoin ETFs. Major players include Morgan Stanley, JPMorgan, Wells Fargo, UBS, BNP Paribas, Royal Bank of Canada, and hedge funds like Millennium Management and Schonfeld Strategic Advisors.\nMillennium Management leads the pack with $1.9 billion invested across various Bitcoin ETFs, including BlackRock’s iShares Bitcoin Trust (IBIT) and Fidelity’s Wise Origin Bitcoin Fund (FBTC). Schonfeld Strategic Advisors follows with a $479 million investment, primarily in BlackRock’s and Fidelity’s funds. Boothbay Fund Management and Pine Ridge Advisers have also declared significant holdings in spot Bitcoin ETFs.\nMorgan Stanley stands out with a $269.9 million investment in the Grayscale Bitcoin Trust (GBTC), making it one of the largest holders. Other notable investors include Aristeia Capital, Graham Capital Management, CRCM, and Fortress Investment Group, each with substantial investments in IBIT.\nSpot Bitcoin ETFs, which launched in January, saw massive demand in the first three months. Despite a recent slowdown in inflows, the sustained interest from hundreds of financial institutions underscores the growing institutional confidence in Bitcoin’s potential. As Bitcoin’s price continues to rise, these substantial investments highlight the increasing mainstream acceptance and adoption of the leading cryptocurrency.\nEthereum's Potential Surge Amid SEC Decision Anticipation\nEthereum (ETH) currently trades at around $2,950.80, down 0.5% from yesterday but poised for a potential short-term bullish surge after a five-day stagnation. This momentum is fueled by discussions on declining revenue on the ETH Mainnet and the looming SEC decision on spot ETH ETFs.\nOpinions are divided on the SEC's verdict for VanEck's spot ETF application due May 23. Nate Geraci of ETF Store believes rejection is unlikely, citing past ETH futures ETF approvals and staking option removals. However, some speculate denial due to ongoing Ethereum security classification investigations.\nSEC scrutiny began in April 2023, yet ETH futures ETFs were approved in September, highlighting regulatory complexity. Ethereum now aims to surpass $3,000, facing resistance at $3,103 and $3,161. Short-term bullish sentiment is evident, with ETH long liquidations decreasing, open interest rising to 1.97%, and anticipation of increased price volatility pre-SEC decision.\nFurrever Token: Analysts Predict the Next Big Thing in Crypto\nFurrever Token (FURR) is capturing the attention of the crypto world, with analysts predicting it could be the next big thing. Built on the BNB-20 blockchain, Furrever Token stands out by combining blockchain technology with the universal appeal of cute cat imagery. This unique approach transforms everyday crypto interactions into delightful experiences, featuring charming cat-themed stickers, emojis, and visuals that enhance user engagement.\nOne of the key features driving interest in Furrever Token is its engaging community challenges. These regular events encourage users to share their love for cuteness and participate in fun activities, fostering a warm and inclusive community atmosphere. The project also promises future exclusive content, ensuring that the community remains excited and engaged with new and delightful surprises.\nSecurity and compliance are top priorities for Furrever Token. The smart contract has been audited by Securi Lab, providing a safe and trustworthy platform for all users. Additionally, the team’s tokens are locked for a year, demonstrating a commitment to the project’s longevity and stability.\nFurrever Token's impressive tokenomics include a total supply of 9 billion tokens, with 65% allocated for presale, 25% for DEX allocation, and 10% for the team. The presale has already raised over $1.1 million, nearing the end of its stages and aiming to raise $1.9 million. With a current price of $0.000648, Furrever Token offers an attractive entry point for investors.\nMoreover, Furrever Token has launched a $20,000 Highest Total Buys Competition, where 10 lucky winners will share the prize. The competition runs until May 27, 2024, providing an additional incentive for new investors to join the community.\nFurrever Token has gained organic growth with nearly 4,000 members in its active Telegram channel. This growing community and the project's innovative approach position Furrever Token as a promising investment opportunity, blending the charm of cats with the potential of cryptocurrency for unparalleled rewards. Don't miss out on being part of this adorable revolution in the crypto world!Join Furrever Token Presale Now: Furrever Token Official Website Join $20,000 Furrever Token GiveawayJoin Official Telegram Group     Follow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support (at) furrevertoken.comDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities."]}
{"date":"2024-05-20","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-05-21","titles":["Cryptocurrency Gateway CryptoCloud Released a Major Update: Accelerating Transactions, Automatic USDT Conversion, AML Check and Brand Guide","Ether Capital: ETF Conversion And Valuation To ETH (NEOE:ETHC:CA)"],"urls":["https:\/\/www.globenewswire.com\/news-release\/2024\/05\/21\/2885777\/0\/en\/Cryptocurrency-Gateway-CryptoCloud-Released-a-Major-Update-Accelerating-Transactions-Automatic-USDT-Conversion-AML-Check-and-Brand-Guide.html","https:\/\/seekingalpha.com\/article\/4694723-ether-capital-etf-conversion-and-valuation-to-eth"],"sources":["globenewswire.com","seekingalpha.com"],"descriptions":["Poland, Warsaw, May  21, 2024  (GLOBE NEWSWIRE) --                            CryptoCloud aims to empower businesses to integrate cryptocurrency payments...","Ether Capital currently derives revenue from staking Ethereum on its balance sheet. Read more to see an overview and analysis of DTSRF stock."],"article_contents":["May 21, 2024 10:28 ET\n\n\n | Source:\r\n            \nCryptoCloud\n\n\n\n\n\nCryptoCloud\nPoland, Warsaw, May  21, 2024  (GLOBE NEWSWIRE) --\nCryptoCloud aims to empower businesses to integrate cryptocurrency payments seamlessly and unlock new opportunities. Their team understands the importance of exceptional performance, user-friendliness, and robust security in today's dynamic financial landscape. That's why they're constantly innovating and refining the platform to deliver a best-in-class experience.\nKey Updates\nLet's delve into the latest advancements designed to streamline the payment process, safeguard merchants’ assets, and empower to harness the full potential of cryptocurrencies.\nExperience Blazing-Fast Transaction Speeds\nThe CryptoCloud Gateway team has significantly accelerated confirmation times for USDT, USDC, and TUSD stablecoins on the Tron network. Their cutting-edge search algorithm expedites confirmations without compromising network security.\nThis translates into a smoother payment experience for customers. Transactions in these popular stablecoins are now confirmed in under a minute, minimizing friction at checkout and reducing the burden on the support team of business owners from inquiries about payment status.\nEnhanced Payment Convenience\nWorking with cryptocurrency payments can be a hurdle, especially for customers new to digital currencies. Incorporated user-friendly cryptocurrency payment instruction templates into the CryptoCloud documentation can bridge this gap. This readily available template simplifies the payment process for clients and empowers merchants to educate their customers on how to pay using cryptocurrency.\nPlacing the template on a website or checkout page significantly improves user experience and boosts conversion rates, especially among customers who are new to the world of cryptocurrencies.\nVolatility Protection with Automatic USDT Conversion\nThe inherent volatility of cryptocurrencies can be a concern for businesses. To shield from these market fluctuations, CryptoCloud merchants can now activate the automatic conversion of incoming Bitcoin (BTC) and Litecoin (LTC) payments to USDT, a stablecoin pegged to the US dollar. This innovative feature ensures funds remain protected from price swings, minimizing the risk of financial losses.\nPlatform identifies the most favorable exchange rate among a network of more than 10 licensed operators, maximizing financial security of merchants. The feature can be conveniently enabled within project settings, requiring no additional configuration.\nEffortless Payments with Static Wallets\nFor businesses that work with repeated payments (e.g., account top-ups), managing invoices can become cumbersome. CryptoCloud introduces static wallets, a game-changer for streamlining this process. This new feature allows customers to make payments to the same permanent address, eliminating the constant need to generate new invoices for each payment cycle. Funds are instantly credited to the account upon receiving an API response, accelerating the payment process and enhancing convenience for both merchants and their customers.\nAdvanced Security with AML Transaction Checks\nSecurity is paramount at CryptoCloud. New Anti-Money Laundering (AML) transaction check empowers business owners to mitigate fraudulent activity and potential exchange account suspensions. This automated system meticulously scrutinizes every transaction, flagging and halting high-risk transactions in their tracks.\nThis proactive approach safeguards assets of CryptoCloud clients and bolsters the security of cryptocurrency operations. The feature can be effortlessly activated within project settings, requiring no modifications to existing integration.\nBoost Brand Awareness with Branded Payment Icons\nThe CryptoCloud team designed a comprehensive guide on integrating branded payment icons onto websites. These icons effectively communicate to customers who accept cryptocurrency payments, a payment method increasingly favored by a tech-savvy demographic. Strategically placed icons (e.g., on the payment methods page) attract crypto clientele and enhance brand recognition. Integration is straightforward, allowing merchants to insert HTML code or manually upload files from the provided archive.\nThe Future is Bright with CryptoCloud\nCryptoCloud’s commitment to innovation continues beyond here. Automatic USDT conversion, static wallets, and AML verification are just the beginning of a series of advancements designed to propel businesses into the future of finance. Stay informed about upcoming developments as they continuously expand the platform's functionality and optimize services. Explore additional features on their website and FAQs for more information. Partner with CryptoCloud Gateway and unlock the full potential of cryptocurrency payments for business.\nContact:Contact Name: CryptoCloudContact Person: PR TeamCompany E-mail: marketing (at) cryptocloud.proWebsite: https:\/\/cryptocloud.plus\/en\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.",null]}
{"date":"2024-05-22","titles":["Legendary Trader John Bollinger Warns of Bitcoin Price Pullback By U.Today","Cryptocurrency Data Overview for Hedge Fund’s CIOs","Elon Musk Issues 'Black Mirror' Warning, Shibarium on Verge of Major Record, Samson Mow Makes Bullish Bitcoin Statement: Crypto News Digest by U.Today By U.Today"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/legendary-trader-john-bollinger-warns-of-bitcoin-price-pullback-3451991","https:\/\/caia.org\/blog\/2024\/05\/22\/cryptocurrency-data-overview-hedge-funds-cios","https:\/\/www.investing.com\/news\/cryptocurrency-news\/elon-musk-issues-black-mirror-warning-shibarium-on-verge-of-major-record-samson-mow-makes-bullish-bitcoin-statement-crypto-news-digest-by-utoday-3453038"],"sources":["investing.com","allaboutalpha.com","investing.com"],"descriptions":["Legendary Trader John Bollinger Warns of Bitcoin Price Pullback","By Fernando Walter Lolo, CAIA. Fernando Lolo specializes in alternative investment, cryptocurrencies, volatility, international finance, and global-macro tradin...","Elon Musk Issues 'Black Mirror' Warning, Shibarium on Verge of Major Record, Samson Mow Makes Bullish Bitcoin Statement: Crypto News Digest by U.Today"],"article_contents":[null,"Welcome to Portfolio for the Future™!\nBy Fernando Walter Lolo, CAIA. Fernando Lolo specializes in alternative investment, cryptocurrencies, volatility, international finance, and global-macro trading and investment strategies.\nThe objective of this article is to provide the reader an overview on cryptocurrency (crypto) data and statistics as a kind of dashboard to help especially Chief Investment Officers (CIO) in Crypto Hedge Funds (HF), and also to portfolio and wealth managers, allocators, practitioners, traders, and investors.\nThe information and data hereby analyzed are based on factual information and data from past events in addition to analyses based on own calculations, assessments and best estimates by using the best suitable information, data, and research available as of the date of this report. This report has to be treated as a summarized version of a further continued analysis on the subject, a brief descriptive overview, and a work in progress given the fast-paced changing dynamics in the crypto industry as a different asset class. Further, it was written from a hedge fund CIO and investment\/trading perspective only. Furthermore, this report focuses only on data, analyses, information, and relevant drivers that are related to crypto assets. Trading and investment strategies\/tactics have not been addressed in this report since it was scoped to data analysis and a preliminary assessment only. This report and analyses are not financial or investment advice; the reader must always do their own research at all times, and is for informational, educational, and illustrative purposes, subject to updates and changes any time.\nIn the crypto space, there’s still a need to connect what is a global-macro (or world-macro) hedge fund approach and the crypto specifics by considering crypto a different asset class. These two worlds must be interconnected since they are correlated in high degree. In addition, we should note that crypto have volatilities that start from 100% p.a. and some group of specific tokens can reach above 400% p.a. approximately. Drawdowns, selloffs, large volatility spikes, high breakouts and break downs to name a few are the common currency when investing, trading, and conducting portfolio management in this space. The correlation and decorrelation between crypto and other asset classes are rapid, hence the fast-paced changes in dynamics, approaches, strategies, position, allocations, portfolio rotation\/calibration, management, have to be rapid, active, and with active switches. All these make crypto trading and investing a different type of asset class. Therefore, cryptocurrencies should be treated differently by having a special treatment and a totally different approach than other asset classes.\nThis report has been structured in the following sections:\nGlobal-Macro drivers to consider.\nBitcoin (BTC) past halvings and other cryptos\/tokens overview, information, and statistics.\nSome current crypto\/tokens sectors and different categories with the largest market capitalization (MC) to consider today.\nPortfolios by market capitalization (MC) and sectors\/categories. Risks. Rotational portfolio management.\nThoughts for further consideration.\nThe sections are summarized below:\nSection 1: Global-Macro drivers to consider.\nBelow is a list of Global-Macro specific topics that are on watch as of the date of this report that influence and have an impact in the crypto industry.\nInterest rates. US Dollar. Global Central Banks.\nGold and Digital Gold (2024 onward - generational Transfer-Delegation(s) by maintaining both innovative\nEvolution-Conservation-History\/Evolutionary Transfer). Gold buying trends by Central Banks\/Countries (2025-2028). Bitcoin as digital gold\/safe haven (2024 onward). Oil (2024-2028).\nNatural resources in emerging markets vs. demand from developed markets, and innovative industries\/manufacturing. Arctic and Antarctic geopolitical agreements (North\/South and East-West collaborations\/alliances).\nFED & other Global Central Banks rate's decisions. EU rate's decisions. Asia\/Japan rate's decisions. Central Banks' catch-22 situation. Interest debt services given high interest rates scenarios and total debt levels; deficits (worldwide level).\nPost-earning markets scenarios esp. 2024-Q4.\nBitcoin (BTC) post-halving scenarios, parabolic upside, crypto Bull Run, past halvings’ statistics, and altcoin season vis-a-vis past-halvings’ returns; given both post-halving performance in 2024-2025 and spot crypto ETFs approvals. Other cryptos\/tokens and Blockchain innovations\/upgrades.\nMagnificent-7 stocks' upside potential (2025-2026).\nCrypto & Blockchain as innovative investable sectors and a different asset class (2024-2026).\nClimate change.\nAgricultural commodities upside. Food inflation (2024-2036).\nElections worldwide esp. in the US (2024).\nGeopolitical events (past, present, future). NATO\/G7 vis-a-vis BRICs and G20 given new geopolitical reorganization\/alliances.\nPolarized societies, immigration issues\/clashes, cross-border integration\/misalignments. Politics. Country alliances. Elections.\nBonds issuance. Yield curve.\nThematic investing, rotation, economic cycle, different cryptocurrencies as new and different asset class\/sector approach (e.g., Tokenization, RWA, AI, Runes, digital gold, other).\nCAIA’s Total Portfolio Approach (TPA) considering SWFs, Family Offices, and Institutional Investors' investment forward-looking trends (2025-2034).\nCrypto’s Long\/Short ratio. ICOs.\nBitcoin dominance vs. Bitcoin price. Crypto total market capitalization including\/excluding BTC\/ETH.\nEquity indices: S&P500, NASDAQ.\nSpot Crypto ETF inflows\/outflows.\nOthers.\nSection 2: Bitcoin (BTC) and crypto information & statistics.\nA. Bitcoin: the main Bitcoin halving phases could be summarized as follows:\nPre-halving: in the previous halvings, BTC has contracted between 20 and 35% on average. The deeper and longer the contraction, the higher the probability to reach bottom and starts a trend change; which increases rapidly. The contraction might take between 16 to 48 days on average.\nAfter the contraction, a re-accumulation or consolidation phase happens based on history. In the past, it started just weeks before the halving event and ended months after the halving. BTC started to lateralize until it finished this phase with a price breakout (bo). In parallel, it is worth noting that the average pullback after a halving event averaged 20%. Now, BTC experienced retracements lasting between 10 to 40 days approximately before a halving. The downside or retracements could range between 10 to 30% on average. The longer BTC consolidated after the halving, the better switch and phasing into the parabolic upside trend.\nOnce BTC breakouts, a parabolic upward trend starts, where the price experiences a rapid growth that could last over one year based on historical data. As a reference, BTC has rallied for about 300 to 500 days on average after the past halvings. Acceleration kicks off and consolidates for about 6 months on average, to then decelerates and start lateralizing. It is worth noting that new innovations and events (tech, AI, crypto adoption, geopolitics) make the 2024 halving event (pre, during, and post) somewhat different from past halving events. It is important to consider these and also previous all-time high (ATH) BTC prices; as well as support\/resistance and Chartism analyses.\nB. Altcoin season phases that could be considered based on BTC dominance:\nAccumulation: buying period after prices hit bottom.\nResurgence: big whales\/institutional investors\/funds accelerates their purchases attracting retail investors.\nLateralization: this often happens after Bitcoin halvings.\nUptrend: this entails a strong upward price move in both Bitcoin and Altcoins, including all market caps tokens like a parabolic move as described above.\nIt is worth noting that from phase 1 to 3, market progress and movements could be slow; but they ramp up big in phase 4. Indicators to consider are the inverse correlation between Bitcoin dominance metrics and Bitcoin price, the total market capitalization including and excluding BTC and ETH, and the market capitalization of the rest of Altcoins excluding BTC and ETH. In crypto, volatilities are above 100% p.a. only in BTC and ETH, and much more in other tokens.\nSection 3: Some crypto\/tokens sectors and different categories with the largest market capitalization (MC).\nBTC ecosystem.\nLayer 1 & 2 (L1 - L2).\nInjective Ecosystem.\nSmart Contracts.\nEthereum (ETH) ecosystem.\nBNB Chain ecosystem.\nSEC Securities\/Tokens.\nSolana (SOL) ecosystem.\nArbitrum ecosystem.\nOptimism ecosystem.\nMoondriver ecosystem.\nStablecoin.\nAvalanche ecosystem.\nDeFi.\nFantom ecosystem.\nDWF Labs ecosystem.\nMemes.\nRehypot hecated crypto.\nNFTs & collectibles.\nEigenLayer Ecosystem.\nReal World Assets (RWA).\nPolygon ecosystem.\nLiquid staking derivatives.\nRestaking.\nDePIN.\nDistributed computing.\nETH 2.0 staking.Metaverse.\nCardano.\nGovernance.\nPolkadot ecosystem.\nGaming.\nToncoin ecosystem.\nNear protocol ecosystem.\nDecentralized exchange.\nBinance launchpad.\nZero knowledge proofs.\nGenrative AI.\nStorage.\nModular blockchain.\nWrapped tokens.\nOracles.\nPrivacy.\nLending & Borrowing.\nYield farming.\nPlay to earn.\nAMM.\nData availability.\nWallet.\nIoT.\nHarmony ecosystem.\nInternet computer ecosystem.\nDerivatives.\nAptos ecosystem.\nAnalytics.\nJump crypto.\nSEI ecosystem.\nBase ecosystem.\nGaming guild.\nSUI ecosystem.\nBRC-20.\nTokenFi Launchpad.\nOlympus Pro ecosystem\nInscriptions.\nParallel EVM.\nSports.\nCommunications & Social Media.\nOthers.\nSource: Coinmarketcap (May 16, 20224)\nSection 4. Portfolios by market capitalization (MC) and sectors\/categories. Risks. Rotational portfolio management.\nA. Rotational Portfolio Management\nIn general, portfolio rotation follows this pattern:\nInvestors starts a long position and accumulating Bitcoin (BTC) (buying more) until BTC dominance starts to decrease. This is when Altcoin season (Altseason) starts kicking off.\nThen, they increase allocations in Ethereum (ETH), in BNB and\/or in Solana (SOL) until the uptrend starts to lateralize.\nThen, they increase their allocation in large market capitalization (MC) altcoins.\nAnd after that, in mid and small market caps altcoins.\nIn case they want to take more risks, they consider MEME coins and micro caps (for instance those below $10 million in MC).\nB. Risks\nAlthough investing in crypto is risky, roughly speaking within the crypto space, some sectors\/categories are riskier than others. Below is a list of cryptos’ sectors\/categories sorted by its risks (from highest to lowest):\nPresales\/Airdrops.\nMeme coins.\nLow caps.\nMid caps.\nLarge caps.\nEthereum (ETH).\nBitcoin (BTC).\nC. Portfolio by Market Capitalization (MC) & Sectors\nBelow there are examples of portfolio construction based on MC and by sector\/categories divided by three different types of risk profiles.\n1. Portfolio construction by MC\nConservative: 50% BTC, 30% ETH, 20% Altcoins Large Cap.\nMedium: 40% BTC, 20% ETH, 20% Altcoins Large Cap., 10% Altcoins Mid Cap., 10% Altcoins Small Cap.\nSpeculative: 10% BTC, 10% ETH, 20% Altcoins Large Cap., 40% Altcoins Mid Cap., 20% Altcoins Small Cap.\n2. Portfolio construction by Sectors\/Categories\nConservative: 30% BTC, 30% ETH, 10% SOL, 5% L1, 5% L2, 5% Staking, 5% DeFi, 5% Privacy, 5% Generative AI.\nMedium:  20% BTC, 20% ETH, 10% SOL, 10% L1, 5% L2, 5% Staking, 5% DeFi, 5% Tokenization\/RWA, 5% Runes, 5% GameFi, 5% Generative AI, 5% DePIN.\nSpeculative: 10% BTC, 10% ETH, 5% SOL, 5% L1, 5% L2, 5% Staking, 5% DeFi, 5% Tokenization\/RWA, 5% Runes, 5% GameFi, 5% Generative AI, 5% DePIN, 5% Governance, 5% Music, 5% Tourism, 5% BRC-20, 10% Metaverse.\nSection 5. Thoughts for further consideration.\nThoughts for further consideration follow:\nThe link and connection between global-macro drivers and crypto dynamics are inevitable and also have to be considered a must to trade and invest in cryptocurrencies.\nThe speed of correlation\/decorrelation with equities, gold, and other asset classes is fast.\nVolatility is high; therefore, crypto should be considered a different asset class.\nBuy & Hold might not be the best suitable strategy; rather, active portfolio management and a rotational strategy could be primer.\nDiversification among other asset classes, and also, among different types of Blockchain technology sectors are also key.\nFor illustrative purposes, below is a chart with some statistics and data from the previous and today’s halvings:\nTechnical & Fundamental analyses, related crypto events, related global-macro events plus other drivers should always be factored in since crypto is a different asset class with its own dynamics. Timing and time also play big roles in this asset class. Therefore, predictions in crypto plays more as best estimates than a prediction. In general they happen, but in the crypto space it’s all about probabilities that change rapidly. Again, volatility is high.\nIn terms of portfolio management, it is active, very fast paced, and dynamic. You have to validate and invalidate strategies and tactics very fast while maintaining focus, speed, actionable knowledge on crypto dynamics and global-macro drivers, which are key. Investors in this space must do their own in depth research (DYOR), reviews, and due diligence, but more importantly, they must understand the asset class in full first.\nAs the saying goes, history doesn't repeat itself, but it rhymes.-\nAbout the Author:\nFernando Walter Lolo, CAIA specializes in alternative investment, cryptocurrencies, volatility, international finance, and global-macro trading and investment strategies.\nHe founded Directional Alpha, which was first a private Hedge Fund, and thereafter, it converged into a consulting firm. The firm focuses on tail risk, volatility trading, hedging, geopolitical international finance, financial modeling, quantitative analysis, hedge fund strategies, financial crises, and global-macro events. Fernando went through a difficult thought process of traditional financial methods. His approach is unconventional.\nHe advised on international finance, Financial Stability Board (FSB), and G-20 related topics at the Ministry of Economy of Argentina. Prior to that, he worked in finance and alternative investment at the World Bank Group based in Washington, DC. Before that, he worked in finance in Latin America (LATAM).\nFernando strategized his specialization for a long period of time by following a \"Mosaic\" approach in different Ivy-leagues and other Institutions, which also included unconventional education. He holds an MBA, a Master in Finance, and Post-graduate Degrees in financial engineering, fund management, and strategy from Harvard University, Columbia University, Universidad Torcuato Di Tella, Universidad de Buenos Aires, and Johns Hopkins University. In addition, he is a Certified Public Accountant and holds the CAIA designation (Chartered Alternative Investment Analyst). During his career, Fernando worked in the USA, Emerging Markets, and Europe. www.DirectionalAlpha.com\n©2025 Chartered Alternative Investment Analyst Association®",null]}
{"date":"2024-05-23","titles":["Can Crypto Become a Mainstream Payment Method?"],"urls":["https:\/\/thefintechtimes.com\/can-crypto-become-a-mainstream-payment-method\/"],"sources":["thefintechtimes.com"],"descriptions":["Continuing our focus on digital assets, we now ask what need to happen before we see mainstream adoption of using crypto as a payment method?"],"article_contents":["Cryptocurrencies are most commonly associated with trading, due to volatile prices, and significant success stories like Bitcoin. But could crypto break out of this shell, and become a mainstream payment method? What would need to happen before this becomes a reality?\nTo find out, we hear from a number of industry leaders, who share their thoughts on the future of crypto and payments.\nBitcoin has already proven itself as ready to become a medium of exchange, and will inevitably evolve into a trusted payment method, says Mukarram Dhorajiwala, head of marketing and branding at Occams Advisory.\n“It needs to be understood that historically before any currency or commodity is adopted as a medium of exchange (MoE) it needs to be first adopted as a store of value (SoV). Bitcoin in this regard has a proven track record as a SoV technology since 2009 mainly due to its true decentralised and security features, hence as more and more users participate in the Bitcoin network, it will eventually evolve into a MoE.\n“‌Making bitcoin wallets digitally native to Apple and Android OS can revolutionise and drive the adoption of bitcoin right into the mainstream globally. We have also seen significant strides from products like Bitkey by Jack Dorseys’ Block Inc. Which is trying to solve the UX problems of holding bitcoin in a secured self-custody significantly cooler and easier for non-technical users.”\nKey barriers still stand in the way of cryptocurrencies becoming a genuinely mainstream payment method, according to Alejandro del Rio, regional director of LatAm at Paymentology.\n“Cryptocurrencies have the potential to become a key tool for both businesses and consumers, enabling cost-efficient cross-border transactions, access to stablecoins and a gateway to owning digital assets. However, they have not significantly disrupted the daily payment routines of consumers and businesses due to the absence of fast and reliable links to traditional payment networks.\n“One of the key hurdles holding back regular cryptocurrency usage is the multiple-step exchange and withdrawal process required to spend with regular merchants, taking minutes at best and days at worst.\n“Next-gen payment processors have the tools to enable the integration of cryptocurrencies with traditional payment networks, working in close collaboration with exchanges and blockchain technology companies to enable businesses and consumers to spend their cryptocurrencies instantly.\n“This task is not simple, requiring cloud-native infrastructure and strong API integrations. The combination of the cutting edge of the payments industry and the most innovative Web3 platforms has the power to enable businesses and consumers to rely on cryptocurrencies when interacting with regular point-of-sale and e-commerce checkouts, reducing a key barrier to greater mainstream adoption of crypto as a payment method.”\nCristiano Ventricelli, VP of digital economy at credit ratings and insights provider Moody’s Ratings, also reveals the challenges associated with the crypto world becoming a popular payment method.\n“Cryptocurrencies such as BTC and ETH face challenges in gaining traction as payment methods due to their inherent volatility, limiting their utility in everyday transactions. In contrast, stablecoins are steadily gaining attention from leading payment providers like Visa and Mastercard.\n“Fintech giants such as Stripe have recently announced integrations with USDC stablecoin, while others like Paypal have developed their own stablecoins for payment purposes.\n“However, the broader adoption of stablecoins is hindered by several obstacles, including the lack of clear regulatory frameworks in many jurisdictions, occasional fragility in maintaining their peg during market distress, and uncertainties surrounding the use of public permissionless blockchains by institutions due to technology risks and tight regulatory stance.”\nCurrently, the demand for using crypto to make a payment simply does not exist, says Scott Lieberman, founder of Touchdown Money.\n“According to a 2021 Oliver Wyman survey, less than one per cent of Americans plan to use cryptocurrency to pay for items in the future. That shows crypto is a long way off from being accepted as a potential replacement for cash and plastic. So what needs to happen for that to occur?\n“Mainly, consumers need to agree that crypto has value. Without the backing of the US government, our paper money and coins would be worthless. Crypto doesn’t have any form of backing, so it lacks any agreed-upon value. Where a dollar is a dollar, crypto could be valuable to one person yet unwanted by the next.\n“Second, crypto must be more stabilised. The market for bitcoin is highly volatile, and wild swings in currency lead to an inflation roller coaster.\n“Finally, each transaction carries a high price point. Credit card fees are a manageable three per cent, while cash carries no fee. Bitcoin cannot compete with that, making it impractical to use as a currency. If these factors don’t change, crypto will never be accepted as a true form of currency.”\nBakhrom Saydulloev, product lead at a global payments infrastructure platform Mercuryo, outlines the process that crypto must go through to become a more accepted payment method:\n“Firstly, enhancing the user experience is essential. This means providing familiar UX and seamless on-and-off-ramping processes akin to those found in traditional Web2. Innovative on- and off-ramp solutions are addressing a key pain point in this space and opening up the path for mass adoption in crypto.\n“Additionally, fostering institutional adoption is crucial. Collaborations with banks and financial institutions worldwide to integrate blockchain technology into their systems can revolutionise international payments.\n“By replacing outdated systems like SWIFT and democratising global payment systems such as Visa and MasterCard, we can pave the way for wider crypto adoption. Building alliances with prominent institutional players and biggest banks and dispelling misconceptions about cryptocurrency as a ‘scam’ are also vital steps in showcasing its potential as a transformative technology in the realm of finance.”\nMicah Kershner, SVP of digital assets at Paysafe, also outlines three areas of progress required: “It depends on the jurisdiction that you’re operating within. However, there are three main points of consideration that need addressing, and they’re all interconnected. That of the user, the merchant, and the tax official.\n“Addressing the user first, there needs to be an inherent benefit, and this must go further than the benefits that they would get from transacting with traditional payment methods. It’s critical that organisations work to solve the challenge of on-ramping and off-ramping i.e. the exchanging of fiat currency (such as US dollars) for cryptocurrencies and vice versa. Crypto wallet applications that are linked to a liquidity provider are a good way around this.\n“To increase merchant adoption, there needs to be enough user demand and transactions need to be fast and easy. Here, it’s critical that the tech is integrated into point-of-sale (POS) systems, terminals, online shopping carts, and gateways, and there needs to be value for the merchant, such as a cost reduction.\n“Finally, to really drive adoption, the transaction cannot initiate a taxable event. In the US, this limits the cryptocurrencies for everyday purchases to stablecoins, however, in markets without capital gains, this is less of an issue.”\nA key barrier to mainstream adoption is trust, explains Scott Major, CCO of global payments platform Transact365: “There are currently over 295 million cryptocurrency users worldwide, with over 10 per cent of UK adults estimated to hold or have held some form of crypto asset. However, cryptocurrency is not always deemed as an accessible or necessary payment method.\n“A large component of this is trust. As with any new or alternative financial service, trust and user experience are paramount to driving adoption for cryptocurrency. One way to enhance trust is for crypto exchanges to integrate more traditional payment technologies that support fast, secure, and user-friendly transaction experiences.\n“For example, implementing widely used local instant payment methods and reducing transaction fees can encourage more frequent trading and boost user engagement. Furthermore, creating a seamless user experience similar to that of Apple Pay or Google Pay is critical in user uptake.\n“Another aspect to consider is how to make crypto more cost-effective for the user. For example, if crypto exchanges were to partner with a local payout solution that we can offer, they’d be able to eliminate intermediaries like banks, resulting in reduced fees and more cost-effective solutions for users.”\nFinally, Bryan Feng, head of Unlimit Crypto, breaks down what crypto must become to encourage its adoption as a mainstream payment method.\n“Payment methods need to be easily accessible, quick, secure, and cheap. The removal of fee-charging intermediaries and increased scrutiny of regulators has left only speed and accessibility to be addressed.\n“While transactions themselves may occur almost instantaneously, the pre-purchase process is often far slower and more complex than with traditional payment methods. The additional complexity of transacting in cryptocurrency remains off-putting to many.\n‌”Merchants need to fully embrace cryptocurrencies as a viable payment method, which is quickly becoming more popular. This embrace will streamline payment processes by integrating new crypto-focused APIs and support the creation of additional onboarding routes built for simplicity.”\nThe Fintech Times"]}
{"date":"2024-05-24","titles":["Ether ETFs Only Cleared a Hurdle: Final Approval Is Still Pending"],"urls":["https:\/\/www.financemagnates.com\/cryptocurrency\/ether-etfs-only-cleared-a-hurdle-final-approval-is-still-pending\/"],"sources":["financemagnates.com"],"descriptions":["The cryptocurrency industry has crossed another milestone, as the US Securities and Exchange Commission (SEC) approved the listing of Ether exchange-traded fund..."],"article_contents":["The cryptocurrency industry has crossed another milestone, as the US Securities and Exchange Commission (SEC) approved the listing of Ether exchange-traded funds (ETFs) on American exchanges. However, the agency has yet to approve trading.\nThe SEC’s approval yesterday (Thursday) came for the 19b-4 forms tied to the Ether ETFs. Securities exchanges make these so-called 19b-4 form submissions for introducing new products or amending existing rules. For Ether ETF, the 19b-4 forms of Nasdaq, CBOE, and NYSE were approved.\nenter the ether 🫴 pic.twitter.com\/YXgKQFP5Nr\nHowever, for trading Ether ETFs, the SEC must approve S-1 forms filed by prospective issuers of the instrument. The S-1 registration forms contain detailed information about new securities to be offered to the public. For ETFs, these forms include the fund’s structure, management, and investment strategy, along with details on the methods of tracking the performance of the underlying assets. The SEC assesses the risk and transparency of the funds with these S-1 forms.\nFor the Ether ETF to be available to the public for trading, the SEC must approve both 19b-4 and S-1 forms. As of now, it has only approved the 19b-4 forms, and there is no indication of the approval of the S-1 forms.\nThe prospective Ethereum ETF issuers who submitted the S-1 forms include BlackRock, Fidelity, Grayscale, VanEck, Franklin Templeton, Ark\/21Shares, and Invesco\/Galaxy. In recent amendments to their submissions, most of these companies removed the provisions of Ethereum staking.\nThe SEC’s statutory period for the approval of S-1 can be extended up to 240 days, and there is no guarantee that a green light to the 19b-4 forms will also lead to the approval of S-1 forms.\nWhile approving the Bitcoin ETFs, the SEC approved both 19b-4 and the S-1 forms at the same time, enabling their trading the very next day of approval.\nAlthough anticipation for Ether ETFs was lower than that for Bitcoin ETFs, the buzz around the instrument suddenly burst in the last few days after a senior Bloomberg analyst raised the odds of approval of a Bitcoin ETF from 25 percent to 75 percent.\nSubsequently, reports also came that the SEC approved the securities exchanges, asking them to amend their 19b-4 forms, an indication of the incoming approval.\nWith all these events, the dollar value of Ether rallied aggressively in the markets. The cryptocurrency gained about 30 percent in the last 7 days. However, the approval of the 19b-4 forms failed to create significant volatility.\n“It’s all about liquidity and flow,” highlighted IG-owned tastycrypto's Head, Ryan Grace. “ETFs equal institutional flow, and new money into the asset class. There’s debate over the initial demand for ETH, but over time, the pipes exist and this matters to the growth of the asset.”\nEther ETF Approved: Why Investing in Ether is Much More Sensible than Bitcoin in 5 PointsA thread 🧵1. Ether is Much Scarcer and Even Deflationary Compared to Bitcoin 📈Unlike Bitcoin, transaction fees on the Ethereum blockchain do not go directly to miners (validators,… pic.twitter.com\/1xDgWp8KD0\nHe further pointed out that even if Ether ETFs receive a trading clearance, the results might not be similar to the impact of Bitcoin ETFs on price.\n“We could see a price squeeze given illiquid ETH supply,” Grace added. “Around 30% of supply is staked, and while it could be unstaked, ETH is used in DeFi etc., and the supply is not super liquid vs potential demand flows.”\n“Essentially, ETH ETF gives institutions a way to 'diversify' their crypto allocation. I’m not expecting there to be as big of an inflow as we saw in the BTC ETFs initially, but maybe we see assets under management approach 50% of BTC ETFs within 6 months.”\nThe cryptocurrency industry has crossed another milestone, as the US Securities and Exchange Commission (SEC) approved the listing of Ether exchange-traded funds (ETFs) on American exchanges. However, the agency has yet to approve trading.\nThe SEC’s approval yesterday (Thursday) came for the 19b-4 forms tied to the Ether ETFs. Securities exchanges make these so-called 19b-4 form submissions for introducing new products or amending existing rules. For Ether ETF, the 19b-4 forms of Nasdaq, CBOE, and NYSE were approved.\nenter the ether 🫴 pic.twitter.com\/YXgKQFP5Nr\nHowever, for trading Ether ETFs, the SEC must approve S-1 forms filed by prospective issuers of the instrument. The S-1 registration forms contain detailed information about new securities to be offered to the public. For ETFs, these forms include the fund’s structure, management, and investment strategy, along with details on the methods of tracking the performance of the underlying assets. The SEC assesses the risk and transparency of the funds with these S-1 forms.\nFor the Ether ETF to be available to the public for trading, the SEC must approve both 19b-4 and S-1 forms. As of now, it has only approved the 19b-4 forms, and there is no indication of the approval of the S-1 forms.\nThe prospective Ethereum ETF issuers who submitted the S-1 forms include BlackRock, Fidelity, Grayscale, VanEck, Franklin Templeton, Ark\/21Shares, and Invesco\/Galaxy. In recent amendments to their submissions, most of these companies removed the provisions of Ethereum staking.\nThe SEC’s statutory period for the approval of S-1 can be extended up to 240 days, and there is no guarantee that a green light to the 19b-4 forms will also lead to the approval of S-1 forms.\nWhile approving the Bitcoin ETFs, the SEC approved both 19b-4 and the S-1 forms at the same time, enabling their trading the very next day of approval.\nAlthough anticipation for Ether ETFs was lower than that for Bitcoin ETFs, the buzz around the instrument suddenly burst in the last few days after a senior Bloomberg analyst raised the odds of approval of a Bitcoin ETF from 25 percent to 75 percent.\nSubsequently, reports also came that the SEC approved the securities exchanges, asking them to amend their 19b-4 forms, an indication of the incoming approval.\nWith all these events, the dollar value of Ether rallied aggressively in the markets. The cryptocurrency gained about 30 percent in the last 7 days. However, the approval of the 19b-4 forms failed to create significant volatility.\n“It’s all about liquidity and flow,” highlighted IG-owned tastycrypto's Head, Ryan Grace. “ETFs equal institutional flow, and new money into the asset class. There’s debate over the initial demand for ETH, but over time, the pipes exist and this matters to the growth of the asset.”\nEther ETF Approved: Why Investing in Ether is Much More Sensible than Bitcoin in 5 PointsA thread 🧵1. Ether is Much Scarcer and Even Deflationary Compared to Bitcoin 📈Unlike Bitcoin, transaction fees on the Ethereum blockchain do not go directly to miners (validators,… pic.twitter.com\/1xDgWp8KD0\nHe further pointed out that even if Ether ETFs receive a trading clearance, the results might not be similar to the impact of Bitcoin ETFs on price.\n“We could see a price squeeze given illiquid ETH supply,” Grace added. “Around 30% of supply is staked, and while it could be unstaked, ETH is used in DeFi etc., and the supply is not super liquid vs potential demand flows.”\n“Essentially, ETH ETF gives institutions a way to 'diversify' their crypto allocation. I’m not expecting there to be as big of an inflow as we saw in the BTC ETFs initially, but maybe we see assets under management approach 50% of BTC ETFs within 6 months.”\nShare this article"]}
{"date":"2024-05-27","titles":["Crypto Highlights: Bitcoin Price Volatility, Ethereum ETF Hopes, and Furrever Token's $1.2M Presale Finale"],"urls":["https:\/\/www.globenewswire.com\/news-release\/2024\/05\/27\/2888443\/0\/en\/Crypto-Highlights-Bitcoin-Price-Volatility-Ethereum-ETF-Hopes-and-Furrever-Token-s-1-2M-Presale-Finale.html"],"sources":["globenewswire.com"],"descriptions":["New York City, NY, May  27, 2024  (GLOBE NEWSWIRE) --  The cryptocurrency market is constantly evolving, with significant developments influencing investor..."],"article_contents":["May 27, 2024 07:00 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nNew York City, NY, May  27, 2024  (GLOBE NEWSWIRE) --\nThe cryptocurrency market is constantly evolving, with significant developments influencing investor sentiment and market dynamics. Recently, Bitcoin has faced potential price risks, Ethereum has generated buzz with ETF speculations, and Furrever Token is nearing the end of its successful $1.2 million presale. Here's an in-depth look at these key events and their potential impacts on the market.\nBitcoin Faces Price Drop Risks\nBitcoin (BTC), the leading cryptocurrency by market capitalization, is currently experiencing potential price risks that have raised concerns among investors. A significant factor contributing to these fears is the activity of long-term holders. According to a recent analysis by analysts, these holders, who have amassed significant quantities of Bitcoin over time, are showing signs of profit-taking. This behavior often precedes a price drop, as large sell-offs can create downward pressure on Bitcoin's price.\nThe data suggests that long-term holders have been moving their BTC to exchanges, indicating a potential intent to sell. This trend, if it continues, could lead to increased volatility and a further decline in Bitcoin's price. Additionally, macroeconomic factors, such as regulatory developments and changes in investor sentiment, are also playing a role in the current market dynamics.\nDespite these concerns, Bitcoin's long-term fundamentals remain strong. Institutional adoption is growing, with major companies and financial institutions recognizing Bitcoin's potential as a store of value and a hedge against inflation. The integration of Bitcoin into traditional financial systems and its increasing acceptance as a legitimate asset class provides a solid foundation for its future growth.\nEthereum ETF Hopes Stir Optimism\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, has generated significant buzz with the potential approval of a spot Ethereum Exchange-Traded Fund (ETF). This development could mark a pivotal moment for Ethereum and the broader cryptocurrency market. A recent report by a trusted source highlights that industry experts, including Michael Saylor of MicroStrategy, believe that a spot Ethereum ETF could be beneficial for the entire crypto market, including Bitcoin.\nThe approval of a spot Ethereum ETF would provide institutional investors with a regulated and easily accessible vehicle to gain exposure to Ethereum. This could lead to increased demand and potentially drive up the price of ETH. Furthermore, an Ethereum ETF would signify a broader acceptance of cryptocurrencies by traditional financial markets, paving the way for further innovation and adoption.\nThe U.S. Securities and Exchange Commission (SEC) has been cautious in its approach to approving cryptocurrency ETFs, citing concerns about market manipulation and investor protection. However, the growing interest from institutional investors and the increasing pressure from the crypto industry could eventually lead to a favorable decision.\nThe anticipation of an Ethereum ETF has already had a positive impact on market sentiment. Investors are hopeful that this development will bring more legitimacy to Ethereum and attract a new wave of capital into the market. As the industry awaits the SEC's decision, the potential approval of a spot Ethereum ETF remains a key factor to watch.\nFurrever Token’s $1.2 Million Presale Nears to an End\nWhile Bitcoin and Ethereum navigate their respective challenges and opportunities, Furrever Token (FURR) is making waves with its unique approach to the crypto market. Furrever Token aims to create a heartwarming ecosystem centered around adorable cat imagery, offering a refreshing contrast to the often serious and technical world of blockchain projects.\nThe Furrever Token presale has been a resounding success, raising over $1.2 million as it nears its end. This achievement highlights the strong interest and support from the crypto community. Built on the BNB-20 blockchain, Furrever Token has a total supply of around 9 billion tokens. Of these, 65% are available during the presale, 25% are allocated for decentralized exchanges (DEXs), and 10% are reserved for the team, with a one-year lock on these tokens.\nFurrever Token's appeal lies in its blend of fun and innovation. The project integrates cute cat-themed stickers, emojis, and visuals, transforming everyday interactions into delightful experiences. Community engagement is a cornerstone of the Furrever ecosystem, with regular challenges and events that encourage users to share their love for cuteness. Future surprises, featuring exclusive cat content, are also planned to keep the community engaged and entertained.\nSecurity and compliance are paramount for Furrever Token. The project’s smart contract has been audited by Securi Lab, ensuring a secure and reliable platform for users. The team, while not doxxed, has shown commitment to the project's longevity by locking their tokens for a year. The organic growth of the Furrever Token community, with nearly 4,000 active members on Telegram, further underscores its legitimacy and potential.\nAs the presale nears its end, now is the ideal time to invest in Furrever Token. The combination of a strong community, innovative approach, high return rates, and robust tokenomics makes Furrever Token a standout option for those looking to capitalize on emerging trends in the cryptocurrency market. With its unique blend of cuteness and substantial growth potential, Furrever Token presents a compelling investment opportunity.\nIn conclusion, while Bitcoin faces price risks and Ethereum generates optimism with ETF speculations, Furrever Token's successful presale and engaging community offer a unique and promising investment avenue. The dynamic nature of the cryptocurrency market continues to offer opportunities for those willing to explore beyond the mainstream and invest in projects with distinctive value propositions. Join Furrever Token Presale Now:  Furrever Token Official Website    Join $20,000 Furrever Token Giveaway  Join Official Telegram Group   Follow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support@furrevertoken.comDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities."]}
{"date":"2024-05-28","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-05-29","titles":["Crypto Price Today: Bitcoin Hovers Over $62,000, Solana Joins Ether, Tether in Losses","Can Bitcoin (BTC) and Ethereum (ETH)'s Bull Run Propel Furrever Token to New Heights?","What Will it Take for Bitcoin to Break Its All Time High Again?"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-ether-price-today-solana-tether-see-losses-5769765","https:\/\/www.globenewswire.com\/news-release\/2024\/05\/29\/2889721\/0\/en\/Can-Bitcoin-BTC-and-Ethereum-ETH-s-Bull-Run-Propel-Furrever-Token-to-New-Heights.html","https:\/\/thefintechtimes.com\/what-will-it-take-for-bitcoin-to-break-its-all-time-high-again\/"],"sources":["ndtv.com","globenewswire.com","thefintechtimes.com"],"descriptions":["In the last 24 hours, the total market cap of the crypto sector rose by 1.70 percent. While Bitcoin managed to mint a small gain, Ether joined Solana, Polkadot,...","New York City, NY , May  29, 2024  (GLOBE NEWSWIRE) --      The  cryptocurrency market is renowned for its volatility and the rapid  shifts in value that...","We set out to find out what will need to happen for Bitcoin to break its all-time high once again, following the new record in March 2024."],"article_contents":["Photo Credit: Pexels\/ Rodnae Productions\nThe overall crypto market cap, as of now, stands at $2.58 trillion\nThe overall crypto chart showed the market trading rather flat today. Bitcoin on Wednesday, May 29 reflected a small gain of 1.28 percent. With this, Bitcoin is currently trading at $68,768 (roughly Rs. 57.2 lakh) on foreign exchanges like CoinMarketCap. Meanwhile, on national exchanges like WazirX, CoinDCX, and CoinSwitch, Bitcoin is trading around the price point of $71,770 (roughly Rs. 59.7 lakh). Market analysts have predicted that the upcoming US GDP Q announcement could induce more volatility in the market in the coming days.\n“The crypto market has been volatile due to the news of Mt. Gox transferring BTC, causing many altcoins to fall. Bitcoin's short-term price action looking uncertain, though it remains strong and bullish in the higher time frame,” CoinDCX told Gadgets360.\nEther showed a price dip of 1.42 percent as per Gadgets360's crypto price chart. At the time of writing, Ether was trading at $3,861 (roughly Rs. 3.21 lakh) as per CoinMarketCap. The price of Ether is expected to see hikes in the coming days, following the approval of ETH ETFs in the US.\n“As the launch of spot Ether ETFs approaches within the next two months, Ethereum bulls are reasserting their dominance. Daily trading volumes for Ethereum have also seen a substantial increase, rising by 68 percent to nearly $17 billion (roughly Rs. 1,41,554 crore). This renewed bullish sentiment appears to be driven by the anticipation of the ETF launch, indicating that investors are positioning themselves for potential further gains shortly,” the ZebPay trade desk told Gadgets360.\nOn Wednesday, more cryptocurrencies recorded small gains than losses on the price chart. Binance Coin, Ripple, Dogecoin, Shiba Inu, Cardano, Avalanche, Wrapped Bitcoin, Tron, and Near Protocol - all found their ways onto the profit-making side of the crypto chart.\nMinor gains were also seen by Leo, Cosmos, Stellar, Bitcoin SV, and EOS Coin.\nIn the last 24 hours, the total market cap of the crypto sector rose by 1.70 percent. With this, its capitalisation has come to the mark of $2.58 trillion (roughly Rs. 2,14,83,982 crore).\nTether, Solana, Polkadot, Polygon, Litecoin, and Cronos emerged on the loss-making side of the crypto chart.\n“The crypto market remained volatile with BTC and ETH witnessing marginal swings in their prices. The market is expected to remain volatile in the coming weeks due to uncertain macroeconomic conditions,” Shivam Thakral, CEO of BuyUcoin told Gadgets360.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement","May 29, 2024 07:07 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nNew York City, NY , May  29, 2024  (GLOBE NEWSWIRE) --\nThe  cryptocurrency market is renowned for its volatility and the rapid  shifts in value that can either make or break investors. Bitcoin (BTC)  and Ethereum (ETH), two of the most prominent cryptocurrencies, have  recently shown strong bullish signs, leading many to wonder if this  momentum could lift emerging tokens like Furrever Token (FURR)  to new heights. This article explores how the bull run of Bitcoin and  Ethereum might positively impact Furrever Token, driving significant  gains and broader market recognition.\nBitcoin and Ethereum: Leading the Charge\nBitcoin  and Ethereum have long been the stalwarts of the cryptocurrency market.  Their market movements often set the tone for the entire crypto space.  Recent analysis suggests several reasons to be bullish on Bitcoin,  including its current position in a consolidation zone, favorable  on-chain metrics, and technical indicators like the golden ratio  multiplier and the MVRV Z-score. These metrics indicate that Bitcoin  might be undervalued and poised for a significant upward movement.\nEthereum,  on the other hand, is anticipating the approval of its ETFs by the SEC,  which could attract a wave of institutional investment. This potential  influx of capital is expected to drive ETH prices higher, further  solidifying its market position. Additionally, Ethereum's robust  ecosystem, which includes decentralized finance (DeFi) and non-fungible  tokens (NFTs), continues to grow, attracting both retail and  institutional investors.\nFurrever Token: The New Contender\nFurrever  Token is an emerging cryptocurrency that stands out with its unique,  cat-themed approach designed to make the crypto experience fun and  engaging. Operating on the BNB-20 blockchain, Furrever Token has a total  supply of 9 billion tokens and has already raised over $1.1 million in  its presale. The token's appeal lies in its community-driven approach,  integrating cute cat-themed stickers, emojis, and visuals to create a  delightful user experience.\nPotential Impact of Bitcoin and Ethereum's Bull Run\nWhen  Bitcoin and Ethereum enter a bull run, they tend to boost overall  market confidence. Investors often feel more secure and optimistic about  the potential returns from other cryptocurrencies when the market  leaders are performing well. This positive sentiment can extend to  emerging tokens like Furrever Token, encouraging more investors to  explore and invest in these newer opportunities.\nA bull run in  Bitcoin and Ethereum generally brings higher liquidity to the  cryptocurrency market. Increased trading volumes and capital inflows  into BTC and ETH can spill over into other cryptocurrencies. For  Furrever Token, this could mean more active trading, greater price  stability, and the potential for significant price appreciation as it  becomes more accessible to a broader audience.\nAs Bitcoin and  Ethereum dominate headlines with their price surges, the overall  interest in the cryptocurrency market grows. This increased attention  can drive more people to explore other cryptocurrencies, including  Furrever Token. The unique value proposition of Furrever Token, with its  cat-themed ecosystem and community engagement, can attract investors  looking for novel and enjoyable investment opportunities.\nThe  approval of Ethereum ETFs is expected to bring substantial institutional  investment into the crypto space. This influx of capital can create a  favorable environment for other cryptocurrencies. Institutions looking  to diversify their crypto portfolios might consider investing in  promising new projects like Furrever Token, particularly if it  demonstrate strong community support and innovative features.\nFurrever Token’s Unique Value Proposition\nFurrever Token’s  approach to creating a fun and engaging user experience is its standout  feature. The integration of cat-themed stickers, emojis, and visuals  transforms everyday interactions within the crypto ecosystem, making it  appealing to a broad audience. The project also encourages active  community participation through regular challenges and events, fostering  a warm and friendly environment.\nMoreover, Furrever Token's  presale success, raising over $1.1 million, indicates strong initial  interest and support. The project's roadmap includes plans for exclusive  cat content and further community-driven initiatives, which could  enhance its attractiveness as a long-term investment.\nConclusion\nThe  bullish trends in Bitcoin and Ethereum present a unique opportunity for  emerging tokens like Furrever Token. As BTC and ETH drive market  confidence and liquidity, Furrever Token stands to benefit from  increased attention, higher trading volumes, and potential institutional  interest. With its unique, engaging approach and strong community  support, Furrever Token could indeed be propelled to new heights by the  ongoing bull run of Bitcoin and Ethereum.\nJoin Furrever Token Presale Now:  Furrever Token Official Website    Visit Furrever Token Presale   Join Official Telegram Group   Follow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support@furrevertoken.comDisclaimer:  The information provided in this press release is not a solicitation  for investment, nor is it intended as investment advice, financial  advice, or trading advice. It is strongly recommended you practice due  diligence, including consultation with a professional financial advisor,  before investing in or trading cryptocurrency and securities.","For better or for worse, when you think of cryptocurrencies, it is very likely you think of Bitcoin. Against all the odds and the negative press Bitcoin receives; be it facilitating illegal trade transactions or having a massive negative impact on the environment, crypto’s poster boy continues to remain in the limelight. One major reason for this is the price points it has achieved.\nBitcoin helped feed the crypto hype during the pandemic, which in turn led to the digital asset reaching all-new heights. Since then, it seemed like Bitcoin’s heyday was in the rearview mirror, but once again, the asset’s price shot up and broke its record once again in March 2024.\nAs we look to the future, we set out to find out what will need to happen for Bitcoin to break its all-time high once again.\nBitcoin is an extremely volatile asset, as its values soar and plummet in the blink of an eye. One factor that comes along every four years that has historically impacted its value is the Bitcoin halving. This event reduces the reward for each Bitcoin block mined by 50 per cent. The purpose of the halving is to counteract inflation and maintain scarcity.\nCommenting on how the recent halving will impact the sphere, Professor Andrew Urquhart – head of the ICMA Centre and professor of finance and financial technology said: “I believe Bitcoin will again reach an all-time high in 2024 given the halving in April which involved a decrease in the amount of new Bitcoin created every 10 minutes.\n“This decrease in the increase in the supply of Bitcoin should cause a supply squeeze, putting upward pressure on prices. Regulation may help, but also hinder price prospects so it depends on the level, scope and purpose of the regulations.”\nJames Sullivan, group general counsel and UK general manager of Bitstamp, the crypto exchange, added: “Bitcoin has, as a result of the Bitcoin halving event and growing institutional interest, been under some pressure for increased demand.\n“As a result, we may see Bitcoin reach a new all-time high in later in the cycle. Additionally, we will also need to see the continued development of regulatory frameworks that place trust and security at the forefront for investors, giving institutions the confidence to treat it like traditional finance.”\nWhile the halving has acted as a big catalyst for change in the past, Lars Holst, founder and CEO, GCEX, the digital assets and FX brokerage, also notes the importance of other factors.\n“Beyond greater institutional adoption and after the Bitcoin-Halving event, a combination of factors could contribute to this event. Positive macroeconomic conditions may encourage further interest in risk assets, such as Bitcoin. Additionally, regulatory clarity is crucial for wider adoption, providing a stable framework that gives confidence among investors and businesses alike.\n“These factors, coupled with ongoing technological advancements and growing mainstream acceptance, have the potential to propel Bitcoin to new records.”\nLukman Otunuga, senior market analyst at FXTM, the online trading broker, 5 November 2024 will be a pivotal moment for the future of Bitcoin and its possible all time record break. On this day, the US election will take place.\n“Bitcoin remains under pressure with the scales of power seemingly shifting in favour of bears. The cryptocurrency ended April over 15 per cent lower and extended losses into the new month despite the halving event two weeks ago.\n“Investor appetite for the crypto has been hit by the prospects of ‘higher for longer’ US interest rates with ETF outflows fuelling the downside pressure. According to Bloomberg, a group of almost a dozen US spot Bitcoin ETFs saw outflows of $564million on Wednesday – the biggest seen they launched in January. With Bitcoin trading roughly 20 per cent away from its all-time and currently weighed by fundamentals, bulls have a steep hill to climb.\n“Nevertheless, the cryptocurrency is still up almost 40 per cent year-to-date and could remain influenced by US rate cut expectations. Looking ahead, the next major event that could rock Bitcoin is likely to be the US presidential elections. Biden‘s opposition, Trump could be the next catalyst. His pro stance towards cryptocurrencies may boost sentiment towards Bitcoin should he triumph.\n“To be clear, determining what influence Trump could have on the SEC is uncertain – but the idea of a pro-crypto US president may translate to fresh upside gains across the crypto space.”\n“The prospect of Bitcoin surpassing its previous all-time high (ATH) requires a confluence of factors to align,” explains Nick Merritt, executive director, Designit, the experience innovation company.\n“Institutional adoption plays a pivotal role, with continued investment from corporations, asset managers, and hedge funds driving demand and price appreciation. Market sentiment, influenced by macroeconomic factors, inflation concerns, and technological advancements, can sway investor behaviour towards bullish trends. Regulatory developments that provide clear and favourable frameworks can mitigate uncertainty and foster investor confidence.\n“Halving events, which reduce the rate of new coin creation, historically coincide with bull markets and ATHs, potentially influencing price movements. Additionally, market dynamics, including supply and demand dynamics and investor sentiment, contribute significantly to Bitcoin’s price trajectory.\n“However, the relationship between the halving and price movement is nuanced. Market sentiment, investor behaviour, and external factors also influence Bitcoin’s price dynamics. Speculative activity leading up to the event can contribute to short-term volatility.”\nBoth Jonathan Dixon, head of trade surveillance at eflow Global, the workflow and regulatory software provider and Edan Yago, CEO of Sovryn the crypto trading platform, shared similar views that ultimately, we would have to wait and see\nDixon noted: “The halving of BTC and the adoption of ETFs is one way this could happen. The halving reduces the supply of new Bitcoin, while ETF adoption increases demand by facilitating broader market participation.\n“The change of ‘whales’—entities that hold large amounts of Bitcoin—being individual high-net-worth investors to nation-states and institutional firms, is also important. All of these players can afford to take long positions and ride out price volatility. As more people hold, price moves rely less and less on retail and more on the demand of providers of ETFs and cash rich firms.\n“Finally, time is required. Historically, Bitcoin has outperformed traditional finance when viewed over extended periods. Given time, one would expect Bitcoin to organically achieve several new all-time highs throughout its cycles over the next decade. In other words, patience is a virtue.”\nYago said time will be key factor in determining if Bitcoin can break its record: “While Bitcoin’s price is volatile in the medium term, it has maintained a rapid growth trajectory. More users, more integration with legacy financial systems and improved technology mean that Bitcoin’s rise remains as robust and inevitable as it has been at any point in its almost 15 year history.”\nThe Fintech Times"]}
{"date":"2024-05-30","titles":["Michael Saylor Delivers Key Bitcoin Tip By U.Today","Can Bitcoin Survive the $9B Bearish Wave from Mt. Gox?"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/michael-saylor-delivers-key-bitcoin-tip-3463849","https:\/\/www.valuewalk.com\/bitcoin-forecast-mt-gox-repayments\/"],"sources":["investing.com","valuewalk.com"],"descriptions":["Michael Saylor Delivers Key Bitcoin Tip","Mt. Gox transferred around $9 billion for a possible repayment distribution. Can Bitcoin withstand the selling if the creditors dump their BTC?"],"article_contents":[null,null]}
{"date":"2024-05-31","titles":["MI REWIND: BITCOIN, CRYPTOCURRENCIES, AND BLOCKCHAIN PART 2"],"urls":["https:\/\/www.theinvestorspodcast.com\/millennial-investing\/rewind-bitcoin-cryptocurrencies-blockchain-part-2\/"],"sources":["theinvestorspodcast.com"],"descriptions":["Today’s show is part 2 of a two-part series all about Bitcoin, other cryptocurrencies, and blockchain technology with Preston Pysh."],"article_contents":["31 May 2024\nToday’s show is part 2 of a two-part series all about Bitcoin, other cryptocurrencies, and blockchain technology with TIP’s Co-Founder Preston Pysh. Preston is a graduate of West Point and Johns Hopkins University, the founder of BuffettsBooks.com, and Co-Founder\/Co-Host of We Study Billionaires by The Investor’s Podcast Network.\nSUBSCRIBE\nSUBSCRIBE\nDisclaimer: The transcript that follows has been generated using artificial intelligence. We strive to be as accurate as possible, but minor errors may occur.\nRobert Leonard  00:02\nIn today’s episode, Preston and I continue our conversation from last week. If you haven’t already listened to last week’s show, I’d recommend you go back and listen to it before continuing with this one. Without further delay, let’s jump into Part 2, right where we left off.\nIntro  00:19\nYou’re listening to Millennial Investing by The Investor’s Podcast Network, where your host, Robert Leonard, interviews successful entrepreneurs, business leaders, and investors to help educate and inspire the millennial generation.\nRobert Leonard  00:41\nIt’s kind of hard to fathom, honestly. From someone who doesn’t know a ton about Bitcoin, it’s hard to see why it wouldn’t be better than gold or why it wouldn’t do all the things that you expect it to do. So yeah, I definitely agree with you.\nNow let’s talk about mining. We’ve talked about blockchain. We’ve talked about a couple of different cryptocurrencies and Bitcoin. Let’s discuss mining. What exactly is that?\nPreston Pysh  01:07\nThis one’s hard. For somebody who’s not extremely technical to understand this, it’s going to be hard to kind of plow through it, so let me just try to describe it like this. Almost everything that you look at in Bitcoin can almost have a correlation to the physical gold market. So are there companies out there mining for gold right now? Yes, there are. They’re digging the gold out of the ground. How do you know that they’re digging out of the ground? Well, you could look at all their expenses on their income statement; you can see all the hardware, all the equipment, and all the man-hours. When you look at that, and you know the probability of how much resources you have to expend to pull 1 oz. of gold out of the ground, you can get an idea of the amount of work that went into basically achieving that feat of finding something extremely scarce.\nWith Bitcoin, what you have is a bunch of people that are running their processor on their computer, and they’re trying to solve a puzzle. This is their work. So there’s a riddle that’s published every 10 minutes or until the block is discovered, and the next block occurs. But on average, it’s around 10 minutes. It publishes a riddle basically saying, “Solve this mathematical puzzle that can only be solved through guesswork.”\nWhen you talk about encryption, it’s a one-direction function. Let me give you an example. If you type the word ‘the’, took those three characters, t-h-e, all lowercase, and put them through the SHA256 encryption algorithm, it’s going to always pop out on the right side of the equation; a hash. I’m sure many people have seen a cryptographic hash and it looks like 78arT like it has this big long string, and it pumps out the same length of the string as the output. Now, if you took the word ‘the’, with a capital T, and lowercase h and e, T-h-e, and you put it through the one-way function, it’s going to pump out a completely different hash. If you took an entire book, and you put it as an input to the SHA256 encryption, it’s going to pump out a hash that has the same number of characters as the word ‘the’. And if you ran that entire book, without any of those letters being different through the SHA256 encryption, it’s going to pop it out on the other side. Same thing.\nWhen these miners are trying to solve the puzzle, the Bitcoin protocol says, “Here’s the hash,” but it’s not giving you the full hash. This gets into really complex mathematics, but it’s not giving you the full hash. It’s giving you a portion of the hash. It’s easier to solve than if you had to solve the entire hash. And it’s saying, “Solve this riddle.” The only way you can solve this riddle is by guessing the word or whatever makes up this hash: this one-way encryption output. And so all these processors are guessing, “Oh, I think it’s the word ‘the’. I think it’s the word ‘most.’ I think it’s the word…” I’m dumbing this down as far as how the computers are guessing.\nAll these computers are guessing what the input is to that one-way encrypted output. Once a computer solves that, it takes all the transactions that have been requested during that period of time: from when the riddle was put out to the world to be solved. It takes all those transactions that went into the mempool, then basically conducts them through that proof of work that that miner just solved. Then you have a header and a tail inside that block that also has encryption that then gets tied to the very next block that goes.\nLong story short, what these miners are doing is, just like if you’re mining gold, they are conducting work to prove that they solved the puzzle. They’re actually securing the transactions because if you wanted to try to go back and undo one of those transactions, you have to go back in time, then be able to solve the next puzzle in addition to the puzzle that you solved, where the original transaction happened. The miners cannot, from a mathematical sense, conduct that, and do it in a manner that is cost-efficient to them for all the work and the energy that they’re consuming to do it.\nI don’t know if that did a good job of answering your question, but that’s the best way I can kind of describe something extremely technical.\nRobert Leonard  05:54\nSo with that being so complex, I’m sure we were just touching on the surface. Are coins that don’t require mining better than coins that do require it like say, Bitcoin?\nPreston Pysh  06:06\nYou’re going to get a whole range of opinions on this one, but what I would tell you is I believe that the only reason Bitcoin’s price continues to go up, especially during this first decade of the protocol, is because what you’re doing is this proof of work algorithm. What I just described before was proof of work. And what you’re really implying is a proof of stake mechanism, where the people that own all the units basically have a vested interest in the security of the protocol, so that the protocol doesn’t fail.\nMy opinion is how does gold have an intrinsic value? Well, it’s based on that cost that takes for them to pull it out of the ground. This is a really, really tricky conversation because it’s somewhat based on the cost of pulling it out of the ground, and then it’s somewhat based on the demand for people to hold it and the utility of it. So, when you’re talking about Bitcoin early on, if you were one of these miners, and let’s say you spent $100 worth of fiat to mine 100 bitcoins early on, you spent $100 of fiat to get $100 of Bitcoin. There’s no way you’re going to sell one of those bitcoins for less than $1. It doesn’t make any sense. So what you have very early on in the protocol is because of the proof of work, and the cost associated with mining it, you were able to stick a price tag to what one of the units were worth.\nOne of the other pieces of the protocol is that every four years, the protocol gives half as much reward for solving the riddle. Think of it like mining gold. If you were going to mine some gold, and today, we were able to mine 100 oz. of gold for $100, and then tomorrow, it got twice as hard to mine the same amount, what happens to the price that you’re willing to sell it for? Well, you’re only willing to sell it for double what you were doing because your production costs literally doubled to get the same amount.\nThat’s what the Bitcoin protocol has been doing for a decade now. Every four years, the amount of reward gets cut in half, and what you find is the miners are unwilling to sell it for a loss. And the miners that can’t mine it for a profit fall out of the system. They just say, “Hey, I’m not going to do this anymore,” and they stop competing. As that competition goes down, other people step in, and then the price, and so that’s what’s driving the adoption curve at the rate at which it’s going. When you plot it, and you get Metcalfe’s law out of the price, it all starts to make sense.\nThe other big thing is these big price swings. It has a 68% volatility on an annual basis. Why does it have a 68% volatility? Well, I would argue, one of the reasons that you have that is this symbiotic relationship between the four-year halving cycle and a two-week difficulty adjustment, which we haven’t even talked about, that’s also built into the protocol. This relationship between those two functions is what’s driving that intense volatility. I would tell you it’s by design so that you can get entrenchment into existing financial rails. So, there are so many things going on inside of this that it’s kind of mind-bending, to be quite honest with you.\nRobert Leonard  09:36\nI want to go into a conversation about how to value a Bitcoin next. But before we do that, just like you said, it is mind-bending. And I’m just wondering how in the world did someone even come up with this? How did they even create this? Where did it come from?\nPreston Pysh  09:54\nNo one knows. I would tell you that some type of mathematical genius that understands game theory to the nth degree; that understands economics to the nth degree; that understands network effects to the nth degree; that understands branding and marketing to the nth degree. And, I mean, just the programming! You can hit so many different fields of technology inside of something that, from a distance, looks silly to the commoner. It’s just like magic internet money, right? That it’s hard to even wrap your head around how a person could possibly understand all those things, then to release it, and then to have the success that it’s had. It’s mind-bending again. It’s indescribable!\nRobert Leonard  10:43\nAnd they keep it all a secret.\nPreston Pysh  10:45\nWell, I think that that also goes to the intelligence of the person or the group of people that created it. I mean, look at Libra: the Facebook coin. They were dead on arrival. They were dragged straight up onto the hill. Over in Europe, they were crushed because everyone knew who was behind it. And so, I mean, you have to be that smart. You have to understand all these different things. And then, you also have to understand that you can’t be known.\nRobert Leonard  11:15\nIt really is incredible. I would love to know who is behind it. I’m sure there are millions and millions and millions of people who want to know. Some people would pay a lot of money to know that. But yeah, they’ve got to be some of the smartest people that have ever walked the face of this earth.\nLet’s talk about how you can calculate the value of this. Because with the stock, you can calculate the intrinsic value of the business, and then determine if the stock is undervalued, fairly valued, or even overvalued. It doesn’t necessarily seem like you could do that with Bitcoin or cryptocurrencies. So, inherently, doesn’t that mean it’s a speculation play? Not an investment? And how are you attempting to value things like this as a value investor?\nPreston Pysh  11:52\nThis is a question that, when I was buying it back in 2015 or 2016, that period of time, a lot of people had. I don’t think that I had a really good answer for how I was valuing it back then other than “If this would catch on a global level, the market cap would have to be over $1 trillion.” And back then, I mean, it was a market cap of $5 billion. So right there, you were 100x easy on. The big question was like, “How long is that adoption going to take?” Now, I think we have a much better idea of the speed of the adoption rate because we’re seeing how the protocol is executing Metcalfe’s law through stock-to-flow. And there’s a lot of models today that didn’t exist five years ago, when I first started getting into this.\nThe way I would describe it to value investors, I’d say, is very similar to the way I was thinking about it back in 2015. I would tell you, “I think your market cap on the very low end, I’d say this is a super ultra-conservative number, in my opinion, is $2 trillion.” I think a mediocre market cap to probably high market cap might be around $30 trillion. There are people out there that will make arguments for it being even higher than that. But for simplicity’s sake, let’s just say, it’s between $2-30 trillion. That’s the market cap of how high this could go if it starts replacing fiat, which it seems that’s what’s happening right now.\nBased on the price being where it is today, in the $180 billion range, that means that it’d be a 10x move if it went to $2 trillion, and it’d be around 164x move if it went to $30 trillion from where we’re at now. So then, you say, “Well, how long is it going to take to get there?” And I would say, a very conservative estimate is another 10 years to get to that level.\nAnd so, if it takes 10 years to get to that level, you can go back, you can basically do an annual adjusted rate of return to get that 10x and 164x move, and you’re between 30-76% annual return at the current price. That’s how I do an IRR. If it’s a stock, I figure out “What is the internal rate of return that I’m going to get based on the price of where it’s at now and the future cash flows that I expect to receive in the future?” Then I figure out what percent does that give me today, and that’s my IRR. So I guess I’m doing some form of an IRR, but with a currency that I think has a huge adoption rate on the horizon.\nRobert Leonard  14:29\nSo if someone doesn’t have say, $10,000 to buy one whole bitcoin, can they still buy a fraction of it or a decimal of it like you mentioned, and still earn those same returns?\nPreston Pysh  14:41\nExactly. So if you have $100, and that’s all you can afford; $100 fiat, backed by nothing. People will say it’s backed by the military. Well, it might be, but the monetary baseline’s backed by nothing. It’s going to keep expanding. Yeah, you can take that $100 and you can go by 0.00x bitcoin, and it’ll perform the same as if you own 1 BTC, 10 BTC, or 100 BTC.\nRobert Leonard  15:05\nWith all of this talk about valuing Bitcoin and other cryptocurrencies, as well as its potential return, how can this even be considered a currency? That’s one of the hardest parts for me to wrap my head around on from the very beginning a few years ago, when I first started learning about it and reading about it a little bit. Today, it’s still the hardest thing for me to wrap my head around on. I can understand how someone could think of it as an investment like you’ve talked about, but I have so far had a tough time understanding how it can be considered a currency.\nPeople can freely spend the US dollar because it’s relatively stable, whereas with Bitcoin, if it’s going to be achieving the returns that you just mentioned, why would anyone spend it like a normal currency? Why would they give up those potential future returns for a simple product or service? I’m sure you’ve heard the story about the guy that bought pizza with it in its early days, so just, I guess, why for those things?\nPreston Pysh  15:54\nA fun note about the pizza: With 10,000 BTC he purchased the pizza. It was the first transaction. Today, you can purchase a Gulfstream G650 and a $30 million mansion with the same 10,000 BTC. So if you want to talk about hyperinflation relative to owning Bitcoin, there’s a perfect example. You went from pizza to Gulfstream G650 and $30 million mansions. So it’s all “What is your numeraire that you’re using in order to gauge the central banking printing that’s happening?”\nMore to your point on the volatility in the utility of the currency and why so many people are having a hard time understanding. I don’t know if you saw this, Robert, but I got in a Twitter war with Mark Cuban. It was a pretty engaged conversation. I’ll try to dig up the thread, so we can put it in the show notes if people want to check out the discussion. The back and forth. Mark, in my very humble opinion, Mark’s a billionaire, right? So, he’s got all the credibility in the world. I’m nobody. And so, people listening to this, you can gauge this however you want, but I think Mark is missing a very key component of this.\nMark is skeptical of [Bitcoin] because he went to his Mavs stadium down in Dallas, Texas, and he allowed people to purchase seats into the stadium with Bitcoin. I think in a year or after a really long time, since he implemented people being able to pay with Bitcoin, he said he had $600-700 worth of transactions of people buying tickets with Bitcoin to come into the stadium. His argument is, “Well, if no one’s using it, then it’s worthless. You can’t convince me that Bitcoin is going to become a thing if nobody’s using it. They’re not going to the game and paying with it.” He’s like, “People have to pay with it for it to work, right?” Like, that’s Mark’s argument.\nI told Mark, “You’re going to change your opinion on Bitcoin, and this is when you’re going to change it,” I said, “When the price hits $1 trillion in the market cap, and you’re still collecting $600 worth of payments at your games, that’s when you’re going to change your opinion.” That’s 5x higher than we’re at right now, and I don’t suspect that he is ever going to have people paying at his games for Bitcoin. The reason why is because Bitcoin’s not solving a transactional problem. Bitcoin is solving a monetary baseline at a sovereign level problem.\nMy opinion is these countries are still going to continue to have their own domestic currencies. They’re going to tokenize the dollar. They’re already talking about doing that. You’re seeing other countries that are tokenizing. It doesn’t even matter because you have people like Adam Back that have already tokenized the dollar on Liquid, and Tether’s already tokenized the dollar. So, you’re still going to have that because people are always going to pay their taxes in that domestic currency. But you’re not going to have an incentive for anybody to go out there, and spend something that goes up 400% annually. And guess what? That doesn’t mean they’re still not going to buy it and hold it if it goes up 400% annually.\nI have Bitcoin. The last thing I would do is go to a Mavs game and spend my Bitcoin to go into the stadium and watch the game. I’m going to spend my fiat to do that. The stuff that’s devaluing against Bitcoin at 400% a year. I think that’s the thing where a lot of people miss; the utility is that this is not going to be like the fiat that devalues like crazy that we’re accustomed to, as far as holding.\nNow, when you get into the volatility piece of it, I can totally understand why people don’t want to put a substantial portion of their savings into Bitcoin because the volatility is so high. But guess what? Do you know how you manage that risk? You manage that risk through sizing. I don’t have to make Bitcoin 20% of my portfolio. I can make it 1% of my portfolio.\nHere’s a fun fact: If you held Bitcoin for any four year period of time…and the reason I’m using four years is because that’s the halving cycle. You have to understand how the protocol functions from an engineering standpoint to know how to look at it, right? So you could pick any four-year period of time, any chunk of four years. If you had 1% exposure to Bitcoin, and the rest was in cash; $1 in Bitcoin and $99 in cash, you would have matched the performance of the S&P 500, which is not a 400% return over the last 10 years. 1% exposure, right? Let’s say the volatility is 68%, and you had 1% exposure, you don’t even notice it because it’s such a small exposure. But when it goes up 400%, and then the next year, it goes up another…I mean, heck, man! I had one year where it went like 2,000% or 3,000% in a year. It’s insane! So, you adjust your exposure size to account for the volatility in your risk. This is just basic investing stuff.\nRobert Leonard  20:44\nI wonder if Mark Cuban has held on to those $600 or $700 worth of Bitcoin that he has sold?\nPreston Pysh  20:50\nI think I remember seeing somewhere in the exchange where he didn’t, and I guess the company that they were using to accept the transactions was immediately converting it into fiat.\nRobert Leonard  21:02\nSo with all that volatility, should someone wait for a “dip” to buy their 1%?\nPreston Pysh  21:11\nOh, boy! That’s a super hard question because of the volatility. Having owned it for five years, I can tell you, it is one of the hardest things to get that timing. For people that are really interested in this, I would argue that I’ve had a lot of success on the timing of owning Bitcoin; when to sell it; when to buy it. What I’ve used is the Mayer Multiple, which is something that Trace Mayer and I co-created. It basically takes the 200-day moving average, and it looks at the price. It basically divides those two, so you get the units of dollars out of there, and you just have a straight ratio to understand what’s a high price, what’s a normal price, and what’s a low price.\nLet me give you an example. If you take the price at $200, the 200-day moving average is 100. That would be a Mayer Multiple of 2.0, and that would be a pretty normal price to buy Bitcoin. You’re not getting a great deal. You’re not getting a bad deal. It’s just kind of where it’s normally at. It’s a little hot, not hot. $1,400 I think is the average for the price that it trades. Recently, I bought some. The price went down to $6,500, I was able to execute a limit order. That was a Mayor Multiple of about 0.68, which happens 5% or 7% of the time based on when you plot the stats of that. If you do a distribution plot, it’s like 5% or 6% of the time.\nIf you go to mayermultiple.com, it’s a domain that I own, and it goes into the math behind that. It shows the stats, the distribution plot, a histogram, and all sorts of fun stuff. The other thing that I would tell you to look at is really pay close attention to Plan B’s work on the stock-to-flow to understand what the price is. More importantly, understand where you’re at in the four-year cycle.\nSo my personal opinion, right now, is you’re probably at one of the most opportune times to enter a Bitcoin position because I expect to have extremely good price action in the coming two years. If you would have asked me that two years ago…in fact, pull up my Twitter feed from December 2017, and you’ll see me saying owning Bitcoin right now is extremely dangerous and probably not a good idea. I had about a whole month of tweets when the price was $18,000 to $20,000. Go to December 2017, and look at some of my comments. You will see that back then, I was saying this was very risky to be buying it then, because I understood where it was at in the four-year cycle.\nSo understand where you’re at in the four-year cycle before you buy it. Because there’s going to be people that are listening to this conversation two years from now. The price will be $100,000 or more. They’ll be buying it, and they’re going to maybe be on a very bumpy road ahead if the cycle continues to perform the way that it has in the past. I caution people listening two years from now because if the bond market explodes, which is a potential based on the central banking actions, you might see Bitcoin fully become a global currency at that point. It could go to $1 million for all we know.\nSo it’s really hard to make comments about that far in the future based on where we’re at and everything that’s happening.\nRobert Leonard  24:21\nWhat role do non-professional or unsophisticated investors play in the price of Bitcoin, in terms of their rationality, right? So when you talked about the run-up to $18,000 to $20,000, I had people in my life that are friends, family, and acquaintances that knew I was into finance, investing, and things like that, and they were all texting me and telling me that they were running out buying Bitcoin. And so, what’s the role of people that don’t understand it to the degree that you do? How did they either help or hurt the way that you see your models working?\nPreston Pysh  24:56\nI would argue that when you look at the stock-to-flow, and from a technical standpoint, price should go to $100,000. Where they come into play is on the emotional side, so they’re going to blow the price way through $100,000 on the way up. But they’re also the same ones that are going to blow it down through $100,000 after it goes through its correction. And then, by the end of the four-year cycle, it’s going to come back to its appropriate price of $100,000. If I was going to spitball it, yeah, I tell you December of 2021ish. Somewhere around that timeframe, plus or minus 60 to 90 days, is probably where you’re going to see that peak of speculators that don’t know much; that are chasing the price action, they are going to drive the price to probably $200,000 to $250,000 at that point, by December 2021.\nThose same people that buy at those extreme prices are the same ones that unravel it coming back down. Back down through $100,000, and that’s when you really want to buy it because the price during that cycle is all at $100,000 based on stock-to-flow. They just basically make it go more extreme on both sides: on the buying and on the selling. That’s all they do.\nRobert Leonard  26:06\nSo how about government regulation? This is a component that we haven’t even mentioned yet. We’ve assumed that it can just continue to operate without government intervention, but what if the government does try to step in?\nPreston Pysh  26:18\nWe’ve already seen this happen back in 2017. The Chinese government came out, and said, “You can own Bitcoin. You cannot buy it on an exchange.” They banned the exchanges, and the impact in the short term was the price went down, but the impact in the long term was nothing. That’s the tricky part for our government. In order for it to get shut down, every single government has to decide to shut it down; every single government. I would argue that you have a very strong incentive for countries that are not from the US, which is everybody but us, to have something other than dollar dominance, because think about it. Dollar dominance has provided the US an extremely powerful position in the world, and it’s been that way since Bretton Woods.\nLet me say, Germany. Right now, Germany is building so much legal framework around the protection of Bitcoin, because I think they understand where this is all going. I think they understand the value of trying to attract as much of that business into their country; to attract as much Bitcoin into their country when it becomes a new global currency. They have one of the best legal frameworks on the planet right now to promote Bitcoin businesses into their country. I think that’s going to set a precedence for many other countries to do something very similar.\nSo the fact that you already have a country the size of Germany doing something like that, if you go ahead and ban it, you can do that, but I think what you’re going to do is you’re just going to lose your place in line, and now you’re at the back of the line. In the long term, that’s going to be a huge disadvantage for the countries that do it. I would argue China’s a perfect example of something that was done in haste and done in fear. It’s going to be a huge consequence to them long term if they’re not doing something behind the scenes to put as many of these things into their treasury as possible.\nRobert Leonard  28:13\nSo how would a ban work? Say the US government decides to ban Bitcoin? Can people in the US still obtain it in some way? Or is it…? How would that work?\nPreston Pysh  28:24\nAbsolutely, they can! They can VPN out. Through encryption, they can VPN outside of the country. Now, you have to have an exchange in some other country, which, boy, there’s going to be a black market for that real fast. You could VPN to that exchange. You could collect the coins, and then you could run your own full node up through the Blockstream satellite. There are satellites in space right now that are broadcasting the blockchain, whether people believe that; understand that. You can take a satellite to your house. You can connect to the Blockstream satellite that’s orbiting Earth, run your own full node, and conduct transactions. You don’t have to go through an Internet Service Provider hub. They’d have no idea what your IP address is or anything.\nRobert Leonard  29:03\nSo it sounds like it’d be very difficult to even ban on a wide scale, even if they wanted to.\nPreston Pysh  29:09\nAbsolutely! This is for the same reason you can’t ban BitTorrent to this day. It still exists. Bram Cohen, who created BitTorrent, he is a hardcore Bitcoiner.\nRobert Leonard  29:21\nLet’s talk about some of the misconceptions about Bitcoin. What is a misconception surrounding Bitcoin or just cryptocurrencies, in general, that you think a lot of people have? Why is that?\nPreston Pysh  29:33\nI really think a lot of people have a misconception as to what it’s trying to solve. First of all, I think a lot of people are thinking that it’s for a transactional basis. You have a guy, Roger Ver, who I can’t even tell you how much money he lost! And that was one of the forks that we were talking about earlier with Bitcoin Cash. The guy was hell-bent on the idea that this is for transactions of buying coffee. In my humble opinion, he made the most fatal mistake of all, which was trying to make this something that it was not trying to solve whatsoever. This is trying to solve a global peg to global money because there’s an issue where fiat has run amok, you’re driving interest rates to nothing, and you’re about to have an explosion in the bond market.\nRobert Leonard  30:12\nDo you think that that misconception exists because it’s much easier for the general population to understand and wrap their head around it being a transactional currency rather than it being a peg?\nPreston Pysh  30:25\nThink about it. Mark Cuban. Billionaire. Mavs owner. He’s as smart as they come when it comes to business. He’s making that same mistake. He’s making the Roger Ver argument. It’s crazy to me! I mean, when I was having the back and forth with him. I’m literally laughing out loud like, “This dude does not get it. This is blowing my mind that somebody, who made all this money in tech doesn’t get this.” So, I mean, how are your mom and dad going to get it? I mean, come on, give me a break.\nRobert Leonard  30:54\nSo I’d say it’s pretty clear that you’re bullish on Bitcoin, but what would someone on the other side of the argument say? What are the bearish saying about Bitcoin? What are some of the major risks or cons to just cryptocurrencies, in general, and maybe more specifically, Bitcoin?\nPreston Pysh  31:09\nI think a lot of people are going to make the argument about the government banning it. They’re always going to go back to that. You’re going to have people making arguments as to “There are a million of the coins. How do you know Bitcoin’s going to win?” There are a lot of arguments that just keep coming up. It’s funny because I just look at it, like, “Oh my God! We used to hash that out back in 2015 a million times. The fact that you’re bringing this up in 2020 is just kind of funny in a way.” But those are some of the big ones that I can think of just off the top of my head.\nRobert Leonard  31:43\nAdmittedly, those are the two things that I think of initially from someone who doesn’t know a lot about the technology or Bitcoin in general. I’m not pro or con for it. I don’t know enough to have an educated opinion on it, but just from my knowledge, those are the two things that I think about a lot, and things that I’ve heard from people who are skeptical about it as well.\nPreston Pysh  32:03\nThe one other thing that I think is huge is the Cuban argument, which is, “Well, no one’s using it. It’s going to be slower than me just pulling $1 out of my pocket and paying, or swiping my credit card. Why doesn’t that work?” You’re going to hear that argument all day, as well.\nRobert Leonard  32:18\nYeah. I think it comes back to the complexity versus simplicity-type dynamic, where it’s too complex to understand why that’s not necessarily the case, and it’s simpler to just say that that’s why it won’t work.\nPreston Pysh  32:30\nBut this is what people have to think about. Back when you had Bretton Woods, did you see people going to stores and paying with gold? Did you see any of that stuff? No, you didn’t. But that was the root of the entire underlying layer one of the entire financial system globally. It was the balance of payments of the amount of gold that central banks had in their coffers. So if we had a deficit with Germany or vice versa and it needed to be adjudicated in gold, well, it took place in gold. Those balances of payments occurred at that central banking fundamental layer level. All that’s happening right now is that, but it’s happening digitally.\nRobert Leonard  33:07\nSo how does this entire conversation relate back to millennials and their investing? What actionable advice do you have for a new investor who’s just getting started on their investing journey that’s listening to the show today? Should they be allocating a portion of their portfolio to cryptocurrencies? Or are they better off just sticking with the tried and true assets like ETFs and stocks?\nPreston Pysh  33:27\nI think you’re absolutely nuts if you don’t have some exposure to this, my personal opinion. I would highly encourage millennials to get smart on the four-year cycle. Understand where you’re at in that four-year cycle for Bitcoin. Be very hesitant to add to your position, when you’re at the top of that cycle, which I’m saying is probably somewhere around like December of 2021 for the next cycle. Be careful about adding to your position during those times. And when you’re in the bottom or you’re in a very advantageous part of the cycle, you should probably have a much larger percentage inside your portfolio. So like right now, I think is a very advantageous time to be a buyer. This is when I would probably take a larger percentage on your portfolio.\nRobert Leonard  34:10\nSo it’s still an advantageous time even though it’s been up 43%, since January 1, 2020? We’re only on February 13th today as we’re recording this.\nPreston Pysh  34:21\nYeah, I think so. My expectation for the end of the year and the year closeout is a price of $20,000. Why I’m saying that number has a lot of reasons behind it. I’m not just pulling a number out of thin air. That’s my metric. In fact, I posted that on Twitter probably three or four days ago as to what I think is a byline and where I expect it to end by the end of the year. But my estimated price by the end of this year 2020 is going to be around $20,000, which means you could go 100% gain from here.\nRobert Leonard  34:51\nI’m no technical analysis trader by any means, but with the last peak ending around $20,000, is there resistance at that $20,000 number if we do get there again?\nPreston Pysh  35:03\nThere absolutely is. If and when, in my opinion, it penetrates the $20,000, that’s when you start getting your crazy moves to the upside. Yeah, I suspect that you’re going to go from $20,000 to $200,000 in a year. So after you would hit the $20,000, call it, next December, I think, by the following December, you’re going to have literally gone from $20,000 to $200,000.\nRobert Leonard  35:30\nOne of the things I wanted to talk about as well is how this is portrayed on social media. Let’s take Instagram for example. I hear this conversation that you and I are having. This all makes sense. It makes me bullish on Bitcoin. I came into this conversation not knowing much, but now through what we’ve learned and what I’ve learned through you, I feel like it’s a much more legitimate asset that I can be bullish on. But then I think there’s a lot of people that are going to see on Instagram are going to get fraud messages all the time. I get hundreds of them probably a day, saying that they can make you rich with Bitcoin overnight. So how is that going to play into Bitcoin and the legitimacy of it?\nPreston Pysh  36:06\nYou’re endowed with senses that are innate to your protection. That’s how you’re wired. Your genetic DNA that wires that into your brain. From your past experiences, you’ve been conditioned to be aware of scams. When a person hears me say, “Oh, I think it’s going to be $20,000 by December, and then it’s going to be $200,000 the year after that,” their senses are saying, “That is a total flippin’ scam. 100%!” That means you have good senses. So what you have to do is you have to say, “All right, well, how are they coming to that opinion? What’s behind that opinion? What’s driving it?” You have to ask yourself a lot of hard questions, and you have to do an extreme amount of work to understand what’s behind that. Whether it’s true or not.\nI would argue the strongest reason why Bitcoin’s going to be successful is that so many people do not believe this is possible, and they don’t invest. Dude, I can’t even tell you how many hours I’ve invested into trying to understand this. I can’t even put a number to it. But that’s because I was extremely skeptical. But I think what drove me to research it is I understood the fundamental global problem that was happening, and I was searching for how in the world is this going to be resolved because right now, it appears like there’s no solution to this. Lo and behold, I started reading up on Bitcoin. I said,” Oh, my God! I think this could potentially be the solution.” Then, I dug more and I dug more and dug more.\nSo I kind of came to it from a completely different vantage point of your typical person, who comes to it as total speculation to make a quick buck. That’s how a lot of people come to this, and that’s why so many people are skeptical of it. You’re skeptical of something is when you don’t understand it. That’s when you’re skeptical of it. Because you’re saying, “That’s too good to be true! That person looks like a scammer. They sound like a scammer. And they’re promising things that there’s no way is possible.” Scam level of analysis complete. They’re done.\nI would challenge the heck out of everybody to question everything I just said, and to treat me as if I am a scammer because that’s how you’re going to arrive at the truth. If you don’t arrive at the truth as to how this thing works, you will not have the conviction to hold it through wild swings and wild rides. I mean, that’s just a fact from stock investing. If you don’t have conviction behind your trade, you will not hold it, and you will sell when it goes down.\nIf a person goes out there and buys Bitcoin… You had said that you purchased it and then you turned around and sold it. Why did you do that? Well, because you knew you didn’t understand it. And everybody else who’s listening to this is going to do the exact same thing. If they buy it, it goes down 20% in a day, which can happen. They’ll sell the position because, inherently, at their core level, they have no idea what’s actually happening. So when you see these people on Instagram saying, “I’m going to make you rich. Just buy this token and this crypto coin,” well, you’re chasing a narrative that you heard where your neighbor made $1,000 or $10,000, and you’re trying to replicate it based on speculation and hope, opposed to truth and understanding.\nSo, I don’t know if I answered your question well, but I would tell you being skeptical is a good thing. And doing your homework as to how it works is insanely important to not be shaken out of your position if you do decide to take a position. Follow the right resource. Don’t follow some yayhoo, who’s a nobody; who has no experience in financial markets; doesn’t even know what a bond is or know what a stock is. If that person’s telling you what to buy, well, I guess I’m going to say it bluntly. You’re being dumb, right? You’re being dumb. So, do your research on who the person is. Look at what authority they have, how they got that authority, and technically, why they’re making the arguments that they’re making.\nRobert Leonard  40:11\nI’m wondering if a similar tactic that I like to use in the stock market can work with Bitcoin, specifically for people listening to the show, who haven’t studied it like I haven’t. So when there’s a stock, now that there are no commissions on trading, I do this even more. But if there’s a company on my radar, and I’m interested in it, it’s hard for me to find the time to actually analyze that company and determine if I want to buy a position. So, now, I’d buy one or two shares just to get it in my portfolio. I have skin in the game, and now, something psychologically tells me that I need to go take the time and research that company because I have money on the line.\nAnd it really works. It really does. And so, I wonder if somebody listening to the show today that’s interested, but skeptical should maybe buy $10,000, or maybe buy 10% of a coin, or even 5%, and just kind of get some skin in the game, so that you are then invested in it, and then you go and learn about it more, so you feel comfortable. Either sell your position because you decided you don’t believe in the thesis, or you believe in it after you studied it, and you buy more.\nPreston Pysh  41:11\nI think that’s a great way to do it.\nRobert Leonard  41:13\nIf someone listening to the show today is completely new to cryptocurrencies, Bitcoin, and just blockchain in general, like I am, but they want to learn more about these topics, what resources would you recommend they check out? Any specific books for a new investor? I know we’ve mentioned a bunch of different resources so far, and those will definitely go in the show notes, but any specific books or other resources?\nPreston Pysh  41:35\nI think it’s really important who you follow, and who you pay attention to. So you want to pay attention to the engineers that have actually written the code for this stuff and the people that have participated in it, so people like Adam Back is somebody you want to follow on Twitter. Somebody like Nick Szabo is somebody you want to follow on Twitter. There are three podcasts that I would recommend. One is Stephan Livera. He has a podcast. We’ll have it in the show notes. You have another podcast called, Noded, and another one by Trace Mayer that I would highly recommend. I think those three people are total forces in this field for podcasts to listen to.\nThe first book that I read back in 2015 was called, The Age of Cryptocurrency. I thought that was an extremely good book. It was written by Wall Street Journal authors, and there are a couple of other books that I’d recommend. One is called, The Bitcoin Standard. This is written by Saifedean Ammous. That’s an incredible, incredible book that I think is vital for people to read. There’s another book called, The Book of Satoshi, and what it does is it takes all the e-mails and everything that Satoshi ever wrote, and they put it into a book. I would highly recommend that you check that out.\nThere is a website called the Nakamoto Institute that’s run by Michael Goldstein and Pierre Rashard. That’s an incredible resource. I would highly encourage people to read the Bitcoin white paper, which is Satoshi’s very first document that he published that talks about Bitcoin in general. I took a course from Yale University that is completely free. I think it’s on Coursera. That was, oh my god, 65 to 70 hours long that gets into the details of how Bitcoin, from a technical standpoint, works. I would highly recommend that.\nThere’s a guy named Jameson Lopp that has an incredible list of resources that will be way better than everything that I just listed for you that goes into all these details of things. He is an original tributor to the source code as far as updates and things like that to the protocol. So he’s a huge source that you would want to follow on Twitter, as well.\nAll of those things, we will get you links in the show notes, too. And that will get you moving in the right direction. But pay very close attention to the source of people that you follow in this industry because there are so many coins out there and so many scammers that are trying to leverage “Blockchain”, and all these buzzwords. But follow the right people, read the right resources, and I think you’ll be in a good spot.\nRobert Leonard  44:10\nAs Preston mentioned, I’ll definitely put all of the different resources we’ve talked about throughout the show in the show notes, so you guys could go check it out in case you missed any if you couldn’t write it down. So you can definitely go to the show notes and check it out. They will all be there.\nPreston, thanks so much for coming on the show today and talking all about cryptocurrencies and Bitcoin with me and the audience. I know I learned a ton from our conversation, and so I’m sure the audience will too.\nPreston Pysh  44:34\nHey, man! This was a blast. I had so much fun, I lost my voice!\nRobert Leonard  44:38\nSo that’s it, guys. That’s the end of the two-part series about Bitcoin, blockchain, and other cryptocurrencies. I hope you all enjoyed the conversation as much as I did. I had to listen to it a few times but I learned a ton, and I can’t wait to dive into all of the different resources that Preston mentioned throughout the show. You can find all of those resources linked below in the show notes of your favorite podcast player or at theinvestorspodcast.com, and clicking on the Millennial Investing show.\nIf you know anyone that wants to learn more about Bitcoin, blockchain, or cryptocurrencies, please share this completely free two-part series with them.\nAnd I’d love to hear what you thought about this two-part structure. Connect with me on Instagram with my username: @robertattip, and let me know what you thought. Did you like how the episodes were split in two? Would you have preferred one much longer episode? Or do you like the shorter content? Do you even like learning about the topics Preston and I talked about? I truly do love hearing your feedback and connecting with you, guys. I respond to every single comment and DM that I get, so be sure to reach out.\nThat’s all I had for this week’s episode of Millennial Investing. I’ll see you again next week!\nOutro  45:52\nThank you for listening to TIP. To access our show notes, courses, or forums, go to theinvestorspodcast.com This show is for entertainment purposes only. Before making any decisions, consult a professional. This show is copyrighted by The Investor’s Podcast Network. Written permissions must be granted before syndication or rebroadcasting.\nHelp us reach new listeners by leaving us a rating and review on Apple Podcasts! It takes less than 30 seconds and really helps our show grow, which allows us to bring on even better guests for you all! Thank you – we really appreciate it!\nSupport our free podcast by supporting our sponsors:\nCONNECT WITH ROBERT\nCONNECT WITH PRESTON\nCheck out our latest offer for all The Investor’s Podcast Network listeners!\nGet smarter about valuing businesses in just a few minutes each week.\nGet the weekly email that makes understanding intrinsic value easy and enjoyable, for free.\nWe are an exclusive business podcast network which aims to educate people all over the world about how to grow financially and personally.\nWe Study Billionaires Bitcoin Fundamentals Richer, Wiser, Happier The Intrinsic Value Podcast Millennial Investing Real Estate 101 The Good Life Silicon Valley\nTIP Academy TIP Finance Forum Advertising Contact Us\nPrivacy Policy Terms & Conditions Disclaimer Cookie Policy Consent Preferences\nWe are an exclusive business podcast network which aims to educate people all over the world about how to grow financially and personally.\nWe Study Billionaires Bitcoin Fundamentals Richer, Wiser, Happier The Intrinsic Value Podcast Millennial Investing Real Estate 101 The Good Life Silicon Valley\nTIP Academy TIP Finance Advertising Contact Us\nPrivacy Policy Terms & Conditions Disclaimer Cookie Policy\nWe are an exclusive business podcast network which aims to educate people all over the world about how to grow financially and personally.\nJOIN OUR NEWSLETTER:\nSHOWS\nWe Study Billionaires Bitcoin Fundamentals Richer, Wiser, Happier The Intrinsic Value Podcast Millennial Investing Real Estate 101 The Good Life Silicon Valley\nQUICKLINKS\nTIP Academy TIP Finance Forum Advertising Contact Us\nPrivacy Policy Terms & Conditions Disclaimer Cookie Policy\nThe Investor’s Podcast Network © 2025 All Rights Reserved.\nThe Investor’s Podcast Network © 2025\nAll Rights Reserved."]}
