{"date":"2024-06-03","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-06-04","titles":["The Investment Case For Ethereum In 2024 (ETH-USD)"],"urls":["https:\/\/seekingalpha.com\/article\/4697303-ethereum-investment-case-2024"],"sources":["seekingalpha.com"],"descriptions":["Since its release in 2015, Ethereum has grown exponentially, attracting hundreds of millions of users, and gaining the attention of mainstream investment firms ..."],"article_contents":[null]}
{"date":"2024-06-05","titles":["BITO: Wait For End Of Turbulence Before Investing (Rating Downgrade)","Billionaires Are Buying This Cryptocurrency ETF That Could Soar 1,050% to 5,400%, According to Certain Wall Street Analysts"],"urls":["https:\/\/seekingalpha.com\/article\/4697502-bito-wait-for-end-of-turbulence-before-investing-rating-downgrade","https:\/\/finance.yahoo.com\/news\/billionaires-buying-cryptocurrency-etf-could-084400595.html"],"sources":["seekingalpha.com","finance.yahoo.com"],"descriptions":["ProShares Bitcoin Strategy ETF may experience further volatility and it is better to wait for turbulence period to end. Read more to see my analysis on BITO.","Bitcoin more than doubled in value over the past year, but these wealthy hedge fund managers are still bullish on the cryptocurrency."],"article_contents":[null,"Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin (CRYPTO: BTC) rallied 154% over the past year. Several factors made that resurgence possible, including a rotation back to risk assets as recession fears diminished. However, the approval of spot Bitcoin exchange-traded funds (ETFs) certainly contributed to those gains, and they could have a more significant impact in the future.\nTo elaborate, the Securities and Exchange Commission (SEC) approved 11 spot Bitcoin ETFs in January. Some analysts called that decision a watershed moment for cryptocurrency because those ETFs could unlock demand from institutional investors, a group with about $100 trillion in assets under management.\nLo and behold, several hedge fund managers purchased positions in the recently approved iShares Bitcoin Trust (NASDAQ: IBIT) during the first quarter, as detailed below.\nIsrael Englander of Millennium Management purchased 20.9 million shares of the iShares Bitcoin Trust, valued at $844 million on March 31. The ETF ranks as his 12th largest position excluding options contracts.\nSteven Schonfeld of Schonfeld Strategic Advisors purchased 6.1 million shares of the iShares Bitcoin Trust, valued at $752 million. The ETF ranks as his second-largest position excluding options contracts.\nKen Griffin of Citadel Advisors purchased 440,709 shares of the iShares Bitcoin Trust, valued at $17.8 million.\nPaul Singer at Elliot Investment Management purchased 296,010 shares of the iShares Bitcoin Trust, valued at $12 million.\nCertain analysts have made bold predictions in the wake of the SEC's approval of spot Bitcoin ETFs. For instance, Anthony Scaramucci of SkyBridge Capital believes Bitcoin could eclipse the market capitalization of gold. That values the cryptocurrency at roughly $800,000 per coin, implying about 1,050% upside from its current price of $69,000.\nSimilarly, Cathie Wood of Ark Invest believes spot Bitcoin ETFs will eventually capture about 5% of institutional assets under management. That prediction values the cryptocurrency at roughly $3.8 million per coin, implying about 5,400% upside from its current price.\nHere's what investors should know.\nBitcoin's price is ultimately determined by supply and demand. That said, because supply is limited to 21 million coins, demand is the most consequential variable. In other words, Bitcoin's price will increase as demand increases, and its price will decrease as demand decreases.\nThe bull case for spot Bitcoin ETFs is straightforward: They offer direct exposure to Bitcoin but without the friction associated with cryptocurrency exchanges. That value proposition could bring more retail and institutional investors to the market, unlocking demand that drives its price higher.\nTo elaborate, spot Bitcoin ETFs tend to be less expensive than cryptocurrency exchanges. The iShares Bitcoin Trust bears an expense ratio of 0.25%, meaning the annual fees would total $25 for every $10,000 invested in the fund. By comparison, Coinbase charges between 0.4% and 0.6% per transaction for orders under $10,000.\nAdditionally, spot Bitcoin ETFs allow investors to add Bitcoin exposure to existing brokerage accounts. But buying Bitcoin outright involves creating, funding, and maintaining a separate account with a cryptocurrency exchange. That may sound like a small source of friction, but it has likely kept some investors on the sidelines\nIndeed, that theory is corroborated by the extraordinary success certain spot Bitcoin ETFs have enjoyed since their launch. For instance, the iShares Bitcoin Trust and the Wise Origin Bitcoin Fund accumulated more assets during their first 50 trading days than any other ETFs in history, according to Eric Balchunas at Bloomberg.\nEvery spot Bitcoin ETF should do the same thing: Buy Bitcoin, split it into shares, and sell those shares on the stock market. Not surprisingly, investors have gravitated toward the ETFs that offer lower fees, especially those issued by well-known asset managers.\nAs mentioned, BlackRock's iShares Bitcoin Trust and Fidelity's Wise Origin Bitcoin Fund have been very successful. That's because both funds bear a relatively low expense ratio of 0.25%, but also because BlackRock and Fidelity are two of the largest asset managers in the world. Personally, I think investors interested in owning a spot Bitcoin ETF should keep things simple and select between those two funds.\nAs a caveat, there is no guarantee Bitcoin ever reaches Anthony Scaramucci's $800,000 price target, nor is it guaranteed to reach Cathie Wood's $3.8 million price target. Both outcomes are plausible -- I would never be so bold as to say anything was impossible where cryptocurrency is concerned -- but it's also possible that Bitcoin goes to zero. Speculating on the future price is relatively fruitless.\nInstead, investors should focus on facts. Bitcoin outperformed virtually every other asset class over the last five years, including stocks, bonds, commodities, gold, and real estate, according to Ark Invest. That information makes a compelling case for owning Bitcoin (or a spot Bitcoin ETF) but only for investors comfortable with high risk and extreme volatility.\nBefore you buy stock in iShares Bitcoin Trust, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and iShares Bitcoin Trust wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $704,612!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 3, 2024\nTrevor Jennewine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin and Coinbase Global. The Motley Fool has a disclosure policy.\nBillionaires Are Buying This Cryptocurrency ETF That Could Soar 1,050% to 5,400%, According to Certain Wall Street Analysts was originally published by The Motley Fool"]}
{"date":"2024-06-06","titles":["Bitcoin and Other Crypto Assets on the Cusp of ‘Significant Move,’ Says Jason Pizzino – Here’s His Outlook","$1,500,000,000 Liquidation Cascade Waiting for Bitcoin at $72,000, According To Willy Woo"],"urls":["https:\/\/dailyhodl.com\/2024\/06\/06\/bitcoin-and-other-crypto-assets-on-the-cusp-of-significant-move-says-jason-pizzino-heres-his-outlook\/","https:\/\/dailyhodl.com\/2024\/06\/06\/1500000000-liquidation-cascade-waiting-for-bitcoin-at-72000-according-to-willy-woo\/"],"sources":["dailyhodl.com","dailyhodl.com"],"descriptions":["Cryptocurrency analyst and trader Jason Pizzino is offering his thoughts on the potential trajectory for the digital asset market going forward.","On-chain analyst Willy Woo says there's a"],"article_contents":["Cryptocurrency analyst and trader Jason Pizzino is offering his thoughts on the potential trajectory for the digital asset market going forward.\nPizzino tells his 328,000 YouTube subscribers that the Average True Range indicator is suggesting that “another significant move” is imminent for Bitcoin (BTC) and other crypto assets.\nThe ATR is used to measure the volatility of an asset with higher values indicating higher volatility and lower values indicating lower volatility.\nAccording to Pizzino, Bitcoin recently witnessed a relatively small range and this could portend a bullish move ahead.\n“Basically, we’ve seen one of the smallest days since January. So Bitcoin did a $500 range day on the weekend on Saturday… typically when this happens, you see some sort of windup period… you can see in each of these occasions you will see a pretty significant move to the upside.”\nThe widely followed analyst says that Bitcoin is “still looking relatively good” and is well-placed for the “next leg to start”. According to Pizzino, Bitcoin needs to first undergo a consolidation phase before it can rise above the all-time high of $73,800 reached on March 14th.\n“Does not mean that we’re going to blow up in a matter of days or weeks. But I think we could still take a bit of time here. Bitcoin’s price has got to consolidate above $72,000.”\nBitcoin is trading at $70,984 at time of writing.\nTurning to altcoins, Pizzino says that the combined market cap of this class of crypto assets is currently in a phase similar to other periods that preceded a breakout.\n“I see this as a stealth move for the altcoins. And the stronger ones are going to get the gains when this breaks out. So the theory here is we’re in stealth – the stealth is identified here with small average true ranges of the bars.”\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","On-chain analyst Willy Woo says there’s a “cascade” of liquidation that’s primed to begin when Bitcoin (BTC) hits $72,000.\nWoon tells his 1.1 million followers on the social media platform X that $1.5 billion worth of short positions are “ready to be liquidated all the way up to $75,000 and a new all-time high.”\nWoo also looks at the Bitcoin Macro Oscillator (BMO), which is a composite of four signals: the Market Value to Realized Value (MVRV) indicator, volume-weighted average price (VWAP) ratio, cumulative value-days destroyed (CVDD) and the Sharpe Ratio.\nMVRV is the ratio of Bitcoin’s market capitalization relative to its realized capitalization (the value of all BTC at the price they were bought at) and is used to assess whether the crypto asset is undervalued or overvalued.\nVWAP represents the average traded price of an asset throughout the day, taking into account both volume and price. Traders use the VWAP to help them determine whether an asset is trading underbought or overbought based on its intraday price action.\nThe coin days destroyed metric looks at the value of each Bitcoin transaction while giving weight to the number of days since the coins were last moved. The CVDD tracks the cumulative sum of the coin days destroyed metric as a ratio to the market age.\nThe Sharpe Ratio aims to compare the return of an investment with its risk by dividing a portfolio’s excess returns by a measure of its volatility.\nExplains Woo,\n“This 2.5 months of consolidation under bullish demand has been very good for Bitcoin, it means price has more room to run before topping out.\nChart: BMO moves 1 level down, now has 2-3 levels to climb before a macro market top.”\nBTC is trading at $71,121 at time of writing.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-06-07","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-06-10","titles":["Ether 2030 Price Target And Optimal Portfolio Allocations (undefined:BTC-USD)"],"urls":["https:\/\/seekingalpha.com\/article\/4698378-ether-2030-price-target-and-optimal-portfolio-allocations"],"sources":["seekingalpha.com"],"descriptions":["bizoo_nBy Matthew Sigel, Patrick Bush, Denis Zinoviev We estimate ETH's price to hit $22k by 2030 in our updated base case scenario and explore optimal BTC...."],"article_contents":[null]}
{"date":"2024-06-11","titles":["Trader That Called May 2021 Crypto Collapse Updates Bitcoin Outlook, Says BTC ‘Still on Track’ for Bull Market","5.6 Million Brits Invested in Crypto – Why 47% Chose Bitcoin","Top 5 Crypto-Focused ETFs"],"urls":["https:\/\/dailyhodl.com\/2024\/06\/11\/trader-that-called-may-2021-crypto-collapse-updates-bitcoin-outlook-says-btc-still-on-track-for-bull-market\/","https:\/\/www.thelondoneconomic.com\/prices-markets\/5-6-million-brits-invested-in-crypto-why-47-chose-bitcoin-376721\/","https:\/\/seekingalpha.com\/article\/4698520-top-5-crypto-focused-etfs-sa-quant"],"sources":["dailyhodl.com","thelondoneconomic.com","seekingalpha.com"],"descriptions":["A trader known for several accurate crypto market calls says that Bitcoin (BTC) remains in a bullish market trend.","More Brits have invested in Bitcoin than other cryptocurrencies in 2024. Read on to understand BTC’s increasing appeal among crypto enthusiasts in the UK","Cryptocurrencies like Bitcoin and Ethereum exploded in the past 1Y. Investors can gain exposure through 5 Strong Buy crypto-focused ETFs. Read an analysis here."],"article_contents":["A trader known for several accurate crypto market calls says that Bitcoin (BTC) remains in a bullish market trend.\nPseudonymous analyst Dave the Wave tells his 146,500 followers on the social media platform X that as long as Bitcoin remains above an ascending diagonal level, the crypto king is still poised to print fresh all-time highs (ATHs).\n“BTC still on track.”\nThe analyst says that Bitcoin could still fall lower than its current value and remain in an uptrend provided that it stays above a diagonal support that has kept BTC bullish since October 2023.\n“Plenty of wiggle room for BTC price yet. Dashed diagonal line the weightier one here.”\nThe analyst also predicts a market top for Bitcoin in December 2025 by using his version of the logarithmic growth channel (LGC) curve, which aims to predict Bitcoin’s longer-term cycle lows and highs while filtering out shorter-term volatility.\n“If you subscribe to the BTC four-year cycle theory, then it may not help you much with the top (again). However, if you subscribe to the LGC theory, it may once again be useful.”\nLooking at his chart, the analyst suggests Bitcoin could hit the top of the LGC model and soar above $300,000 at the end of 2025.\nBitcoin is trading for $68,654 at time of writing, down slightly in the last 24 hours.\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","Bitcoin (BTC) needs no introduction among crypto traders and investors. It is the world’s largest cryptocurrency by market capitalisation and trading volume. However, what you probably didn’t know is how really popular Bitcoin is among British investors.\nAccording to reports, 11% of Britons (equivalent to 5.6 million adults) had invested in crypto as of 2024. Interestingly, about 47%, or nearly half of the number, invested in Bitcoin rather than other assets. That means both retail and institutional investors in the UK consider BTC a viable investment option. This guide explains why Brits fancy Bitcoin over its competitors.\nAs stated above, BTC is the most popular coin in the UK. Despite the country’s growing crypto adoption, the few who invest in cryptocurrencies stick with BTC over Ethereum (with 33% of investors) and Dogecoin (with 21% of investors). Below are the reasons nearly half of the British investors have Bitcoin as their top crypto investment.\nOnline gambling has taken a new turn due to the adoption of Bitcoin in the iGaming space. Today, online casinos and sportsbooks accept cryptocurrency deposits and withdrawals, making it possible for players to wager on their favourite games using Bitcoin and other assets.\nMoreover, these crypto casinos facilitate fast, secure, and convenient payments, making them more desirable to the average Brit gambler than regular casinos that accept conventional payment methods.\nBitcoin was the first cryptocurrency created. Since it began trading in 2009, it has paved the way for altcoins like Ethereum, Solana, Ripple, etc. Due to its popularity and demand among investors globally, there has been an increased interest in the coin among retail investors.\nMoreover, the increasing institutional investments in Bitcoin have made it more scarce and increased its demand. For instance, MicroStrategy owns 214,246 BTC tokens as of May 2024, which is about 1% of all Bitcoins in circulation.\nAnother reason for the growing popularity of Bitcoin among UK investors is its broader adoption as a means of payment. More merchants and businesses are accepting crypto payments for goods and services, and BTC also dominates that space.\nFor instance, you can pay for a cup of coffee or a game ticket with Bitcoin, provided the service providers support crypto payments. As more businesses include BTC in their checkout options on mobile apps and websites, the demand for BTC as a payment option has surged.\nThough cryptocurrency prices are volatile, market swings can be positive. When a bull run occurs, coin prices typically increase significantly, resulting in better profitability for investors.\nFor instance, in December 2023, the Bitcoin price increased by 50% because the market was anticipating the approval of spot Bitcoin Exchange-Traded Funds (ETFs) by the US Securities and Exchange Commission (SEC).\nAfter its approval, the coin attained a new all-time high of over $75,000 in March 2024. Early investors would have locked in significant gains. The possibility of profiting from upward market trends and positive market movements makes Bitcoin a top choice among long-term and short-term investors.\nThe economic challenges in the UK and the rest of the world have also contributed to the rise of Bitcoin investing in the country. At a time of interest rate hikes, high unemployment rate, and increased inflation, many Brits seek Bitcoin as an alternative store of value to gold and real estate.\nDespite its numerous benefits as a store of value and a potentially profitable investment, here are some downsides to consider before investing in Bitcoin.\n●  Market Volatility: The crypto market is highly volatile, making Bitcoin a risky investment. The coin’s price can rise or fall sharply within minutes, potentially resulting in loss of value or profits.\n●  Potential Fraud: With crypto scams on the rise, cryptocurrency users are susceptible to hacks, phishing attacks, and fraud. For example, you may invest in a Bitcoin scheme and lose all your funds. You can also lose access to your coins if a malicious actor successfully takes over your crypto exchange account or digital wallet.\n●  Regulatory Uncertainty: There are still unclear regulations around the use of cryptocurrencies in the UK. However, this has slowly changed with the introduction of the Cryptoasset Promotion (Regulation) Order 2021, which regulates the advertisement of certain assets to crypto customers in the UK.\n●  Low Interest: Despite the evident increase in the demand for cryptos, a significant number of Brits are uninterested in investing soon. Many people haven’t invested in any digital asset because they believe it’s a scam, and several others are sceptical about cryptocurrencies due to their risky nature.\nThough cryptocurrency is still unregulated in the UK, the country has specific laws that crypto businesses must adhere to. For instance, the Financial Conduct Authority (FCA) states that crypto firms in the UK are not under their anti-money laundering laws and do not have to register to operate.\nHowever, crypto marketing is regulated, and companies must get their marketing initiatives approved by the FCA or another authorised entity.\nAt the same time, there are tax laws regarding crypto investments. Your crypto income may attract capital gains tax between 10% and 20% if it is more than £6,000. Ensure you understand the legal aspect of crypto investing as stipulated by the government before investing.\nIf you have decided to invest in Bitcoin, the easiest way to purchase the asset in the UK is through a crypto exchange. Follow the steps below to get started.\n●  Create a trading account with a reputable exchange\n●  Complete KYC\n●  Deposit funds using the available payment options\n●  Buy BTC\nFor additional security, you can store your BTC in a secure self-custodial wallet. Research the various hot and cold wallets on the market and choose the one that best suits your needs.\nBitcoin has reached new highs in 2024, valued as high as $75,000 in April. Still, some experts believe the coin hasn’t peaked yet and predict its value will increase if the blockchain continues to grow and gain more adoption in the digital payments sector.\nAt the same time, some quarters are making bearish predictions, with analysts saying that the coin’s short-term sell pressure and potential security issues could negatively impact its price. Moreover, unfavourable regulations and public criticisms of Bitcoin could also swing its market sentiment and decrease its value.\nSo, while you’re optimistic about BTC, have an investment strategy that mitigates risks and stay updated with market trends to determine the best time to enter or exit the market.\nThe average UK crypto enthusiast is more interested in Bitcoin than any other asset due to its popularity and potential. Besides being a leading crypto asset, the coin is also at the forefront of digital payments and online gaming.\nHowever, despite its potential, every investment is risky – and Bitcoin is no exception. Factors like volatility, regulation, environmental criticisms, and security issues can negatively affect the coin’s value and growth. Thoroughly assess your risk tolerance and take a strategic investment approach before investing in Bitcoin.\nTheLondonEconomic.com – Open, accessible and accountable news, sport, culture and lifestyle.\r Read more\nWe do not charge or put articles behind a paywall. If you can, please show your appreciation for our free content by donating whatever you think is fair to help keep TLE growing and support real, independent, investigative journalism.\nEditorial enquiries, please contact: [email protected]\nCommercial enquiries, please contact: [email protected]\n© The London Economic Newspaper Limited t\/a TLE thelondoneconomic.com - All Rights Reserved. Privacy\n© The London Economic Newspaper Limited t\/a TLE thelondoneconomic.com - All Rights Reserved. Privacy\n© The London Economic Newspaper Limited t\/a TLE thelondoneconomic.com - All Rights Reserved. Privacy",null]}
{"date":"2024-06-12","titles":["Can Bitcoin reach $100,000 mark in 2024? Here's what experts say"],"urls":["https:\/\/economictimes.indiatimes.com\/markets\/cryptocurrency\/can-bitcoin-reach-100000-mark-in-2024-heres-what-experts-say\/articleshow\/110941579.cms"],"sources":["economictimes.indiatimes.com"],"descriptions":["Bitcoin, which has been synonymous with volatility,  has experienced dramatic price movements since its inception in 2009, reaching highs of $73,000 by 2024. Am..."],"article_contents":["Did you Know?\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors.\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\nHow Gensol crashed Indian cab rider’s blue darling\nHDFC Bank vs. ICICI: Which should be your value bet?\nHow IPL franchises play the profit and power game in cricket's billion-dollar battle\nIndia has a major health insurance headache\nStock Radar: Why is Bharti Airtel stock looking attractive on charts; trading above 200-DMA\nVolatility is integral to the market, take advantage of it: 6 mid-caps from different sectors with an upside potential of up to 47%\nWorry not. You’re just a step away.\nIt seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account  and log in again using your ET Prime credentials  to enjoy all member benefits.\nOffer Exclusively For You\nSave up to Rs. 700\/-\nON ET PRIME MEMBERSHIP\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet Flat 40% Off\nThen  ₹ 1749 for 1 year\nOffer Exclusively For You\nET Prime at ₹ 49 for 1 month\nThen  ₹ 1749 for 1 year\nSpecial Offer\nGet flat 40% off on ETPrime\n90 Days Prime access worth Rs999 unlocked for you\nStories you might be interested in"]}
{"date":"2024-06-13","titles":["Legendary Trader John Bollinger Breaks Silence on Bitcoin Price By U.Today","Crypto Market Guide: Bitcoin and Ethereum Lead the Market - Can Furrever Token Join the Ranks with its Referral Bonus?","Bitcoin (BTC)'s Fed-Induced Dip vs. Solana (SOL)'s Surge: How Furrever Token Can Benefit with Its Referral System"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/legendary-trader-john-bollinger-breaks-silence-on-bitcoin-price-3482923","https:\/\/www.globenewswire.com\/news-release\/2024\/06\/13\/2898161\/0\/en\/Crypto-Market-Guide-Bitcoin-and-Ethereum-Lead-the-Market-Can-Furrever-Token-Join-the-Ranks-with-its-Referral-Bonus.html","https:\/\/www.globenewswire.com\/news-release\/2024\/06\/13\/2898427\/0\/en\/Bitcoin-BTC-s-Fed-Induced-Dip-vs-Solana-SOL-s-Surge-How-Furrever-Token-Can-Benefit-with-Its-Referral-System.html"],"sources":["investing.com","globenewswire.com","globenewswire.com"],"descriptions":["Legendary Trader John Bollinger Breaks Silence on Bitcoin Price","New York City, NY , June  13, 2024  (GLOBE NEWSWIRE) --   The  cryptocurrency market continues to evolve, with Bitcoin and Ethereum  maintaining their...","New York City, NY, June  13, 2024  (GLOBE NEWSWIRE) --   The  cryptocurrency market is currently experiencing notable fluctuations,  with Bitcoin and..."],"article_contents":[null,"June 13, 2024 07:01 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nNew York City, NY , June  13, 2024  (GLOBE NEWSWIRE) --\nThe  cryptocurrency market continues to evolve, with Bitcoin and Ethereum  maintaining their positions as the leading digital assets. These two  giants have set the benchmark for innovation, adoption, and market  performance. However, a new contender, Furrever Token,  is making waves with its unique appeal and innovative referral bonus  system. This guide explores how Furrever Token could potentially join  the ranks of Bitcoin and Ethereum and what makes it a compelling  investment opportunity.\nBitcoin: The Pioneer of Cryptocurrencies\nBitcoin  (BTC) remains the most well-known and valuable cryptocurrency. Launched  in 2009 by an anonymous figure known as Satoshi Nakamoto, Bitcoin  introduced the world to the concept of decentralized digital currency.  Over the years, Bitcoin has experienced significant price fluctuations,  but it has consistently maintained its position as the market leader.  Recently, Bitcoin faced a dip in its price following the Federal  Reserve's decision to keep interest rates unchanged, currently trading  around $42,590. Despite this volatility, Bitcoin's long-term potential  and widespread adoption continue to attract investors.\nEthereum: The King of Smart Contracts\nEthereum  (ETH), launched in 2015 by Vitalik Buterin, has revolutionized the  crypto space with its smart contract functionality. Ethereum allows  developers to build decentralized applications (dApps) on its  blockchain, making it the backbone of numerous blockchain projects.  Ethereum’s price has shown resilience, currently on a bullish trend with  predictions of reaching significant price targets in the near future.  The network’s continuous upgrades and its pivotal role in decentralized  finance (DeFi) and non-fungible tokens (NFTs) reinforce its strong  market position.\nEnter Furrever Token: The New Contender\nAmidst  the dominance of Bitcoin and Ethereum, Furrever Token (FURR) is  emerging as a promising new player in the crypto market. Designed to  bring a whimsical and heartwarming touch to the digital currency space,  Furrever Token features adorable cat-themed imagery and a strong focus  on community engagement.\nInnovative Referral Bonus System\nOne  of the standout features of Furrever Token is its innovative referral  bonus system. This system allows users to earn 10% in FURR tokens for  every deposit made through their personal referral links. This not only  incentivizes early adoption but also fosters strong community growth.  The referral system is a unique strategy that leverages the power of  community engagement to drive the token’s growth and adoption.\nStrong Financial Potential\nFurrever  Token offers substantial financial potential, promising up to 15X  returns for early investors. Currently priced at just $0.000732,  Furrever Token is in Stage 9 of its presale, having already raised over  $1.3 million, with a target of $1.9 million before its launch on  PancakeSwap. This attractive entry point, combined with its innovative  features, positions Furrever Token as a noteworthy investment  opportunity.\nSecurity and Compliance\nSecurity and  compliance are top priorities for Furrever Token. The project has  undergone rigorous audits by Securi Lab to ensure a safe and reliable  investment environment. Additionally, the team has committed to locking  their tokens for one year, providing reassurance to the community about  the project’s longevity and stability.\nCan Furrever Token Join the Ranks of Bitcoin and Ethereum?\nWhile  Bitcoin and Ethereum continue to lead the market with their established  presence and robust infrastructures, Furrever Token presents a fresh  and unique opportunity. Its innovative referral bonus system, strong  financial potential, and focus on community engagement set it apart from  many other cryptocurrencies.\nAs the crypto market evolves, the  potential for new players like Furrever Token to join the ranks of  established giants like Bitcoin and Ethereum grows. Investors looking  for new opportunities in the meme coin space should consider the  promising prospects of Furrever Token.\nThe Takeaway\nBitcoin  and Ethereum have solidified their positions as the top  cryptocurrencies, but the market is always open to innovative new  players. Furrever Token, with its unique appeal and innovative referral  system, is well-positioned to capture the attention of investors and  potentially join the ranks of these market leaders. Don’t miss out on  the chance to be part of this exciting new project. Visit  furrevertoken.com to learn more and participate in the presale. Use your  referral code to earn additional FURR tokens and contribute to the  growth of this vibrant community. Act now before the opportunity passes  by, and be a part of the next big thing in the crypto market!Join Furrever Token Presale Now: Furrever Token Official Website    Visit Furrever Token Presale   Join Official Telegram Group Follow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support@furrevertoken.comDisclaimer:  The information provided in this press release is not a solicitation  for investment, nor is it intended as investment advice, financial  advice, or trading advice. It is strongly recommended you practice due  diligence, including consultation with a professional financial advisor,  before investing in or trading cryptocurrency and securities.","June 13, 2024 10:30 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nNew York City, NY, June  13, 2024  (GLOBE NEWSWIRE) --\nThe  cryptocurrency market is currently experiencing notable fluctuations,  with Bitcoin and Solana showcasing contrasting trends. Bitcoin recently  saw a 2.5% decline following the Federal Reserve's decision to keep  interest rates unchanged, disappointing many who were anticipating a  rate cut. This has caused a cautious sentiment among investors, with  Bitcoin now trading around $42,590.\nBitcoin's Fed-Induced Dip\nBitcoin  experienced a significant dip after the Federal Reserve's recent  decision to maintain interest rates, dashing hopes for a rate cut. The  Fed's stance on maintaining rates between 5.25% and 5.50% has created a  cautious atmosphere among investors. As a result, Bitcoin’s price fell  by 2.5%, currently trading at $42,590. Analysts predict further  volatility as the market reacts to these developments.\nSolana’s Steady Climb\nConversely,  Solana has been on an upward trajectory. A 7% increase has pushed  Solana’s price to $160, bolstered by favorable responses to recent U.S.  CPI data. The cryptocurrency has formed a symmetrical triangle pattern  over the past few months, indicating potential for significant price  movements. With a surge in network activity, new addresses on the Solana  network have increased by 33.8%, signaling growing adoption and  interest. Analysts predict that Solana could reach $210 and possibly  $310 if it breaks through its current resistance levels.\nFurrever Token’s Unique Value Proposition\nAmid these market dynamics, Furrever Token (FURR)  is emerging as a promising player with its unique value proposition.  Furrever Token is designed to add a whimsical touch to the crypto space,  featuring adorable cat-themed stickers and visuals. Despite its playful  appeal, Furrever Token promises serious returns, with potential gains  of up to 15X. The token is currently in Stage 9 of its presale, having  already raised over $1.3 million, with a target of $1.9 million before  its launch on PancakeSwap. At a current price of $0.000732, Furrever  Token presents an attractive entry point for investors.\nLeveraging Furrever Token’s Referral System\nOne  of the standout features of Furrever Token is its innovative referral  system. Users can earn 10% in FURR tokens for every deposit made through  their personal referral links, encouraging community growth and  rewarding early adopters. This referral system not only incentivizes  participation but also fosters a sense of community among investors.\nEnsuring Security and Compliance\nSecurity  and compliance are top priorities for Furrever Token. The project has  undergone audits by Securi Lab to ensure a safe and reliable investment  environment. Additionally, the team has committed to locking their  tokens for one year, providing reassurance to the community about the  project’s longevity and stability.\nThe Takeaway\nAs Bitcoin  contends with the volatility sparked by the Federal Reserve's recent  decisions and Solana enjoys a steady ascent, Furrever Token stands out  as a unique investment opportunity. By leveraging its innovative  referral system and potential for high returns, Furrever Token offers  investors a compelling addition to their portfolios. Don't miss the  chance to join this promising project. Visit furrevertoken.com to learn  more and participate in the presale. Use your referral code to earn  additional FURR tokens and contribute to the growth of this exciting new  community. Act now before the opportunity passes by! Join Furrever Token Presale Now:  Furrever Token Official Website    Visit Furrever Token Presale   Join Official Telegram Group   Follow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support@furrevertoken.comDisclaimer:  The information provided in this press release is not a solicitation  for investment, nor is it intended as investment advice, financial  advice, or trading advice. It is strongly recommended you practice due  diligence, including consultation with a professional financial advisor,  before investing in or trading cryptocurrency and securities."]}
{"date":"2024-06-14","titles":["BTCO: Streamlining Bitcoin Investments (BATS:BTCO)"],"urls":["https:\/\/seekingalpha.com\/article\/4699318-btco-streamlining-bitcoin-investments"],"sources":["seekingalpha.com"],"descriptions":["Invesco Galaxy Bitcoin ETF offers convenient access, cost efficiency, and transparency for investors and has recently reduced its fees. Read more on BTCO here."],"article_contents":[null]}
{"date":"2024-06-17","titles":["Cryptocurrency Market News: Bitcoin Creeps Up But Still Under $70K","May BFG Token Grow by 100%? | The Best Ways to Earn BFG on Its Rise"],"urls":["https:\/\/www.investopedia.com\/crypcryptocurrency-market-news-bitcoin-creeps-up-but-still-under-usd70k-8664175","https:\/\/www.globenewswire.com\/news-release\/2024\/06\/17\/2899834\/0\/en\/May-BFG-Token-Grow-by-100-The-Best-Ways-to-Earn-BFG-on-Its-Rise.html"],"sources":["investopedia.com","globenewswire.com"],"descriptions":["Bitcoin didn't quite rebound with enough fervor after sliding ahead of last week's inflation and Federal Reserve news, but it is having a moment on the campaign...","Willemstad, Curacao, June  17, 2024  (GLOBE NEWSWIRE) --   The number of BFG investors has remarkably increased due to its tokenomics update and..."],"article_contents":["Chesnot \/ Getty Images\nThe past week has been a wild ride for the price bitcoin (BTC).\nThe price of bitcoin fell below $67,000 on Tuesday ahead of May inflation data and the Federal Reserve's meeting. Bitcoin regained some ground on Wednesday before tumbling again on Friday. While other risk assets such as stocks bounced back on cooler-than-expected inflation data, bitcoin failed to claw back the losses.\nDespite bitcoin's performance last week, crypto is having a moment on the U.S. presidential election campaign trail. Presumptive Republican nominee Donald Trump met with bitcoin miners last week and a leaked email showed members of President Joe Biden's adminstration will meet with members of the crypto community.\nElsewhere, Terraform Labs has agreed to a massive $4.5 billion settlement with the U.S. Securities and Exchange Commission (SEC) regarding the TerraUSD stablecoin disaster from 2022, and an investigative report concluded that Binance founder and former CEO Changpeng \"CZ\" Zhao is one of the top 25 richest people in the world.\nFormer President Donald Trump has shifted his stance on cryptocurrencies during the current election cycle, now actively courting the crypto community to gain an edge over rivals Joe Biden and Robert F. Kennedy Jr.\nAfter meeting with bitcoin miners at his Mar-a-Lago estate, Trump urged cryptocurrency enthusiasts on his Truth Social platform to \"vote for Trump,\" positioning himself as a defender against what he calls \"Biden's hatred of Bitcoin.\"\nThis new approach follows Trump's previous strong criticism of cryptocurrencies during his presidency, where he labeled them as highly volatile and unregulated assets that facilitate illegal activities. Now, however, Trump's campaign has announced plans to accept cryptocurrency donations, aiming to mobilize a \"crypto army\" to secure his election victory.\nOn the other side of the aisle, the Biden Administration's approach to Bitcoin and crypto has come under fire, especially with a recent veto on legislation supporting crypto custody by financial institutions and proposed taxes on Bitcoin mining. According to a report in The Block, Biden is also expected to start accepting campaign contributions via crypto.\nPeople in Biden's camp will reportedly be attending a Bitcoin and blockchain roundtable next month, according to Bitcoin Magazine.\nLast Wednesday, a court filing revealed that Terraform Labs consented to a nearly $4.5 billion settlement to resolve a lawsuit from the SEC. The filing requested court approval for the settlement, which would put an end to a legal battle over the company's role in the dramatic failure of TerraUSD in May 2022 that led to an estimated $40 billion loss for investors.\nThe settlement comprises roughly $3.5 billion in disgorgement, over $460 million in prejudgment interest, and $420 million as a civil penalty. Former CEO Do Kwon will also personally contribute over $200 million to the Terraform bankruptcy estate and is barred from serving as an officer or director of a public company.\nThis agreement, originally reached ahead of a May 29 hearing, aims to impose substantial financial remedies and facilitate swift recovery for investors. The SEC highlighted that these penalties are intended to deter future fraudulent activities in the cryptocurrency market. Terraform Labs declared bankruptcy earlier this year, just before its trial with the SEC, where it was found guilty of defrauding investors.\nSince his imprisonment, Binance founder Changpeng \"CZ\" Zhao has seen a significant increase in his net worth.\nForbes now estimates Zhao’s fortune is $61 billion, making him the world's 24th richest person.\nThis rise comes from his 90% stake in Binance, valued at $33 billion. Zhao stepped down as CEO of the company in November 2023 as a result of a plea deal with the U.S. Department of Justice. Despite the company's legal challenges and a $4.3 billion fine, Zhao's personal financial impact was limited to a $50 million fine. Since then, Binance has continued to grow, with its market share rising to 42% from 38% before Zhao's departure.\nA major boost to Zhao’s wealth comes from his holdings in Binance Coin (BNB). Forbes estimates he owns around 94 million tokens, which is 64% of all BNB tokens. Despite Binance’s legal troubles, BNB has surged by 100% in 2024, reaching a market cap of $110 billion.\nBinance’s initial coin offering in 2017 was undersubscribed, and forensic analysis indicates Zhao and Binance retained a significant portion of the unsold tokens. Currently, BNB trades heavily on Binance’s platform, and the token's performance has continued to add billions to Zhao’s net worth, even as he serves his sentence.\nAll eyes are on the bitcoin price this week, as digital asset investment products, which include U.S.-based bitcoin ETFs, experienced more than $600 million in outflows amidst bitcoin's price drop last week, according to CoinShares.\nDespite the price drop, the notorious bitcoin bulls at MicroStrategy (MSTR) announced another $500 million convertible note offering for the purpose of purchasing more bitcoin before updating the offering to $700 million later in the week.\nWhile bitcoin has traded in a relatively narrow range this month, the crypto asset has been outperformed by several bitcoin mining stocks, as noted by a JPMorgan report. This is thought to be a response to Core Scientific's (CORZ) deal with CoreWeave related to artificial intelligence.\nThe SEC's approval of spot ether ETFs also now appears to be an issue of \"when\" rather than \"if.\" SEC Chair Gary Gensler indicated in a Senate hearing last week that the matter will be resolved over the summer. Additionally, Bloomberg analyst Eric Balchunas gives a 50-50 chance that the approval will take place by July 2. Prediction market Polymarket puts chances of a spot ether ETF trading by July 4 at 75%.\nCNBC. \"Bitcoin miners at Donald Trump’s closed-door event say he thinks bitcoin can help win AI arms race.\"\nX. \"@realDonaldTrump, 8:15 PM, Jul 11, 2019.\"\nThe Block. \"Biden campaign in talks to accept crypto donations through Coinbase Commerce: sources.\"\nBitcoin Magazine. \"BIDEN ADMIN TO ATTEND BITCOIN ROUNDTABLE WITH KEY CONGRESSIONAL OFFICIALS IN DC.\"\nForbes. \"How Crypto’s Richest Billionaire Doubled His Net Worth Behind Bars.\"\nCoinShares. \"Volume 187: Digital Asset Fund Flows Weekly Report.\"\nMicroStrategy. \"MicroStrategy Announces Pricing of Offering of Convertible Senior Notes.\"\nCoinDesk. \"U.S.-Listed Bitcoin Miners Reached Record Total Market Cap of $22.8B in June: JPMorgan.\"\nX. \"@EricBalchunas, 5:15 PM, Jun 14, 2024.\"\nPolymarket. \"Ethereum ETF begins trading by July 4?.\"\nStore and\/or access information on a device. Use limited data to select advertising. Create profiles for personalised advertising. Use profiles to select personalised advertising. Create profiles to personalise content. Use profiles to select personalised content. Measure advertising performance. Measure content performance. Understand audiences through statistics or combinations of data from different sources. Develop and improve services. Use limited data to select content.","June 17, 2024 11:00 ET\n\n\n | Source:\r\n            \nBetFury\n\n\n\n\n\nBetFury\nWillemstad, Curacao, June  17, 2024  (GLOBE NEWSWIRE) --\nThe number of BFG investors has remarkably increased due to its tokenomics update and deflationary mechanism with regular buybacks. While thousands of tokens compete for users' attention, the BFG token has already caught your eye. How about learning more about BFG's 100% pump, $20M Cryptodrop, and unique utilities for holders?\nWhat's a BFG Token?\nBFG is more than just the native token of an iGaming platform; it’s the cornerstone of the high-trust BetFury ecosystem. This unique cryptocurrency continually rewards its holders with exclusive offers. The token was launched on the Binance Smart Chain network and listed on the leading exchanges. Here, you can see the actual BFG exchange rate:\nBFG has low volatility and has risen by over 60% during the last month, according to CoinMarketCap statistics. Moreover, the BetFury team pays maximum attention to the growth of BFG in the market. They have locked 1B of the team’s tokens for 4.8 years in the BFG Staking Pool to show confidence in their product and token.\nThe Past of BFG: What Does History Tell Us?\nThe past always has consequences. Therefore, it is crucial to dig deeper and understand the origins of a project. BFG was created with the primary goals of platform profit sharing and providing passive earnings for its holders. Initially, users mined it by playing platform games. As the product developed, partnerships increased, providing additional utilities for the token and enhancing users’ income. In the summer of 2023, when BFG mining ended, the token became a resource with a limited supply. Monthly burnings and multiple events have contributed to the current rise in BFG's value.\n7 Main Factors Driving BFG Upwards\nBFG Price Prediction for 2024-2033 | Technical Analysis\nAccording to the Cryptopolitan forecast, the average BFG trading price in 2024 will be $0.029 per token. At the same time, it may reach a peak of $0.038. Based on historical cycles and the above facts, the trust resource also determined possible BFG prices for 2025-2033:\nFor subsequent years, Cryptopolitan determined a constant increase in the BFG to a value of $0.42 in 2033. Thus, a 100% growth in BFG is more than possible.\nBest Ways to Earn BFG | Have you Heard of a $20M BFG Cryptodrop?\nConclusion\nBFG is a valuable asset for investors and crypto enthusiasts of any level. Considering the above facts, it may increase by 100% or more. The token's strong tokenomics, limited supply, and strategic partnerships contribute to its potential for significant growth. Additionally, the active community and ongoing developments within the BetFury ecosystem ensure continued interest and support for BFG. By staying informed and making well-researched decisions, you can confidently navigate the opportunities that BFG presents. Join the $20,000,000 Cryptodrop to earn more BFG tokens and use this valuable asset to grow as an experienced crypto owner.\nMedia ContactPerson: Alisia PrestonWebsite: https:\/\/betfury.com\/Company Email: support@betfury.com"]}
{"date":"2024-06-18","titles":["Why Furrever Token is Poised to Benefit from Bitcoin (BTC)'s Endurance and Ethereum (ETH)'s Growth","MicroStrategy: Upside Potential, But Wait For Miners To Adjust (NASDAQ:MSTR)"],"urls":["https:\/\/www.globenewswire.com\/news-release\/2024\/06\/18\/2900681\/0\/en\/Why-Furrever-Token-is-Poised-to-Benefit-from-Bitcoin-BTC-s-Endurance-and-Ethereum-ETH-s-Growth.html","https:\/\/seekingalpha.com\/article\/4699799-microstrategy-upside-potential-but-wait-for-miners-to-adjust"],"sources":["globenewswire.com","seekingalpha.com"],"descriptions":["New York City, NY, June  18, 2024  (GLOBE NEWSWIRE) --           In the ever-evolving landscape of cryptocurrency, certain tokens stand out due to their...","In addition to being an IT play, MicroStrategy has been collecting Bitcoins for almost four years. Read why I'm bullish on MSTR."],"article_contents":["June 18, 2024 12:00 ET\n\n\n | Source:\r\n            \nFurrever Token\n\n\n\n\n\nFurrever Token\nIn the ever-evolving landscape of cryptocurrency, certain tokens stand out due to their unique value propositions and strategic positioning. Furrever Token (FURR) is one such emerging player that is gaining attention for its innovative approach and community-centric focus. As major cryptocurrencies like Bitcoin (BTC) demonstrate remarkable endurance and Ethereum (ETH) shows significant growth potential, Furrever Token is strategically poised to benefit from these market dynamics. In this article, we will explore how Bitcoin's stability and Ethereum's path to $5,000 can propel Furrever Token to new heights.\nBitcoin's Endurance: A Market Stabilizer\nBitcoin has long been the bedrock of the cryptocurrency market, often acting as a stabilizing force during times of volatility. Its decentralized nature, widespread adoption, and recognition as digital gold have cemented its status as a trusted store of value. Despite periodic market fluctuations, Bitcoin's ability to endure and maintain a relatively stable value over the long term has made it a cornerstone for both retail and institutional investors.\nThe stability of Bitcoin provides a foundation upon which other cryptocurrencies can build. As Bitcoin continues to demonstrate resilience, it fosters a sense of confidence among investors, encouraging them to explore other digital assets. This trickle-down effect can create a favorable environment for emerging tokens like Furrever Token, which can attract investors looking to diversify their portfolios while still anchored to the security of Bitcoin.\nEthereum's Growth: A Catalyst for Innovation\nEthereum, the second-largest cryptocurrency by market capitalization, is renowned for its smart contract functionality and the myriad of decentralized applications (dApps) built on its network. The upcoming Ethereum 2.0 upgrade promises to enhance the network's scalability, security, and energy efficiency, potentially driving its value to new heights. Analysts predict that Ethereum could reach $5,000, fueled by these technological advancements and increasing adoption.\nEthereum's growth is not just about its rising price; it represents a broader trend of innovation within the crypto space. As Ethereum enhances its capabilities, it paves the way for new projects and tokens to leverage its infrastructure. Furrever Token, which operates on the BNB-20 blockchain, can draw inspiration from Ethereum's success and apply similar principles of innovation and community engagement to its own ecosystem. The positive sentiment surrounding Ethereum's growth can spill over into the wider market, benefiting tokens that align themselves with these progressive values.\nFurrever Token: A Unique Value Proposition\nFurrever Token distinguishes itself with a whimsical and heartwarming approach to cryptocurrency. Designed to revolutionize the crypto space with an irresistible dose of cuteness, Furrever Token aims to create a delightful and engaging experience for its users. The project focuses on building a community centered around the universal appeal of adorable cat imagery, making it a standout in the crowded crypto market.\nThe tokenomics of Furrever Token are structured to ensure broad distribution and community involvement. With a total supply of 9 billion tokens, 65% are available during the presale, 25% are allocated for decentralized exchanges (DEXs), and 10% are reserved for the team, locked for a year. This allocation strategy is designed to foster organic growth and community-driven development.\nFurrever Token's potential for high returns is a key attraction for investors. The project has already raised over $1.3 million and is currently in stage 9 of its presale, aiming for a total of $1.9 million. With the presale price at $0.000732 and the promise of up to 15X returns, Furrever Token presents a compelling opportunity for those looking to invest in innovative and community-focused projects.\nThe Synergy of Bitcoin, Ethereum, and Furrever Token\nThe interplay between Bitcoin's endurance, Ethereum's growth, and Furrever Token's unique appeal creates a synergistic dynamic that can drive the latter's success. Bitcoin's stability provides a solid foundation for investor confidence, while Ethereum's advancements highlight the importance of innovation and scalability. Furrever Token, with its focus on community engagement and high returns, can attract investors who are already buoyed by the positive trends in Bitcoin and Ethereum.\nAs more investors recognize the potential of Furrever Token within this broader market context, the token is likely to experience increased demand and value appreciation. By aligning itself with the strengths of Bitcoin and Ethereum, Furrever Token is well-positioned to carve out its niche and thrive in the competitive crypto landscape.\nConclusion\nFurrever Token's strategic positioning amid the resilience of Bitcoin and the growth of Ethereum underscores its potential to benefit from these established market forces. As Bitcoin continues to provide stability and Ethereum drives innovation, Furrever Token's unique value proposition and community-centric approach can attract a diverse range of investors. By leveraging the strengths of these major cryptocurrencies, Furrever Token is poised to achieve significant growth and become a noteworthy player in the digital asset space.Join Furrever Token Presale Now: Furrever Token Official Website Visit Furrever Token Presale Join Official Telegram GroupFollow Official X Account\nMedia Contact:Robert Smithhttps:\/\/furrevertoken.com\/support (at) furrevertoken.comDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.",null]}
{"date":"2024-06-19","titles":["Exact Reason Behind Bitcoin (BTC) Drop Finally Revealed By U.Today","Bitcoin Plummets To $64K As Price 'Manipulation' Talks Rise"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/exact-reason-behind-bitcoin-btc-drop-finally-revealed-3489197","https:\/\/www.ibtimes.com\/bitcoin-plummets-64k-price-manipulation-talks-rise-3734684"],"sources":["investing.com","ibtimes.com"],"descriptions":["Exact Reason Behind Bitcoin (BTC) Drop Finally Revealed","Are Bitcoin prices being manipulated? Some crypto traders on X believe there is market manipulation as the digital currency's price has been on a downtrend in r..."],"article_contents":[null,"Cryptocurrency prices have once again demonstrated their volatility as Bitcoin, the world's largest digital asset by market value, plummeted to $64,000 late Tuesday. Talks have since increased regarding the reasons why BTC has been struggling to reach its mid-March all-time high of $73,000.\nOn X (formerly Twitter), some crypto traders and observers shared their insights on Bitcoin's stubborn ascent despite some significant developments in the industry, with a growing number of Bitcoin holders suggesting there may be manipulation.\nProminent trader @DaanCrypto wrote there was a lot of \"spoofing\" around Bitcoin on Tuesday. Spoofing, a term in trading that refers to placing fake market orders in an attempt to manipulate an asset's price, is \"illegal in regulated markets,\" he pointed out. He explained that the yellow bars in a chart he posted showed the huge orders that were added and then removed shortly after, \"usually with the intention to drive price up\/down.\"\n#Bitcoin Lots of spoofing going on today.All those yellow bars are big orders that are being added & removed shortly after. Usually with the intention to drive price up\/down.Fun fact: Spoofing is something that's illegal in regulated markets. pic.twitter.com\/BKjOW4WShb\nAnother trader who goes by @BritishHodl questioned why BTC prices are plummeting \"while the miners\" are seeing a spike. \"There is blatant manipulation OR selling that institutions are not taking seriously going on in this market,\" he said.\nOne crypto user said \"big banks\" now have control over the digital currency's price, and another said history has shown how assets can be \"purposefully held down\" using enough capital before the assets' prices explode.\nAs of late Tuesday, BTC prices were trading at around $65,400 and $65,600. However, it hit the low end of $64,000 at one point Tuesday night. The asset, which declined 2.8% in the past week, isn't the only major cryptocurrency that has seen red in the last seven days.\nDogecoin (DOGE), the top memecoin in the market, is down by 8.6%, Cardano (ADA) declined by 7.0%, another popular memecoin, Shiba Inu (SHIB), is down by 13.4%, Avalanche (AVAX) declined by 14.1% in the past week along with several other coins in CoinGecko's Top 20 rankings.\nDespite the increasing concerns about Bitcoin prices possibly being manipulated, some observers remain optimistic that better days are coming.\nWhat we're currently witnessing in terms of Bitcoin price action is fairly typical around the actual halving: A big pump leading into the halving, followed by a brief but sharp correction, a period of sideways chop, a final dump to nuke any remaining bullish sentiment, another… pic.twitter.com\/n25WWI1fYp\nJulien Bittel, head of research at Global Macro Investor (GMI), said patience is necessary at this point in the digital coin's journey. He explained that the price downturn is \"fairly typical around the actual halving.\" BTC went through a halving – wherein Bitcoin rewards for miners were cut in half – on April 20. For Bittle, it's \"the boring zone before the banana zone.\"\n© Copyright IBTimes 2024. All rights reserved."]}
{"date":"2024-06-20","titles":["EXCLUSIVE: Will The Crypto Bulls Come Back In the Fall? Experts Explain Why Summers Are Not The Best For Bitcoin, Ethereum And Other Coins"],"urls":["https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/06\/39408881\/exclusive-will-the-crypto-bulls-come-back-in-the-fall-experts-explain-why-summers-are-not-"],"sources":["benzinga.com"],"descriptions":[""],"article_contents":["Benzinga Rankings give you vital metrics on any stock – anytime.\n\"Sell in May and Walk Away.\" This age-old Wall Street adage, in addition to the stock market, has proven increasingly applicable to cryptocurrencies as well.\nFrom June to August, market growth and trading volumes have historically trended down across the sector.\nLast year, total volumes on spot and derivatives exchanges during the summer months dropped 18% compared to the spring. Conversely, volumes rose nearly 10% in the subsequent fall, according to digital asset data provider CCData.\nMoreover, the total market cap shrank 4% during this phase last year, only to rise by a whopping 52% in the next four months, a striking contrast.\nBenzinga spoke to experts to demystify the \"summer doldrums\" as many in the market label them.\nRyan Grace, Head of decentralized trading platform tastycrypto, said that most retail traders and institutions cut back on trading activities due to the holiday season.\nIndeed, summer is the peak travel time in the U.S., and people are seen indulging in water activities and chilling at the beach.\n\"This often creates an environment of lower volatility,\" Grace remarked. He added that selling options could be a good strategy in a neutral market, but reminded that a low liquidity market can witness wild swings quickly.\nMarkus Kraus, Affiliate Manager Europe at Trive Financial Services, while referring to the aforementioned factor, also attributed the dull phase to a lack of significant events like cryptocurrency conferences and meetings with regulators that could move the markets.\nChris Kline, COO & Co-Founder at BitcoinIRA, mentioned that the phase tends to witness a spike in Bitcoin BTC\/USD accumulation due to the subdued prices, offering a great chance for bullish traders to grab the asset before a potential rate cut by the Federal Reserve later in the year.\nGrace deemed the fall as \"one of the best times\" to trade cryptocurrencies due to the injection of fresh liquidity by investors returning from vacations.\n\"Historical data shows considerable price movement in Bitcoin during the fall when compared to the summer, though the direction varies. This trend often continues into the winter months, driven by renewed market sentiment and year-end positioning,\" Grace emphasized.\nEchoing this sentiment, Kline predicted a return of bullish impulse in the latter phase of the year.\nWith prediction markets anticipating a 70% chance of two or more rate cuts by year-end, premised on easing inflation and upcoming elections, Kline was hopeful that cryptocurrencies, along with other major assets, would see a northward movement during the fall and winter months.\nAs of this writing, the total cryptocurrency market cap was worth $2.39 trillion, while Bitcoin was exchanging hands at $65,556.36, according to data from Benzinga Pro.\nPhoto by FellowNeko on Shutterstock\nThese insights set the stage for deeper discussions at the upcoming Benzinga Future of Digital Assets event on Nov. 19.\nRead Next: Circle CEO Jeremy Allaire Bets Big On Bitcoin, Stablecoins: ‘I’m More Bullish Than I Have Ever Been About Crypto’\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes."]}
{"date":"2024-06-21","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-06-24","titles":["Coinbase: Bitcoin Has Stalled. Now What? (NASDAQ:COIN)","Trader That Called May 2021 Collapse Warns Bitcoin May Witness up to 20% Correction Following Support Break","FRNT Introduces New Institutional Bitcoin and Ether-Backed Lending Platform with BitGo Custody Solutions"],"urls":["https:\/\/seekingalpha.com\/article\/4700689-coinbase-bitcoin-has-stalled-now-what","https:\/\/dailyhodl.com\/2024\/06\/24\/trader-that-called-may-2021-collapse-warns-bitcoin-may-witness-up-to-20-correction-following-support-break\/","https:\/\/www.globenewswire.com\/news-release\/2024\/06\/24\/2903037\/0\/en\/FRNT-Introduces-New-Institutional-Bitcoin-and-Ether-Backed-Lending-Platform-with-BitGo-Custody-Solutions.html"],"sources":["seekingalpha.com","dailyhodl.com","globenewswire.com"],"descriptions":["Coinbase stock has outperformed Bitcoin, powered by revenue up 111.98% YoY, proving dominance in the Bitcoin ETF custody market. See my view on COIN stock.","A trader with a track record for accurate Bitcoin (BTC) calls says that the crypto king's bull market trend line is breaking, opening the door for a correction.","The new front-to-end platform offers users all relevant risk-management tools for both borrower and lender, manages liquidations and provides automated..."],"article_contents":[null,"A trader with a track record for accurate Bitcoin (BTC) calls says that the crypto king’s bull market trend line is breaking, opening the door for a correction.\nPseudonymous analyst Dave the Wave tells his 146,000 followers on the social media platform X that BTC may soon make a move to the downside, possibly dropping to as low as the 0.38 Fibonacci level which is around the $50,000 mark.\n“With the trendline breaking, a weighted outlook has to shift toward further consolidation of BTC price over the shorter term. Looking either for a range to form [0.23 fib] or support at the buy zone [0.38 fib]. This may well set up for a better 4th quarter.”\nThe trader says he’s watching the monthly chart for more confirmation of a trend reversal.\n“Still wanting to see some follow-through on the monthly to confirm a change of trend… these things take time.”\nBitcoin’s current monthly candle has gone slightly lower since Dave the Wave posted his chart, now trading below the diagonal support level.\nThe analyst recently predicted a market top for Bitcoin in December 2025 by using his version of the logarithmic growth channel (LGC) curve, which aims to predict Bitcoin’s longer-term cycle lows and highs while filtering out shorter-term volatility.\n“If you subscribe to the BTC four-year cycle theory, then it may not help you much with the top (again). However, if you subscribe to the LGC theory, it may once again be useful.”\nSource: Dave the Wave\/X\nLooking at his chart, the analyst suggests Bitcoin could hit the top of the LGC model and soar above $300,000 at the end of 2025.\nAt time of writing, Bitcoin is trading at $62,249, down over 3% on the day.\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","June 24, 2024 09:07 ET\n\n\n | Source:\r\n            \nFRNT Financial\n\n\n\n\nFRNT Financial\nTORONTO, June  24, 2024  (GLOBE NEWSWIRE) -- FRNT Financial Inc. (TSXV: FRNT) (OTCQB: FRFLF) (FSE: XZ3) (“FRNT” or the “Company”) is pleased to announce its partnership with BitGo, a leading qualified custodian in the digital assets space, and the launch of its new institutional-only lending platform, aiding the origination and maintenance of BTC and ETH-backed loans. The platform offers significant advantages to both lenders and borrowers over existing industry structures.\nFRNT's new lending interface leverages a tri-party structure to mitigate counterparty risk by using a bankruptcy remote third-party custodian, BitGo, ensuring that the collateral is securely held in cold storage and cannot be rehypothecated. FRNT’s solution minimizes the lender’s required engagement while maintaining the benefits and safety of a tri-party structure. Unlike traditional tri-party lending arrangements that demand a high degree of involvement from the lender, FRNT’s platform requires the lender only to provide the balance sheet, with FRNT’s technology handling all loan monitoring. This streamlined approach offers significant advantages, providing lenders with peace of mind and returns, while borrowers can access liquidity without selling their BTC or ETH, maintaining potential upside in their investments.\n“Our platform is designed to provide a seamless and secure lending experience for institutional clients,” said Giles Colwell, Head of NA Capital Markets at FRNT. “With 24\/7 monitoring, automated margin calls, and a robust liquidation management process, lenders can confidently lend against BTC and ETH without the need to handle the physical assets.”\nKey features of the new platform include:\nOvercollateralization: Loans are typically structured with a starting Loan-to-Value (LTV) ratio of 50%-70%.No Rehypothecation: Collateral is held with BitGo, a qualified custodian, and remains in bankruptcy-remote cold storage, providing an additional layer of security.Automated Management: The platform offers 24\/7\/365 trading capabilities, deep liquidity, and real-time monitoring of collateral health, margin levels, and liquidation points.Auditability: Utilizing the public BTC and ETH blockchains ensures all transactions are transparent and can be audited in real-time, enhancing trust and security.\nThe platform aims to address the growing demand for digital asset-backed lending solutions. As the market for BTC and ETH continues to mature, the availability of a secure and efficient lending platform presents a significant opportunity for both lenders seeking yield and borrowers looking to leverage their digital assets without selling them.\n“We are excited to partner with FRNT and leverage our extensive collateral management capabilities to assist them in growing their lending platform,” said Adam Sporn, BitGo’s Head of Prime Brokerage and U.S. Institutional Sales.\n“Crypto-backed loans are a key component in institutional integration into the digital asset ecosystem,” added FRNT CEO and co-founder Stéphane Ouellette. “For lenders, FRNT’s platform provides a unique opportunity to diversify lending book exposure to a less correlated asset class. For borrowers, FRNT’s platform offers a secure and transparent means to access dollar liquidity while maintaining long exposure to the collateralized asset. We’re further extremely excited to be announcing this launch with BitGo, one of the longest serving and trusted names in digital asset custody.”\nAbout FRNTFRNT is an institutional capital markets and advisory platform focused on digital assets. FRNT, through a technology-forward and compliant operation, aims to bridge the worlds of traditional and web-based finance. Partnering with both financial institutions and crypto native firms, FRNT operates 5 synergistic business lines including deliverable trading services, institutional structured derivative products, merchant banking, advisory and consulting, and principal investments & trading. Co-founded in 2018 by CEO Stéphane Ouellette, FRNT is a global firm headquartered in Toronto, Canada.\nAbout BitGoBitGo is the leading infrastructure provider of digital asset solutions for businesses, offering custody, wallets, staking, trading, financing and settlement. Founded in 2013, BitGo is the first digital asset company to focus exclusively on serving institutional clients. In 2018, it launched BitGo Trust Company, the first qualified custodian purpose-built for storing digital assets and established BitGo New York Trust in 2021. In 2022, BitGo launched institutional-grade DeFi, NFT and web3 services. BitGo also supports over 800 digital assets on its platform and provides the security and operational backbone for more than 1500 institutional clients in 50 countries, including many of the world’s top cryptocurrency exchanges and platforms. For more information, please visit www.bitgo.com.\nFRNT Financial Inc. Chief Executive OfficerStéphane Ouelletteinvestors@frnt.io833 222-3768https:\/\/frnt.io\nNeither the TSXV nor its regulation services provider (as that term is defined in policies of the TSXV) accepts responsibility for the adequacy or accuracy of this press release.\nFORWARD-LOOKING STATEMENTSThis press release contains “forward-looking statements” and “forward-looking information” within the meaning of applicable law which may include, without limitation, statements relating to financial and business prospects of the Company, its assets and other matters. Generally, forward-looking statements and forward-looking information can be identified by the use of forward-looking terminology such as “plans”, “expects” or “does not expect”, “is expected”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates” or “does not anticipate”, “believes”, or variations of such words and phrases or statements that certain actions, events or results “may”, “could”, “would”, “might” or “will be taken”, “occur” or “be achieved”. All forward-looking statements and forward-looking information are based on reasonable assumptions that have been made by the Company as at the date of such information. Forward-looking statements and forward-looking information are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements and forward-looking information, including but not limited to: the general risks associated with the speculative nature of the Company’s business, current global financial conditions, uncertainty of additional capital, price volatility, no history of earnings, government regulation in the industries in which the Company operates, political and economic risk, absence of public trading market, arbitrary offering price, dilution to the Company’s common shares, dependence on key personnel, currency fluctuations, insurance and uninsured risks, competition, legal proceedings, conflicts of interest and lack of dividends. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements and forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements or information. Accordingly, readers should not place undue reliance on forward-looking statements or forward-looking information. The Company does not undertake to update any forward-looking statement or forward-looking information that is included herein, except in accordance with applicable securities laws."]}
{"date":"2024-06-25","titles":["Top Trader Says Breaking Parabolic Trend a Positive for Bitcoin, Unveils Timeline for Renewed BTC Strength","How to Short Bitcoin in 2024 – Top 5 Strategies"],"urls":["https:\/\/dailyhodl.com\/2024\/06\/25\/top-trader-says-breaking-parabolic-trend-a-positive-for-bitcoin-unveils-timeline-for-renewed-btc-strength\/","https:\/\/www.valuewalk.com\/cryptocurrency\/how-to-short-bitcoin\/"],"sources":["dailyhodl.com","valuewalk.com"],"descriptions":["A trader known for making timely Bitcoin calls says that the current BTC correction is healthy for the long-term uptrend of the crypto king.","Read our full guide on how to short Bitcoin in 2024, including strategies such as margin trading, futures markets, CFDs and more."],"article_contents":["A trader known for making timely Bitcoin calls says that the current BTC correction is healthy for the long-term uptrend of the crypto king.\nPseudonymous analyst Dave the Wave tells his 146,700 followers on the social media platform X that Bitcoin’s latest move below $60,000 has invalidated prospects for a BTC parabolic surge.\nAccording to the crypto strategist, Bitcoin’s price action suggests that more consolidation is on the horizon, allowing BTC to build a better base for a stronger lift-off later this year.\n“A positive of BTC price not going parabolic is that it continues to develop in a relatively stable technical manner – consolidation and then renewed strength going into the 4th quarter. A manic market at a later date would see higher prices than if it came earlier.”\nDave the Wave recently predicted that Bitcoin could fall to as low as $50,000 where it will likely find support at the 0.382 Fibonacci retracement level.\nAccording to the analyst, a drop to $50,000 would put BTC back into the “buy zone” of his logarithmic growth curve (LGC) model, which aims to predict Bitcoin’s longer-term cycle lows and highs while filtering out shorter-term volatility.\nDave the Wave highlights that the deep drawdown would place BTC in a position “for renewed strength to the upside.”\nAt time of writing, Bitcoin is trading for $60,357, up from its 24-hour low of $58,443.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl",null]}
{"date":"2024-06-26","titles":["Economist Alex Krüger ‘Very Bullish’ on Bitcoin Through 2024 Elections, Says BTC Will Carry Crypto Rally","Best Bitcoin Staking Strategies"],"urls":["https:\/\/dailyhodl.com\/2024\/06\/26\/economist-alex-kruger-very-bullish-on-bitcoin-through-2024-elections-says-btc-will-carry-crypto-rally\/","https:\/\/medium.com\/@eynahntouko\/best-bitcoin-staking-strategies-7dedb098fc28"],"sources":["dailyhodl.com","medium.com"],"descriptions":["Macro trader and economist Alex Krüger is saying that the macro environment is currently conducive for risk assets such as Bitcoin (BTC), other crypto assets a...","With the rise of Bitcoin’s popularity and value, more and more people are looking into how to stake Bitcoin to earn rewards and secure the network. Bitcoin st..."],"article_contents":["Macro trader and economist Alex Krüger is saying that the macro environment is currently conducive for risk assets such as Bitcoin (BTC), other crypto assets and stocks.\nIn an interview with the chief investment officer of the investment firm Arca, Jeff Dorman, Kruger says,\n“My outlook for Bitcoin remains very bullish into year-end. And if that happens… it just makes sense that it carries everything with it. Like when Bitcoin is going up usually everything goes up. It is that simple.”\nBitcoin is trading at $61,478 at time of writing.\nAccording to Kruger, risk assets could increase in price over the coming months.\n“[Over the] mid-term like into 2025 the market should keep on rallying. Market, in this case, is the S&P 500 index, the NASDAQ, risk assets, equities and the exchange-traded funds (ETFs), they finally linked Bitcoin and Ethereum to the macro side on a permanent basis now. This correlation comes back and forth. It’s definitely there.”\nOn when entry opportunities will present themselves for risk assets, Kruger says,\n“It’s an environment where risk assets perform very very well and my macro view towards year-end is that leaving aside the [US general] elections that are very very momentous and are going to drive very significant, should drive not going to, very significant volatility, which I think would give very good entry points for risk assets.”\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl",null]}
{"date":"2024-06-27","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-06-28","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
