{"date":"2024-08-01","titles":["Digihost Announces Cash and Crypto Position and Provides July 2024 Production Update"],"urls":["https:\/\/www.globenewswire.com\/news-release\/2024\/08\/01\/2922534\/0\/en\/Digihost-Announces-Cash-and-Crypto-Position-and-Provides-July-2024-Production-Update.html"],"sources":["globenewswire.com"],"descriptions":["HOUSTON, Aug.  01, 2024  (GLOBE NEWSWIRE) -- Digihost Technology Inc. (“Digihost” or the “Company”) (Nasdaq \/ TSXV: DGHI), an innovative U.S. based..."],"article_contents":["August 01, 2024 06:00 ET\n\n\n | Source:\r\n            \nDigihost Technology Inc.\n\n\n\n\nDigihost Technology Inc.\nHOUSTON, Aug.  01, 2024  (GLOBE NEWSWIRE) -- Digihost Technology Inc. (“Digihost” or the “Company”) (Nasdaq \/ TSXV: DGHI), an innovative U.S. based blockchain technology and computer infrastructure company, is pleased to provide unaudited comparative Bitcoin (“BTC”) production results for the month ended July 31, 2024, combined with an operations update. All monetary references are expressed in USD unless otherwise indicated.\nMonthly Production Highlights for July 2024\nOperations Update\nPresently, Digihost’s consolidated operating capacity across its three sites represents approximately 90MW of available power and is mining at hashrate of 2.75 EH\/s.\nAbout Digihost\nDigihost is a growth-oriented technology company focused on the blockchain industry. The Company operates from three sites in the U.S. and, in addition to managing its own operations, provides hosting arrangements at its facilities.\nFor further information, please contact:\nDigihost Technology Inc.www.digihost.caMichel Amar, Chief Executive Officer T: 1-818-280-9758Email: michel@digihost.ca\nCautionary StatementTrading in the securities of the Company should be considered highly speculative. No stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\nForward-Looking Statements\nExcept for the statements of historical fact, this news release contains “forward-looking information” and “forward-looking statements” (collectively, “forward-looking information”) that are based on expectations, estimates and projections as at the date of this news release and are covered by safe harbors under Canadian and United States securities laws. Forward-looking information in this news release includes information about potential further improvements to profitability and efficiency across mining operations, including, as a result of the Company’s expansion efforts, potential for the Company’s long-term growth, and the business goals and objectives of the Company. Factors that could cause actual results to differ materially from those described in such forward-looking information include, but are not limited to: future capital needs and uncertainty of additional financing; share dilution resulting from equity issuances; risks relating to the strategy of maintaining and increasing Bitcoin holdings and the impact of depreciating Bitcoin prices on working capital; effects on Bitcoin prices as a result of the most recent Bitcoin halving; development of additional facilities and installation of infrastructure to expand operations may not be completed on the timelines anticipated by the Company, or at all; ability to access additional power from the local power grid; a decrease in cryptocurrency pricing, volume of transaction activity or generally, the profitability of cryptocurrency mining; further improvements to profitability and efficiency may not be realized; development of additional facilities to expand operations may not be completed on the timelines anticipated by the Company; ability to access additional power from the local power grid; an increase in natural gas prices may negatively affect the profitability of the Company’s power plant; the digital currency market; the Company’s ability to successfully mine digital currency on the cloud; the Company may not be able to profitably liquidate its current digital currency inventory, or at all; a decline in digital currency prices may have a significant negative impact on the Company’s operations; the volatility of digital currency prices; and other related risks as more fully set out in the Annual Information Form of the Company and other documents disclosed under the Company’s filings at www.sedarplus.ca and www.SEC.gov\/EDGAR. The forward-looking information in this news release reflects the current expectations, assumptions and\/or beliefs of the Company based on information currently available to the Company. In connection with the forward-looking information contained in this news release, the Company has made assumptions about: the current profitability in mining cryptocurrency (including pricing and volume of current transaction activity); profitable use of the Company’s assets going forward; the Company’s ability to profitably liquidate its digital currency inventory as required; historical prices of digital currencies and the ability of the Company to mine digital currencies on the cloud will be consistent with historical prices; the ability to maintain reliable and economical sources of power to run its cryptocurrency mining assets; the negative impact of regulatory changes in the energy regimes in the jurisdictions in which the Company operates; and there will be no regulation or law that will prevent the Company from operating its business. The Company has also assumed that no significant events occur outside of the Company's normal course of business. Although the Company believes that the assumptions inherent in the forward-looking information are reasonable, forward-looking information is not a guarantee of future performance and accordingly undue reliance should not be put on such information due to the inherent uncertainties therein. The Company undertakes no obligation to revise or update any forward-looking information other than as required by law.\nMIAMI, April  01, 2025  (GLOBE NEWSWIRE) -- Digi Power X Inc. (“Digi Power X” or the “Company”) (Nasdaq: DGXX \/ TSXV: DGX), an innovative energy infrastructure company that develops cutting-edge data...\nMIAMI, March  31, 2025  (GLOBE NEWSWIRE) -- Digi Power X Inc. (“Digi Power X” or the “Company”) (Nasdaq: DGXX \/ TSXV: DGX), an innovative energy infrastructure company that develops cutting-edge data..."]}
{"date":"2024-08-02","titles":["MicroStrategy’s Bold Bitcoin Bet: Adding 12.22K BTC Amid Q2 Loss"],"urls":["https:\/\/medium.com\/@nettorgtwin\/microstrategys-bold-bitcoin-bet-adding-12-22k-btc-amid-q2-loss-785f3e270baf"],"sources":["medium.com"],"descriptions":["MicroStrategy adds 12.22K BTC despite a $123M Q2 loss, holding 226.5K Bitcoin with a market value of $14.5B. MicroStrategy, the business intelligence giant, is ..."],"article_contents":[null]}
{"date":"2024-08-05","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-08-06","titles":["Ether Prices Fall To Lowest Point Of 2024 As Crypto Markets Bleed","Prediction: Crypto Prices Will Surge After the Sell-Off, Seize Your Chance to Buy Now"],"urls":["https:\/\/www.forbes.com\/sites\/digital-assets\/2024\/08\/05\/ether-prices-fall-to-lowest-point-of-2024-as-crypto-markets-bleed\/","https:\/\/finance.yahoo.com\/news\/prediction-crypto-prices-surge-sell-130700068.html"],"sources":["forbes.com","finance.yahoo.com"],"descriptions":["Ether prices fell below $2,200 today on CoinMarketCap, reaching a 2024 low as cryptocurrencies and other risk assets suffered widespread losses.","Crypto prices are down recently and the highly anticipated boost from the Bitcoin halving is nowhere to be seen. Here why you should see this price drop as a pr..."],"article_contents":["ByCharles Lloyd Bovaird II\nByCharles Lloyd Bovaird II,\nSenior Contributor.\nEther prices fell below $2,200 today as risk assets plunged. (Photo by S3studio\/Getty Images)\nEther suffered notable declines today, dropping to its lowest value of the year, as the broader cryptocurrency markets, and risk assets in general, suffered widespread losses.\nThe price of ether, the second-largest digital currency by market value, fell below $2,200 earlier today, CoinMarketCap data shows.\nJust two days prior, it was trading above $3,000, additional CoinMarketCap additional CoinMarketCap figures show.\nTim Enneking, managing partner of Psalion, emphasized the severity of this drop, describing it as “breathtaking, especially by the standards of the past several years,” in emailed comments.\nSeveral other cryptocurrencies, including bitcoin and Solana’s SOL token, also experienced notable declines, additional CoinMarketCap figures reveal.\nMajor stock indices, including the benchmark S&P 500 index and the Dow Jones Industrial Average, encountered significant volatility.\nWhen explaining the drop in ether prices, analysts cited multiple headwinds, including concerns of U.S. economic weakness that helped fuel widespread sell-offs in risk assets.\nGreg Magadini, director of derivatives for digital asset data provider Amberdata, for example, stressed the U.S. July jobs report that came out last week, as well as communications provided by members of the Federal Open Market Committee, stating that these helped send “risk-assets crashing.”\nWhile agreeing that these economic worries helped motivate investors to flee riskier assets, the market observers polled for this article emphasized other factors as well.\n“It seems that Ether is experiencing volatility as a result of the current macro investment environment,” Brett Sifling, an investment advisor for Gerber Kawasaki Wealth & Investment Management, said via email.\n“Market participants were worried over the weekend when news of the, ‘Japanese Yen Carry Trade’ broke after the more hawkish fed meeting in the U.S. last week. I believe this combination of news, along with a sell-the-news event that happened when the Ether spot ETFs started trading on U.S. markets, was the primary driver for this correction,” he stated.\n“Risk-on assets like crypto have been sold across the board as these investors worry about a potential recession ahead of the upcoming presidential election,” said Sifling.\nNumerous analysts highlighted the effect that the approval of spot-based ether exchange-traded funds has had on the markets.\nWhile these funds certainly drew interest, they failed to generate as much trading volume as bitcoin-based spot ETFs.\nEnneking emphasized the role that this development played in ether’s price performance in 2024, stating that it was a major contributor to the recent weakness in the digital asset.\n“As for reasons for the drop other than the disappointing correlation with fiat equities markets, and the lumping of crypto into a general basket labeled ‘risk-on assets’, I think the main reason is disappointment over the market’s reaction to spot ETH ETFs. One could argue that the effect of the ETFs had been priced in, but that still doesn’t explain ETH’s very significant underperformance relative to BTC this year.”\n“All that, plus the apparent demise of the ‘Trump trade’ with the Democrats switching presidential candidate just weakened the floor beneath the ETH price. When the low US employment numbers came out last week, and predictions went from ‘no landing’ or ‘very soft landing’ to a possible ‘hard landing’, along with a shift in sentiment from ‘maybe 25 bps in September’ to ‘25 or 50 bps in September’, the floor collapsed.”\nBrett Munster, portfolio manager for Blockforce Capital, also spoke to the key role that Ether ETFs are playing in the market for the high-profile cryptocurrency.\n“Ethereum is following the same path following its launch of the Ethereum ETF as bitcoin did following its ETF launch and for the same reason,” he stated via email.\n“When the bitcoin ETFs launched, all the new issuers charged roughly 0.2% - 0.25%. The lone exception was Grayscale who decided to keep the fees roughly 10x as high as the rest of the market,” said Munster.\n“The result was a mass exodus out of Grayscale and into other, lower costs ETFs,” he noted.\n“Just like with the bitcoin ETF, Grayscale is keeping the fees on their ETH ETF 10x higher than the rest of the market,” said the analyst.\n“Grayscale’s existing trust held roughly $10 billion worth of ETH prior to the ETF launch,” he continued.\n“As we speculated earlier this year, we believed it was likely we would see a similar exodus as seen with the bitcoin ETF which would result in $2-3 billion worth of sell pressure on ETH in the first few weeks after launch. We predicted that this sell pressure would likely outpace net inflows, causing ETH’s price to dip over the first week or two.”\n“That's exactly what has happened as $2.1 billion worth of ETH has exited ETHE since launch.”\nGoing forward, Munster offered an optimistic take on how these funds will affect the value of ether.\n“In the long term, the approval and launch of Ethereum ETFs is incredibly bullish for ETH’s price,” Munster predicted.\n“However, its no surprise that we are seeing an initial dip in ETH’s price over the first couple of weeks as the market works through the sell pressure from Grayscale’s conversion.”\nDisclosure: I own some bitcoin, bitcoin cash, litecoin, ether, EOS and SOL.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe cryptocurrency market feels wobbly right now. After starting the year with a 73% year-to-date gain, Bitcoin (CRYPTO: BTC) has posted a 21% price drop in five months. Ethereum's (CRYPTO: ETH) volatility is slightly wilder with a 77% peak gain followed by a 34% decline. Solana (CRYPTO: SOL) doubled at the top, then dropped 32% lower.\nCrypto investors are nervous right now. Bitcoin was supposed to soar thanks to the one-two punch of spot Bitcoin ETF approvals and the fourth halving of its mining rewards. Ethereum was expected to follow suit, spring-loaded for big gains via a game-changing technology update two summers ago. And Solana came back strong last year from the currency's confidence-sapping proximity to the earlier FTX meltdown. None of these ultra-bullish narratives are playing out, so the leading crypto names started to sag instead.\nBut I'm here to tell you that better times are on the way. The Bitcoin halving boost is a slow-burning fuse, but its market price effects tend to be jaw-dropping when the time is right.\nSo I see a massive buying opportunity in the current crypto-price downturn. Let me walk you through my logic real quick.\nThe next boom in the highly cyclical crypto market starts and ends with Bitcoin's halving cycle. This four-year rotation of shrinking rewards for crypto mining is a crucial part of Bitcoin's economic model, since it ensures lower inflation over time. Bitcoin has already reached an annual inflation rate of 0.84%, down from 1.7% a year ago and 3.8% in 2019.\nBy comparison, the global reserves of physical gold is rising at an annual rate of 3%. That's an unusually high increase due to record gold mining and very high recycling rates, all inspired by lofty gold prices. Still, Bitcoin's inflation now stands far below gold's long-term average rate of approximately 1.8%.\nIn other words, Bitcoin's supply side scarcity looks more stable in the long run than owning physical gold bars at this point. At the same time, the sudden availability of exchange-traded funds (ETFs) based on Bitcoin prices opened the door for large-scale institutional investors to take a direct interest in the crypto market. With this combo in play, the current halving cycle could be more impressive than the last one, where coin prices rose by 579% in the 52 weeks after that reward adjustment.\nBut the soaring gains didn't start right away. Roughly four months after the May 2020 halving, Bitcoin couldn't quite keep up with the S&P 500 (SNPINDEX: ^GSPC) index posting a 22% gain.\nInstead, the crypto chart started to pull away by the middle of October. Large banks started to take Bitcoin seriously at this point. Financially questionable mining operations filed for bankruptcy amid lower rewards and constant operating costs. Weak hands folded, freeing up their resources to be bought by stronger competitors in bankruptcy auctions. Bitcoin had gained 124% post-halving by the end of November, roughly six months after the adjustment.\nThis drama played out in the year of coronavirus lockdowns and unpredictable economic swings. That backdrop probably added to Bitcoin's wild price swings, which continued until a pricing peak formed in November 2021.\nYou know the drill -- past performance is not a guarantee of future results, and every market cycle is different. Yet, the same economic forces are at work again and Bitcoin transactions are powered by the miners. If they can't afford to stay in business, or they drop their Bitcoin mining operations in favor of a different business model, transactions become slower, less secure, and more expensive for people trying to use the cryptocurrency. So the whole system only works if Bitcoin prices rise over time.\nLong story short, Bitcoin should see strong price gains in this halving cycle too, probably starting about six months after the latest halving. The recent price drop only makes Bitcoin a better buy, according to my analysis. If you haven't touched a cryptocurrency with a ten-foot pole so far, this could be a great time to get started with a modest investment in the iShares Bitcoin ETF (NASDAQ: IBIT) or Bitwise Bitcoin ETF Trust (NYSEMKT: BITB). You don't even have to open a crypto-trading account, since the spot Bitcoin ETFs are available in most stock brokerages.\nWhen Bitcoin makes a big move, the crypto market as a whole tends to follow suit. The correlation between Bitcoin prices and the S&P 500 index is quite weak but the digital currency almost moves in tandem with Ethereum and Solana. Bitcoin is the flagship of the crypto fleet, and many smaller crypto projects rely on Bitcoin to provide fiscal stability.\nOn top of that, leading altcoins such as Solana and Ethereum come with price-boosting qualities of their own. Ethereum is only partially done with its conversion into a nimbler, fast, and less energy-hungry global computing platform. Solana is carving out a larger slice of the decentralized app space, still battling headwinds from the FTX crisis. I'll be shocked if these healthy crypto systems can't keep up with Bitcoin's near-term gains, and they could even outperform their larger cousin in this four-year halving cycle.\nI'll admit that Bitcoin is a more mature digital asset today, and it's probably best to keep these investment bites on the smaller side. And remember that cryptocurrencies should constitute a fairly small slice of a diversified investment portfolio. For what it's worth, my own direct and indirect bets in the crypto space work out to less than 5% of my stock portfolio, and even less if you include things like real estate in the calculation.\nBefore you buy stock in Bitcoin, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bitcoin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $615,516!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 29, 2024\nAnders Bylund has positions in Bitcoin, Bitwise Bitcoin ETF Trust, Ethereum, and Solana. The Motley Fool has positions in and recommends Bitcoin, Ethereum, and Solana. The Motley Fool has a disclosure policy.\nPrediction: Crypto Prices Will Surge After the Sell-Off, Seize Your Chance to Buy Now was originally published by The Motley Fool"]}
{"date":"2024-08-07","titles":["Bitcoin Whales Reportedly Accumulate Nearly $23B Worth Of BTC In A Month: 'Something Is Happening Behind The Scenes'","Bitcoin Crashed Alongside Stocks, Is It No More The Outlier? - Analyst Calls Comparison With Traditional Safe Haven Gold 'Ludicrous' - Grayscale Bitcoin Mini Trust (BTC) Common units of fractional und","Marathon Digital: I Would Rather Hold Bitcoin (NASDAQ:MARA)"],"urls":["https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/08\/40212271\/bitcoin-whales-reportedly-accumulate-nearly-23b-worth-of-btc-in-a-month-something-is-happe","https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/08\/40216228\/bitcoin-crashed-alongside-stocks-is-it-no-more-the-outlier-analyst-calls-comparison-with-t","https:\/\/seekingalpha.com\/article\/4711602-marathon-digital-too-many-variables-at-play"],"sources":["benzinga.com","benzinga.com","seekingalpha.com"],"descriptions":["Bitcoin (CRYPTO: BTC) whales have been quietly accumulating the cryptocurrency over the past month, despite the market’s recent downturn.","Leading cryptocurrencies mirrored the stock market decline this week, with barometer Bitcoin (CRYPTO: BTC) plummeting to lows not seen since February.","Marathon Digital has significantly diluted shareholders, with the number of shares outstanding increasing 44 times in the last four years. Learn more on MARA st..."],"article_contents":["Benzinga Rankings give you vital metrics on any stock – anytime.\nBitcoin BTC\/USD whales have been quietly accumulating the cryptocurrency over the past month, despite the market’s recent downturn.\nWhat Happened: Bitcoin whales have moved nearly $23 billion worth of BTC to “permanent holder addresses” in the last 30 days, observed Ki Young Ju, the founder, and CEO of CryptoQuant. He added that this recent spike in demand for Bitcoin among long-term holders is a sign of the King Crypto being in an “accumulation phase.”\n“I’m pretty sure something is happening behind the scenes. 404,448 #Bitcoin have moved to permanent holder addresses over the past 30 days, and it’s clearly accumulation,” he wrote.\nI'm pretty sure something is happening behind the scenes.404,448 #Bitcoin have moved to permanent holder addresses over the past 30 days, and it's clearly accumulation.We'll know within a year. https:\/\/t.co\/Ip0jow2pGN pic.twitter.com\/OOxuWcyxJu\nHe predicted that various entities, including traditional financial institutions, companies, and governments, will publicly disclose their Bitcoin acquisitions in the third quarter of 2024.\nAdditionally, Ju highlighted other bullish indicators, such as the near-end of miner capitulation, a stable hash rate, and reduced selling pressure from long-term Bitcoin holders.\n#Bitcoin On-chain Data Summary:Bullish• Hashrate Recovery: Miner capitulation is nearly over, with hashrate nearing ATH. U.S. mining costs are ~$43K per BTC, so hashrate likely stable unless prices dip below this.• Whale Accumulation: Significant BTC inflows into custody…\nDespite the recent market slump, which saw Bitcoin prices briefly drop to $49,800 on Monday, the cryptocurrency has since recovered by 14% to reach $56,703 on Wednesday.\nSee Also: Trump’s Bold Plan To Use Bitcoin To ‘Wipe Out’ $35T US Debt Questioned By Economist Justin Wolfers: ‘That’s Not How Crypto Works’\nWhy It Matters: The recent accumulation of Bitcoin by whales comes amid significant market volatility, driven by unexpected global financial events. On Tuesday, Jim Bianco of Bianco Research attributed a major market downturn to the Bank of Japan’s surprise interest rate hike on Jul. 31. This decision led to a massive unwinding of the yen carry trade, causing ripple effects across international markets.\nDespite the market turbulence, U.S. stock markets rebounded strongly on Tuesday, with the S&P 500 and Nasdaq 100 both climbing over 2%. This recovery was driven by investor confidence in the U.S. economy’s resilience.\nHowever, some experts remain cautious. Crypto trader Altcoin Sherpa predicted that Bitcoin might find its bottom in the $40,000s, suggesting further market volatility and potential liquidations. Additionally, the crypto market is facing increased unpredictability, described as a “random walk” by BloFin Academy.\nPrice Action: Bitcoin is trading at $56,726.50, reflecting a gain of 1.20% in the last 24 hours. Over the past month, Bitcoin has increased 1.52%. Year to date, the King Crypto has surged by 28.42%, according to data from Benzinga Pro.\nRead Next:\nImage Via Pixabay\nThis story was generated using Benzinga Neuro and edited by Kaustubh Bagalkote\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.","Benzinga Rankings give you vital metrics on any stock – anytime.\nLeading cryptocurrencies mirrored the stock market decline this week, with barometer Bitcoin BTC\/USD plummeting to lows not seen since February.\nBitcoin's downswing ignited a fresh debate around its store of value narrative, a major sticking point between advocates of the cryptocurrency and its skeptics.\nThe concerns were exacerbated by the fact that gold, the traditional safe-haven asset, dropped a little over 1% on Monday, while \"digital gold\" cratered 16%.\nHence, it begs the question — Is Bitcoin more integrated than traditional markets than ever, and hence no more the outlier?\nBenzinga talked about experts to understand if it's indeed the case or is it too early to arrive at any informed conclusions.\nRobert R. Johnson, Professor of Finance, Heider College of Business, Creighton University, refused to read too much into the recent market swings.\n\"I don't see increased coupling (between Bitcoin and stocks). I see Bitcoin trading as an extremely speculative supposed asset,\" Johnson stated. \"Volatility is a part of any market, and these moves are not out of the ordinary.”\nThat said, Johnson categorically slammed arguments around the cryptocurrency being an inflation hedge or a store of value.\n\"Bitcoin is a nascent asset. Anyone who believed it to be either an inflation hedge or a store of value is delusional. It is an extreme-risk asset — pure and simple. The comparisons to gold are ludicrous.\"\nChris Martin, Head of Research at Amberdata, a cryptocurrency data analytics firm that supports financial institutions like Citi, Nasdaq, and Franklin Templeton, echoed Johnson's views, ruling out any significant coupling between the two asset classes.\n\"What we’re seeing is a global unwinding amid several macro factors, with crypto’s crash being affected far more by large liquidations,\" he explained. Instead, he said that cryptocurrencies were far more correlated to each other than stocks, citing similar declines in other coins such as Solana SOL\/USD and Binance Coin BNB\/USD.\nAs a result, Martin was convinced that Bitcoin's inflation hedge narrative still holds.\nDaniel Cawrey, Chief Strategy Officer at Tonkeeper, and author of the books \"Mastering Blockchain\" and \"Understanding Crypto,\" had a divergent view.\nHe said it has become \"tough\" to call Bitcoin an outlier in 2024, given King Crypto's expanding footprints in TradFi through exchange-traded funds.\n\"The high AUM and daily volumes from the top ETFs created traditional finance liquidity in the market for bitcoin – so it’s easier to hit that sell button and get a good price for Bitcoin more than ever before,\" Cawrey explained. \"Bitcoin is most definitely a bellwether for crypto, yet it is ultimately beholden to traditional markets now.\nSee Also: Peter Schiff Says Owning Bitcoin In ETFs Is The Antithesis Of ‘Not Your Keys, Not Your Coins’ — Gets A Gold Jibe In Return From Noted Analyst\nWhile perspectives hold significance, it's important to note that things can change quickly in capital markets, and more so in the case of cryptocurrencies.\nPrice Action: At the time of writing, Bitcoin was trading at $56,869.46, up 2% in the last 24 hours, according to data from Benzinga Pro.\nPhoto by Shuttershock\nThese insights set the stage for deeper discussions at the upcoming Benzinga Future of Digital Assets event on Nov. 19.\nRead Next:\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.",null]}
{"date":"2024-08-08","titles":["Bitcoin: Current State of Play & Where to Next","VanEck Crypto Monthly Recap For July 2024"],"urls":["https:\/\/themarketonline.com.au\/bitcoin-current-state-of-play-where-to-next-swyftx-australia-2024-08-09\/","https:\/\/seekingalpha.com\/article\/4712032-vaneck-crypto-monthly-recap-for-july-2024"],"sources":["themarketherald.com.au","seekingalpha.com"],"descriptions":["Flash Crash in the Crypto Market","Before August’s bloodbath, Bitcoin rose 6% in July, while Ethereum lagged, facing ETH ETP outflows and fee revenue issues due to EIP-4844.Please note that..."],"article_contents":["Earlier this week, Bitcoin and the broader cryptocurrency market experienced a “flash crash,” marking the largest three-day sell-off in the past 12 months. Bitcoin (BTC) dropped 14% in 24 hours, and Ethereum (ETH) fell as much as 20% in less than an hour.\nBoth have somewhat recovered, though they’re currently trading lower than a week ago.\nWhat contributed to this? Unlike previous market crashes, this flash crash doesn’t appear to be triggered by a single event. Instead, it was likely a combination of factors.\nThe global economy experienced hysteria on Monday, led by Japan’s stock market, which had its largest drop since 1987.\nThis was likely caused by the recent spike in interest rates on the Japanese Yen, striking fear into carry traders looking to borrow Yen for higher yields elsewhere. The hysteria seemed to be overblown as the Nikkei 225, recovered almost all of its losses the very next day – however we will need more time to understand if there is more turmoil to come into next week.\nWe have also seen rising tensions in the Middle East conflict, which is undoubtedly stoking fears of escalations.\nDid You know?\nOnly 7 altcoins (alternative cryptocurrencies to Bitcoin) in the top 50, have outperformed BTC since the start of 2024.  They are:\nSource – CryptoRank\nThe tightening of the U.S. presidential election race has introduced new uncertainty into the market. Polls show Kamala Harris on a level playing field with Donald Trump.\nThe Democratic Presidential nominee has appointed an ex-Binance adviser to her team and there are credible reports that she is seeking closer ties to the industry. But she has not yet publicly expressed an opinion on cryptocurrency. Meanwhile, Trump has suggested he will make Bitcoin a “strategic reserve” and promised to fire the head of the US Securities and Exchange Commission if he is elected (a promise he would not have the power to keep).\nEither way, the apparent willingness of both candidates to have a relationship with the industry does appear to have reduced the amount of jeopardy around the election.\nDespite recent market turmoil, 2024 has been a landmark year for Bitcoin. The approval and launch of Bitcoin spot ETFs in the United States was monumental. Especially given the strict stance of US regulators on the crypto market. This provided a traditional investment vehicle for institutional investors. The launch did not disappoint, shattering several records, including the biggest ETF launch in history, solidifying a strong institutional appetite for the world’s first and biggest cryptocurrency.\nThe success of the ETFs contributed to Bitcoin’s strong start to the year, with a yearly high return of +69% since January 1st (source: CoinMarketCap), outperforming most other asset classes like the S&P 500, NASDAQ, gold, and oil.\nIn April, Bitcoin went through its fourth halving, a process that reduces the creation of new Bitcoin by 50%. This has historically had a profound impact on the price of Bitcoin as it reduces its inflation rate.\nBitcoin price after every halving. Source Glassnode.\nInterestingly, crypto, and Bitcoin in particular, has been a focal point in this year’s US presidential race. Under the Biden administration, crypto wasn’t viewed favorably, with regulators unleashing several lawsuits against American-based crypto companies. Trump seized on this issue to gain support, even accepting crypto as donations.\nSince Biden pulled out of the presidential race, likely replacement and current Vice President Kamala Harris has made strides to take a friendlier approach to the crypto industry. She has engaged with industry representatives from Coinbase, Ripple, and Circle and democratic supports recently launched the “Crypto for Harris” campaign to counter Trump’s industry appeal.\nThough Trump has a strong head start in attracting crypto voters, Harris appears to be softening the Democrat’s position on crypto.\nRecent volatility earlier in the week may have done enough to spook investors for some time but from a fundamental point of view, Bitcoin adoption has never been stronger.\nWith increasing investment from the retail and institutional market, and growing adoption by federal and state governments worldwide, Bitcoin continues to go from strength to strength.\nHowever, explosive growth like we’ve seen in the past will likely depend on a strengthening economy. “Risk on” assets like Bitcoin and cryptocurrencies benefit from easing monetary policies, often when interest rates are low, and people are spending more freely.\nEconomic forecasts suggest that interest rate reductions in the US may occur as early as next month. Lower interest rates can stimulate economic activity and investment, potentially providing a favorable environment for Bitcoin’s growth.\nWhile Bitcoin faces short-term challenges due to global economic and political uncertainties, its long-term outlook remains positive. Increased adoption, regulatory advancements, and its growing role as a mainstream investment asset bode well for its future.\nDisclaimer: The information provided by Swyftx is for general educational purposes only and should not be taken as investment advice, personal recommendation, or an offer of, or solicitation to, buy or sell any assets. It has been prepared without regard to any particular investment objectives or financial situation and does not purport to cover any legal or regulatory requirements. Customers are encouraged to do their own independent research and seek professional advice. Swyftx makes no representation and assumes no liability as to the accuracy or completeness of the content. Any references to past performance are not, and should not be taken as a reliable indicator of future results. Make sure you understand the risks involved in trading before committing any capital. Never risk more than you are prepared to lose. Consider our Terms of Use and Risk Disclosure Statement for more details.",null]}
{"date":"2024-08-09","titles":["Gold Rises Amid Geopolitical Tensions, Euro Unchanged; BTC Soars on ETF Inflows"],"urls":["https:\/\/www.investing.com\/analysis\/gold-rises-amid-geopolitical-tensions-euro-unchanged-btc-soars-on-etf-inflows-200650815"],"sources":["investing.com"],"descriptions":["Market Overview Analysis by Octa covering: EUR\/USD, XAU\/USD, US Dollar Index Futures, Gold Futures. Read Octa's latest article on Investing.com"],"article_contents":[null]}
{"date":"2024-08-12","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-08-13","titles":["HIVE Announces Quarterly Revenue of $32.2 Million, Adjusted EBITDA of $14.9 Million with an Increase in Bitcoin Holdings to 2,496 Bitcoin, 449 Bitcoin Mined and HPC Expansion By Investing.com"],"urls":["https:\/\/www.investing.com\/news\/press-releases\/hive-announces-quarterly-revenue-of-322-million-adjusted-ebitda-of-149-million-with-an-increase-in-bitcoin-holdings-to-2496-bitcoin-449-bitcoin-mined-and-hpc-expansion-93CH-3568093"],"sources":["investing.com"],"descriptions":["HIVE Announces Quarterly Revenue of $32.2 Million, Adjusted EBITDA of $14.9 Million with an Increase in Bitcoin Holdings to 2,496 Bitcoin, 449 Bitcoin Mined and..."],"article_contents":[null]}
{"date":"2024-08-14","titles":["Think Bitcoin Is Volatile? These Crypto-Related Stocks May Witness More Significant Price Swings Than BTC In The Days Ahead - Coinbase Glb (NASDAQ:COIN)","Bitcoin ETFs See $19,000,000,000 in Net Flows As BlackRock Becomes Third-Largest BTC Holder: Bloomberg Analyst","BTC: A Future Top 3 Bitcoin ETF (NYSEARCA:BTC)"],"urls":["https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/08\/40363772\/think-bitcoin-is-volatile-these-crypto-related-stocks-may-witness-more-significant-price-s","https:\/\/dailyhodl.com\/2024\/08\/14\/bitcoin-etfs-see-19000000000-in-net-flows-as-blackrock-becomes-third-largest-btc-holder-bloomberg-analyst\/","https:\/\/seekingalpha.com\/article\/4714347-btc-future-top-3-bitcoin-etf"],"sources":["benzinga.com","dailyhodl.com","seekingalpha.com"],"descriptions":["Over the years, cryptocurrencies, including Bitcoin (CRYPTO: BTC), have earned the reputation of being one of the most volatile asset classes in the market.","Spot Bitcoin (BTC) exchange-traded funds have witnessed more than $19.3 billion of net inflows this year, according to Eric Balchunas, a Bloomberg ETF analyst.","The SEC approved the first 11 Bitcoin Spot ETFs for trading. Read why BTC ETF is expected to potentially become the third or fourth-largest Bitcoin ETF by AUM."],"article_contents":["Benzinga Rankings give you vital metrics on any stock – anytime.\nOver the years, cryptocurrencies, including Bitcoin BTC\/USD, have earned the reputation of being one of the most volatile asset classes in the market.\nInterestingly, publicly traded companies that are directly or indirectly tied to cryptocurrencies were experiencing higher volatility than Bitcoin and were expected to record more substantial price swings than the leading currency in the coming days.\nWhat Happened: MicroStrategy Inc. MSTR, known for its vast Bitcoin stockpile, recorded a 30-day implied volatility (IV) of 81% at Tuesday's market close, according to Fintel.\nSimilarly, America's biggest cryptocurrency exchange Coinbase Global Inc. COIN registered an implied volatility of 68%, while the stock of the world's biggest Bitcoin mining company, Marathon Digital Holdings Inc. MARA, showed a reading of 85%.\nIn comparison, Bitcoin’s 30-day implied volatility was 55% as of this writing, according to the charting platform, TradingView. King Crypto's volatility forecast has dropped significantly since yearly highs of 82% in March.\nFor context, implied volatility is a forward-looking measure of volatility used by options traders. It is used to determine the expected price fluctuations of a stock over a specific period.\n.See Also: Elizabeth Warren’s Pro-Bitcoin Rival John Deaton Calls Out Her Campaign for Labeling Him A Recruit: ‘She’s Worried For A Reason…’\nWhy It Matters: The marked difference in projected volatility came amid Bitcoin’s months-long sideways movement following its all-time high in early March. With the exception of a few market downtrends, King Crypto has generally drifted between $62,000 and $72,000.\nThe projection of higher volatility for the aforementioned stocks mirrors a similar forecast for AI chip-making giant NVIDIA Corp. NVDA. At Tuesday's market close, the tech powerhouse recorded an implied volatility of 66%, higher than Bitcoin.\nPrice Action: At the time of writing, Bitcoin was exchanging hands at $61,076.15, up 3.14% in the last 24 hours, according to data from Benzinga Pro. Shares of MicroStrategy closed 2.98% higher at $135.38 after Tuesday’s regular trading session. Coinbase ended 3.23% up at $197.94, while Marathon Digital popped 2.51% to $15.49.\nPhoto Courtesy: Gerd Altmann from Pixabay\nRead Next:\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.","Spot Bitcoin (BTC) exchange-traded funds have witnessed more than $19.3 billion of net inflows this year, according to Eric Balchunas, a Bloomberg ETF analyst.\nBalchunas tells his 319,100 followers on the social media platform X that the number is “surprisingly strong” and argues that it is the most important bellwether of success given Grayscale’s GBTC unlock and net price movement.\nBalchunas also notes US ETFs are on pace to pace Satoshi Nakamoto, Bitcoin’s pseudonymous creator, as the top holders of BTC.\n“BlackRock alone is already #3 and on pace to be #1 late next year, and will likely stay there for a very long time.”\nThe Bloomberg analyst also argues that ETF holders offer the top crypto asset some stability in the face of volatility.\n“So IBIT investors woke up on Monday to a -14% move over the weekend after stomaching an 8% decline the week prior and what did they do? ABSOLUTELY NOTHING. $0 flows. Compared to some of these degens these boomers are like the Rock of Gibraltar. You guys are so lucky to have them.”\nIBIT is BlackRock’s iShares Bitcoin Trust.\nBTC is trading at $60,719 at time of writing. The top-ranked crypto asset by market cap is up more than 1.5% in the past 24 hours and more than 8% in the past week.\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl",null]}
{"date":"2024-08-15","titles":["Capula, Schonfeld, Point72 among hedge funds riding Bitcoin ETFs: Report","More Hedge Funds Buy Bitcoin ETFs as Institutional Demand Grows"],"urls":["https:\/\/www.business-standard.com\/markets\/cryptocurrency\/capula-schonfeld-point72-among-hedge-funds-riding-bitcoin-etfs-report-124081500928_1.html","https:\/\/financialpost.com\/pmn\/business-pmn\/more-hedge-funds-buy-bitcoin-etfs-as-institutional-demand-grows"],"sources":["business-standard.com","financialpost.com"],"descriptions":["Among the most well-known buyers that have emerged are hedge funds like Millennium Management, which held shares in at least five Bitcoin ETFs","Hedge funds, pensions and banks continued to lavish capital into exchange-traded funds that invest directly in Bitcoin, as more traditional investors embrace th..."],"article_contents":[null,"(Bloomberg) — Hedge funds, pensions and banks continued to lavish capital into exchange-traded funds that invest directly in Bitcoin, as more traditional investors embrace the asset class that US regulators begrudgingly helped push into the mainstream at the beginning of the year.\nAmong the most well-known buyers that have emerged are hedge funds like Millennium Management, which held shares in at least five Bitcoin ETFs, according to a Bloomberg analysis of second-quarter filings with the US Securities and Exchange Commission. The firm, which has $68 billion in assets under management, trimmed its stakes in the ETFs significantly from the prior quarter but remained as the top holder for most of the funds, including BlackRock’s iShares Bitcoin Trust (ticker IBIT).\nCapula Investment Management, Schonfeld Strategic Advisors and Steven Cohen’s Point72 Asset Management also reported stakes in the ETFs. Other buyers ranged from the State of Wisconsin Investment Board to market makers among firms crossing geographies from Hong Kong to the Cayman Islands, Canada and Switzerland.\nGet the latest headlines, breaking news and columns.\nBy signing up you consent to receive the above newsletter from Postmedia Network Inc.\nA welcome email is on its way. If you don't see it, please check your junk folder.\nThe next issue of Top Stories will soon be in your inbox.\nWe encountered an issue signing you up. Please try again\nInterested in more newsletters? Browse here.\nThere were 701 new funds reporting spot-Bitcoin ETF holdings following Wednesday’s deadline to file second-quarter 13F reports with the SEC, data compiled by Bloomberg show, bringing the total number of holders to almost 1,950. Millennium, Capula, Schonfeld, SWIB and Point72 declined to comment.\nThe spot-Bitcoin ETFs that debuted in January have smashed expectations in terms of flows and assets. In all, the cohort, including newer entrants, has attracted a net inflow of $17 billion this year, with BlackRock’s IBIT swelling into a $20 billion behemoth. The existence of such ETFs has given everyday investors an easier way to trade in and out of Bitcoin.\nThe increase in the number of holders is especially encouraging given the poor price performance — Bitcoin slid by nearly 13% in the quarter — and the fact that not many financial advisers are allowed to recommend the ETFs to their clients, according to Noelle Acheson, author of the Crypto Is Macro Now newsletter.\n“This reflects a mix of conviction and investors taking time to ‘do the work,’” she said. “So far, Morgan Stanley is the only one of the large wirehouses whose financial advisers can recommend BTC spot ETF diversification positions. But others will follow, bringing not just more demand but also a longer-term view.”\nIn July, spot-Ether ETFs were also approved. The group has seen inflows of $1.9 billion, a figure that excludes $2.3 billion in outflows from the Grayscale Ethereum Trust (ETHE) which converted to an ETF last month, data compiled by Bloomberg show.\nThe 13F filings, reported every quarter by qualified institutional investment firms, only represent a snapshot in time and it’s impossible to know without confirmation why money managers were holding the ETFs. It’s likely that not all of them are Bitcoin bulls. Some may have opened positions as part of a trade meant to profit from the cryptocurrency’s volatility or offset a short position in derivatives. Others may have bought the ETFs as part of a basis trade, a popular strategy which exploits differences in prices between spot and futures markets, without the inconvenience of dealing with Bitcoin directly.\nAmong the buyers in the second quarter was hedge fund Hunting Hill Global Capital, which reported holdings of IBIT shares. The firm has been involved in the cryptocurrency space since 2016, according to Adam Guren, its founder and chief investment officer.\n“One of our trading strategies involves providing liquidity within the ETF ecosystem,” he said. “Given the current political tailwinds, we anticipate the introduction of more products in the US, including options on Bitcoin ETFs, Solana ETFs, and potentially others. This expansion would create further opportunities for our trading strategies.”\n—With assistance from Denise Cochran and Matt Mancuso.\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information.\nThis website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Use and Privacy Policy.\nYou can manage saved articles in your account.\nand save up to 100 articles!\nYou can manage your saved articles in your account and clicking the X located at the bottom right of the article."]}
{"date":"2024-08-16","titles":["Becoming Bitcoiner: Understanding Blockchain Technology And Metcalfe's Law (NYSEARCA:BTC)"],"urls":["https:\/\/seekingalpha.com\/article\/4715110-becoming-bitcoiner-understanding-blockchain-technology-metcalfes-law-crypto"],"sources":["seekingalpha.com"],"descriptions":["Bitcoin becomes more valuable as more participants join the network, as this increases its security and utility. Click here for a detailed analysis."],"article_contents":[null]}
{"date":"2024-08-19","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-08-20","titles":["$1,000,000 BTC in 2027? Analyst Says Bitcoin Could Be Mirroring Japanese Stock Market’s Early Years"],"urls":["https:\/\/dailyhodl.com\/2024\/08\/20\/1000000-btc-in-2027-analyst-says-bitcoin-could-be-mirroring-japanese-stock-markets-early-years\/"],"sources":["dailyhodl.com"],"descriptions":["Bitcoin's (BTC) chart appears to be mirroring a Japanese stock market index, according to one popular crypto analyst."],"article_contents":["Bitcoin’s (BTC) chart appears to be mirroring a Japanese stock market index, according to one popular crypto analyst.\nThe pseudonymous trader known as TechDev shares charts with his 465,800 followers on the social media platform X comparing BTC to the Nikkei 225, a price-weighted index that tracks 225 blue-chip companies trading on the Tokyo Stock Exchange.\n“Haven’t seen much else like it.\nLog growth cycles have existed well before Bitcoin. Different assets. Different decades. Same species. Without looking at time or price, most would think the first half of the Nikkei’s chart is Bitcoin’s. It must have had a halving every 10 years…\nBitcoin’s latest leg consistently shows more volatility, but the trend doesn’t care.”\nTechDev’s chart suggests Bitcoin could crack $1 million in 2027 before correcting sharply. The top-ranked crypto asset by market cap is trading at $60,492 at time of writing.\nThe analyst also shares a chart comparing BTC to the Nasdaq.\n“Confluence for a longer macro leg than many expect. Back at new highs.”\nEarlier this month, TechDev noted in a newsletter that he was optimistic about the recent downturn in the crypto market.\n“Obviously, there is extreme fear in the market. The last two weeks were filled with ‘told you’ comments from doomer bears – on a retest to $48,000 levels they previously said would never be reached the last time they were doom-posting at $25,000.\nExactly what I like to see. The fact that it came at a time when global macro conditions are pointing up makes it nothing more than two weeks of loud noise to me. More like the last six months.\nIt’s usually the case in all speculative markets, but the last two years have reflected this more than any other time in the crypto market – it doesn’t move up until X is scared absolutely shitless. That was the case at $15,000 after the FTX crash, at $20,000 after regional banks were failing, at $38,000 after the brutal post-ETF wick, and now.\nWhat you’ll also recall is how much sentiment can whiplash in a couple of weeks. Expecting it again. All the while, the global cycle continues to point higher.”\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-08-21","titles":["Long-Term Bitcoin Holders Likely Ramping Up Conviction on BTC Positions: Glassnode","Coinbase: The Growth Of Bitcoin Is Inevitable - How To Invest (NASDAQ:COIN)"],"urls":["https:\/\/dailyhodl.com\/2024\/08\/21\/long-term-bitcoin-holders-likely-ramping-up-conviction-on-btc-positions-glassnode\/","https:\/\/seekingalpha.com\/article\/4716133-coinbase-the-growth-of-bitcoin-is-inevitable-how-to-invest"],"sources":["dailyhodl.com","seekingalpha.com"],"descriptions":["Long-term Bitcoin (BTC) holders seem to be doubling down on their bullish sentiment for the crypto king, according to blockchain analytics platform Glassnode.","Coinbase is thriving in the crypto market, with a solid cash balance and growing subscription revenue, despite widespread skepticism. Read my COIN thesis here."],"article_contents":["Long-term Bitcoin (BTC) holders seem to be doubling down on their bullish sentiment for the crypto king, according to blockchain analytics platform Glassnode.\nIn a new analysis, Glassnode reports that Long-Term Holders (LTH), or addresses that hold coins for at least 155 days, do not appear phased by the recent market volatility and are adding more Bitcoin to their wallets.\n“Despite challenging and choppy market conditions, Long-term Bitcoin holders remain remarkably steadfast in their conviction, with evidence they are ramping up accumulation behavior.”\nGlassnode says that the unwillingness of long-term holders to sell their coins despite Bitcoin’s recent drop to $48,000 earlier this month is a sign that investors are weathering the storm and expecting new all-time highs for  BTC.\n“An elevated percentage of Bitcoin network wealth is held by this investor cohort relative to previous cycle ATH breaks, which suggests there is a degree of investor patience on display, and waiting for higher prices. Additionally, the lack of panic selling amongst this cohort in lieu of the largest price contraction of the cycle highlights a resilience of their aggregate conviction.”\nGlassnode also says that since June, more than $22.176 billion worth of BTC has moved into the hands of long-term holders.\n“This cohort has now returned to a preference for HODLing (holding on for dear life), with a total volume of +374,000 BTC migrating into LTH status over the last three months.”\nBitcoin is trading for $59,336 at time of writing, down 2.55% in the last 24 hours.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl",null]}
{"date":"2024-08-22","titles":["Blackrock ETF Demonstrates How Institutional Products Improve Crypto’s Stability"],"urls":["https:\/\/www.forbes.com\/sites\/lawrencewintermeyer\/2024\/08\/22\/blackrock-etf-demonstrates-how-institutional-products-improve-cryptos-stability\/"],"sources":["forbes.com"],"descriptions":["As global stock markets and bitcoin prices suffered a short-lived flash crash in August, crypto ETF flows highlight how institutional products have built-in sta..."],"article_contents":["ByLawrence Wintermeyer\nByLawrence Wintermeyer,\nContributor.\nNEW YORK, NEW YORK - JANUARY 11: The Nasdaq board in Times Square displays a message as Bitcoin Spot ... More ETF's are launched on the Nasdaq Exchange on January 11, 2024 in New York City. The trading of several exchange-traded funds (ETFs) tied to the milestone for the cryptocurrency industry that has been seeking regulatory approval for the financial product for over a decade.(Photo by Stephanie Keith\/Getty Images)\nGlobal stock markets saw a rapid decline in the first week of August as the Bank of Japan raised rates a modest 15 basis points with many U.S. firms selling off Japanese equities amidst mounting concerns for the carry trade - borrowing at low rates to fund investments. The Japanese stock market, the Nikkei 225, plunged more than 12 percent to levels not seen since Black Monday in 1987.\nThe panic sparked a sell off of U.S. stocks on all major indices of 2.5 percent and crypto followed with bitcoin falling 17 percent to below $50,0000. With highly correlated markets, bitcoin’s status as “digital gold” was questioned, as gold recorded a 1 percent drop over the period. Losses in most U.S. and crypto markets were pared within 24 hours and back to previous levels by beginning of the following week.\nInvestors of the iShares Bitcoin Trust Fund (IBIT), Blackrock’s $19 billion spot bitcoin ETF, endured the sell off. Data from Farside Investors reported that IBIT did not see outflows, even on August 5 when BTC’s price dropped, and saw greater inflows within the following two days as investor bought the dip. Notably, other spot BTC ETFs, with the exception GBTC, also fared well, achieving inflows following the short lived flash crash.\nBitcoin ETF Flow USD Millions\nThese recent flows highlight how institutional products like ETFs have a degree of built-in stability, which can reduce bitcoin volatility, and signal more of a longer-term investment strategy.\nAs Shibtoshi, the CEO of SquidGrow, a platform advancing private cross-chain aggregators such as SilentSwap, notes, \"ETFs carry inherent risks, including the potential for excessive asset consolidation, which can undermine decentralization, along with other issues typically associated with centralized products. However, their performance during the recent market volatility highlights that those who invest in (crypto) ETFs exhibit a level of resilience that is crucial for the maturation of cryptocurrency markets.\"\nShibtoshi also attributes this resilience to the nature of the investors predominantly involved in ETFs. Unlike speculative traders or newcomers, many are more seasoned investors that bring decades of experience navigating volatile market conditions. Their approach to trading and investment is characterized by rational decision-making and a focus on long-term strategies, rather short-term strategies, or emotions.\nIt has become popular to publish SEC 13F filings that disclose institutional firms' investments in crypto ETFs, the major force driving volume.\nThe role of Ethereum ETFs in catalyzing institutional adoption is also now also garnering market attention, and with many of the same principles and insights that apply to BTC ETFs. Attracting mainstream investors who shy away from volatile investments is at the center of the strategy to drive mass adoption. Bitcoin’s average volatility has been around 46 percent over the past decade, and has dropped to roughly 35 percent over the past year, a significant decrease, but still significantly above U.S. equities.\nAccording to Serhii Kravchenko, the CEO of DeXe, an AI launchpad for creating and governing DAOs and Memecoins, with a TVL of over $480 million, “While bitcoin is still a risk-on asset, it’s increasingly getting at par with mainstream instruments like tech stocks. Spot ETFs and the institutional adoption they bring are some of the key enabling factors in this regard.”\nAdding another dimension to this trend, Pontem Network CEO Alejo Pinto emphasized that institutional products and adoption initiate a positive feedback loop adding, “On the one hand, more institutional demand raises the overall quality standard for builders and projects to meet. In this sense they bring positive competition into the market. On the other hand, more decentralized crypto-native products emerge to offset the rise of centralized institutional products and instruments, making the industry more versatile as a whole.”\nThe demand for ETFs is underpinning the case for crypto, despite volatility. ETF holders are raising the industry’s time preference, which can serve as a key metric to instill confidence in those who are still waiting on the sideline. It also helps to demonstrate the case for crypto to policymakers and regulators who tend to view crypto as a speculative casino-like asset class.\nLike bitcoin and Ether, AI ETFs have also evolved steadily over the past year. According to data from ETF Central, the aggregated value of 13 AI ETFs has surged to over 10 percent YTD and 25 percent since August 2023. Their current AUM is $2.91 billion, with roughly $1.6 billion of daily inflows.\nAggregate Data of 13 Funds\nOwlto Finance Co-founder, Krystal Zhang, argues that the parallel rise of AI ETFs is a big macro development for crypto and blockchain stating, “Spot BTC and ETH ETFs have brought lots of mainstream attention to the industry. To capitalize on this influx fully, it’s important to deliver a frictionless, scalable, and intuitive UX, so that incoming Web2 users get what they expect. Leveraging AI advancements with cutting-edge blockchain innovation is the way to achieve this much-needed UX boost.”\nWhile there have been many mostly futile AI versus Crypto debates in the past, there’s a growing consensus regarding the mutually beneficial nature of these technologies. Crypto and blockchain projects are implementing AI for more functionality and efficiency, especially around access and analytics. Owlto Finance is a platform that enables users to transfer assets across more than 45 blockchains with over 2 million users in over 200 countries and regions, a great GenAI Small Language Models (SLMs) use case.\nRock Zhang, the Founder of the DePIN-EdgeAI synergy project Network3, which recently launched its physical dual mining machine N3 Edge V1, weighed in on this topic. As he sees it, using blockchain and cryptography to decentralize AI computations, data storage, etc., could play an important role in extricating AI, a potentially world-changing technology, from Big Tech’s seeming dominance and control.\nSays Zhang, “Like blockchain and crypto, AI is a tool for community empowerment. They must come together for the potential of decentralized intelligence, which is crucial as we move toward a more interconnected and data-driven world. By processing data closer to the source, Edge AI not only accelerates decision-making but also enhances security and efficiency.”\nCrypto ETFs have presented themselves as a force that are driving the mass adoption of cryptoassets. Many current projects are working to tap into this success and it’s likely that we will see more mainstream products to come. It’s important that innovators and industry stakeholders keep up a competitive and vigilant outlook and not get distracted by frenzy and hype, like we are witnessing with GenAI.\nThe future lies in a greater network of more projects deploying these still relatively nascent and quickly maturing technologies like DLT, digital assets, and AI, to demonstrate the use case for digital and Web3. These new digital technologies have important jobs to do, old and new, transforming markets, industries, and sectors, and ultimately the next generation of society.\nIt’s a rather exciting times in the digital space race, especially for the financial services sector. In the future, we will likely look back at this epoch of the bitcoin ETF as the pivotal milestone that drove the mass adoption of new global digital finance."]}
{"date":"2024-08-23","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-08-26","titles":["Risk Appetite Returning to Crypto Markets Following Mass Liquidations and Deleveraging: Bitfinex"],"urls":["https:\/\/dailyhodl.com\/2024\/08\/26\/risk-appetite-returning-to-crypto-markets-following-mass-liquidations-and-deleveraging-bitfinex\/"],"sources":["dailyhodl.com"],"descriptions":["One leading crypto exchange says that consumers are showing a higher tolerance for risky assets like cryptocurrencies."],"article_contents":["Research from crypto exchange Bitfinex says that appetite for risk assets is heating up once again.\nIn its latest research report, Bitfinex says that Bitcoin (BTC) is showing a stronger correlation with US equities, indicating a return of risk-on sentiment in crypto.\nBitfinex also says that the significant amount of liquidations that occurred during the recent correction has likely reset the market into more favorable territory.\n“The rally occurred amidst a backdrop of increasing positive correlation between Bitcoin and US equities. Until now, Bitcoin has shown relative weakness compared to equities since hitting its early August low. Friday’s price surge also saw a sharp increase in correlation, which we believe indicates a return of risk appetite to the market.\nAdded to this are the significant short liquidations seen on August 23rd, with $40 million in BTC perpetual futures liquidations and $140 million across all pairs. This comes as there has been a substantial drop in open interest, suggesting reduced leverage in the market.”\nThe newsletter points out how BTC reacted positively to US Federal Reserve Chair Jerome Powell’s comments suggesting potential rate cuts, leaping to $65,000 earlier this week.\n“This shows that despite an increase in risk appetite across risk assets, the amount of market participants leveraged long across all assets has decreased significantly which potentially increases the room for prices to move higher, for both BTC and altcoins.”\nAccording to Bitfinex, it is normal for higher-risk assets like crypto to react later than less-volatile assets, such as US equities, implying that BTC could print a delayed rally following the stock markets recent strength.\n“It is a common occurrence that higher volatility assets move later as compared to lower volatility assets, in this case, equities. Our previous edition of Bitfinex Alpha covered how BTC is trading well within the trajectory of past bull markets.\nThe market is clearly exhibiting a risk-on sentiment, encouraged by the apparent imminence of rate cuts, and the current lack of overhang, given the complete distribution of seized bitcoins by German law enforcement, while the Mt. Gox distribution is almost complete.”\nBTC is worth $63,598 at time of writing, up 9% over the last week.\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-08-27","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-08-28","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-08-29","titles":["Is Crypto Worth the Hype?"],"urls":["https:\/\/medium.com\/@isreal_51123\/is-crypto-worth-the-hype-d9ac7d312417"],"sources":["medium.com"],"descriptions":["From capturing headlines with tales of overnight millionaires to fueling debates about the future of finance, cryptocurrency has become a cultural phenomenon. I..."],"article_contents":["Sign in\nSign in\nUPay Technology Ltd\nFollow\n--\nFrom capturing headlines with tales of overnight millionaires to fueling debates about the future of finance, cryptocurrency has become a cultural phenomenon. Its potential for disruptive innovation and revolutionary returns has ignited a firestorm of interest. But is crypto worth the hype?\nBehind the hype lies a complex and often volatile digital asset class. This article delves into the world of cryptocurrency, separating fact from fiction. We'll explore cryptocurrencies' potential benefits and risks and help you decide whether they deserve a place in your investment strategy.\nCryptocurrency is a type of digital money that uses special codes to keep transactions secure. It works through blockchain technology, which records all transactions in a decentralized way.\nThe most famous cryptocurrency is Bitcoin, but others like Ethereum, Ripple, and Litecoin exist. These digital currencies can be used to buy goods or services online.\nAs the popularity of cryptocurrencies grows, it's essential to understand how they work and the different options available in the market.\nInvesting in major cryptocurrencies like Bitcoin and Ethereum involves understanding their historical performance highlighting potential returns and risks.\nLaunched in 2009 by an individual or group using the pseudonym Satoshi Nakamoto, Bitcoin has become the most recognized cryptocurrency. Initially worth mere cents, it reached $1 in 2011 and experienced its first significant peak at $29.81 the same year before retracting to $5.\nThe journey continued with notable volatility: in 2013, Bitcoin's value shot to $200, then surged to over $1,000 later that year. 2017 marked a monumental rise, starting at around $1,000 and escalating to just below $20,000, spurred by increasing mainstream acceptance and an initial coin offering (ICO) boom.\nFollowing this spike, Bitcoin entered a prolonged slump, hitting a low near $6,612 in December 2019.\n2020 and 2021 saw a significant rebound, with values peaking above $64,000 and then nearly $69,000, driven by heightened interest during the pandemic.\nRecently, Bitcoin faced corrections influenced by regulatory crackdowns and economic factors, yet it remains a pivotal asset, often dubbed \"digital gold\" for its value-storing capability.\nEthereum emerged in 2015 and was developed by Vitalik Buterin and his team. Starting at approximately $0.74, it grew steadily, reaching around $10 by the end of 2016.\nThe real surge came in 2017 when it climbed to over $1,400 by early 2018, fueled by the popularity of Ethereum-based ICOs. However, it wasn't immune to the \"crypto winter,\" falling below $100 at times but somewhat recovering to the $200-$300 range by 2020.\nThe subsequent rise in decentralized finance (DeFi), primarily based on Ethereum's network, propelled its price to over $4,300 in 2021.\nEthereum's capability to support smart contracts and decentralized applications (dApps) extends its utility beyond mere currency, which continues to underpin its value despite recent market adjustments.\nOngoing network upgrades aimed at improving scalability and efficiency offer potential future enhancements to Ethereum's performance and value.\nBitcoin and Ethereum exhibit extreme volatility, with prices capable of significant fluctuations over short periods.\nThis reflects the speculative nature of cryptocurrencies and their sensitivity to technological advancements, regulatory news, and macroeconomic trends. While both have impressive long-term growth, the market remains high-risk, especially for short-term trading.\nTiming market entry and exit is crucial and can significantly affect investment outcomes.\nFor those looking to invest, it may be wise to consider the unique attributes of each—Bitcoin as a value store and Ethereum as a utility platform. Diversifying between them could help balance potential returns against risks.\nHowever, prospective investors should ideally perform thorough research or seek advice from financial professionals to understand how cryptocurrency investments might fit into their broader economic strategy, given the substantial risks and potential rewards involved.\nCrypto is exciting for a bunch of reasons: It changes the game of how we think about and use money. It does this using blockchain technology, which makes transactions open for everyone to see, super secure, and permanent.\nThe prices of cryptocurrencies can jump up and down a lot, which can be risky but also pretty thrilling for people who like to take chances on making money. This up-and-down movement is part of what draws people to crypto.\nThe community part is significant, too. People in crypto are all about sharing ideas, creating new stuff, and helping each other. It's not just about cash; it's about being on the cutting edge and making a difference together.\nCrypto also offers a different take on money, not controlled by big banks or governments. This idea hits home for people tired of the same old financial systems and who want something more fair and open to everyone.\nBut diving into crypto has its challenges. There are a lot of complicated bits to understand, including laws that aren't entirely clear yet and the risk of losing money. Getting into crypto means being ready for a rollercoaster and being smart about the risks.\nSeveral factors contribute to the hype surrounding cryptocurrencies, driving interest and investment from individuals and institutions alike.\nCryptocurrencies have garnered attention for their potential to deliver high returns on investment. Early adopters of Bitcoin and other digital assets have witnessed significant price appreciation, leading to a speculative frenzy in the market. The allure of quick profits has attracted both seasoned investors and newcomers seeking to capitalize on the volatile nature of the crypto market.\nThe concept of decentralization lies at the heart of cryptocurrencies, offering users greater autonomy and control over their finances.\nUnlike traditional financial systems, centralized and governed by banks or governments, cryptocurrencies operate on decentralized networks powered by blockchain technology.\nThis decentralized structure eliminates the need for intermediaries, such as banks or payment processors, and empowers individuals to transact directly with one another, fostering financial inclusion and sovereignty.\nCryptocurrencies represent a paradigm shift in finance driven by technological innovation and disruption. Blockchain technology, the underlying foundation of cryptocurrencies, enables secure and transparent peer-to-peer transactions without intermediaries.\nBeyond digital currencies, blockchain has the potential to revolutionize various industries, including supply chain management, healthcare, and voting systems, by providing immutable records and enhancing transparency, efficiency, and security.\nMedia coverage and celebrity endorsements have played a significant role in amplifying the hype surrounding cryptocurrencies.\nHigh-profile endorsements from celebrities, influencers, and prominent figures in the financial industry have contributed to mainstream awareness and adoption of digital assets.\nMedia outlets often report on the latest developments in the crypto market, generating excitement and speculation among investors and the general public.\nThe crypto craze that has taken over the world has resulted in a lot of disagreement on the actual value of cryptocurrency.\nSome believe that cryptocurrencies are the way to the future of finance, while others still do not believe in it, pointing out the problems with volatility, regulatory issues, and security.\nThose advocating for cryptocurrency point out that blockchain technology can transform the industry by providing fast and efficient transactions, financial inclusion, and decentralized systems.\nFurthermore, as institutional investors and mainstream businesses increasingly accept cryptocurrencies, there is growing optimism about their future.\nIn the final analysis, the value of cryptocurrency hype is purely subjective and hinges on the risk appetite and objectives of the investor.\nFor some, it is a high-risk, high-reward chance, while some may opt for more traditional investment routes with stability and regulatory control.\nWhen discussing investments, research and careful analysis of the risks and benefits are crucial for making informed decisions in the cryptocurrency ecosystem.\nDeciding to invest in cryptocurrency is a personal choice with its own risks and opportunities. Here's a straightforward look at what you should consider before jumping in:\nCrypto is known for its rollercoaster-like price fluctuations. While some people have made significant profits, others have faced hefty losses. It's like gambling; you could hit the jackpot or walk away empty-handed. Make sure you're okay with the risk, and never invest more than you can afford to lose.\nBefore investing, get to know the crypto world. Understand what drives prices up or down, learn about different cryptocurrencies, and stay updated with market trends. It's like studying for a test; the more you know, the better you'll do.\nIf you decide to invest, think about how to keep your crypto safe. Use reputable exchanges, enable robust security features like two-factor authentication, and consider storing your crypto in a secure wallet. It's like locking your valuables in a safe instead of opening them.\nThink about your investment goals. Are you looking for a quick profit or in it for the long haul? Crypto can be unpredictable in the short term but has shown significant growth over time for those who are patient.\nThe legal landscape for crypto is still evolving. Taxes, regulations, and laws can affect your investment, so staying informed is essential. It's like driving; you need to know the rules of the road to avoid getting into trouble.\nDon't put all your eggs in one basket. Crypto should only be a part of your overall investment strategy. Spreading your investments across different assets can reduce risk and increase your chances of a positive return.\nFor every crypto enthusiast, there's a skeptic. Listen to both positive and negative opinions to get a balanced view. It's like getting a second opinion before making a big decision.\nFinally, remember that investing in crypto isn't suitable for everyone. Your financial situation, risk tolerance, and investment goals are critical factors in deciding whether it's right for you. It's a personal decision, like choosing a diet or exercise plan; what works for one person might not work for another.\nNow, if you choose to invest in cryptocurrency, you should know that it offers a unique set of advantages that has drawn attention from investors around the globe. Here’s a look at some of the key benefits:\nOne of the most enticing aspects of crypto is the potential for significant returns. Some cryptos have seen astronomical gains over a short period, far outpacing traditional investments like stocks and bonds. It's the thrill of finding a hidden gem that could turn a modest investment into a small fortune.\nCrypto markets operate 24\/7, allowing you to trade any time of day or night anywhere. All you need is an internet connection. This level of accessibility removes many of the barriers to entry found in traditional financial markets, making investment opportunities available to a broader audience.\nAdding cryptocurrency to your investment portfolio can offer diversification. Because crypto often behaves differently than traditional financial assets, it can provide a hedge against market downturns in other areas of your portfolio, potentially reducing overall risk.\nInvesting in crypto puts you at the forefront of technological innovation. Blockchain technology, which underpins most cryptocurrencies, is being explored for applications far beyond digital currencies, including supply chain management, healthcare, and finance. Investing in crypto gives you a stake in this emerging tech landscape.\nCryptocurrencies operate on decentralized networks, reducing the reliance on central banks and traditional financial institutions. This decentralization can offer increased transparency, reduced transaction costs, and resistance to censorship and monetary policy manipulation.\nSome investors view cryptocurrencies, particularly Bitcoin, as a hedge against inflation. Unlike fiat currencies, which governments can print in unlimited quantities, the argument is that cryptocurrencies like Bitcoin have a fixed supply, potentially helping them maintain value as fiat currencies lose purchasing power.\nGetting started with crypto investing can be relatively easy and quick, especially compared to opening accounts with traditional financial institutions. Many platforms allow you to start trading with a small amount of money, lowering the barrier to entry for new investors.\nThe crypto space is filled with a vibrant community of enthusiasts, developers, and investors. Engaging with this community can provide learning opportunities, support, and the chance to be part of a movement looking to redefine the future of finance.\nThe hype around cryptocurrencies comes from their potential to change the way we handle money, alongside the possibility of making significant profits.\nHowever, this comes with challenges such as price swings, regulatory uncertainties, and concerns about their environmental impact. Whether or not cryptocurrencies are worth the hype depends on how individuals view these opportunities and risks.\nThe future of cryptocurrencies is still up in the air, but they continue to be a topic of interest and debate as they grow more integrated into mainstream finance.\nPay Everyday Expenses Easily Via Crypto\nHelp\nStatus\nAbout\nCareers\nPress\nBlog\nPrivacy\nRules\nTerms\nText to speech"]}
{"date":"2024-08-30","titles":["Michael Saylor Weighs in on Bitcoin as BTC Prices Decline By U.Today"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/michael-saylor-weighs-in-on-bitcoin-as-btc-prices-decline-3596010"],"sources":["investing.com"],"descriptions":["Michael Saylor Weighs in on Bitcoin as BTC Prices Decline"],"article_contents":[null]}
