{"date":"2024-01-01","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-01-02","titles":["Coinbase's Potential As The Leading Crypto Exchange In 2024 (NASDAQ:COIN)","Top Cryptos to Watch in 2024 By U.Today"],"urls":["https:\/\/seekingalpha.com\/article\/4660814-coinbases-potential-leading-crypto-exchange-2024","https:\/\/www.investing.com\/news\/cryptocurrency-news\/top-cryptos-to-watch-in-2024-3265161"],"sources":["seekingalpha.com","investing.com"],"descriptions":["Coinbase's potential dominance in 2024 is supported by its position as a custodian for several spot BTC ETFs. Read more to see our analysis on COIN stock.","Top Cryptos to Watch in 2024"],"article_contents":[null,null]}
{"date":"2024-01-03","titles":["Top Cryptocurrencies to Watch in 2024 By U.Today","Top Cryptos to Watch in 2024 By U.Today"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/top-cryptocurrencies-to-watch-in-2024-3265884","https:\/\/www.investing.com\/news\/cryptocurrency-news\/top-cryptos-to-watch-in-2024-3265818"],"sources":["investing.com","investing.com"],"descriptions":["Top Cryptocurrencies to Watch in 2024","Top Cryptos to Watch in 2024"],"article_contents":[null,null]}
{"date":"2024-01-04","titles":["Crypto Price Today: Bitcoin slips below $43,200 ahead of decision on BTC ETF; altcoins tumble up to 12%","Top Cryptocurrencies to Watch in 2024 By U.Today"],"urls":["https:\/\/economictimes.indiatimes.com\/markets\/cryptocurrency\/crypto-prices-today-live-news-bitcoin-dogecoin-ethereum-shibha-inu-cryptocurrency-latest-updates-04-january-2024\/articleshow\/106535273.cms","https:\/\/www.investing.com\/news\/cryptocurrency-news\/top-cryptocurrencies-to-watch-in-2024-3266839"],"sources":["economictimes.indiatimes.com","investing.com"],"descriptions":["Crypto investment services provider Matrixport expects the US SEC to reject all applications to list a spot Bitcoin ETF this month.","Top Cryptocurrencies to Watch in 2024"],"article_contents":["Did you Know?\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors.\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\nStruck by lightning twice, will Cognizant be lucky with its activist-investor this time?\nHousing sales are falling, so are realty stocks. How can investors break the cycle?\nTrump’s embrace of Gandhian swadeshi economics gives India a breather with rival\nDoes it matter if an IT worker puts in 72, 90, or 120 hours a week?\nIs urban India slowing, or is shrinkflation backfiring for companies?\nStock Radar: PNB Housing Finance stocks break out from inverse Head & Shoulder pattern; time to buy?\nWorry not. You’re just a step away.\nIt seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account  and log in again using your ET Prime credentials  to enjoy all member benefits.\nOffer Exclusively For You\nSave up to Rs. 700\/-\nON ET PRIME MEMBERSHIP\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet Flat 40% Off\nThen  ₹ 1749 for 1 year\nOffer Exclusively For You\nET Prime at ₹ 49 for 1 month\nThen  ₹ 1749 for 1 year\nSpecial Offer\nGet flat 40% off on ETPrime\n90 Days Prime access worth Rs999 unlocked for you\nStories you might be interested in",null]}
{"date":"2024-01-05","titles":["Top Cryptocurrencies to Watch in 2024 By U.Today"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/top-cryptocurrencies-to-watch-in-2024-3267817"],"sources":["investing.com"],"descriptions":["Top Cryptocurrencies to Watch in 2024"],"article_contents":[null]}
{"date":"2024-01-08","titles":["Crypto Miner Stock News - HIVE Digital (TSXV: HIVE) (NASDAQ: HIVE) Recaps Calendar Year 2023 Mining 3,260 Bitcoin"],"urls":["https:\/\/www.investorideas.com\/news\/2024\/cryptocurrency\/01081TSXV-HIVE.asp"],"sources":["investorideas.com"],"descriptions":[""],"article_contents":["Vancouver, British Columbia - January 8, 2024 (Newsfile Corp.) (Investorideas.com Newswire) HIVE Digital Technologies Ltd. (TSXV: HIVE) (NASDAQ: HIVE) (FSE: YO0) (the \"Company\" or \"HIVE\") is pleased to announce the summarized unaudited production figures from the Company's global Bitcoin operations for the 2023 calendar year. Production totaled 3,260 Bitcoin mined, and hashrate increased by 100% in the 2023 calendar year, from 2 Exahash per second (\"EH\/s\") at the end of December 2022 to 4 EH\/s at the end of December 2023 (all amounts in US dollars, unless otherwise indicated).\nHIVE has maintained approximately 1% of the global Bitcoin mining network through 2023, mining an average of approximately 9 Bitcoin per day throughout the calendar year of 2023, by maintaining a growing hashrate over the course of the year, that has generally kept pace with the Bitcoin mining network hashrate growth. With the total daily block rewards of the Bitcoin mining network averaging 900 Bitcoin per day, or 328,500 Bitcoin in a calendar year, HIVE earning 3,260 Bitcoin for calendar 2023 is approximately 1% of the Bitcoin mining network.\nThroughout calendar 2023 the Bitcoin mining network continued to attract more efficient ASIC machines to compete for the 900 new Bitcoin mined per day, as HIVE'S network hashrate grew from approximately 2 EH\/s from the beginning of 2023 to approximately 4 EH\/s at the end of 2023. Accordingly, Mining Difficulty1 also increased approximately 100% year over year, from January 1, 2023 to December 31, 2023, as per www.blockchain.com. This is how HIVE maintained approximately 1% of the total Bitcoin rewards mined in calendar 2023.\nHIVE ended the 2023 calendar year with approximately $17 million in cash and a Bitcoin HODL position of 1,704 BTC. As mentioned in the Company's December 19, 2023, news release, the Company's HODL strategy is such that it anticipates to be able to HODL all its Bitcoin until the upcoming Halving which is expected to be in April 2024 after which the number of new Bitcoin mined per day will drop to 450 Bitcoins per day.\nBitmain S19k Pro Update\nHIVE also announces that further to its news releases dated November 14, 2023, and December 4, 2023, all 9,800 of the Bitmain S19k Pro Antminers ordered by the Company have shipped. Currently approximately 70% have been installed, and it is expected that 100% of these machines will be installed before January 2024 month-end. After these miners are installed, it is expected that HIVE will have 4.8 EH\/s of ASICs with an average fleet efficiency of 28.7 J\/TH.\nIn addition, further to its news release dated December 21, 2023, upon the completion of the installation of the 7,000 Bitmain S21 Antminers ordered in December 2023, which will begin in January 2024 and is expected to be completed in June 2024, it is expected that HIVE will have an average fleet efficiency of 25 J\/TH and a total of 5.6 EH\/s of active mining capacity.\nAbout HIVE Digital Technologies Ltd.\nHIVE Digital Technologies Ltd. went public in 2017 as the first cryptocurrency mining company listed for trading on the TSX Venture Exchange with a sustainable green or renewable energy focus. HIVE's electricity is sourced from hydro and geothermal facilities in Sweden, Canada and Iceland.\nHIVE is a growth-oriented technology stock in the emergent blockchain industry. As a company whose shares trade on major stock exchanges, we are building a bridge between the digital currency and blockchain sector and traditional capital markets. HIVE owns green energy-powered data centre facilities in Canada, Sweden, and Iceland, where we endeavour to source green energy to mine digital assets such as Bitcoin on the cloud. Since the beginning of 2021, HIVE has held in secure storage the majority of its treasury of BTC derived from mining rewards. Our shares provide investors with exposure to the operating margins of digital currency mining, as well as a portfolio of Bitcoin. Because HIVE also owns hard assets such as data centers and advanced multi-use servers, we believe our shares offer investors an attractive way to gain exposure to the cryptocurrency space.\nWe encourage you to visit HIVE's YouTube channel here to learn more about HIVE.\nFor more information and to register to HIVE's mailing list, please visit www.HIVEdigitaltechnologies.com. Follow @HIVEDigitalTech on Twitter and subscribe to HIVE's YouTube channel.\nOn Behalf of HIVE Digital Technologies Ltd.\n\"Frank Holmes\" Executive Chairman\nFor further information please contact: Frank Holmes Tel: (604) 664-1078\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.\nForward-Looking Information\nExcept for the statements of historical fact, this news release contains \"forward-looking information\" within the meaning of the applicable Canadian and United States securities legislation and regulations that is based on expectations, estimates and projections as at the date of this news release. \"Forward-Looking information\" in this news release includes but is not limited to: business goals and objectives of the Company; the unaudited results of operations for the 2023 calendar year; the acquisition, deployment and optimization of the mining fleet and equipment, in particular the delivery of the 9,800 Bitmain S19k Pro Antminers the Company has ordered and the delivery and installation of the 7,000 Bitmain S21 Antminers; the volatility of global network mining difficulty; the continued viability of its existing Bitcoin mining operations; and other forward-looking information concerning the intentions, plans and future actions of the parties to the transactions described herein and the terms thereon.\nFactors that could cause actual results to differ materially from those described in such forward-looking information include, but are not limited to, the volatility of the digital currency market; the volatility of global network mining difficulty; the Company's ability to successfully mine digital currency; the Company may not be able to profitably liquidate its current digital currency inventory as required, or at all; a material decline in digital currency prices may have a significant negative impact on the Company's operations; the regulatory environment for cryptocurrency in Canada, the United States and the countries where our mining facilities are located; economic dependence on regulated terms of service and electricity rates; the speculative and competitive nature of the technology sector; dependency on continued growth in blockchain and cryptocurrency usage; lawsuits and other legal proceedings and challenges; government regulations; the global economic climate; dilution; future capital needs and uncertainty of additional financing, including the Company's ability to utilize the Company's at-the-market equity offering program (the \"ATM Program\") and the prices at which the Company may sell Common Shares in the ATM Program, as well as capital market conditions in general; risks relating to the strategy of maintaining and increasing Bitcoin holdings and the impact of depreciating Bitcoin prices on working capital; the competitive nature of the industry; currency exchange risks; the need for the Company to manage its planned growth and expansion; the effects of product development and need for continued technology change; the ability to maintain reliable and economical sources of power to run its cryptocurrency mining assets; the impact of energy curtailment or regulatory changes in the energy regimes in the jurisdictions in which the Company operates; protection of proprietary rights; the effect of government regulation and compliance on the Company and the industry, the introduction of proposed cryptocurrency regulatory legislation in the United States and other countries; network security risks; the ability of the Company to maintain properly working systems; reliance on key personnel; global economic and financial market deterioration impeding access to capital or increasing the cost of capital; share dilution resulting from the ATM Program, private placements of the Company's securities and from other equity issuances; the construction and operation of facilities may not occur as currently planned, or at all; expansion may not materialize as currently anticipated, or at all; the digital currency market; the ability to successfully mine digital currency; revenue may not increase as currently anticipated, or at all; it may not be possible to profitably liquidate the current digital currency inventory, or at all; a decline in digital currency prices may have a significant negative impact on operations; an increase in network difficulty may have a significant negative impact on operations; the volatility of digital currency prices; the anticipated growth and sustainability of electricity for the purposes of cryptocurrency mining in the applicable jurisdictions; the inability to maintain reliable and economical sources of power for the Company to operate cryptocurrency mining assets; the risks of an increase in the Company's electricity costs, cost of natural gas, changes in currency exchange rates, energy curtailment or regulatory changes in the energy regimes in the jurisdictions in which the Company operates and the adverse impact on the Company's profitability; the ability to complete current and future financings, any regulations or laws that will prevent the Company from operating its business; historical prices of digital currencies and the ability to mine digital currencies that will be consistent with historical prices; an inability to predict and counteract the effects of COVID-19 on the business of the Company, including but not limited to the effects of COVID-19 on the price of digital currencies should there be a resurgence, capital market conditions, restriction on labour and international travel and supply chains; and, the adoption or expansion of any regulation or law that will prevent the Company from operating its business, or make it more costly to do so; and other related risks as more fully set out in the Company's disclosure documents under the Company's filings at www.sec.gov\/EDGAR and www.sedarplus.com.\nThe forward-looking information in this news release reflects the current expectations, assumptions and\/or beliefs of the Company based on information currently available to the Company. In connection with the forward-looking information contained in this news release, the Company has made assumptions about the Company's objectives, goals or future plans, the timing thereof and related matters. The Company has also assumed that no significant events occur outside of the Company's normal course of business. Although the Company believes that the assumptions inherent in the forward-looking information are reasonable, forward-looking information is not a guarantee of future performance and accordingly undue reliance should not be put on such information due to its inherent uncertainty. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether because of new information, future events or otherwise, other than as required by law.\nMore Info:\nDisclaimer\/Disclosure: Investorideas.com is a digital publisher of third party sourced news, articles and equity research as well as creates original content, including video, interviews and articles. Original content created by investorideas is protected by copyright laws other than syndication rights. Our site does not make recommendations for purchases or sale of stocks, services or products. Nothing on our sites should be construed as an offer or solicitation to buy or sell products or securities. All investing involves risk and possible losses. This site is currently compensated for news publication and distribution, social media and marketing, content creation and more. Disclosure is posted for each compensated news release, content published \/created if required but otherwise the news was not compensated for and was published for the sole interest of our readers and followers. Contact management and IR of each company directly regarding specific questions.\nMore disclaimer info: https:\/\/www.investorideas.com\/About\/Disclaimer.asp Learn more about publishing your news release and our other news services on the Investorideas.com newswire https:\/\/www.investorideas.com\/News-Upload\/\nGlobal investors must adhere to regulations of each country. Please read Investorideas.com privacy policy: https:\/\/www.investorideas.com\/About\/Private_Policy.asp"]}
{"date":"2024-01-09","titles":["Crypto Bear Says Fakeout Rallies and Then Massive Corrections Coming for Bitcoin and Ethereum","Market's High Stakes On SEC's Favorable Bitcoin ETF Decision Drive Bitcoin Surge","VanEck Crypto Monthly Recap For December 2023"],"urls":["https:\/\/dailyhodl.com\/2024\/01\/09\/crypto-bear-says-fakeout-rallies-and-then-massive-corrections-coming-for-bitcoin-and-ethereum\/","https:\/\/www.ibtimes.com\/markets-high-stakes-secs-favorable-bitcoin-etf-decision-drive-bitcoin-surge-3721749","https:\/\/seekingalpha.com\/article\/4661876-vaneck-crypto-monthly-recap-december-2023"],"sources":["dailyhodl.com","ibtimes.com","seekingalpha.com"],"descriptions":["A widely followed crypto bear believes that major corrections are coming for Bitcoin (BTC) and Ethereum (ETH) after fleeting rallies.","Bitcoin started the week strong, trading above $46,000 and later surpassing $47,000, marking a more than 6% increase from its Sunday closing price.","In December, Bitcoin outperformed the S&P 500 for the fourth straight month (+9% vs. +4%) to end 2023 +154%, its best year since 2020 when BTC rose 305%."],"article_contents":["A widely followed crypto bear believes that major corrections are coming for Bitcoin (BTC) and Ethereum (ETH) after fleeting rallies.\nPseudonymous trader Capo tells his 83,873 Telegram subscribers that the possible approval this week of a spot Bitcoin exchange-traded fund (ETF) will likely ignite a short-lived rally for Bitcoin and other digital assets.\n“Whales are showing strong interest in the $48,000-$50,000 level. News can trigger volatility and leave large wicks. So a pump to that level and a big rejection afterward is a likely scenario.”\nThe trader shares a chart predicting Bitcoin’s price action “for the next few days.”\nLooking at his chart, the trader suggests that Bitcoin will soar toward $51,000 upon news of the approval of a spot market Bitcoin ETF. After the rally, he suggests that Bitcoin will likely correct down to the $30,000-$31,000 as whales “sell the news.”\nThe trader also predicts Ethereum will rally to as high as $2,600 before correcting. And he expects other altcoins to also undergo a massive correction after a brief move to the upside.\n“Interesting week ahead. ETF news should be released soon. As explained these days, I expect the market to pump first. BTC to $48,000-$50,000, ETH to $2,500-$2,600. Alts should pump more, especially low caps. After this, which should take a few days, the market should reach a very important local top. That’s when I will start opening swing short positions, aiming for new lows.”\nLooking further out, the trader maintains his long-standing prediction that Bitcoin will eventually collapse to the $12,000 level, which his chart suggests will happen around April.\n“BTC HTF (high timeframe) idea.”\nBitcoin is trading for $46,776 at time of writing, up 7% in the last 24 hours. Meanwhile, Ethereum is trading for $2,314 at time of writing, up 4.7% in the last 24 hours.\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","Bitcoin experienced a substantial price surge Monday, surpassing the $47,000 price point as the market placed substantial bets on the U.S. Securities and Exchange Commission (SEC) potentially approving several spot Bitcoin exchange-traded fund (ETF) proposals come Wednesday.\nKicking off the week with a significant surge, Bitcoin initially traded above the $46,000 price threshold and eventually soared past the $47,000 mark, marking an over 6% spike compared to its closing value on Sunday.\nThis price rally continues the upward trend observed during the initial week of the year, where the world's oldest crypto asset recorded a 3% spike in its price.\nThe surge in Bitcoin's price this week is largely attributed to the final submission of S-1 registration forms by Bitcoin exchange-traded fund (ETF) issuers looking to launch spot Bitcoin ETFs.\nAdditionally, the swift response from the Securities and Exchange Commission (SEC) regarding the recently filed documents, which came mere hours after submission, fueled optimism within the industry about the potential approval of such products in the U.S.\nMatteo Greco, a Research Analyst at the publicly listed digital asset and fintech investment business Fineqia International, explained in an email to the International Business Times, \"The market's tumultuous nature is predominantly attributed to the imminent SEC decision on the approval or rejection of BTC Spot ETFs. The SEC will communicate its decision to 21Shares by January 10, and likely notify most, if not all the 12 other issuer applicants on the same day of approval. This approach aims to prevent 21Shares from having a first-mover advantage over other issuers.''\nThe analyst also linked Bitcoin's increased volatility with the surge in trading volume on centralized cryptocurrency exchange platforms, a trend noticed continuing into the first week of 2024 and potentially influenced by the SEC's impending decision on spot Bitcoin ETF applications.\n\"Elevated volatility correlates with increased trading volume, as evidenced by the trading volumes on centralized exchanges. Cumulative volume on centralized exchanges reached approximately $1.1 trillion in December 2023, marking the highest level since May 2022. The trend of heightened volume persisted into the first week of 2024, with daily volumes reaching $42.7 billion to Jan. 7, the highest weekly level since March 2023,\" Greco said.\n\"The connection between elevated volumes and the impending decision on BTC Spot ETFs is apparent when examining the daily spot volume on centralized exchanges using a weekly moving average. In the period between January 1 and 7, 2024, BTC recorded $14.1 billion in daily volume, reflecting a 61% increase from the $8.75 billion recorded the previous week. In the same period, Ethereum (ETH)'s total daily volume amounted to $4.2 billion, marking a 3% decrease from the $4.4 billion recorded in the preceding week,\" he added.\nThe price rally of Bitcoin reflected its dominance, which is indicative of the crypto asset's market capitalization compared to the entire cryptocurrency market. This dominance witnessed a 5.8% increase from 51% recorded in the past week to 54% this week.\n\"BTC's share was 54% at the end of the week, a 5.8% increase from 51% registered the previous week. These data points indicate a shift of capital from altcoins to BTC, aligning with positive sentiment by market participants toward approval of BTC Spot ETFs,\" Greco said.\nAs of 1:03 p.m. ET on Tuesday, Bitcoin was trading at $46,835.46, exhibiting a 24-hour trading volume increase of 20.82% at $38,455,487,522.\nThe latest price action of Bitcoin showcases a 3.52% increase in its value for the day and a 3.60% gain over the last seven days.\nAccording to data from CoinMarketCap, Bitcoin's current circulating supply stands at 19,593,881 BTC, with its market cap at $918,198,232,451.\n© Copyright IBTimes 2024. All rights reserved.",null]}
{"date":"2024-01-10","titles":["Crypto Price Today: BTC, ETH Maintains Profits, Fake News About ETF Approvals Rattles Overall Market","Bitcoin Loses $50M In Market Cap, Sees $90M In Liquidation After SEC's Fake BTC ETF Tweet","Bitcoin price action proves that today’s SEC decision over Bitcoin ETF will trigger sell-off"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-ether-price-today-profit-loss-btc-etf-approval-us-sec-crypto-market-4834371","https:\/\/www.ibtimes.com\/bitcoin-loses-50m-market-cap-sees-90m-liquidation-after-secs-fake-btc-etf-tweet-3721828","https:\/\/financefeeds.com\/bitcoin-price-action-proves-that-todays-sec-decision-over-bitcoin-etf-will-trigger-sell-off\/"],"sources":["ndtv.com","ibtimes.com","financefeeds.com"],"descriptions":["The overall crypto market valuation dipped by 0.66 percent in the last 24 hours. Bitcoin, as of Wednesday, December 10 was trading at $45,917 (roughly Rs. 38 la...","Bitcoin's market cap fell from $938.43 billion to $890.16 billion within hours after a fake tweet circulated online, coinciding with the SEC's disclosure of a c...","\"Many attributed the significant sell-off to be caused by the fake news, with BTC’s price dropping from almost $48,000 to below $45,000 before rebounding and ..."],"article_contents":["Photo Credit: Pixabay\/ Dean Crosby\nThe capitalisation of the sector presently stands at $1.71 trillion\nBitcoin on Wednesday, December 10 reflected a minor loss of 1.71 percent. This price drop however, did not spell doom for the asset, as it continued to trade at $45,917 (roughly Rs. 38 lakh). In the last 24 hours, the value of Bitcoin has reduced by $835 (roughly Rs. 69,432). The volatility in BTC pricing was triggered by an interesting turn of events regarding the BTC ETFs that are awaiting approvals from the SEC in the US.\n“In one of the most interesting turn of events in crypto history, SEC's official twitter posted last night that SEC has approved all of the spot Bitcoin ETFs. A few minutes later SEC chief Gary Gensler tweeting that SEC's official twitter account has been hacked and the approval news is not true. Many security lawyers have now been calling for the SEC to investigate itself for market manipulation due to this event,” the CoinSwitch Market Desk told Gadgets360. Bitcoin price, during this time, escalated to over $48,000 (roughly Rs. 39.9 lakh) then dropped to $45,000 (roughly Rs. 37.4 lakh) and finally settled at its current value.\nThe @SECGov twitter account was compromised, and an unauthorized tweet was posted. The SEC has not approved the listing and trading of spot bitcoin exchange-traded products.\nEther managed to mint a gain of 1.62 percent despite the market's volatility. At the time of writing, Ether was trading at $2,346 (roughly Rs. 1.95 lakh).\n“Ethereum had an ETF dress rehearsal yesterday, and continued pumping even as the ETF news turned out to be false. This upward momentum positively affected associated tokens. Top ETH staking provider Lido Finance (LDO) soared by 18 percent, while Layer 2 solutions such as Arbitrum's ARB saw a four percent increase, and Optimism's OP surged by three percent,” the CoinSwitch markets desk added.\nWith BTC and ETH taking different trajectories, the crypto chart was clearly divided. Tether, Binance Coin, Solana, USD Coin, Shiba Inu, and Litecoin tagged behind Ether on the profit-making side of the crypto market.\nLeo, Bitcoin SV, Iota, Qtum, and Braintrust also registered gains.\nThe overall crypto market valuation dipped by 0.66 percent in the last 24 hours. The capitalisation of the sector presently stands at $1.71 trillion (roughly Rs. 1,42,22,839 crore), showed CoinMarketCap.\n“This ETF fever has stirred both speculation and caution within the broader cryptocurrency landscape. Ethereum faced significant pressure, touching a 32-month low against Bitcoin amidst growing anticipation surrounding Bitcoin ETFs,” said Rajagopal Menon, Vice President, WazirX in conversation with Gadgets360.\nMeanwhile, cryptocurrencies trading in losses alongside BTC include Ripple, Cardano, Avalanche, Dogecoin, Tron, Polkadot, Polygon, and Chainlink among others.\nIndustry experts have predicted that the volatility would continue for the rest of this week and advice investors to exercise caution.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement","Bitcoin's market capitalization nosedived by nearly $50 million, and its price volatility on Tuesday afternoon triggered nearly $90 million in liquidations following a fake spot Bitcoin exchange-traded fund (ETF) approval tweet by the U.S. Securities and Exchange Commission (SEC).\nBitcoin's market capitalization was $938.43 billion at around 5 p.m. ET on Tuesday but plummeted to $890.16 billion just a few hours after the fake tweet surfaced online, following the SEC's announcement that its official X (formerly Twitter) account was compromised.\nThe fake SEC tweet also triggered the price of the world's oldest crypto asset to surge from the $46,000 price point to as high as $47,893 but eventually plunged to $45,430 after the agency revealed that its social media account was compromised.\nBitcoin's price volatility propelled the liquidation of more than $90 million of leveraged BTC positions, based on data from the cryptocurrency futures trading and information platform CoinGlass.\nTotal liquidations for all leveraged crypto positions amounted to around $230 million.\nData reveals that the majority of the liquidations were the result of long positions, with $140 million in value wiped out. In contrast, $91 million in value was liquidated in short positions.\nThese figures underscore the inherent risks associated with trading in cryptocurrencies and the importance of carefully managing one's leveraged positions in the market.\nThe positive sentiment surrounding the approval of a Bitcoin ETF remained steadfast despite the drama concerning the SEC on Tuesday.\nThe optimism of industry watchers and business executives surrounding the potential launch of the crypto investment vehicle in the U.S. and Bitcoin has not diminished.\n\"Usually, after positive news, there follows a price increase caused by FOMO or greed, which over-speculates the price of markets for that asset. We saw the price go over $47,000 with the fake Tweet of the approval. However, once the ETF gets officially approved by the SEC, we will likely see Bitcoin's price go up, and later, the market will mature both in the short-term and long-term. In the long term, much capital comes from a different market, not just crypto, and BTC's constant price appreciation action,\" Gaurav Dubey, CEO of crypto incubator and lifetime advisory firm TDeFi told International Business Times.\nFelix Xu, CEO and co-founder of the decentralized secure computation network ARPA Network, is optimistic that Bitcoin will not only reach new highs in terms of price but will also be used for hedge and pension fund allocations following the SEC's approval of the BTC ETF.\n\"Bitcoin, finally, can hit six figures. Last time, we couldn't manage to do it, but this time, with the ETF approval, hedge funds and pension funds will be allocated to BTC. After Tesla and MicroStrategy, we could see another big corporation putting BTC on their balance sheet, and potentially, another country would make a similar move, like El Salvador, and declare Bitcoin a legal tender as the flipping gold narrative gains traction,\" Xu told IBT in an email.\nHatu Sheikh, CMO, and co-founder of the innovative platform that operates within the realm of cryptocurrency and blockchain DAO Maker said: \"With speculations rife around the US Spot Bitcoin ETF getting approval soon, Bitcoin prices will likely go up, just as we saw with the fake BTC ETF approval Tweet; the price spiked to above $47,000. The excitement will grow further if the SEC approves multiple Bitcoin ETF applications. However, this robust recovery will be followed by a market cooldown.\"\nHe further said, \"For now, the Bitcoin price is on an ascending curve that looks to become steeper. Over the past year, Bitcoin has grown steadily, with its market capitalization more than doubling from nearly US$800 million to nearly US$1.7 trillion. The growth rate will be higher, posting a much larger number until it reaches a cooldown phase and stabilizes.\"\nBitcoin was trading in the red zone at $46,510.95 with a 24-hour trading volume up by 23.26% at $43,548,366,815 as of 1:31 p.m. ET on Wednesday.\nBitcoin's latest price action represents a 0.62% increase in its value in the past 24 hours and an 8.76% gain in the last seven days.\nData from CoinMarketCap shows that Bitcoin's current circulating supply stands at 19,594,831 BTC and its market cap is at $908,489,381,675.\n© Copyright IBTimes 2024. All rights reserved.","ATFX proudly continued its long-standing support of The Duke of Edinburgh Cup, with the first\nThe Australian Securities and Investments Commission (ASIC) will launch a new digital portal on 5\nEURCHF currency pair can be expected to rise to the next resistance level 0.9350, top\nAfter years of uncertainty, stablecoin regulation is finally gaining momentum on Capitol Hill. Three competing\nInstitutional DeFi is accelerating, with tokenized assets moving on-chain, and stablecoin transactions surpassing $15.6 trillion\nDiscount broker Webull and SPAC company SK Growth have closed their previously announced business combination,\nThe Cyprus Securities and Exchange Commission (CySEC) has slapped Lee Ron More, the Executive Director,\nSaxo has announced the launch of a new Flexible Investment and Savings Account (ISA) following\nThe UK Financial Conduct Authority (FCA) is establishing a permanent presence in the United States\nEURCHF currency pair can be expected to rise to the next resistance level 0.9350, top\nICE Bonds has announced the launch of a new Request-for-Quote (RFQ) protocol for Mortgage-Backed Securities\nIEX plans to launch IEX Options at the end of the first quarter of 2026,\nFor fintech startups, 2025 presents a paradox: immense opportunities paired with significant challenges. With Trump’s\nWith Bitcoin going through the roof in 2024 and the entire crypto market showing substantial\nBitcoin has stood the test of time, proving itself as the most secure decentralized network.\nCross-border e-commerce is expected to exceed $3 trillion globally by 2028, and the need for\nWorldFirst, the cross-border payment platform under Ant International, has launched the World Card, a virtual\nUnit No: BA857 DMCC Business Centre Level No 1 Jewellery & Gemplex 3 Dubai, United Arab Emirates.\nInternational House, 10 Admirals Way, London, England, E14 9XL."]}
{"date":"2024-01-11","titles":["Crypto Price Today: Profits Take Over Crypto Charts as 11 BTC ETFs Bag Historic Approval in US","Bitcoin ETF: Wall Street's crypto craze","Bitcoin ETF SEC approval could skyrocket long-term BTC prices - 5 reasons why"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-etf-approval-us-cryptocurrency-market-sec-historic-4840809","https:\/\/www.entrepreneur.com\/finance\/bitcoin-etf-wall-streets-crypto-craze\/468238","https:\/\/www.investorideas.com\/news\/2024\/cryptocurrency\/01111Bitcoin-ETF-SEC.asp"],"sources":["ndtv.com","entrepreneur.com","investorideas.com"],"descriptions":["The overall crypto market valuation rose by 2.77 percent over the last 24 hours. The US SEC approved 11 BTC ETFs on Thursday, January 11 – ushering in the sen...","Bitcoin ETFs, introduced in 2024, merge traditional stock trading ease with Bitcoin's market volatility.",""],"article_contents":["Photo Credit: Pexels\/ DS Stories\nThe overall crypto market cap, as of Thursday, stands at $1.76 trillion\nBitcoin on Thursday, January 11 minted a small profit and continued trading at the price point of $46,331 (roughly Rs. 38.4 lakh). In a historic development, the US SEC finally gave the green signal to 11 Bitcoin ETF applications that include Blackrock, Fidelity, and Invesco among others. This has ushered in an excitement-induced sentiment among the global crypto community even though Bitcoin did not show an immediate reaction to the development. Profits are beginning to seep onto the price chart in the backdrop of this development.\nEther minted a profit of 9.99 percent on Thursday. With this, the value of ETH has touched the price point of $2,606 (roughly Rs. 2.16 lakh). This is a 20-month high for Ether.\n“The decision to greenlight 11 spot Bitcoin ETFs reflects a growing acceptance and recognition of digital assets within traditional financial markets. This move is expected to bring about increased adoption, liquidity, and overall market maturity. It also signifies a shift in the perception of cryptocurrencies from a niche asset class to one that is gaining mainstream acceptance,” Edul Patel CEO of Mudrex told Gadgets360.\nExchange Traded Funds (ETFs) track the value of the asset and trade on traditional market exchanges rather than crypto exchanges. This lets people engage with Bitcoin without having to register with a crypto platform. The SEC-approved BTC ETFs will be available on traditional exchange majors, such as NYSE Arca, Nasdaq, and Cboe BZX Exchange in the US.\nMajority cryptocurrencies reflected gains after news about the BTC ETF approvals broke online. These altcoins include Binance Coin, Ripple, Cardano, Avalanche, Dogecoin, Polkadot, Tron, and Polygon.\nOther altcoins that saw the immediate effect of the ETF approvals unlike BTC include Chainlink, Shiba Inu, Litecoin, Bitcoin Cash, Cosmos, and Uniswap.\n“The future price movement will also be impacted by further capital inflows into Bitcoin ETFs. The abundance or scarcity of funds will play a crucial role in market sentiment and price fluctuations, determining whether Bitcoin prices continue to rise or experience a decline. This event may trigger intense market volatility, and investors should closely monitor the market's reaction post-ETF approval, as well as the flow of funds, to better formulate their investment strategies,” Ryan Lee, Chief Analyst at Bitget Research told Gadgets360.\nA small number of cryptocurrencies did see minor losses on Thursday. These include Tether, Solana, USD Coin, Leo, and Bitcoin SV.\n“Now that the SEC has approved Bitcoin ETFs, it is expected that financial institutions in other regions will apply for similar businesses in the United States. To prevent large and medium-sized financial institutions from transferring their funds out of the region, other financial centres such as London, Hong Kong, Singapore, and Tokyo are also expected to introduce policies related to BTC spot ETFs. This will ultimately lead to the widespread globalization and adoption of cryptocurrency. Additionally, the attributes of cryptocurrency are likely to expand beyond BTC to include ETH, stablecoins, and other tokens, allowing more people to understand the significance of cryptocurrency,” Lee added.\nThe overall crypto market cap, as of Thursday, stands at $1.76 trillion (roughly Rs. 1,46,01,628 crore). As per CoinMarketCap, the market valuation rose by 2.77 percent over the last 24 hours.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement","Copyright © 2024 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC\nBy          \n            Jeffrey Neal Johnson\n          \n\n            Jan 11, 2024\nShare\nThis story originally appeared on MarketBeat\nThe meteoric rise of Bitcoin (BTC) has captured imaginations and sparked investor interest worldwide. However, the complexities of directly owning and managing this digital asset present a formidable obstacle for many. That will change with the new Bitcoin Exchange Traded Funds (ETFs). These innovative financial instruments are bridging the gap between the burgeoning cryptocurrency space and the familiar terrain of traditional finance.\nHistory was made on January 11th, 2024, as the first spot Bitcoin ETFs began trading. The anticipation surrounding this landmark event sent Bitcoin's price soaring, highlighting the potential impact these new investment vehicles can have on the market. While the initial excitement has settled, the long-term implications for Bitcoin and traditional finance remain intriguing.\nForget the tech headaches and digital vaults. Bitcoin Exchange Traded Funds (ETFs) offer a smooth, familiar path to invest in this volatile asset. Imagine secure vaults, meticulously managed by established financial institutions, holding the actual Bitcoin you're buying. There is no need for private keys, unfamiliar exchanges, or specialized platforms. Buy and sell shares in these ETFs on the NYSE or Nasdaq, just like your favorite stock.\nThis approach provides several benefits. You can invest in Bitcoin with the same simplicity as traditional stocks. You can avoid the complexities of the technology and rely on the security of reputable institutions that manage your underlying asset. Liquidity is strong on major exchanges so you can buy and sell Bitcoin quickly and easily at market prices. Bitcoin can also be used to diversify your portfolio and potentially offset the risks of traditional assets.\nHowever, remember that Bitcoin's inherent volatility still runs deep through these ETFs. Just like with Bitcoin, you will want to brace yourself for significant price fluctuations and carefully consider your risk tolerance before taking the plunge. Fees vary between Bitcoin ETFs, so compare them before choosing your investment vehicle.\nNot all Bitcoin ETFs are created equal. Understanding the two primary types is crucial for making informed investment decisions:\nFor many investors, the allure of Bitcoin's potential returns is undeniable. However, the complexities of directly owning and managing this digital asset can act as a formidable barrier. This is where Bitcoin Exchange Traded Funds (ETFs) come in, offering a compelling solution that bridges the gap between cryptocurrency and the familiar terrain of traditional finance.\nUnlike the steep learning curve of setting up cryptocurrency wallets and navigating unfamiliar exchanges, Bitcoin ETFs grant easy access through your existing brokerage account. You don't have to learn the technical jargon and specialized platforms. With the new Bitcoin ETFs, buying and selling Bitcoin becomes as straightforward as any other stock trade.\nConcerns about cryptocurrency security are well-founded, with stories of exchange hacks and lost private keys consistently in the news. Bitcoin ETFs, however, leverage the robust infrastructure and established regulations of traditional financial institutions. Your underlying Bitcoin is held in secure custodians, offering greater peace of mind than the sometimes uncertain world of independent crypto exchanges.\nThe occasional illiquidity experienced when buying or selling Bitcoin directly can be frustrating. Bitcoin ETFs, however, trade on major stock exchanges, providing the same level of liquidity you've come to expect from traditional assets. This ensures smooth buying and selling at market prices, reducing the worry of getting stuck in an illiquid position.\nWhile the potential of Bitcoin ETFs is undeniable, a prudent investor approaches any new asset class with a clear-eyed awareness of its challenges. Before investing in Bitcoin ETFs, here are some crucial considerations to consider:\nBitcoin's price movements are infamous for their dramatic swings, and this inherent volatility extends directly to its ETF counterparts. Prepare for a potentially bumpy ride with significant fluctuations that may test your risk tolerance. Be sure your investment strategy aligns with the stomach for potentially sharp price changes.\nDifferent Bitcoin ETFs levy varying expense ratios, representing a silent yet persistent drag on your returns. Diligent research is vital to identifying ETFs with competitive fees that minimize this erosion of your potential gains. Don't let the allure of a catchy ticker symbol overshadow the importance of cost-effective investment vehicles.\nThe critical distinction between spot and futures ETFs requires careful consideration. Spot ETFs directly hold Bitcoin, mimicking its price movements, while futures ETFs track Bitcoin futures contracts, introducing an element of derivative exposure. Understanding these differences is crucial for aligning your investment strategy with your desired level of risk and potential return.\nWhile currently approved, the regulatory landscape surrounding Bitcoin ETFs remains in flux. Be mindful of potential future changes that could impact these instruments' structure, taxation, or even legality. Staying informed and adaptable is essential for navigating the evolving regulatory landscape.\nThe advent of Bitcoin ETFs represents a transformative step in bridging the gap between the complex world of cryptocurrencies and traditional financial markets. They offer an accessible and familiar pathway for investors, combining the potential high returns of Bitcoin with the security and simplicity of established financial mechanisms. However, investors must approach with caution, mindful of the inherent volatility of Bitcoin and the evolving regulatory landscape. As this innovative investment vehicle gains traction, it underscores the dynamic nature of financial markets and the growing influence of digital assets in shaping the future of investment.\nWant to be an Entrepreneur Leadership Network contributor?\n                \n  Apply now to join.\nStripe has a creative way of getting customer feedback — by inviting them to internal meetings.\nIt would take Apple three years to move 10% of its supply chain to the U.S.\nWhile your values guide your business, they also can (and should) guide your investments. Intentional investing is a powerful way to make a difference. Here's my experience, along with tips to get started in areas that matter most to you.\nA Google spokesperson said the move would help Google run more efficiently.\nKelly Bozigian, 32, and her husband Colt have built a lucrative online business.\nTwo 21-year-old Yale juniors are changing digital networking with Series, an AI-powered platform backed by $3 million in venture capital.\nSuccessfully copied link","January 11, 2024 (Investorideas.com Newswire) The SEC approval of Bitcoin Exchange-Traded Funds (ETFs) signals a landmark moment for both Bitcoin and the broader cryptocurrency market, and could send prices skyrocketing in the longer-term with BTC prices perhaps hitting $60,000 this quarter, predicts the CEO of one of the world's largest independent financial advisory, asset management and fintech organisations.\nThe bullish prediction from Nigel Green of deVere Group, a long-term high profile cryptocurrency advocate, comes as the US financial regulator, the Securities and Exchange Commission, approved 11 spot bitcoin exchange-traded funds, including those of Grayscale, Bitwise and Hashdex, according to a statement on Wednesday.\nHe says: \"This approval by the financial regulator of the world's largest economy is a landmark moment for Bitcoin and the wider crypto market and boosts prices in the long-term, even if there's a sell-off in the near-term.\nThe deVere CEO says there are five main reasons to be bullish for the long-term price trajectory following the SEC approval.\nFirst, institutional validation. \"The approval of Bitcoin ETFs represents a resounding institutional validation of the cryptocurrency, marking a departure from its initial reputation as a speculative and volatile asset.\n\"Institutional investors have long been cautious about entering the crypto space due to concerns about regulatory uncertainties and market integrity.\n\"The introduction of SEC-regulated Bitcoin ETFs addresses these concerns by providing a transparent and secure investment vehicle, paving the way for institutional capital to flow into the market,\" affirms Nigel Green.\nSecond, likely influx of capital. \"One of the primary catalysts for the anticipated surge in Bitcoin prices is the massive influx of capital that is expected to follow the approval of ETFs.\n\"These investment vehicles provide a convenient and regulated avenue for both retail and institutional investors to gain exposure to Bitcoin without the complexities of managing private keys or navigating unregulated exchanges.\n\"As traditional investors seek diversification and higher returns, Bitcoin ETFs offer an attractive option, potentially unlocking billions of dollars in new investments,\" affirms the deVere Group CEO.\nThird, accessibility and liquidity. \"Bitcoin ETFs help democratize access to the cryptocurrency market, allowing a broader range of investors to participate.\n\"Increased accessibility is likely to contribute to higher liquidity in the Bitcoin market, reducing price volatility and enhancing the overall stability of the cryptocurrency.\"\nFourth, market integration and regulatory clarity. Nigel Green says: \"The approval of Bitcoin ETFs represents another significant step towards the integration of cryptocurrencies into the mainstream global financial system.\n\"Regulatory clarity surrounding these investment vehicles provides a framework for market participants to operate within established rules, promoting a more secure and transparent environment.\n\"As regulatory uncertainties dissipate, more and more institutional and individual investors can confidently engage with the crypto market, further reinforcing the legitimacy of Bitcoin.\"\nFifth, increased global adoption. \"Bitcoin ETFs aren't limited by geographical boundaries, offering a globally accessible investment vehicle for investors across jurisdictions. This global reach is expected to drive widespread adoption and recognition of Bitcoin as a legitimate asset class.\n\"As more countries embrace the idea of regulated Bitcoin ETFs, the cryptocurrency will likely gain further acceptance on the international stage, attracting a broader investor base and propelling prices to potentially new heights.\"\nHe concludes: \"The approval of Bitcoin ETFs is a watershed moment for Bitcoin and the entire crypto market.\n\"The institutional validation, massive influx of capital, increased accessibility, market integration, and global adoption are powerful catalysts that could send BTC prices to potentially near all-time highs.\n\"On a tidal wave of investor enthusiasm, we wouldn't be surprised if Bitcoin hits $60,000 this quarter - and higher moving forward throughout the year.\n\"We expect that history will show that the ETF approval will be a significant price driver in the long-term, even if there's a very short-term sell-off.\"\nt: +44 207 1220 925Twitter: @PriorConsults\ndeVere Group is one of the world's largest independent advisors of specialist global financial solutions to international, local mass affluent, and high-net-worth clients.  It has a network of more than 70 offices across the world, over 80,000 clients and $12bn under advisement.\nMore Info:\nDisclaimer\/Disclosure: Investorideas.com is a digital publisher of third party sourced news, articles and equity research as well as creates original content, including video, interviews and articles. Original content created by investorideas is protected by copyright laws other than syndication rights. Our site does not make recommendations for purchases or sale of stocks, services or products. Nothing on our sites should be construed as an offer or solicitation to buy or sell products or securities. All investing involves risk and possible losses. This site is currently compensated for news publication and distribution, social media and marketing, content creation and more. Disclosure is posted for each compensated news release, content published \/created if required but otherwise the news was not compensated for and was published for the sole interest of our readers and followers. Contact management and IR of each company directly regarding specific questions.\nMore disclaimer info: https:\/\/www.investorideas.com\/About\/Disclaimer.asp Learn more about publishing your news release and our other news services on the Investorideas.com newswire https:\/\/www.investorideas.com\/News-Upload\/\nGlobal investors must adhere to regulations of each country. Please read Investorideas.com privacy policy: https:\/\/www.investorideas.com\/About\/Private_Policy.asp"]}
{"date":"2024-01-12","titles":["Vanguard Unmoved By Record-Smashing $4.5B Bitcoin Exchange-Traded Funds Kickoff, Gives BTC ETFs The Boot","WHAT IS A BITCOIN ETF AND WHY YOU SHOULD CARE","Crypto goes mainstream: Everything you need to know about investing in Bitcoin ETFs"],"urls":["https:\/\/www.ibtimes.com\/vanguard-unmoved-record-smashing-45b-bitcoin-exchange-traded-funds-kickoff-gives-btc-etfs-boot-3721960","https:\/\/www.forbes.com\/sites\/pattieehsaei\/2024\/01\/12\/what-is-a-bitcoin-etf-and-why-you-should-care\/","https:\/\/www.biznews.com\/global-investing\/2024\/01\/12\/crypto-mainstream-guide-investing-bitcoin-etfs"],"sources":["ibtimes.com","forbes.com","biznews.com"],"descriptions":["While over a dozen financial firms started offering Bitcoin ETFs on Thursday, with BlackRock, Grayscale and Fidelity emerging on top – registering around $4.5...","On Wednesday, the Securities and Exchange Commission approved changes that allow the listing and trading of bitcoin exchange-traded funds.","The first US ETFs directly linked to Bitcoin have hit the market, marking a significant shift in crypto investment accessibility."],"article_contents":["Vanguard, a global leader in asset management, has decided not to allow its clients to purchase the recently authorized spot Bitcoin exchange-traded funds even though the crypto investment vehicle smashed records as it saw over $4.5 billion on its debut on U.S. exchanges.\nOver a dozen financial firms started offering the newly approved Bitcoin ETFs on Thursday, with BlackRock, Grayscale and Fidelity emerging on top. Spot Bitcoin ETFs recorded around $4.5 billion in cumulative trading volume on their first day.\nHowever, the eagerly awaited crypto investment vehicle is not available for purchase in one of the biggest fund issuers in the world, Vanguard.\n\"While we continuously evaluate our brokerage offer and evaluate new product entries to the market, spot Bitcoin ETFs will not be available for purchase on the Vanguard platform. We also have no plans to offer Vanguard Bitcoin ETFs or other crypto-related products,\" Vanguard said in a statement.\n\"Our perspective is that these products do not align with our offer focused on asset classes such as equities, bonds, and cash, which Vanguard views as the building blocks of a well-balanced, long-term investment portfolio,\" it added.\nVanguard is one of the top players in the U.S. exchange-traded fund market. Its rival, BlackRock, entered the Bitcoin arena with its iShares Bitcoin Trust (IBIT), which commenced trading Thursday.\nEven before the spot Bitcoin ETFs were approved by the U.S. Securities and Exchange Commission, Vanguard had expressed its intention not to offer the crypto investment vehicle.\n\"Vanguard believes that the investment case for cryptocurrencies is weak,\" the company's representative said at the time. \"Unlike stocks and bonds, most crypto assets lack intrinsic economic value and generate no cash flows. And cryptocurrencies' high volatility runs counter to our goal of helping investors generate positive real returns over the long term.\"\nIndustry watchers and analysts are confident of the benefits spot Bitcoin ETFs would bring to investors and the broader cryptocurrency industry, which is why it has been a hot topic in finance over the past months.\nRobert Quartly-Janeiro, chief strategy officer at the forward-thinking cryptocurrency exchange Bitrue, outlined those benefits to International Business Times.\n\"It's been a wild week for BTC and digital currency markets, but also a historic one; we'll look back on it for a long time to come. As the eleven approved ETFs come to market, it's exciting to anticipate their impact on trading volumes and price dynamics. Notably, when major investment firms like BlackRock begin offering these ETFs on their platforms, a notable increase in activity is expected,\" Janeiro said.\n\"As an asset, BTC moved up the rankings, with only a handful of equities and commodities outperforming it in value, such as Apple Inc., Saudi Aramco, Gold, and Amazon. That said, though, the US ETF approvals indicate that BTC is very much here to stay and that its development and adoption will continue,\" the executive added.\nMeanwhile, the total volume across 10 spot Bitcoin ETFs recorded over $4.5 billion for day-one trading.\nBlackRock's IBIT was on top among newly approved funds by handling over $1 billion in volume, making up 22% of the total volume, Yahoo Finance data showed. Behind it was Fidelity's BTC ETF, with around $685 million in total trading on its first day.\n© Copyright IBTimes 2024. All rights reserved.","ByPattie Ehsaei\nByPattie Ehsaei,\nContributor.\nINDIA - 2021\/10\/16: In this Photo illustration a Bitcoin logo seen displayed on a smartphone with an ... More ETF(exchange traded fund) logo in the background. (Photo Illustration by Avishek Das\/SOPA Images\/LightRocket via Getty Images)\nThe Securities and Exchange Commission approved changes that allow the listing and trading of bitcoin exchange-traded funds on Wednesday. Bitcoin ETFs aim is to expose investors to bitcoin’s performance without requiring them to directly own or store the digital currency.\nUntil now, the buying and selling of cryptocurrency was prohibited on the U.S. stock exchange. Additionally, many casual investors may be unversed in cryptocurrency and have no idea what it is or how much to buy. The SEC’s approval of bitcoin ETFs changes all of this.\nAn exchange-traded fund is a type of investment fund and exchange-traded product representing a collection of securities such as stocks, bonds, or commodities. ETFs trade on stock exchanges similar to individual stocks. However, while individual stocks always run the risk of plummeting to $0, ETFs mitigate this risk by providing investors with a diverse portfolio of assets.\nWith the SEC’s approval of the bitcoin ETF, instead of purchasing and holding bitcoin directly on a crypto exchange platform, investors can now buy shares of a bitcoin ETF through their brokerage accounts. Experienced crypto investors manage these shares. The ETF holds bitcoin on investors’ behalf, and the shares of the ETF represent a stake in the fund's overall holdings of bitcoin.\nThe value of these ETF shares is typically tied to the price movements of bitcoin. This allows investors to invest in bitcoin's performance without dealing with the complexities of managing and securing the cryptocurrency themselves.\nAlthough the bitcoin ETF is not currently a diversified pool of cryptocurrencies because it exclusively focuses on bitcoin, it could open the door to similar products featuring a pool of cryptocurrencies. The hope is that in the near future, an investor may buy a single ETF share that represents a wide range of cryptocurrencies, similar to traditional ETF models.\nIf you wanted to dip your toe in the crypto pool but felt intimidated by your lack of expertise, the bitcoin ETF is a great way to start. Since bitcoin ETFs are regulated financial instruments, their issuers are subject to regulatory oversight, thus protecting investors and ensuring compliance with relevant financial laws.\nPurchasing bitcoin ETFs is relatively simple, as they are available on most trading platforms like Schwab, Fidelity, and Robinhood.\nHowever, it is important to note that while bitcoin ETFs offer certain advantages, they also come with their own set of drawbacks. While bitcoin ETFs can protect you from risks like hacking or fraud, they cannot fully shield you from the cryptocurrency market’s volatility. Bitcoin is influenced by various factors, including market sentiment, regulatory changes, and technological developments, and its value has been subject to extreme price swings over the years.\nThe cryptocurrency industry overall has been marred by numerous frauds and scandals, like the 2022 collapse of TerraUSD, which plummeted the price of bitcoin down 65%. Then, over the past year, the price of bitcoin skyrocketed more than 150%. This is clearly a highly volatile asset. The SEC cautions investors to proceed carefully when it comes to investing in cryptocurrency assets and to ensure that they are aware of the risks.\nBefore making any investment decisions, it is crucial to thoroughly research and consider your risk tolerance, investment goals, and the specific details of the ETF you are interested in. Consulting with a financial advisor can provide personalized guidance based on your individual circumstances.","Discover the latest financial frontier as the first US exchange-traded funds (ETFs) directly linked to Bitcoin hit the market, marking a significant shift in cryptocurrency investment accessibility. These spot Bitcoin ETFs, including offerings from BlackRock and Fidelity, provide investors with a straightforward way to gain exposure to the cryptocurrency's market price. Explore the ease of investing through your regular brokerage account, but tread cautiously amidst the crypto market's notorious volatility. With 11 approved ETFs offering competitive fees, the landscape is changing, yet the risks remain for those navigating the dynamic world of Bitcoin investments.\nSign up for your early morning brew of the BizNews Insider to keep you up to speed with the content that matters. The newsletter will land in your inbox at 5:30am weekdays. Register here.\nBy Ainsley Thomson\nIt just got a whole lot easier to invest in Bitcoin.\nAfter years of anticipation, the first US exchange-traded funds that invest directly in the biggest cryptocurrency have begun trading. Billions of dollars changed hands Thursday and the token briefly surged past $49,000 following the US Securities and Exchange Commission decision to grant them approval after markets closed on Wednesday.\nHow do you get some of the action? And what are the pros and cons?\nHere's what you need to know:\nAn ETF is a basket of securities that tracks a specific index or asset, giving people an easy way to invest in equities, bonds, currencies, commodities and real estate. And, as the name implies, ETFs trade on exchanges, making them simple to buy and sell — just like a stock.\nThe key aspect of the new spot Bitcoin ETFs is that they hold actual Bitcoin. That means investors get direct exposure to the current market price of the token.\nPreviously, you could only invest in ETFs that traded Bitcoin futures — contracts to buy or sell an asset at a specified price at a later date.\nWhy Crypto Is Counting on Spot Bitcoin ETFs: QuickTake\nBecause they're ETFs, you can just buy them using your regular brokerage account. As Ryan Firth, a financial planner at Mercer Street Company in Bellaire, Texas, explains it really is as simple as logging in to your account and searching for a quote using the term \"Bitcoin\" or \"BTC.\"\nIt's a good idea to watch the liquidity of the ETFs, which may take a few weeks to establish, said Matt Maley, chief market strategist at Miller Tabak + Co.\n\"I think the best way to invest, especially early on, is to stay with the ones that are the most liquid,\" he said.\nOn the first day of trading, over $4.6 billion worth of shares traded across almost a dozen US spot Bitcoin ETFs. The Grayscale Bitcoin Trust, which converted into an ETF, saw about $2.3 billion in volume, according to data compiled by Bloomberg. Meantime, BlackRock's iShares Bitcoin Trust — IBIT — saw over $1 billion change hands.\nRead more: From the FT: Bitcoin leaves the rest of the crypto market behind\nNo — it's up to firms and some may be reluctant to jump into a volatile asset class.\nVanguard Group Inc.'s brokerage arm will not offer trading in ETFs that invest directly in Bitcoin, according to a spokesperson. Bank of America Corp.'s Merrill Edge is still evaluating whether to provide that service, a person familiar with the matter said, asking not to be identified discussing a private matter.\nRead more: Vanguard Spurns Bitcoin ETF Trading While Merrill Evaluates\nUS regulators approved 11 ETFs, including from BlackRock, the world's biggest asset manager, and other well known names including Fidelity Investments and Invesco.\nHere's the list: Grayscale Bitcoin Trust, Bitwise Bitcoin ETF, Hashdex Bitcoin ETF, BlackRock's iShares Bitcoin Trust, Valkyrie Bitcoin Fund, ARK 21Shares Bitcoin ETF, Invesco Galaxy Bitcoin ETF, VanEck Bitcoin Trust, WisdomTree Bitcoin Fund, Fidelity Wise Origin Bitcoin Fund and Franklin Bitcoin ETF.\nThe beauty of competition means the issuers have been slashing their fees in a bid to make their products more attractive.\nThe cost of holding a spot Bitcoin ETF may be much cheaper than some traditional digital wallets, Bloomberg Intelligence analysts Rebecca Sin, Eric Balchunas and James Seyffart said in a note.\nThe temporary management fee of 0% may lure owners of other virtual assets into swapping to an ETF to gain the benefits of having their assets in a regulated exchange, Bloomberg Intelligence said.\nFor Maley, it's the low fees and the security of having the backing of big firms like BlackRock.\nBitcoin ETFs have also been widely lauded by crypto advocates for opening up the token to everyday investors, which should help increase adoption, liquidity and growth.\n\"An ETF packages Bitcoin ownership into a widely accepted and accessible vehicle, removing the need for investors — whether individuals or institutions – to take physical custody of Bitcoin,\" said Sui Chung, chief executive of data provider CF Benchmarks.\nThe big one is volatility. Bitcoin gained 60% in 2021, lost 64% in 2022, and more than doubled in 2023 — and that wild ride may be too much for the average retail investor.\nAlso, note the language of SEC Chair Gary Gensler when the decision was announced: \"While we approved the listing and trading of certain spot Bitcoin ETP shares today, we did not approve or endorse Bitcoin. Investors should remain cautious about the myriad risks associated with Bitcoin and products whose value is tied to crypto.\"\nMaley said while the big names behind the ETFs would give investors some peace of mind, they still need to be aware that the price of Bitcoin can still fall.\n\"It's still a very speculative thing. The volatility is still going to be there,\" Maley said. \"More people able to invest it, means more people can sell it too.\"\nRead also:\n© 2024 Bloomberg L.P."]}
{"date":"2024-01-15","titles":["SEC Green-Lights Bitcoin ETFs: 3 Things I Expect To Change","How To Chose Between The Bitcoin ETF's"],"urls":["https:\/\/seekingalpha.com\/article\/4662910-sec-green-lights-bitcoin-etfs-3-things-i-expect-to-change","https:\/\/seekingalpha.com\/article\/4662922-how-to-chose-between-the-bitcoin-etfs"],"sources":["seekingalpha.com","seekingalpha.com"],"descriptions":["I think the approval of 11 physically-backed Bitcoin ETFs by the SEC will prove to be a game-changer for the crypto industry. Click here to find out how.","The SEC has approved 10 Bitcoin spot ETFs, with an 11th soon to convert from futures to spot. Click here to read what investors need to know."],"article_contents":[null,null]}
{"date":"2024-01-16","titles":["Crypto Price Today: Bitcoin, Ether Retain Profits Despite Most Altcoins Showing Losses: Details","If You Invested $1,000 in Bitcoin 5 Years Ago, This Is How Much You'd Have Now"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-ether-price-today-january-16-usd-india-crypto-buy-sell-4872048","https:\/\/finance.yahoo.com\/news\/invested-1-000-bitcoin-5-193700718.html"],"sources":["ndtv.com","finance.yahoo.com"],"descriptions":["The overall crypto market cap rose by 0.15 percent in the last 24 hours. Bitcoin and Ether – both saw gains on Tuesday, January 16. The market, at large, rema...","Is Bitcoin's roller coaster ride worth the risk? See how it stacks up against the S&P 500's steady 5-year climb."],"article_contents":["Photo Credit: Pixabay\/ Dean Crosby\nThe current crypto market valuation stands at $1.68 trillion\nBitcoin on Tuesday, January 16 reflected a minor gain of 0.36 percent. The asset, at the time of writing, was trading at $42,625 (roughly Rs. 35.3 lakh) as per Gadget360's crypto price tracker. As opposed to what was predicted, the approvals of BTC ETFs in the US last week, did not manage to propel the most valued crypto asset into a profit frenzy. This, as per market analysts, testify to a sentiment of maturity in the investor community.\nEther followed Bitcoin and clocked a gain of 1.01 percent. The asset is currently trading at $2,562 (roughly Rs. 1.09 lakh).\n“In the last 24 hours, both BTC and ETH exhibited stability, and the market remained calm, attributed to the closure of the US market, indicating lower volatility and volume. BTC is maintaining its position and ETH is gradually consolidating in a sideways trend after a recent rally,” CoinDCX Market Movement told Gadgets360. “Notably, BTC dominance is declining, while ETH dominance is rising, suggesting a rotation of funds from BTC to ETH. This shift became more prominent after the BTC spot ETF approval, with ETH showing outperformance as the likelihood of an ETH spot ETF approval.”\nBinance Coin, USD Coin, Uniswap, Cosmos, Monero, and Elrond joined Bitcoin and Ether on the profit-making side of the crypto chart.\nSmall gains also struck Binance USD, Iota, Zcash, Status, and Ardor.\nThe overall crypto market cap rose by 0.15 percent in the last 24 hours. Its current valuation, at the time of writing, stands at $1.68 trillion (roughly Rs. 1,39,40,052 crore), as per CoinMarketCap.\nMeanwhile, a big number of altcoins reeled-in losses on Tuesday. These include Solana, Ripple, Cardano, Avalanche, Dogecoin, Tron, Polkadot, Chainlink, and Polygon.\nShiba Inu, Litecoin, and Bitcoin Cash also registered losses.\n“This has led to a rally in all ETH based altcoins as well. As per the technical analysis, this pair can still jump another 35 percent as traders speculate an ETH ETF in the coming weeks or months. Blackrock CEO Larry Fink has also been bullish on his television interviews about tokenisation of stocks and other real world assets - which could be a positive for ETH,” CoinSwitch Markets Desk told Gadgets360.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nIndex investing is a great approach, but you can do even better with specific stocks or cryptocurrencies from time to time.\nLet's say you invested $1,000 in an index fund tracking the S&P 500 (SNPINDEX: ^GSPC) index 5 years ago. The SPDR S&P 500 ETF (NYSEMKT: SPY) is one popular option with minimal management fees and a stellar history of reflecting its chosen index.\nIf you reinvested dividends into more shares of the exchange-traded fund (ETF) over time, you would have doubled your money by now. That's an average annual return of 15% -- well above the 10-year average at 12% or the 10% annual returns since the ETF was introduced 41 years ago.\nIt's easy to see why The Motley Fool recommends holding a diversified stock portfolio for a long time, in the spirit of index-fund pioneer John Bogle and master investor Warren Buffett. I mean, good luck finding a savings account with a stable 10% interest rate, not to mention the higher gains in recent years. Diversified investing is a proven strategy for building and protecting your wealth in the long run.\nBut what if you picked up $1,000 of Bitcoin (CRYPTO: BTC) tokens five years ago? The largest cryptocurrency was in the middle of another crypto winter back then, hampered by hacking scandals and regulatory crackdowns with no support to speak of from large banks and other financial institutions. The $19,345 record price of the Bitcoin boom in 2017 felt like a distant memory, melted down to $3,644 per token.\nAs it turns out, that was a solid buying window for investors looking to commit their funds over a five-year span. A $1,000 Bitcoin investment on Jan. 15, 2019, was worth $11,540 at the time of writing exactly five years later:\nIt hasn't been a smooth ride, but there's no denying the general upswing over five years. In this period, Bitcoin investors faced more crypto-exchange hacks, the coronavirus health crisis, a global inflation surge, and other challenges. Bitcoin prices fell more than 10% in August 2023, not to mention six single-month drops of that magnitude in 2022. The preceding chart includes all of these headwinds and crashes.\nStill, Bitcoin is back on its digital feet with more gains than losses in recent months and a robust slate of upcoming catalysts for further gains.\nThe next Bitcoin halving -- a regularly scheduled increase of the computing power required to mine new Bitcoins -- is scheduled in April 2024. These events are typically followed by a strong bull run in Bitcoin prices over the next couple of years.\nAmerican regulators recently approved 11 applications for ETFs based on spot-market Bitcoin prices. The approval did not result in a sharp price boost, but having easy access to Bitcoin-based investment vehicles such as the ARK 21Shares Bitcoin ETF (NYSEMKT: ARKB) and iShares Bitcoin Trust (NASDAQ: IBIT) should ultimately increase trading volume and support higher Bitcoin prices.\nThe regulatory picture is starting to clear up, driven by renewed public interest in the crypto space and progress in important legal cases such as the U. S. Securities and Exchange Commission vs. Ripple (CRYPTO: XRP). The wheels of justice and regulatory rulemaking grind slowly, and I don't expect a complete rulebook in 2024 or 2025. Still, every step in the direction of clarity is good news, even if they're not always taken in the direction of lower taxes and greater investor access to cryptocurrency assets.\nThe general long-term trend tends to leave traditional stock market indices like the S&P 500 far behind. Furthermore, that bullish market tenor should continue over the next couple of years due to the technology, market, and regulation events listed above -- with the caveat that there may be dramatic price drops along the way for a myriad unforeseen reasons.\nSo Bitcoin isn't a magic ticket to automatic investment gains, with a significant risk of sudden downswings and long periods of stalled or negative returns. Sticking with a market tracker like the SPDR S&P 500 ETF may be a better choice if you're not ready for the volatility and technical quirks of Bitcoin investing.\nStill, it's a robust digital currency with an unpredictable yet promising future, and I think a modest position in Bitcoin (or one of the Bitcoin-based ETFs) would be a healthy addition to a diversified portfolio.\nShould you invest $1,000 in Bitcoin right now?\nBefore you buy stock in Bitcoin, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Bitcoin wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of January 8, 2024\nAnders Bylund has positions in Bitcoin and XRP. The Motley Fool has positions in and recommends Bitcoin and XRP. The Motley Fool has a disclosure policy.\nIf You Invested $1,000 in Bitcoin 5 Years Ago, This Is How Much You'd Have Now was originally published by The Motley Fool"]}
{"date":"2024-01-17","titles":["Bitcoin: The Wall Street Takeover Is Complete (BTC-USD)","Bitcoin ETF Fever Boosts Crypto Spot Volumes by 60% YoY"],"urls":["https:\/\/seekingalpha.com\/article\/4663380-bitcoin-wall-street-takeover-is-complete","https:\/\/www.financemagnates.com\/cryptocurrency\/bitcoin-etf-fever-boosts-crypto-spot-volumes-by-60-yoy-in-december-2023\/"],"sources":["seekingalpha.com","financemagnates.com"],"descriptions":["11 ETFs have been approved for Bitcoin. The approval marks the end of decentralization for Bitcoin. Find out why BTC-USD stock is a Sell.","The crypto spot trading volumes for the top 10 exchanges in December 2023 reached their highest levels since June 2022."],"article_contents":[null,"The crypto\nspot trading volumes for the top 10 exchanges in December 2023 reached their\nhighest levels since June 2022, marking the third consecutive month of growth.\nBinance,\nmaintaining its lead, experienced a month-on-month (MoM) increase of 40%  in\ntrading volumes, amounting to $432.65 billion. According to Finance Magnates\nIntelligence, there was an increase of 32% in total trading volume, climbing\nfrom $671 billion to $887 billion. Notably, this period witnessed a\nyear-over-year (YoY) increase of 64%, attributed to the weak industry condition\nin December 2022.\nAfter two\nconsecutive months of growth, expectations were high for December. Bitcoin  \n            Bitcoin\n           \n      While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n     \n    While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n    Read this Term did not disappoint investors, adding 12% to its value in the past month\nand testing new annual highs. This surge in Bitcoin's value significantly\nboosted investor activity, increasing cryptocurrency exchange volumes\nconsiderably.\nBinance\nretained its top position with trading volumes of $433 billion and a market\nshare of 46%. Upbit remained in second place with $92 billion, and OKX held the third\nspot with $87 billion in trading volumes. ByBit also reached the top ranks,\nsecuring the fourth position with $82 billion in volumes.\nIn the case\nof these two exchanges, a very strong MoM and YoY volume surge was recorded,\nwhich amounted to over 40% compared to the previous month and 126% and 209%,\nrespectively, compared to December 2023. However, the record holder in this\nregard turned out to be Upbit, whose YoY volumes grew almost tenfold, by 952%.\n\"Over the past year, we’ve seen a significant recovery in the markets, and expectations around the likely approval of the Bitcoin Spot ETF certainly played into that, particularly in December and early January, when at VALR we recorded our highest daily trading volume to date,\" Ben Caselin, the CMO of VALR, commented.\nBitcoin's\nprice increases and the subsequent rise in trading volumes continued for\nanother month, driven by eager anticipation of the first-ever Bitcoin spot exchange-traded\nfunds (ETFs). Although these ETFs were eventually introduced in 2024, the\nBitcoin market saw dynamic growth in anticipation of their launch, especially\nnoticeable in December.\nIt appears\nthat the upward momentum will continue into this month. Preliminary data for\nJanuary 2024 indicated that spot volumes for exchanges reported by Finance\nMagnates have already reached $500 billion halfway through the month,\nfollowing more than $714 billion in January 2023.\nHowever,\nthe future remains uncertain. Following the introduction of nearly a dozen new\ncryptocurrency ETFs, the market began to exhibit a \"sell the news\"\nscenario, and the new instruments attracted less capital than expected in their\ninitial days of trading. Finance Magnates’ infographic shows that four issuers, namely Bitwise, ARK Invest, Invesco, and WisdomTree, have decided to cut fees to zero for six months, followed by a rate of 0.2 to 0.3%, to attract more capital.\nThe situation for Bitcoin might be saved by the\nupcoming network halving  \n            Halving\n           \n      Halving represents a phenomenon when crypto mining rewards are cut in half. Cryptocurrency networks that run on Proof-of-Work (PoW) algorithms require the computers (nodes) that uphold them to solve complex equations that are used to confirm transactions. This process is known as mining. In exchange for their work, these nodes are given rewards in the form of the crypto token that belongs to that particular network. For example, on the Bitcoin network, halving happens regularly at preset interva\n     \n    Halving represents a phenomenon when crypto mining rewards are cut in half. Cryptocurrency networks that run on Proof-of-Work (PoW) algorithms require the computers (nodes) that uphold them to solve complex equations that are used to confirm transactions. This process is known as mining. In exchange for their work, these nodes are given rewards in the form of the crypto token that belongs to that particular network. For example, on the Bitcoin network, halving happens regularly at preset interva\n    Read this Term, which is expected to occur in April and could\npotentially impact its trajectory.\n\"It’s also good to take stock of the overall and persistent cyclical nature of growth in the crypto space, with the Bitcoin halving marking a new cycle roughly every four years and which is happening again in just under 100 days from now. From that perspective, both Bitcoin’s recovery and the recent spikes in volatility are not too much out of the ordinary,\" Caselin concluded.\nThe crypto\nspot trading volumes for the top 10 exchanges in December 2023 reached their\nhighest levels since June 2022, marking the third consecutive month of growth.\nBinance,\nmaintaining its lead, experienced a month-on-month (MoM) increase of 40%  in\ntrading volumes, amounting to $432.65 billion. According to Finance Magnates\nIntelligence, there was an increase of 32% in total trading volume, climbing\nfrom $671 billion to $887 billion. Notably, this period witnessed a\nyear-over-year (YoY) increase of 64%, attributed to the weak industry condition\nin December 2022.\nAfter two\nconsecutive months of growth, expectations were high for December. Bitcoin  \n            Bitcoin\n           \n      While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n     \n    While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n    Read this Term did not disappoint investors, adding 12% to its value in the past month\nand testing new annual highs. This surge in Bitcoin's value significantly\nboosted investor activity, increasing cryptocurrency exchange volumes\nconsiderably.\nBinance\nretained its top position with trading volumes of $433 billion and a market\nshare of 46%. Upbit remained in second place with $92 billion, and OKX held the third\nspot with $87 billion in trading volumes. ByBit also reached the top ranks,\nsecuring the fourth position with $82 billion in volumes.\nIn the case\nof these two exchanges, a very strong MoM and YoY volume surge was recorded,\nwhich amounted to over 40% compared to the previous month and 126% and 209%,\nrespectively, compared to December 2023. However, the record holder in this\nregard turned out to be Upbit, whose YoY volumes grew almost tenfold, by 952%.\n\"Over the past year, we’ve seen a significant recovery in the markets, and expectations around the likely approval of the Bitcoin Spot ETF certainly played into that, particularly in December and early January, when at VALR we recorded our highest daily trading volume to date,\" Ben Caselin, the CMO of VALR, commented.\nBitcoin's\nprice increases and the subsequent rise in trading volumes continued for\nanother month, driven by eager anticipation of the first-ever Bitcoin spot exchange-traded\nfunds (ETFs). Although these ETFs were eventually introduced in 2024, the\nBitcoin market saw dynamic growth in anticipation of their launch, especially\nnoticeable in December.\nIt appears\nthat the upward momentum will continue into this month. Preliminary data for\nJanuary 2024 indicated that spot volumes for exchanges reported by Finance\nMagnates have already reached $500 billion halfway through the month,\nfollowing more than $714 billion in January 2023.\nHowever,\nthe future remains uncertain. Following the introduction of nearly a dozen new\ncryptocurrency ETFs, the market began to exhibit a \"sell the news\"\nscenario, and the new instruments attracted less capital than expected in their\ninitial days of trading. Finance Magnates’ infographic shows that four issuers, namely Bitwise, ARK Invest, Invesco, and WisdomTree, have decided to cut fees to zero for six months, followed by a rate of 0.2 to 0.3%, to attract more capital.\nThe situation for Bitcoin might be saved by the\nupcoming network halving  \n            Halving\n           \n      Halving represents a phenomenon when crypto mining rewards are cut in half. Cryptocurrency networks that run on Proof-of-Work (PoW) algorithms require the computers (nodes) that uphold them to solve complex equations that are used to confirm transactions. This process is known as mining. In exchange for their work, these nodes are given rewards in the form of the crypto token that belongs to that particular network. For example, on the Bitcoin network, halving happens regularly at preset interva\n     \n    Halving represents a phenomenon when crypto mining rewards are cut in half. Cryptocurrency networks that run on Proof-of-Work (PoW) algorithms require the computers (nodes) that uphold them to solve complex equations that are used to confirm transactions. This process is known as mining. In exchange for their work, these nodes are given rewards in the form of the crypto token that belongs to that particular network. For example, on the Bitcoin network, halving happens regularly at preset interva\n    Read this Term, which is expected to occur in April and could\npotentially impact its trajectory.\n\"It’s also good to take stock of the overall and persistent cyclical nature of growth in the crypto space, with the Bitcoin halving marking a new cycle roughly every four years and which is happening again in just under 100 days from now. From that perspective, both Bitcoin’s recovery and the recent spikes in volatility are not too much out of the ordinary,\" Caselin concluded.\nShare this article"]}
{"date":"2024-01-18","titles":["Top 10 Crypto Trends for 2024, Alpha Sigma Capital’s Predictions for What’s Next in Blockchain"],"urls":["https:\/\/www.globenewswire.com\/news-release\/2024\/01\/18\/2811410\/0\/en\/Top-10-Crypto-Trends-for-2024-Alpha-Sigma-Capital-s-Predictions-for-What-s-Next-in-Blockchain.html"],"sources":["globenewswire.com"],"descriptions":["Alpha Sigma Capital Research has published its Annual Report including 2023 performance and Top 10 Crypto Trends for 2024..."],"article_contents":["January 18, 2024 07:00 ET\n\n\n | Source:\r\n            \nAlpha Sigma Capital Research\n\n\n\n\n\nAlpha Sigma Capital Research\nTampa, FL, Jan.  18, 2024  (GLOBE NEWSWIRE) -- Alpha Sigma Capital Research, a distinguished blockchain research firm operating under Alpha Transform Holdings' subsidiary, today announced the release of its comprehensive 2023-2024 Annual Report which includes their Top 10 Crypto Trends.\n2024 Top 10 Crypto Trends\n1. Bitcoin Halving Approaching2. Tokenization: RWAs    3. DeFi Maturation            4. AI Blockchain Tokens        5. Solana Ecosystem            6. L1 Wars                7. Data Availability Layers        8. Decentralized Computation    9. Augmented Reality and Blockchain Convergence        10. Decentralized Science (DeSci)\nAccess the full report, click here.\nThe Annual Report offers a detailed overview of the 2023 crypto market and presents a thorough analysis of the performance of Alpha Sigma Capital's funds.\nIn 2023, Bitcoin took center stage, fueled by the much-anticipated approval of Bitcoin ETFs. Simultaneously, other Layer 1 protocols experienced substantial growth in user bases and valuations. Noteworthy mentions include established leaders from the previous bull market such as Solana, NEAR, and Avalanche, as well as emerging chains like Kaspa, Injective, and TON (Telegram Open Network).\nThe report provides valuable insights into the performance of ASC Fund's debut fund and the recently launched Alpha Liquid Fund. Additionally, it highlights the firm's strategic focus on index products.\nEnzo Villani, CEO, Alpha Transform Holdings, stated, “The crypto landscape is evolving positively. Risk management is crucial in creating opportunities for investors to enter the marketplace. The first significant step was the approval of BTC ETFs and quickly approaching is the Bitcoin halving in April.\"\nWes Levitt, Co-CIO, commented, “We’re gauging the market's interest in crypto investment. The 2024 trends indicate a sustained evolution in the crypto markets, with blockchain maturation and the acceleration of AI Blockchain.”\nDelving deeper, the report outlines the top 10 crypto trends identified by Alpha Sigma Capital Research, offering a comprehensive understanding of the evolving landscape in the blockchain and cryptocurrency industry.\nThe 2023-2024 Annual Report including Top 10 Crypto Trends can be accessed here.\nAbout Alpha Sigma Capital ResearchActive Investing in the Blockchain Economy.™Alpha Sigma Capital Research is provided by Alpha Sigma Capital Advisors, LLC, the Investment Manager for the Alpha Blockchain\/Web3 Fund and Alpha Liquid Fund.  Alpha Sigma Capital (ASC) investment funds are focused on emerging blockchain companies that are successfully building their user-base, demonstrating real-world uses for their decentralized ecosystems, and moving blockchain technology towards mass-adoption. ASC is focused on companies leveraging blockchain technology to provide value-add in areas such as fintech, AI, supply chain, and healthcare. Apply to receive ASC Research at  www.alphasigma.fund\/research.\nAbout Alpha Transform HoldingsAlpha Transform Holdings (ATH) is a digital asset organization dedicated to ushering in the future of blockchain-powered Web3. With our deep knowledge and expertise, we invest in and advise innovative companies and decentralized projects that leverage blockchain technology to revolutionize traditional industries such as financial services, healthcare, media & entertainment, and more. We work closely with portfolio companies to drive value while creating outsized returns and are renowned for our detailed research on growing blockchain initiatives. Our mission is simple: to accelerate the mass adoption of distributed ledger technology through investments that provide impactful solutions with long-term sustainability. Our vision is an open, connected world powered by secure decentralized systems so that everyone can benefit from the new tech economy. https:\/\/www.alphatransform.io\/\nDISCLAIMER\nThis is for informational use only. This is not investment advice. Other than disclosures relating to Alpha Transform Holdings (ATH) and Alpha Sigma Capital (ASC) this information is based on current public information that we consider reliable, but we do not represent it as accurate or complete, and it should not be relied on as such. The information, opinions, estimates, and forecasts contained herein are as of the date hereof and are subject to change without prior notification. We seek to update our information as appropriate.\nAny forecasts contained herein are for illustrative purposes only and are not to be relied upon as advice or interpreted as a recommendation. The price of crypto assets may rise or fall because of changes in the broad market or changes in a company's financial condition, sometimes rapidly or unpredictably. Past performance is not a guide to future performance, future returns are not guaranteed, and a loss of original capital may occur. Fluctuations in exchange rates could have adverse effects on the value or price of, or income derived from certain investments. We and our affiliates, officers, directors, and employees, excluding equity and credit analysts, will from time to time have long or short positions in, act as principal in, and buy or sell, the securities or derivatives, if any, referred to in this press release.\nThe information on which the information is based has been obtained from sources believed to be reliable such as, for example, the company’s financial statements filed with a regulator, the company website, the company white paper, pitchbook, and any other sources. While Alpha Sigma Capital has obtained data, statistics, and information from sources it believes to be reliable, Alpha Sigma Capital does not perform an audit or seek independent verification of any of the data, statistics, and information it receives.\nUnless otherwise provided in a separate agreement, Alpha Sigma Capital does not represent that the contents meet all of the presentation and\/or disclosure standards applicable in the jurisdiction the recipient is located. Alpha Sigma Capital and its officers, directors, and employees shall not be responsible or liable for any trading decisions, damages, or other losses resulting from, or related to, the information, data, analyses, or opinions within the report.\nCrypto and\/or digital currencies involve substantial risk, are speculative in nature, and may not perform as expected. Many digital currency platforms are not subject to regulatory supervision, unlike regulated exchanges. Some platforms may commingle customer assets in shared accounts and provide inadequate custody, which may affect whether or how investors can withdraw their currency and\/or subject them to money laundering. Digital currencies may be vulnerable to hacks and cyber fraud as well as significant volatility and price swings.\nTampa, FL, Feb.  24, 2025  (GLOBE NEWSWIRE) -- Alpha Sigma Capital Research has released an in-depth report on XNET Mobile (XNET), a pioneering force in the decentralized wireless (DeWi) industry. As...\nTampa, FL, Feb.  21, 2025  (GLOBE NEWSWIRE) -- Alpha Sigma Capital Research has released an in-depth report entitled DeFAI Unleashed, highlighting the rise of AI agents in the crypto world, capturing..."]}
{"date":"2024-01-19","titles":["Crypto Analyst Warns Bitcoin (BTC) Could Be Losing Support, Does a Deep Dive Into Ethereum (ETH)","Opinion: Bitcoin ETFs have turned these crypto analysts wildly bullish"],"urls":["https:\/\/dailyhodl.com\/2024\/01\/19\/crypto-analyst-warns-bitcoin-btc-could-be-losing-support-does-a-deep-dive-into-ethereum-eth\/","https:\/\/www.marketwatch.com\/story\/bitcoin-at-1-million-a-rival-to-gold-bonds-and-the-fed-bitcoin-etfs-have-turned-these-crypto-analysts-wildly-bullish-489f37f4?mod=mw_rss_topstories"],"sources":["dailyhodl.com","marketwatch.com"],"descriptions":["A widely followed crypto analyst says that Bitcoin (BTC) may soon lose support and fall even further. Pseudonymous crypto trader Rekt Capital tells his 388,500...","What the future could hold: Bitcoin at $1 million and rivaling gold, bonds and the Fed."],"article_contents":["A widely followed crypto analyst says that Bitcoin (BTC) may soon lose support and fall even further.\nPseudonymous crypto trader Rekt Capital tells his 388,500 followers on the social media platform X that the loss of support has not yet been confirmed.\n“BTC is losing the Range Low as support\nThis is not confirmed yet however\nA Weekly Close below the Range Low is needed as previously price would downside wick here\nWeekly Close below the Range Low would kickstart the breakdown process.”\nBTC is worth $40,950 at time of writing, down 4% in the last 24 hours.\nDeep diving into Ethereum (ETH) in his latest Altcoin Newsletter, the analyst wonders if the leading smart contract platform by market cap’s recent rally is almost over.\n“Ethereum performed a +19% move across the entirety of its red-red range, revisiting the Range High area, pretty much completing its +22% move from Range Low to Range High, narrowly missing the top of the range by some +2%.\nIs this move over?”\nThe analyst says ETH could drop to the range low again, and that test could potentially be volatile for Ethereum’s value.\n“So if the retest is a volatile one, similar to what we saw last month, ETH could drop into the very low $2000s as per this adjusted green path.\nHowever, if we see an even more volatile retest there, then the green macro Higher Low could come into play as a key support in the highs $1900s…\nIt all depends on the extent of volatility at this Range Low support, which is difficult to assess ahead of time; after all, how can we assess the level of emotionality ahead of time?”\nOverall, the trader believes ETH has completed its big move for the time being.\n“This $2740-$2791 range has acted as a re-accumulation range in the previous cycle.\nCould it become one of the same in this cycle as well?”\nETH is trading for $2,470 at time of writing, down 8% in the last week.\nFeatured Image: Shutterstock\/Benny Studio\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl",null]}
{"date":"2024-01-22","titles":["Bitcoin Price Action Explained: Here's Real Reason Why BTC Dipped After ETF Approval By U.Today","A New Dawn in Crypto: How Spot Bitcoin ETFs Boost Adoption, Reshape Regulation","Will “User-Friendly” ETFs Amplify Market Impact Of The Bitcoin Halving?"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/bitcoin-price-action-explained-heres-real-reason-why-btc-dipped-after-etf-approval-3280049","https:\/\/www.ibtimes.com\/new-dawn-crypto-how-spot-bitcoin-etfs-boost-adoption-reshape-regulation-3722600","https:\/\/www.forbes.com\/sites\/alisonmccauley\/2024\/01\/22\/will-user-friendly-etfs-amplify-market-impact-of-the-bitcoin-halving\/"],"sources":["investing.com","ibtimes.com","forbes.com"],"descriptions":["Bitcoin Price Action Explained: Here's Real Reason Why BTC Dipped After ETF Approval","The introduction of spot Bitcoin ETFs marks a significant milestone, yet many questions and challenges lie ahead for the cryptocurrency ecosystem.","The countdown is on to the next bitcoin halving event, the first to collide with newly available, long-awaited bitcoin ETFs. Could this be a turning point for a..."],"article_contents":[null,"The dynamic landscape of the cryptocurrency industry witnessed a groundbreaking development when the U.S. Securities and Exchange Commission (SEC) officially approved 11 spot Bitcoin exchange-traded funds (ETFs).\nThis pivotal development has ignited a fervent discourse surrounding its potential implications, particularly with regard to market stability, investor sentiment, and the ongoing regulatory deliberations within the United States.\nDavid Bailey, the chief marketing officer at Azteco, a consumer Bitcoin platform supported by Jack Dorsey, shared his insights on these important topics and discussed the implications of this decision for the broader cryptocurrency industry.\nThe approval of spot Bitcoin ETFs in the U.S. was one of the biggest events in the cryptocurrency industry, which brought a lot of promise to the nascent sector.\nBut, what can the crypto community expect from this historic development?\n\"It's important to remember that Bitcoin is a very different thing from the broader 'crypto industry,' Bitcoin was originally designed for people to make electronic payments, whereas most crypto\/altcoins seem to have little use beyond being highly speculative assets,\" Bailey told International Business Times in an exclusive interview.\n\"The SEC's approval of spot bitcoin ETFs (and the subsequent inflows of capital from globally respected firms like BlackRock) will definitely boost confidence in bitcoin. This in turn will help to drive consumer adoption of bitcoin as a solution for everyday payments, international remittances, and personal savings,\" the Azteco CMO added.\nAsked whether the SEC's recent approval of spot Bitcoin ETFs exerted influence on the country's regulatory stance concerning cryptocurrencies, Bailey stated that while regulation can be beneficial, it should not be seen as a panacea for every challenge.\nIn his astute analysis, Bailey drew attention to a fundamental query: the necessity of regulating Bitcoin, considering it is fundamentally a technological innovation akin to the Internet itself.\nBailey, who is also the co-founder and CEO of Aitrak, a platform that offers AI solutions for brands, retailers, and advertisers. also raised a crucial question: the need to regulate Bitcoin, since it is a technology just like the Internet.\n\"It's worth noting that the SEC's approval was somewhat reluctant and contained a highly prejudiced description of bitcoin as being 'used for illicit activity including ransomware, money laundering, sanction evasion, and terrorist financing.' Arguably, it was companies like BlackRock that drove this decision, not the SEC,\" Bailey told IBT.\n\"Unfortunately, regulation has a history of being used to stifle or control innovation. Look at how telecom companies with vested interests tried to use regulation to hinder the growth of innovative services such as Skype and WhatsApp,\" he said, adding, \"Bitcoin is a global technology (much like the internet). Why does it need regulation from local governments?\"\n\"Also, regulation is not the answer to every problem (or even most problems) and it's highly questionable whether Bitcoin really needs more 'regulation' from anyone like the SEC. In the near future, more and more consumers will start using Bitcoin wallet apps like Jack Dorsey's Bitkey to securely manage bitcoin on their smartphones, so they won't even need to use exchanges,\" Bailey further said.\nDuring our exclusive interview, IBT asked the experienced marketing executive whether the persistent price volatility witnessed within the cryptocurrency market can be ascribed to inherent factors.\nIn response, Bailey said, \"The long-term value (and price stability) of Bitcoin depends on how quickly and extensively it's adopted by mass market consumers as a solution for their everyday payments, international remittances, and personal savings. If more people start using Bitcoin in their everyday lives (instead of just storing it), the demand will increase and then the price stability will improve.\"\nThe advent of Spot Bitcoin ETFs is anticipated to engender a process of normalization for Bitcoin within the purview of consumers, effectively setting it apart from the negative connotations associated with other cryptocurrencies.\nThis perceptual transformation may indeed generate heightened interest in Bitcoin, particularly as users come to recognize the convenience of managing it through smartphone applications.\nHowever, the pivotal question remains: Will this heightened interest ultimately translate into mainstream adoption?\n\"Consumers will arguably take more notice of BlackRock (and others) investing billions in a spot bitcoin ETF than they will of the SEC's begrudging approval. The popularity of spot bitcoin ETFs will help to normalize Bitcoin in the minds of consumers and separate it from negative perceptions that surround crypto\/altcoins. This in turn will generate more consumer interest in bitcoin as a solution for everyday payments, especially when they realize that they can use smartphone apps on their phones to manage their Bitcoin,\" the Azteco CMO said.\n\"There are over a billion adults in the world who have a smartphone but don't have a bank account. This means that they have an internet connection and can send WhatsApp messages to anyone anywhere in the world, but they can't make online payments. Bitcoin is an ideal solution for these unbanked, under-banked, and cash-by-choice consumers,\" he further said, emphasizing that the U.S. is behind others when it comes to Bitcoin consumer adoption.\n\"The US is arguably behind in the consumer adoption of Bitcoin. In many parts of the world, bitcoin is used by consumers for everyday payments, international remittances, and personal savings. For example, the Pick n Pay supermarket chain in South Africa now has over 2,000 stores where you can pay for your groceries using Bitcoin,\" Bailey noted.\nCertainly, no discussion concerning Bitcoin would be complete without delving into the Bitcoin Halving event, scheduled for 2024. This event is expected to reduce the Bitcoin mining reward to 3.125 BTC per block from 6.25 BTC per block, carrying significant implications for the bitcoin price and the overall cryptocurrency industry.\nIBT also questioned Bailey about the potential ramifications on the cryptocurrency's network resilience and its capacity to allure a wider spectrum of adoption.\n\"Bitcoin has already proved its reliability and resilience over the last 10+ years (again, setting it apart from the crypto\/altcoins). It's also become quicker and cheaper to use with the introduction of secure second layers such as the Lightning Network. The upcoming halving event will generate more awareness and interest in Bitcoin. This in turn will help to drive consumer adoption of Bitcoin as a solution for everyday payments, international remittances, and personal savings,\" the Azteco CMO said.\n\"The next watershed moment for bitcoin will be when mass market consumers realize that they don't need to use an exchange or an ETF to own bitcoin. Smartphone apps like Bitkey (from Jack Dorsey) allow people to manage bitcoin securely on their phones, while gift cards from companies like Azteco allow people to buy bitcoin in small amounts,\" he added.\nAs the cryptocurrency landscape continues to evolve, the acceptance and understanding of Bitcoin among regulators, investors, and the public will play a pivotal role in shaping its future. The introduction of spot Bitcoin ETFs marks a significant milestone, yet many questions and challenges lie ahead for the cryptocurrency ecosystem.\nAs of 3:10 a.m. Eastern Time on Sunday, Bitcoin was being traded at a valuation of $41,656.95, with a noteworthy 24-hour trading volume amounting to $10.32 billion.\nThe cryptocurrency has exhibited a marginal 0.19% uptick in its value over the course of 24 hours, juxtaposed with a 2.89% decline over the preceding week.\nData sourced from CoinMarketCap revealed that Bitcoin's circulating supply presently amounts to 19.6 million BTC, underpinning its substantial market capitalization, which currently stands at $817.07 billion.\n© Copyright IBTimes 2024. All rights reserved.","ByAlison McCauley\nByAlison McCauley,\nFormer Contributor.\nSamara Cohen, Chief Investment Officer of ETF and Index Investments at Blackrock, stands in Time ... More Square after the opening bell as Bitcoin Spot ETF's are launched on the Nasdaq Exchange on January 11, 2024 in New York City.\nAt its genesis, a policy known as “the halving” was embedded into the Bitcoin\nBTC\n blockchain’s code to reduce the production of new bitcoin approximately every four years. The countdown to the next event is underway, just three months away — and the first to follow the introduction of highly anticipated bitcoin exchange traded funds (ETFs). Should the halving’s shift in supply stir market prices and escalate public attention, now even the crypto novice can instantly add bitcoin to their portfolio as easily as buying a stock (notably, BlackRock’s\nBLK\n bitcoin ETF became the first to achieve $1 billion in investor inflows last week, a milestone closely followed by Fidelity). Could a combination of halving-induced price movement and a streamlined buying experience be the catalyst for a surge of new investors? Or will the crypto world have to wait even longer for bitcoin ETFs to unlock the anticipated floodgates?\nCrypto, as well as Web3 more broadly, has long struggled with high friction user experience (UX), which has impeded adoption across the entire space. Creating a better UX is often the key to unlocking greater adoption in a wide range of industries. This concept is not new; it's a universal best practice spanning sectors from consumer products to finance.\nEarly methods of buying bitcoin required an understanding of digital wallets, rigorous security measures, and complex exchanges. Platforms like Coinbase introduced user-friendly interfaces, making crypto considerably more accessible. However, the emergence of bitcoin ETFs has pushed ease-of-investing even further. ETFs integrate bitcoin investment into traditional brokerage accounts, offering a familiar experience to those already investing in stocks or bonds. Investors don’t need to trust a new provider, open a new account, or learn a new app — they can bypass the nuances of cryptocurrency exchanges entirely and make purchases from their existing accounts.\nThe ETFs also introduce new competitive pressures, with “fee wars” already breaking out among providers. Many scrambled to slash or eliminate management fees to attract early adopters in the days leading up to the U.S. Securities and Exchange Commission’s (SEC) approval of the funds. While Coinbase’s average retail take rate is estimated at 2.5%, many ETFs are available under 30 basis points with introductory rates of 0%. “It’s a quick way to get instant market exposure at a really low cost,” stated financial planner Ben Smith in CNBC.\nEvery four years, the rewards given to bitcoin miners is reduced in half, a pre-programmed “halving” policy to counteract inflation by maintaining scarcity. Historically, these events have preceded rallies in bitcoin's price, capturing the attention of the investment world. While there are many confounding factors that could have contributed to these rallies, the most direct way the halving impacts price is through a change in supply. If there are fewer bitcoin being made available and demand remains constant (or increases), price should rise. As we countdown to the next halving, buzz is intensifying, along with debate over how it will influence bitcoin's trajectory. While many analysts forecast the price could pop after this supply constraint, others argue that the event is already priced in.\nHistorically, halving events have preceded rallies in bitcoin's price.\nAfter rejecting over 20 applications over the last decade, the SEC approved the first U.S. listed ETFs to track bitcoin on January 10 with the approval of 11 applications including from BlackRock, Ark Investments\/21Shares, and Fidelity. The decision was hailed by the industry as a game changer. It is also a move toward much-needed regulatory clarity and formal recognition of bitcoin as a legitimate asset class, which could help to attract more investment and development.\nETFs have transformed investment landscapes since their debut in Canada in 1990 by packaging complex assets into accessible shares. The emergence of bitcoin ETFs marks a milestone, allowing everyday investors to access bitcoin's potential without navigating the complexities of cryptocurrency exchanges. Matt Hougan, Chief Investment Officer of Bitwise Asset Management made the point with CNBC that this includes registered investment advisors, a “many trillion dollar market” who are carving out allocations of 1% to 5%. The power of this development has the potential to make the halving effect on bitcoin price even more pronounced, potentially increasing demand at the same time that new supply is constrained.\nHowever, with greater accessibility comes the potential for heightened volatility. The same features that make ETFs attractive will also make bitcoin's price more sensitive to investor sentiment. If large numbers of investors can move in and out of the asset with ease, we may see sharper price spikes and drops, particularly around significant events like the halving. In an article in Cointelegraph, Basel Ismail, CEO of investment analytics company Blockcircle, made a comparison with 2004’s gold ETF launch that demonstrated a feedback loop correlated to cash transactions in the physical gold market, suggesting that the bitcoin ETFs could serve as accelerants to bitcoin’s price movements — and thus increase overall volatility.\nA cascade of additional criticisms have accompanied the ETFs’ debut. The mismatch between bitcoin’s 24\/7 market and the limited trading hours of the traditional financial system the ETFs operate within could leave investors unable to trade during periods of after hours volatility. Crypto purists will point out that if you don’t hold the keys, it’s not your crypto, and the multiple layers of obfuscation that an ETF imposes between an individual and their asset is an affront to the intent of bitcoin’s original design to disintermediate financial services institutions. Others argue that mining industry margins are already under so much pressure, that this halving event could drive miners — who are responsible for validating transactions and maintaining the integrity of the blockchain — out of the market.\nAs we approach the next bitcoin halving, the advent of ETFs may mark a pivotal turn in cryptocurrency investment. The true test now is whether this streamlined access will catalyze a watershed moment for wider acceptance of bitcoin, or whether it will further challenge the market's stability. What is clear is that, as we edge closer, the anticipation will build towards what will undoubtedly be a defining chapter in bitcoin's narrative, whatever the outcome may be."]}
{"date":"2024-01-23","titles":["Top Cryptocurrencies to Watch in 2024 By U.Today","BUZZ Investing: Echoes Of 'Mission Accomplished' Amid Inflation Battle"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/top-cryptocurrencies-to-watch-in-2024-3280819","https:\/\/seekingalpha.com\/article\/4664321-buzz-investing-echoes-of-mission-accomplished-amid-inflation-battle"],"sources":["investing.com","seekingalpha.com"],"descriptions":["Top Cryptocurrencies to Watch in 2024","U.S. stock markets ended the year strong after the Fed held interest rates steady, prompting revised expectations and signaling lower interest rates in 2024."],"article_contents":[null,null]}
{"date":"2024-01-24","titles":["Solana Prices Continue To Struggle After Reaching Lowest Since Christmas","FedNow, the Federal QR Code and Three Plays from the “FedNow Investor Playbook” teased by Eric Wade","Is Satoshi Nakamoto Still Relevant In 2023?"],"urls":["https:\/\/www.forbes.com\/sites\/digital-assets\/2024\/01\/23\/solana-prices-continue-to-struggle-after-reaching-lowest-since-christmas\/","https:\/\/www.stockgumshoe.com\/reviews\/stansberry-innovations-report\/fednow-the-federal-qr-code-and-three-plays-from-the-fednow-investor-playbook-teased-by-eric-wade\/","https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/01\/36765698\/is-satoshi-nakamoto-still-relevant-in-2023"],"sources":["forbes.com","stockgumshoe.com","benzinga.com"],"descriptions":["Solana prices have continued to suffer today, failing to bounce back notably after dropping to their lowest in over a month.","","Photo by Kanchanara on Unsplash"],"article_contents":["ByCharles Lloyd Bovaird II\nByCharles Lloyd Bovaird II,\nSenior Contributor.\nSolana prices have incurred notable losses lately, falling to their lowest in over a month.\nSolana prices continued to encounter headwinds today, struggling to recoup their recent losses after dropping to their lowest in over a month.\nSOL, the native token of high-bandwidth blockchain network Solana, reached as little as $79.09 this morning, CoinMarketCap data shows.\nAt this point, the cryptocurrency had down nearly 8% from the 24-hour high of $85.82 it attained the night before and was trading at its lowest since approximately December 19, additional CoinMarketCap figures reveal.\nAfter suffering this notable decline, the digital asset experienced a modest recovery, encountering some volatility that saw it approach the $85 level this evening.\nEven after enjoying these gains, the digital currency had not recouped the losses it experienced over the last 24 hours.\n‘Overbought’ Market Conditions\nWhen explaining the cryptocurrency’s latest declines, analysts highlighted a handful of crucial factors, for example voicing their concerns that the digital asset had grown overvalued as of late.\n“Sol, like most of the rest of the crypto market, was terribly overbought leading into the spot BTC ETF approvals,” said Tim Enneking, managing director of Digital Capital Management, noting the U.S. Securities and Exchange Commission’s recent decision to “green light” applications for these exchange-traded funds.\nMarouane Garcon, cofounder of a marketplace for perpetual futures called The Real-World Asset Exchange, offered a similar take on the matter.\n“It seems like Solana’s recent drop can be attributed to a case of overbought conditions,” he stated.\nBrett Sifling, an investment advisor for Gerber Kawasaki Wealth & Investment Management, also chimed in, choosing to focus on traders’ reaction to the bitcoin ETF news.\n“I’m not seeing any major news or catalyst that has been driving the price of Solana down,” he stated. “Rather, I think this correction has been caused by the Bitcoin ETF approval becoming a, ‘Sell the news’ event.”\n“Top market-cap crypto projects have remained correlated and have had a nice run-up into this catalyst, so it’s not uncommon to see such a pull-back after the event has passed,” Sifling emphasized.\nRecent Gains\nIn addition to highlighting the aforementioned causal factors, Enneking pointed out additional variables he believes had a key impact on the recent price movements of the solana digital currency.\n“In Sol’s case, however, the upward movement was compounded by the ‘FTX relief’ rally, as well as technical drivers within the project,” he said, referring to the gains the cryptocurrency markets have enjoyed amid strengthening investor sentiment.\nWhile the digital asset’s price benefited from this situation, the tide has turned, Enneking noted, stating that “now, again just like virtually all of the crypto market, Sol is falling back.”\n“Because it had more forces pushing it even, relatively speaking, than BTC and most other tokens, it is also falling back harder,” he stated, emphasizing that SOL has dropped more than most other major cryptocurrencies in the last 24 hours.\nA Murky Outlook\nGoing forward, Enneking noted that the outlook for the digital currency markets is uncertain.\n“The real question for BTC and most of the rest of the market is when will (or whether) the prospects of the BTC halving, as well as potentially being oversold, reverse this strong correction,” he emphasized.\nDisclosure: I own some bitcoin, bitcoin cash, litecoin, ether, EOS and SOL.","By Travis Johnson, Stock Gumshoe, February 11, 2024\nThis article was originally published on January 24, it has not been updated but new versions of the ad with different headlines are driving questions our way so we’re re-posting here.  If you’re looking for Stansberry Innovations Report’s “#1 AI Stock for 2024” that was covered separately here.\nToday I thought we’d look into a teaser pitch from Eric Wade for his Stansberry Innovations Report ($49)… Wade is better known as the “crypto guy” at Stansberry Research (his pricier “upgrade” newsletter is Crypto Capital, which is currently $5,000\/yr), and Innovations Report is a more generalist “tech growth” letter, but this pitch is pretty crypto-focused.\nAnd the big picture spiel is similar to past “world is coming to an end” spiels about FedCoin and FedNow… but instead of pushing the “fear” button on the potential move to a digital currency in the US, he pushes the “greed” button.  Which is at least a little refreshing after the past year of Nomi Prins and Teeka Tiwari hype about “your dollars are about to be recalled!”\nThe ad does start out with a bit of the “panic” popular among pundits…\n“WATCH YOUR MAILBOX FOR YOUR FEDERAL QR CODE”\n“As part of the biggest shift to the financial system in decades, this Government-issued code could soon be mandatory to access your social security income, pay your taxes and cash your paycheck.\n“‘Saying [it] would be a game changer is almost downplaying the potential impact’ – Forbes”\nThat Forbes quote, by the way, is from one of many articles about FedNow, which is the instant payment network the Fed built and launched last year, in an attempt to finally modernize the rails of the US payment system.  That’s a bank-to-bank network which essentially allows for instant money transfers, which should make the economy more efficient because it should do away with all the persistent delays — like two or three days to clear a check, or transfer money via the ACH.\nThe ‘fear’ part is that a bunch of pundits have been speculating that this FedNow service is the “trojan horse” that will let a central bank digital currency (CBDC) eventually be developed and implemented to replace the current concept of “cash” in the US.  But, thankfully, Wade sticks with the investment angle instead of the “shake your fist at the globalists” angle — and I say “thankfully” not because worries about the loss of financial privacy under a CBDC are necessarily wrong, I share some of the trepidation about how this could evolve over the next decade, but because fretting about a CBDC is essentially irrelevant to your investment portfolio.  It’s just a fear marketing target that the marketers (and politicians) have learned they can push.\nBut like I said, Wade pretty quickly shifts to “greed” on this… here’s a bit of the ad:\n“That means you have a choice to make…\n“You can get angry about the idea of the new, fully digital financial system being rolled out today – and I can guarantee you, millions of ordinary folks will do exactly that…\n“And look, I’m not telling you not to keep money in cash or gold… I think alternative and conservative assets are critical ways to hedge risk.\n“But just as important is backing the companies making the update happen – and riding them as far and as fast as they’ll go.\n“I think just a tiny investment in these companies will be the single best financial decision of your life.\n“Years from now your friends and family will ask you how you saw it all happen.\n“What you choose to do is entirely your call, of course.\n“But just remember what history tells us…\n“When Western Union launched its telegraph enabled “lightening lines,” it transformed itself into one of the biggest companies in America…\n“When Paychex helped launch the credit card and bring plastic money to America, it rose 45,000%…\n“And when Mastercard helped roll out chip and pin money across the country, it rose 8,873%…\n“A $5,000 investment in either of those stocks would have made you hundreds of thousands of dollars richer.”\nSo that’s the basic idea, big-picture wise:  Buy the investments that will benefit from the world of money becoming even more digital than it already is, and that will benefit from the FedNow network.\nBut which stocks might those be?\n“PLAY #1: FedNow’s Secret Partner\n“My No. #1 play is already working hand in glove with the Fed.\n“That’s a fact.\n“It’s one of the handful of technology firms the Fed has hand chosen to be a part of the fast growing FedNow ecosystem.\n“That puts it in a position most fintechs would pay a billion dollars to be in.\n“It’s right at the beating heart of the build-out of the new financial system – working alongside huge financial institutions that’re part of FedNow.”\nNo, I wager that most fintechs would not “pay a billion dollars” to join the FedNow system and be part of the transformation.  That would be dumb — pretty much any financial institution or technology company can work with FedNow.  They have to jump through hoops to work with the government, as all contractors are used to doing, but most of the established financial technology companies already work with the Fed and with tons of banks, this is not some exclusive club that other people aren’t allowed to join.\nWhat else does Wade say about this favorite pick?\n“… while there are currently 41 financial institutions working as part of FedNow…\n“That number is expected it explode 24,290% in the very near future.\n“Soon, there’ll be 10,000 banks and credit unions nationwide incorporated into FedNow.\n“And the play I’ve found for you will be right there working alongside them.”\nOK… so what exactly does this “fintech” do?\n“It’s built a super-secure payment network that would be a giant step forward for our current financial system.\n“Consider…\n“Right now, VISA can process around 1,700 transactions per second…\n“Mastercard can handle 5,000.\n“(For reference, bitcoin can only handle 7 transactions per second.)\n“But this superfast network can process TEN THOUSAND transactions per second.\n“That’s 600,000 per hour.\n“And because it’s “always on”… this network runs seamlessly, 24\/7.\n“There are no outages at night or over the week.\n“Meaning it can process 14.4 million transactions a day.\n“And a hundred million transactions every single week.\n“In fact, in the first quarter of 2023, this network processed SIX BILLION transactions.\n“And it does it using the latest security protocols… in a completely transparent way… and with almost no latency.”\nOK, so it’s some kind of payment network… which means he’s probably pitching a cryptocurrency, but it could be a “fintech” company as well.  Other clues?\n“… it won’t surprise you to know that this network isn’t just working with the Federal Reserve…\n“It’s also partnered up with $100 billion software giant ServiceNow…\n“Not-for-profit organizations like the Coupon Bureau…\n“And the second largest law firm in America.\n“Not only that, some seriously big corporations are directly involved in building this network out.\n“Companies like Google… IBM… Boeing… LG Electronics… and Deutsche Telekom.\n“But here’s the cool part…\n“You can currently buy into this network for less than a dollar.\n“All you need to do is grab a copy of the FedNow Investor Playbook report I’ve put together for you.”\nSo… hoodat?  Eric Wade is very likely teasing Hedera, which you can “buy into” through the network token HBAR.  And it is indeed way under a dollar, HBAR goes for about 7 cents these days.  HBAR has roughly a $2.3 billion “market cap” (number of circulating tokens X token price), which puts it in the top 50 cryptos by size.  The Hedera hashgraph network and technology are being used, to one degree or another, by the Coupon Bureau, mega law firm DLA Piper (on their TOKO project), and  ServiceNow, and they have at least some connection to all the other specific “partners” who are involved in building out the Hedera network.\nWhat is Hedera?  It is trying, like many other crypto projects, to position itself as the rightful heir of bitcoin and ethereum as the “next generation” network. Here’s how they describe themselves:\n“The 3rd generation public ledger\n“Bitcoin pioneered decentralized infrastructure and Ethereum brought programmability. But earlier proof-of-work blockchains consume massive amounts of energy and process transactions slowly in order to achieve acceptable levels of security. Heavy bandwidth consumption by these technologies leads to expensive fees, even for a simple cryptocurrency transaction.\n“The Hedera proof-of-stake public network, powered by hashgraph consensus, achieves the highest-grade of security possible (ABFT), with blazing-fast transaction speeds and incredibly low bandwidth consumption. By combining high-throughput, low fees, and finality in seconds, Hedera leads the way for the future of public ledgers.”\nAnd they include this handy chart to emphasize that point:\nWill Hedera’s token soar higher in the years to come?  No idea.  They did spike higher during the 2021 mania, when pretty much all cryptos were soaring, so they got to 50 cents or so back then, but over the past 18 months or so the price has mostly bounced around between five and ten cents.  As with any network, the potential economic value should eventually be driven by how much the network is used — the “earnings” of a crypto network are the fees that are charged to move tokens around, and the tokens that are “staked” to the network are the ones who earn a share of those network fees, and tokens are fungible and limited in number so the value of any token should be some multiple of the earnings, or the potential earnings, from those staked HBAR tokens.  The returns of any particular crypto token from staking can vary widely, partly because the fees vary widely, but HBAR has a fixed maximum staking reward that seems to be designed to maximize efficiency and keep costs very low.  Back in August their Governing Council set the maximum staking reward at 2.5% (down from 6.5%), and also stipulated that only 13% of the tokens will be eligible for a full 2.5% staking reward (so if more than 13% of tokens are staked, the reward rate will be dropped for all of them).\nThat tells me this is more of a “growth” investment idea than a “yield” or “valuation” idea in the crypto space.  You can’t envision a clear economic reward from being part of the network at the current yield, so you have to imagine that the network becomes vastly more popular and gets used much more in the future, which might increase the potential yield (the fees are very low, and they’re intentionally low in order to encourage the use of smart contracts and micro-transactions, but if there are 10,000X as many transactions, the fees will eventually add up and, at least theoretically, provide more potential yield for the tokens that are staked, which would make all tokens theoretically more valuable).\nThat’s how I see it, anyway.  Buying into a token that runs a network is inherently a different kind of economic relationship than “owning a business” or “lending money to a business,” so it’s a pretty foreign concept for me, but in general the network should become more valuable if it becomes much more widely used, which means there will be more reward available for being part of the network, which means those tokens should be worth more.  But there’s no really objective way to decide how much a token should be worth today, at least for me, beyond that current potential “staking yield” of something between 0 and 2.5%.\nIf that sounds like gobbledygook, here’s the CoinMarketCap description for a different flavor of gobbledygook:\n“The HBAR token has a dual role within the Hedera public network.\n“First and foremost, HBAR the fuel that powers Hedera services, such as smart contracts, file storage and regular transactions. Second, it’s used to help secure the network, since HBAR users can stake their tokens to assist with maintaining the integrity of the platform.\n“Hedera (HBAR) is the native cryptocurrency of Hedera Hashgraph, a platform that is positioned as an alternative to traditional blockchain technology and aims to excel in speed, efficiency and security.\n“Older blockchains tend to use a consensus mechanism like proof-of-work (PoW) to validate transactions, while younger blockchains opted for proof-of-stake (PoS). The Hedera Hashgraph system has a structure that was created from scratch particularly for the project. Hedera is based on a PoS model that is believed to increase the efficiency of transaction verification in the network, provide a high level of security, and protect the network from hacker attacks. Its ecosystem has the underlying hashgraph consensus algorithm and the global enterprise governing body.\n“Hedera Hashgraph is a distributed ledger technology (DLT). According to the project website, Hedera differs from other blockchains because it uses a new consensus algorithm called hashgraph. It intends to process and execute transactions faster, eliminate delays, and smooth out the TPS (transactions per second) indicator. Hashgraph is claimed to be an upgrade in transaction speed, cost, and scalability.”\nSounds pretty cool and a little bit mysterious, like pretty much every real cryptocurrency project.  And yes, Hedera does have a pretty impressive group of partners in their ecosystem… and one of their projects, a micropayments tool called Dropp, was added to the FedNow list of service providers over the Summer, which gave the HBAR token a little boost, but for the most part HBAR has acted like a lot of other cryptocurrencies, which means it moves along with bitcoin most of the time, though with more volatility.  Here’s the chart of HBAR and BTC over the past six months, that little August spike of HBAR, in green on the left, was when the FedNow connection was first made and publicized.\nWorth your money?  That’s your call.  I don’t dabble very much in cryptocurrency projects, for the most part, but I do hold a bit of Bitcoin and Ethereum, and I have put tiny amounts of money into other cryptos from time to time.  I can see why folks would want to put a tiny portion of their speculative portfolio into next-generation ideas that could play out — even if the economic value of those crypto tokens or networks is quite ineffable at the moment.\nI suspect the price will be driven much more by story and speculation over the next year than by anything else, and perhaps a lot of cryptos will surge higher in the wake of Bitcoin’s potential for increased demand as the bitcoin ETFs roll out and begin to gather more institutional money, but I don’t have much ability to even guess at a rational valuation for these kinds of tokens… which means I shouldn’t be putting more money in than I’d wager at the blackjack tables on a trip to Vegas.   Your opinion could easily differ, and I imagine many Gumshoe readers are much more immersed in the cryptocurrency world than I am, so feel free to use the comment box at the bottom to tell me why I should invest in HBAR… or, for that matter, in whatever your favorite crypto might be.\nBut that’s not all we hear from Wade, he also teases two other “plays” on FedNow and the digitization of money…\n“PLAY #2: The “Tollbooth” of the Next Generation Financial System\n“The tollbooth is perhaps the best moneymaking idea in human history…\n“You sit by the side of the road… and collect a small charge from everyone who passes by.\n“There’s nothing complicated or nothing hard to understand about it…\n“It’s all about being in the right place at the right time.\n“So long as there’s plenty of traffic passing through your tollbooth, you’re making money.\n“And that’s exactly the principle behind the second play I want to share with you.\n“It’s owns a ‘tollbooth’ on the fast-changing financial system.\n“In fact, it made $4.5 billion last year, simply by collecting a ‘toll’ as investors and traders move into the market.\n“Even better, it passes millions of dollars of that cash back to its shareholders.\n“Which makes it a great way of getting paid as traffic in the new financial system picks up.”\nWill FedNow increase the velocity of money transfer enough that it actually picks up the level of investing and trading activity?  That seems to be the basic pitch there, if this firm is earning $4.5 billion by “collecting a toll as investors and traders move into the market.”  I’d guess that impact would be pretty muted, but let’s see what other clues we get…\n“… every investor – whether you’re a private investor or a trillion dollar sovereign wealth fund – has to route their trades through a gateway into the financial system.\n“And for every trade you can think of – stock, option, bond, gold, crypto – the owner of that gateway earns a fee.\n“And my second play is one of the best in the business at collecting these fees.\n“Not only that, it’s moving into the digital markets space as we speak… thanks to a huge acquisition it just made for a digital asset and derivative market.\n“And it’s recently partnered with asset-management giants like Fidelity, WisdomTree, VanEck and Invesco to move into the digital currency space.\n“That makes it a perfect way to capitalize on the shift to an all-digital financial system.”\nThat last bit, tying in Fidelity, WisdomTree, VanEck and Invesco, probably means that he’s talking about one of the firms that enabling the Bitcoin ETFs being launched by those firms (or back when this ad was probably written, being planned by them).\nSo what’s our match here?  Well, there are several of the large exchanges and financial overlords who could fit this tease, but the best fit for the specific clues is the CME Group (CME), leader of the futures markets… though probably the best match conceptually is their cousin the CBOE (CBOE).  Those used to be the Chicago Mercantile Exchange and the Chicago Board Options Exchange, and along with the Intercontinental Exchange (ICE), which owns the NYSE, they’re among the biggest exchange operators.  Operating an exchange, which used to mean a physical trading floor but now is almost entirely digital, is one of the world’s great businesses — and it seems as though the CBOE and CME, which offer some specific proprietary products, including licensed rights to things like the S&P 500 index options for CBOE, are among the best at keeping their fees from getting competed away.\nCBOE is more actively involved in the Bitcoin ETFs, they advise or work with all those named players and have been active in cryptocurrency trading, including bitcoin and ethereum futures, and they did buy a digital exchange a little while ago called ErisX (now remaned CBOE Digital).  That’s very likely the match for Eric Wade’s pitch here, and my impression is that they have their fingers in more crypto projects and products than the other big exchanges, but they have never actually had $4.5 billion in revenue (they’re just shy of $4 billion right now).  CME is not as good a match conceptually, but it matches that specific $4.5 billion clue… and they pay a much higher dividend as well if you’re interested in that “passes millions of dollars back to shareholders” bit.\nSo we’ll settle on CBOE Global Markets (CBOE) as our “best guess” here, but can’t be 100% certain.  CBOE is a great company, and trades at a pretty rational valuation even after spiking much higher over the past six months — at about $190, a new record high, the stock is trading at about 28X trailing earnings and 23X their forecasted earnings of $8.35 in 2024 (which would be almost 10% earnings growth from 2023, similar to the prior year’s growth rate).  They pay a dividend of about 1% these days, but have also consistently bought back stock over the years, so the share count has also shrunk about 1% per year.  It’s a great business, and they essentially own some big markets, like S&P index options and VIX options, but I should note that at this point, everything related to cryptocurrencies is so tiny, in relation to the size of the index options market and the general equity options trading volume at CBOE and their other businesses, that the CBOE Digital business is really a rounding error.  We may see the Bitcoin ETFs drive more trading volume on the CBOE, which could help, at least incrementally, but the big driver for CBOE is just “trading volume” in general — the more people invest and trade, the more they make by shaving off their tiny “toll” while the money flies around their exchanges.  I wouldn’t talk you out of buying CBOE, even at a new all-time-high price today, it’s likely that you’ll do fine if you hold the stock for long enough, even though the earnings will almost certainly dip if trading volume collapses in a prolonged bear market… but don’t buy it because of FedNow or your sentiment about cryptocurrencies, none of that matters very much to CBOE’s bottom line at this point.\nAnd there’s one more… what else does Wade tease?\n“PLAY #3: The unknown network building the financial “KILLER APP”\n“We’re in the middle of a shift not just to the way money works… but the digitisation of the entire financial system.\n“Ultimately it’ll disrupt the way every stock… bond… ounce of gold… or piece of real estate… gets traded.\n“Before long, it’ll all be traded digitally, using super-fast, super-secure networks like the blockchain. (It’s already happening – the Bank of America claim more than $1 billion in “tokenized” gold was traded in March 2023 alone.)\n“JPMorgan analysts claim the technology that makes this possible will be the financial world’s “killer app.”\n“And I think I’ve found the network that’ll make it possible.\n“I’m not alone.\n“The institutions this tiny company is working with right now is about as prestigious as it gets.\n“Consider… it already has partnerships with Credit Suisse and Deutsche Bank…\n“…the Central Bank of Italy…\n“…payments firm Stripe…\n“…Starbucks… Adobe… META… Adidas… Disney… the NFL… and DraftKings.”\nGoing by the teased partners whose names Wade drops here, that’s very likely a pitch for the crypto smart-contracts platform Polygon, which is an Ethereum “scaling system” designed to improve Ethereum by making it faster, and therefore he’s probably recommending a purchse of the Polyton network and it’s token, MATIC.  Polygon says the “current reward percentage” for staking is 4.95%, though I don’t know how much of that flows through to the folks who stake their tokens to help with validation on the network.  Polygon Labs has received a good chunk of venture capital funding as well, and I don’t know whether that equity investment is separate from their tokens, but it seems likely — most of the time, the token owners don’t actually “own” the business that created the technology, tokens are typically investments in the viability and trading volume and fee generation of a network, not investments in “owning” something.\nPolygon is also pretty big, with a “market cap” of over $6 billion (it was around $20 billion in the 2021 heyday), and it does have a lot of big-name partners who have used their network for things like NFT development — I came across this graphic, and it seems to mesh accurately with press releases I’ve read:\nWill MATIC end up being the best “scaling layer” for Ethereum?  Will that lead to a higher value for MATIC tokens as they process more and more transaction volume, taking that weight from the (pretty expensive) ethereum network?  I dunno.  Maybe.  They do have a limited number of tokens, like many crypto projects these days, so there’s some potential, and they do say that their “gas” fees are quite low, averaging about 1.5 cents, so it’s nowhere near as inexpensive as HBAR claims to be, but it’s a lot cheaper than basic ethereum transactions.  Beyond that, I’m way out of my comfort zone in judging how valuable any of these specific networks or tokens should be… but it’s at least pretty clear that Wade is pitching Polygon.  Do with that what you will.\nThat’s all I’ve got for you today on these three “FedNow Plays” from Eric Wade — a couple cryptocurrencies and one of the large financial exchanges.  Think FedNow will light the candle for these rocketships?  Just marketing hype?  Have other favorite plays on the future of digital money?  Let us know with a comment below… and thanks for reading!\nDisclosure: Of the companies mentioned above I own shares of Google parent Alphabet, and I also own some Bitcoin and Ethereum.  I will not trade in any covered investment for at least three days after publication, per Stock Gumshoe’s trading rules.\nPlease do not use personal information (like your email address) in the text of your comments. Links to outside information and information share are welcome, soliciting is forbidden -- Stock Gumshoe cannot serve as an exchange for buying, selling or trading information beyond what you post in your comments for public view.\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\nare you nreferring to  matic-usd or matic-eth. -big difference in price !\nLooks like MATIC is trading for about $0.70, or for about .00033 ETH.  Which is also a little over 70 cents, if you translate Ethereum to US$.  MATIC-USD and MATIC-ETH seem pretty much the same unless I’m missing something.\nTravis – Is there a way to buy the MATIC concept without being involved in Crypto or ETH?\nwhat technologies are behind the MATIC name and what companies are connected?\nI’m not aware of any way to invest in Polygon’s technology or their MATIC cryptocurrency without buying the cryptocurrency itself.  Almost every large bank or financial services company is using blockchain in some way, either partnering with existing crypto teams or building their own, I’m not aware of anyone in this sector that has a particular “edge” on that… and frankly, the growth of the FedNow system is probably a negative for those kinds of cryptos, since they exist largely to speed up peer-to-peer transactions, and to some degree the modernization of the interbank system in the US will take away the appeal, since it will bring the slow 2-3 day ACH clearance process up to “modern” speed, make those transactions instant without using cryptocurrencies, and take away some of that casual demand for cryptos as a tool for speeding up money transfer.\nCertainly not an expert on financial technology, though, maybe there’s a leader behind the scenes that I don’t know about.\nthey aren’t at TD Ameritreade\nThe cryptocurrency ones?   Yeah,\nNot many brokers deal directly with those.   They’re pretty big, so I imagine they’re  trading on most crypto exchanges, but haven’t checked.\nTD Ameritrade (at least in Canada) does have 2 listings for Ethereum and Bitcoin through 3IQ.  Full disclosure, I had a position in both and did pretty well but sold in early 2022 . I wanted to sell in November 2021 but got talked out of it…trust yourself  I guess or maybe its better to say, trust your conclusions.\nIn the digital realm of cyberspace whales, Michael Saylor may be the elephant in the room.\nI have never bought into crypto coins because, customer token quantities are protected by Blockchain, however, the dollars are in wallets (accounts) in an Exchange (bank) that is NOT protected by blockchain.\nHow many times have off-shore hackers sucked millions of $$ from those exchanges??\nAbout 1 year ago I got E-mailed a certificate for 100 Unicoins priced at 1 cent each.  I get E-mail updates and this crypto is very different.  They went on a big advertising campaign and mase massive sales at 20,000 coins at a time and made millions.  Rather than putting the dollars in an exchange they bought property as in investing.  A copper mine in S.A. and a Lux resort in Thailand etc.  Now a Unicoin is worth 50 cents.\nThey are planning to be listed on the stock market in 2024.  Travis have you looked into Unicoin???\nThanks for all you do, even for us retired folks.\nNope, I don’t know that story at all — thanks!\nCrypto, or The Blockchain, is real and Eric is correct, a Digital Dollar is coming. I’ve been warning people since the 70’S that this is the Fifth World Empire from Daniel’s prophecy in the Bible. It will not be a Military Empire like the first four, it will be Economic.\nI’ve done well with crypto. Bought INJ at $2 and it was recently up over $50! Bought ETH @ $700 and BTC at $20K. There’s still time!\nBlessings\n“Not your keys, not your coins”. Keeping crypto in a CEX isn’t a great idea – self storage is the way to go, preferably a cold wallet.\nHi Travis Can you do a quick review of Joe Duarte MD review of the Apple supplier of new tech? He sent out a review via email on 30 Jan 24 called Profit Catalyst Alert. ($995 pa)  Apparently Apple need the small teased company’s input to make the new Vision Pro Headset work. The urgent call is to get in to this small company  before Apple announces on 2nd Feb.  Thanks\nDude, send Travis the link to that letter @\nILoveStockSpam@gmail.com\nand he will review it.\nThanks for the overview.  I just received a very long video message from Wade.  He misrepresents the “new” FEDNOW program and offering the concept of an individual “code” to log onto their network.  That is not the purpose of FEDNOW as you have correctly presented.  It is refreshing that Stansberry has now decided to go with the GREED factor rather than play the FEAR factor.\nIt is interesting that this report does not include any reference to the BTC Halving event that we have all hoped Gumshoe would be all over!  Just like the Solar Eclipse, there will be a lot of attention leading up to the event. Will there be any long term repercussions the BTC halving?  Stay Tuned!\nPlease do not use personal information (like your email address) in the text of your comments. Links to outside information and information share are welcome, soliciting is forbidden -- Stock Gumshoe cannot serve as an exchange for buying, selling or trading information beyond what you post in your comments for public view.\nWe use cookies on this site to enhance your user experience. By clicking any link on this page you are giving your consent for us to set cookies.","Photo by Kanchanara on Unsplash\nOn October 31, 2008, the mysterious figure Satoshi Nakamoto released an unprecedented paper titled \"Bitcoin: A Peer-to-Peer Electronic Cash System.” The timing was uncanny. The US and the world were still reeling from the worst financial crisis in a long time—since the Great Depression.\nToday, fifteen years since the Bitcoin white paper was published and fourteen since the first Bitcoin block was mined, the pioneering cryptocurrency is still going strong. It's been through many challenging cycles. Through it all, it continues to threaten the dominance of the same institutions that brought about the 2008 recession.\nHowever, the Bitcoin of the present is arguably different from when it started. It is now the world's largest digital currency, thriving with millions of users globally and a newly-reclaimed $800 billion market cap. Bitcoin's ecosystem is robust, with a reliable mining network in multiple countries, extensive wallet support, and numerous dynamic exchanges where you can buy and sell it.\nBitcoin's development ecosystem is also dynamic, with engineers working on their interpretations of the protocol. They've created forks of Bitcoin, developed new ways of sending faster micropayments, and experimented with expanding the blockchain.\nEven finance and regulatory experts have developed their concepts of what Bitcoin should be, turning it into a reserve asset and a formal investable product in traditional markets.\nWith such innovations, players, and applications in the space, some veering off considerably from Satoshi's original vision, is Bitcoin's creator still relevant in 2023?\nIn Bitcoin's early days, Satoshi was active in online forums. Bitcoin's creator carefully laid the groundwork for what would become the world's first successful experiment combining cryptography, payments, decentralized networks, hash functions, economic forces of supply and demand, synthetic scarcity, open source, and others.\nBitcoin's early core developers took on the challenge, along with early miners and experimenters who used the cryptocurrency to pay for mundane things such as pizza.\nFor Bitcoin believers, the technology changed everything. Satoshi Nakamoto's development of Bitcoin in 2008 has been hailed as a breakthrough in the world of money and currency.\nThe first example of a digital asset that can be transferred over the internet without the need for a verifying third party, it promised to render traditional banks nearly insignificant and even challenged the existence of central banking by its independent code.\nAs a digital asset, bitcoin has no backing or perceived \"intrinsic value\"—at least by the traditional definition of money. Even though it has exceeded a decade of existence through tremendous bull runs and numerous market cycles, the asset is still not deemed fully mature.\nHowever, it currently enjoys much wider acceptance and a price reaching the tens of thousands—a far cry from the fledgling coin trading for a few dollars. Bitcoin is traded internationally, experimented on, used as payment and a store of value, and recently, proposed as a formal investment instrument in the form of ETFs.\nSo, where does Bitcoin get its value? It all returns to its architecture and the fundamental monetary problems it solves.\nIn the past, there were many attempts to create online cash. The concept of digital currency isn't exactly anything new. It's several decades old.\nIn the 1980s and 1990s, people started experimenting with anonymous e-cash protocols. Such protocols relied on a cryptographic primitive, Chaumian blinding, created by legendary computer scientist and cryptographer David Chaum. Chaumian blinding conferred privacy properties to digital currencies.\nHowever, in those times, the concept and protocols spun from it failed to gain traction. This failure was due to their reliance on centralized intermediaries.\nAnother noteworthy project was b-money in 1998, created by Wei Dai. B-money was the pioneering proposal on money creation based on solving computational puzzles. It also pioneered the idea of how decentralized consensus could be implemented.\nIn 2005, the concept of reusable proofs of work was invented by Hal Finney. Reusable proof of work is described as a system that draws from several ideas, including that of b-money and the Hashcash puzzles of Adam Back. These concepts were combined to create the budding picture of what appeared to be a first attempt at cryptocurrency. Finney's initial model failed because it relied on trusted computing for its backend.\nA few years later, in 2009, an improvement on Finney's concept emerged. This time, the invention had no centralized issuer or controller. The mysterious and pseudonymous author Satoshi Nakamoto further combined all the previous experiments and created a whole new model.\nSatoshi picked established primitives for ownership management via public key cryptography using a consensus algorithm to track ownership of the coins in the system. This decentralized concept was known as \"proof-of-work.\"\nPhoto by Shubham Dhage on Unsplash\nAs engineers understood Bitcoin further, they dissected its underlying stack. They referred to it collectively as \"blockchain technology,\" a term referring to the chain of transaction records and other mechanisms behind Bitcoin, all leading up to a tool of distributed consensus.\nThe evolution of blockchain technology as an entity has impacted finance and various industries. Programmers and engineers expanded blockchain's applications. They charted a new path and created other digital assets outside Bitcoin.\nBlockchain technology can be programmed to represent a variety of independent currencies and financial instruments with their own arbitrary rules. You can use it to design custom coins with unique features and purposes whose validation depends on their mining pools and other methods, such as staking.\nMoreover, the blockchain has also been used to represent ownership of underlying physical assets, leading to coins representing smart property. Tokenized real estate and digitized property ownership became entirely possible with blockchain technology.\nThrough real estate tokens, property can be digitally investable and transferable. In addition, such tokens pave the way for more innovation and accessibility in real estate investment—beyond what we know today. Even legal contracts concerning property can be made simpler using the versatility and programmability of the blockchain.\nOther protocols, such as Ethereum, created Turing-complete blockchains. You can use Turing-complete language to create smart contracts that encode arbitrary state transition functions. Ethereum expanded the ideas around Bitcoin, allowing developers more freedom to experiment and delve into the possibilities of various transactions online beyond payments.\nThe ecosystem has diverging beliefs, many of which go beyond Satoshi's original vision. Some crypto developers and users think Bitcoin has stagnated and ceased to become innovative, hence the reason for exploring other blockchains.\nCertain Bitcoin proponents, on the other hand, believe that Bitcoin's slower pace of change contributes to its strength, seeing its top application as that of a reserve asset—digital gold.\nConservative investors think there's no need to fix something that isn't broken—the crypto experiments will continue and fail while Bitcoin remains the most reliable. It is, after all, the asset with the longest track record amid a sea of experimental crypto projects.\nBitcoin's founder left a trove of ideas and messages that deliver clues on whether or not he intended Bitcoin's diverse state of development and expansion in the future. Some ideas are embedded in the white paper, while others are written in forum posts. These ideas provide insight into whether his views may be considered archaic by today's standards.\nThe concept of “trustlessness\" came to fruition with bitcoin. A trustless system does not require transacting parties to trust or even know one another. Bitcoin enables all transactions to be recorded on a blockchain, which is immutable and public.\nSuch immutable and public records, independently validated by a network of miners, do not require a trusted third party to validate the truth behind the transactions. Trustless systems, therefore, allow peer-to-peer (P2P) transactions. Anyone anywhere can conduct an anonymous transaction without needing the banking system or a network of central banks.\nSatoshi expressed that the root problem with conventional or fiat currency is the trust required to make it work. To function correctly, the system must trust the central bank not to debase the currency. However, the history of fiat currencies proves that central banks have repeatedly breached that trust.\nTrustless systems, therefore, are the opposite of centralized systems embodied by banks. Every centralized system we've used to hold and transfer money has used authority to verify data and decide on the data.\nCentralized systems have been proven to be vulnerable to theft and hacks. One of their foremost vulnerabilities is the problem of data alternation or manipulation. With Bitcoin, it is tough to alter the transaction record as one-way hash functions protect it.\nEven so, centralized systems are still the dominant way people keep, spend, and move their money today. Governments and banks have also continued to ensure their dominance. However, Bitcoin and the rest of crypto have presented a rival to such systems. Digital assets and the technology behind them have provided the unbanked with alternatives to financial inclusion.\nOpen source has democratized the way we approach software and invention. Open-source code is code written for everybody. It is posted publicly on the internet. It forms the backbone for Bitcoin, Ethereum, and other crypto protocols.\nThe concept of open source predates Bitcoin and cryptocurrency. It was first popularized as a phenomenon in the 1990s when people first posted code publicly online. Today, the open-source culture has penetrated all sorts of online behavior. Linux, for instance, is still crucial to 37 percent of websites. Linux is an open-source operating system.\nSatoshi Nakamoto has expressed the importance of open source to Bitcoin and its design. He believes in the independent review of code. In closed-source systems, it is not possible to verify the security. He thought it was essential for a program of this nature to be open source.\nSatoshi stated that banks, by default, must be trustworthy enough to hold our money and transfer it electronically.\nHowever, they can lend it out in waves of credit bubbles. They lend out our money with barely a fraction in reserve.\nMoreover, we have to trust them with our privacy and information. We are required to trust them not to let identity thieves drain our accounts. Their massive overhead costs make micropayments impossible.\nThe Bitcoin we use today has evolved from the Bitcoin that Satoshi Nakamoto and its early developers created between the late 2000s and early 2010s. Since then, there have been several technical upgrades, some hard forks, and numerous experiments on Bitcoin's use cases.\nNothing gauges Satoshi Nakamoto's ensuring relevance better than the state of Bitcoin this year. Now that we've reviewed Bitcoin's origins and fundamentals, we move toward the present and future. What are the highlights of the Bitcoin ecosystem in 2023?\nTrue to its decentralized nature, Bitcoin is evolving in many ways, as all individuals and organizations interpret it differently.\nBlockchain tokens—built on Bitcoin or other platforms—allow digital representations of property ownership and can even be traded online. However, as regulators have been focusing on reeling in the crypto and blockchain industry, you must balance such investment behavior with consultations with legal professionals.\nWe are also seeing the rise of real estate purchases using Bitcoin. There are several ways to buy real estate with bitcoin and other crypto. A select group of real estate companies and agents have experience accepting Bitcoin for property purchases. However, if you plan to use Bitcoin to buy real estate, you must ensure you don't need to obtain a mortgage. Treat it as a cash purchase. Most banks are hesitant to accept such transactions.\nIsaac Zisckind, real estate lawyer and senior partner at Diamond and Diamond Lawyers, one of Canada's largest real estate law firms, understands the potential of a highly automated real estate market built on the blockchain.\nHowever, he says, \"You need legal advice to handle real estate transactions if you are interested in buying or selling a property digitally, be it residential or commercial. A new technology doesn't exempt you from legal ramifications.\"\nThe larger crypto developer community has been dynamically experimenting with ownership via blockchain tokens. Though such concepts are offshoots of Bitcoin's original technology, Satoshi needed to show clear indications that he expected the Bitcoin blockchain to be used to represent real-world assets.\nIn 2023, crypto winter has finally shown signs of thawing. We've seen traditional markets move from sluggish to bullish. Bitcoin, no matter the circumstances, has proven its fundamental value.\nMoreover, developers and engineers have continued to build relentlessly around it. Entrepreneurs have also navigated the touch climate to continue evolving their startups and expanding Bitcoin's utility.\nPhoto by Kanchanara on Unsplash\nThe market is a clear indicator of Bitcoin's improving health. While there was still some volatility throughout 2023, the year ended with strengthening fundamentals. Spurred by speculation around ETF approvals, BTC's most recent rally is seen as an optimistic sign, a harbinger of a revival in 2024.\nSmall account balances have also risen. This phenomenon indicates broad participation from retail investors who own between 0.01 BTC and 0.1 BTC.\nFor payments and scaling, a Layer-2 (L2) solution, the Lightning Network, remains the most popular direction, promising to increase payment speed and reduce cost and congestion. In 2023, more than 5,400 BTC flowed through Lighting payment channels.\nBeyond Lightning, the year has also given rise to advances in rollups. UTXO Model Rollups mirror Bitcoin's existing state architecture, but the difference is that they add more data to every transaction.\nBRC-20s, Taproot Assets, Ordinals, and Bitcoin in DeFi have also shown promise. These projects and directions ensure that Bitcoin stays relevant and poised for a new wave of growth.\nToday, Many finance experts believe Bitcoin is better as digital gold—a store of value rather than a payment system, as Satoshi originally proposed.\nAs a result of this thinking, institutions are now providing bitcoin custody solutions for a new market. Based on its potential as a new investment asset, financial titans such as Fidelity and BlackRock have also applied for spot Bitcoin ETFs, which promise to heighten demand once approved.\nGovernments like El Salvador have developed and adopted bitcoin-friendly policies as legal tender. These developments among institutions and states revolutionize how millions participate in the Bitcoin ecosystem.\nDespite the numerous changes since Bitcoin's founding, many things in its original design remain constant: the Nakamoto Consensus with its proof-of-work mining and its static supply capped at 21 million coins.\nFurthermore, Bitcoin remains decentralized with no governing body, central bank, or controlling party, and incentives are distributed equitably across its voluntary participants.\nSatoshi Nakamoto's pseudonymity and non-participation in the invention and ecosystem he initiated further add to Bitcoin's value. Because of its decentralization, Bitcoin cannot be considered a security and has thus far avoided the fate of countless tokens and ICOs created using other blockchains.\nSatoshi's legacy extends far beyond Bitcoin's white paper, genesis block, and past communications. His design has ensured security and continuity, allowing a solid foundation for a global community to thrive. His groundbreaking ideas continue to reshape money and finance today, as proven by the financial products and governance revolutions Bitcoin is influencing.\nThis post was authored by an external contributor and does not represent Benzinga's opinions and has not been edited for content. The information contained above is provided for informational and educational purposes only, and nothing contained herein should be construed as investment advice. Benzinga does not make any recommendation to buy or sell any security or any representation about the financial condition of any company.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes."]}
{"date":"2024-01-25","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-01-26","titles":["Bitcoin Network Hits Historic 1 Million Milestone"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/bitcoin-network-hits-historic-1-million-milestone--how-will-btc-price-react-3284283"],"sources":["investing.com"],"descriptions":["Bitcoin Network Hits Historic 1 Million Milestone - How Will BTC Price React?"],"article_contents":[null]}
{"date":"2024-01-29","titles":["Bitcoin Network Hits Historic 1 Million Milestone","5 Great Investments to Buy in February"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/bitcoin-network-hits-historic-1-million-milestone--how-will-btc-price-react-3286151","https:\/\/www.fool.com\/investing\/2024\/01\/29\/5-great-investments-to-buy-in-february\/"],"sources":["investing.com","finance.yahoo.com"],"descriptions":["Bitcoin Network Hits Historic 1 Million Milestone - How Will BTC Price React?","Keep the market rally going with these top-shelf stocks and exchange-traded funds in your pocket."],"article_contents":[null,"You're reading a free article with opinions that may differ\n       from The Motley Fool's Premium Investing Services. Become a Motley Fool member today to\n       get instant access to our top analyst recommendations, in-depth research, investing resources,\n       and more. Learn More\nKey Points\nKeep the market rally going with these top-shelf stocks and exchange-traded funds in your pocket.\nThe year is off to a running start. The S&P 500 index is up by 3.1% so far, checking the last box needed to declare a bull market starting in October 2022. History says that these bull runs tend to last for a couple of years, and the gains before the next (inevitable) bear market should run much higher than this strong start.\nSo it's high time to look around Wall Street and find some great buying opportunities at this auspicious moment. Read on to see why five Motley Fool contributors think Tesla Motors (TSLA -0.13%), NextEra Energy Partners (XIFR 1.78%), Shopify (SHOP -0.31%), D.R. Horton (DHI 3.19%), and the brand-new Bitcoin (CRYPTO: BTC) exchange-traded funds (ETFs) stand out as excellent investments right now.\nDaniel Foelber (Tesla): After a year of price cuts and margin compression, Tesla investors were hoping for a turnaround in 2024. That's not what they got on the company's fourth-quarter 2023 earnings call, which included muted guidance for the year on top of an overall weak quarter.\nRevenue growth was just 3% year over year, operating income fell to $2.1 billion, and the operating margin was 8.2%. For comparison, Tesla's operating income was $3.9 billion in the fourth quarter of 2022, and its operating margin was 16%.\nHigh operating margins have been a differentiating factor for Tesla and a key reason for its premium valuation. Since its margins have been cut in half, it would have to double its revenue to get the same operating income as it did in the 2022 fourth quarter. The ideal scenario is sustaining a relatively high operating margin and growing revenue. But both revenue growth and margins look to be disappointing for a while.\nManagement made it clear on the earnings call that while its vehicles are a good value, they are simply more expensive than the most popular mass-produced vehicles like the Toyota Corolla or Honda Civic. It's harder for consumers to justify paying more when the monthly payment is higher due to high interest rates. And yet, Tesla's Model Y was still the best-selling vehicle (not just EV) in the world last year.\nThe company is doing a good job with what it can control: cost management. Costs per vehicle declined in the fourth quarter, and Tesla is confident it can find further savings in 2024.\nSpecifically, costs per vehicle are falling by about 2% per quarter or around 10% per year. Cost of goods sold per vehicle was just above $36,000 in the fourth quarter of 2023 compared to over $39,000 a year earlier.\nElon Musk sees Tesla as an artificial intelligence (AI) and robotics company, not just a car company. Responding to his post on X that he was \"uncomfortable growing Tesla to be a leader in AI and robotics,\" Musk clarified that it's not about the economic gain of having more shares, but about the voting control to ensure Tesla can grow in AI and robotics without a hostile takeover by an institutional service to take control of the powerful technology.\nHe proposed the idea of a dual-class stock to improve voting control and make the company more secure. From the comments, it doesn't seem that Musk wants to take his AI interests elsewhere but rather wants to ensure the company's governance is intact as innovation becomes irreversible.\nOverall, Tesla seems to be doing a good job investing in its near-term and long-term growth. The company should be able to take market share during a prolonged downturn. And if interest rates do come down, it could see a noticeable uptick in demand.\nThe long-term investment thesis is intact, so Tesla looks like a good buy, especially if the market overreacts and there's a steep sell-off.\nAnders Bylund (Bitcoin ETFs): At long last, investors finally have access to exchange-traded funds (ETFs) tracking the live market price of Bitcoin. For the first time ever, I can recommend a stock-like investing asset that gives you direct exposure to that cryptocurrency's price, with minimal fees and wide availability on pretty much any stock-trading service.\nPerhaps you see no value in Bitcoin since it isn't a business that makes a product or delivers a service. If so, you can stop reading here and move on to a more traditional stock recommendation.\nYou would be in great company. Warren Buffett will probably never own the tiniest sliver of a Bitcoin. Vanguard founder Jack Bogle swore off cryptocurrencies in his lifetime, and the fund-manager firm he created has sworn off the entire crypto industry. It's hard to bet against these investing geniuses. I get it.\nIf you're still reading, maybe you disagree with Vanguard's and Buffett's crypto-free philosophies. And maybe you have stayed away from cryptocurrencies until now only because you don't want to open and fund another investing account with yet another firm, sharing your financial details and bank account numbers over the internet just to get started. And then you're in exactly the right place.\nAs long as you have a stock brokerage account, you probably have easy access to all 11 of the new Bitcoin-based ETFs. Like any other ETF, you buy and sell them in the same manner as you would trade any ordinary stock.\nMoreover, index-tracking ETFs tend to come with no transaction fees and absolutely minimal annual management fees -- in the spirit of Jack Bogle. Technically speaking, these ETFs will match the current Bitcoin price on one of several suitable price-tracing indexes, each averaging the figures from several crypto-trading platforms in order to smooth out volatility. Therefore, a Bitcoin ETF lets you follow Bogle's investing style even if Vanguard isn't involved.\nStill with me? All right. I recommend sticking with the larger ETFs and most-trusted management firms. These funds stand out above the rest in my reasonably informed opinion:\nFund Name\nExpense Ratio\nFee Waiver\nAssets Under Management\niShares Bitcoin Trust (IBIT 0.71%)\n0.25%\n0.12% for first 12 months for up to $5 billion in assets\n$1.73 billion\nFidelity Wise Origin Bitcoin Fund (FBTC 0.73%)\n0.25%\n0% through July 31, 2024\n$1.50 billion\nARK 21Shares Bitcoin ETF (ARKB 0.71%)\n0.21%\n0% for first 6 months for up to $1 billion in assets\n$481 million\nBitwise Bitcoin ETF (BITB 0.70%)\n0.20%\n0% for first six months for up to $1 billion in assets\n$465 million\nData source: Each fund's home page and ETF.com. Market data is current as of 1\/26\/2024.\nEach option comes with a unique selling point or two.\nI have selected the Bitwise ETF for my own Bitcoin ETF holdings, but all of the names above are fine choices. So if you're interested in building a Bitcoin position without dealing with the hassle and fees of buying the actual cryptocurrency yourself, pick your favorite among these leading Bitcoin spot-price ETFs and get started.\nCrypto investing might not be everyone's cup of encrypted transaction ledgers, but the first step is just as easy as buying any old stock nowadays.\nKeith Speights (D.R. Horton): You might have noticed that Warren Buffett didn't buy many stocks last year. In fact, he was a net seller of stocks. However, the legendary investor did scoop up shares of several homebuilders in 2023. His biggest position in the group was (and is) D.R. Horton.\nWhen Buffett likes a stock, it grabs my attention. D.R. Horton wasn't really on my radar screen before, but it definitely is now.\nIt isn't just any homebuilder; it's the biggest one in the U.S. The company operates in 118 markets in 33 states. It claims the highest market share in three of the country's five largest housing markets. Last year, the company closed on 90,777 homes.\nAfter its shares soared more than 70% last year, their momentum is faltering now. The stock fell on the company's mixed fiscal 2024 first-quarter results. D.R. Horton's full-year projected revenue growth is only 3%.\nI think that this pullback presents a great buying opportunity for long-term investors. Why? The U.S. housing shortage hasn't been solved. Some experts estimate that the country needs another 4 million new homes.\nSure, the boom from last year seems to be taking a breather. Chief financial officer Bill Wheat acknowledged in the recent earnings conference call that the company is offering more incentives and reducing home prices in some cases to appeal to buyers.\nHowever, Wheat also noted that the company's sales \"can be significantly affected by changes in mortgage rates and other economic factors.\" With the Fed talking about interest rate cuts later this year and the U.S. economy showing strength, I think D.R. Horton's near-term prospects are better than they might seem. And its long-term prospects remain as strong as ever.\nDemitri Kalogeropoulos (Shopify): Shopify will announce its next earnings update on Feb. 13, likely making the next trading day a volatile one for the stock. But investors don't have to wait until Valentine's Day to pick up shares of this highly successful e-commerce infrastructure specialist.\nShopify checks most of the boxes that growth investors love to see in a stock. It has a small but significant market share with plenty of room to expand. Its platform accounts for just about 10% of U.S. e-commerce transactions right now, yet a growing merchant base is sure to lift that metric over time.\nThe company gave investors plenty to celebrate in its previous earnings report in early November. Sales volumes jumped 22%, and rising subscription, payments processing, and advertising fees all combined to push third-quarter sales up 25%.\nProfits are rising at a much faster rate, and surging cash flow implies years of continuing gains ahead as its platform of services grows. Recent additions include back-office functions like financial management, for example.\nIt's true that the stock doesn't look cheap heading into the mid-February report. You'll have to pay nearly 16 times sales for this business, up from around 10 times sales at a few points in 2023. Yet for investors who don't mind volatility, it's worth considering putting this stock into your portfolio and giving it plenty of time to earn its premium valuation.\nNeha Chamaria (NextEra Energy Partners): (XIFR 1.78%) NextEra Energy Partners wiped out investors' wealth in 2023 as its stock price crashed nearly 57%.\nThe stock, known for steady and growing dividends, hit income investors where it hurts most: It slashed its annual average dividend growth target through 2026 from a range of 12% to 15% to only 5% to 8%, with a target of 6%. Rising interest rates were to blame because they made funding for growth and buyouts of debt in the form of convertible equity portfolio financings costly for the renewable energy specialist.\nNextEra Energy Partners' dividend cut didn't sit well with investors, but that's where the misconception lies: The company didn't cut its dividend. On the contrary, it will still be growing it, albeit at a slower pace for now, and only because it wants to ensure that it can pay out dividends at a sustainable level even in a difficult business environment.\nWhile many expected things to get even worse for NextEra Energy Partners, the company just released its fourth-quarter numbers and assured investors that it can raise its dividend by an average of 5% to 8% through 2026, including a 6% raise for 2024. Importantly, management asserted that its transition plan is on point and that it does not require an acquisition to fund dividends, or issue stock through at least 2027 to fund growth.\nNextEra Energy Partners, in fact, expects to generate $730 million to $820 million in cash available for distribution (CAFD this year. That reflects nearly 12% growth at the midpoint.\nThe company recently sold part of its natural gas assets as planned and is identifying more and more wind assets to repower in a bid to boost CAFD yields as part of its transition plan. Having brought down NextEra Energy Partners' dividend growth in line with peers, its parent company, NextEra Energy (NYSE: NEE), is now focused on improving its cost of capital to put the renewable energy company back on the growth track.\nWith NextEra Energy Partners' management reaffirming its transition plan and dividend growth goals, and the stock still down nearly 50% in the past six months, it's a rock-solid value buy for long-term investors now.\nAnders Bylund has positions in Bitcoin and Bitwise Bitcoin ETF Trust. Daniel Foelber has positions in Bitcoin. Demitri Kalogeropoulos has positions in Shopify and Tesla. Keith Speights has no position in any of the stocks mentioned. Neha Chamaria has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin, NextEra Energy, Shopify, and Tesla. The Motley Fool has a disclosure policy.\nStocks Mentioned\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."]}
{"date":"2024-01-30","titles":["Crypto Price Today: Bitcoin Crosses $43,000, Most Altcoins Including Solana, Avalanche, Dogecoin See Gains","Top Trader Says Bitcoin on the Cusp of Higher Prices As New Narrative Takes Hold – Here’s His Outlook"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-price-today-january-30-usd-43000-most-cryptocurrencies-profits-solana-dogecoin-avalanche-4958787","https:\/\/dailyhodl.com\/2024\/01\/30\/top-trader-says-bitcoin-on-the-cusp-of-higher-prices-as-new-narrative-takes-hold-heres-his-outlook\/"],"sources":["ndtv.com","dailyhodl.com"],"descriptions":["The overall crypto market cap rose by 2.30 percent in the last 24 hours. Bitcoin and Ether are beginning to see profits after days of trading on the low followi...","A closely followed crypto trader says that Bitcoin (BTC) is likely to head higher due to a key development just months away."],"article_contents":["Photo Credit: Pixabay\/ Elvind Pedersen\nThe current valuation of the crypto sector stands at $1.67 trillion\nBitcoin on Tuesday, January 30 jumped to the price point of $43,495 (roughly Rs. 36 lakh). Over the last 24 hours, the asset grew by 2.73 percent, which in-terms of value stands at $1,320 (roughly Rs. 1.09 lakh). This is the first time in over a week that Bitcoin has managed to trade above the mark of $43,000 (roughly Rs. 35.7 lakh). It is also noteworthy that BTC dominance is rising which usually poses challenges for altcoins. Bitcoin dominance is the metric for the relative share of Bitcoin compared to the overall cryptocurrency market. Presently it stands at 51.2 percent.Ether rose by 1.74 percent in price over the last day. The asset, at the time of writing, was trading at $2,310 (roughly Rs. 1.92 lakh).\n“The crypto market has experienced a significant price increase following days of decline, after the approval of Bitcoin ETFs. This price shift can probably be attributed to a change in Google's guidelines, now allowing Bitcoin ETF adverts in the US by companies like BlackRock, VanEck, and Franklin Templeton,” Shivam Thakral, CEO of BuyUcoin told Gadgets360.\nBinance Coin, Solana, Ripple, Cardano, Avalanche, Dogecoin, Polkadot, Chainlink, and Polygon -- all reflected gains on Monday alongside BTC and ETH.\n“One of the notable gainers of the day remained PENDLE (+16.5 percent) as the Arbitrum based protocol entered the top 100 in terms of circulating market cap. This came as the total value locked in the protocol has crossed the 500-million-dollar mark, an all-time high. Another popular altcoin SOL (+5.12 percent) is also on the move again as Solana DEXs briefly flipped Ethereum trading volumes with rolling 24 hour volume on Solana crossing $700 million (roughly Rs. 5,819 crore) compared to $698 million (roughly Rs. 5,802 lakh) on Ethereum as per the data from DefiLlama. Some analysts are predicting another run might be due for SOL as the recent corrective wave seems to have settled,” the CoinSwitch Markets Desk told Gadgets360.\nThe overall crypto market cap rose by 2.30 percent in the last 24 hours. The current valuation of the crypto sector, as of Tuesday, stands at $1.67 trillion (roughly Rs. 1,38,82,793 crore), as per CoinMarketCap.\nCryptocurrencies trading in losses on Tuesday include Tether, USD Coin, Tron, Leo, and Augur.\n“Market awaits key events: the Fed's interest rate decision and US January unemployment rate data. If a widely expected rate cut occurs, bulls may triumph in the ongoing tug of war. Conversely, unchanged rates could signal bearish sentiment. Investors brace for potential impact even as Bitcoin's Bollinger Bands show early signs of convergence, hinting at the possibility of reduced-price volatility in the coming days,” Rajagopal Menon, Vice President, WazirX told Gadgets360.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement","A closely followed crypto trader says that Bitcoin (BTC) is likely to head higher due to a key development just months away.\nPseudonymous trader The Flow Horse tells his 199,500 followers on the social media platform X that the upcoming Bitcoin halving in April is likely going to send the crypto king’s value soaring as it has in the past.\nEvery four years Bitcoin has a halving event, when miners’ rewards are cut in half. Historically, the halvings have correlated with Bitcoin’s bull markets.\nSays The Flow Horse,\n“Just a little advice, as most people in this market are obsessed with intraday activity and try to emulate their favorite traders, riding every little move the market offers: we are on the cusp of the most reliable and popular narrative that this market has seen to this point. It’s a small sample size, but it’s all we have.\nWhether you get in at $43,000 or $33,000, higher prices going into the halving and right after are more likely. This boat will lift all others.”\nHowever, the trader also warns of short-term volatility as a huge supply of Bitcoin flows into top US crypto exchange Coinbase, creating a potential headwind for BTC’s price.\n“There seems to be someone offering a decent amount of BTC again on Coinbase. The pattern to this point has been aggro sell, let price drift higher into sell walls, and repeat.”\nBitcoin is trading for $43,462 at time of writing, up slightly in the last 24 hours.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock\/VFX video\/Panuwatccn\nFeatured Image: Shutterstock\/VFX video\/Panuwatccn\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-01-31","titles":["$1,000,000,000 in Short Liquidations Could Propel Bitcoin (BTC) Upward, Says Glassnode Founders","Bitcoin Network Hits Historic 1 Million Milestone"],"urls":["https:\/\/dailyhodl.com\/2024\/01\/31\/1000000000-in-short-liquidations-could-propel-bitcoin-btc-upward-says-glassnode-founders\/","https:\/\/www.investing.com\/news\/cryptocurrency-news\/bitcoin-network-hits-historic-1-million-milestone--how-will-btc-price-react-3288641"],"sources":["dailyhodl.com","investing.com"],"descriptions":["The co-founders of the crypto analytics firm Glassnode think Bitcoin’s (BTC) sudden move to the upside could trigger an even larger rally.","Bitcoin Network Hits Historic 1 Million Milestone - How Will BTC Price React?"],"article_contents":["The co-founders of the crypto analytics firm Glassnode think Bitcoin’s (BTC) sudden move to the upside could trigger an even larger rally.\nGlassnode co-founders Jan Happel and Yann Allemann, who share the Negentropic handle on the social media platform X, say that Bitcoin’s sudden bullishness could result in a short squeeze.\nA short squeeze happens when traders who borrow an asset at a certain price in hopes of selling it for lower to pocket the difference are forced to buy back the assets they borrowed as momentum moves against them, triggering further rallies.\n“‘Liquidity is KEY.’\n1. Bitcoin Analysis: Bitcoin surged to $42,200, providing liquidity for long positions, with a neutral impulse.\n2. Liquidity Gap: The price is moving to fill the liquidity gap above $42,000, indicating potential volatility. Approximately $659 million in liquidations occurred.\nOutlook: Bullish momentum could trigger $1 billion in short position liquidations, potentially propelling the market upward.”\nThe founders recently said that Bitcoin may be printing a classic descending wedge pattern, which is used in technical analysis to identify potential bullish reversals in an asset’s price.\nThe pattern is characterized by a series of lower highs and lower lows that form a wedge shape on the chart. As the pattern progresses, the distance between the highs and lows decreases, which indicates that the selling pressure is weakening. When the price breaks out of the upper trend line of the wedge, it’s traditionally considered bullish.\nBitcoin is trading for $43,436 at time of writing, up slightly in the last 24 hours.\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl",null]}
