{"date":"2024-02-01","titles":["Crypto And AI Can Help You To Build Next Generation Wealth"],"urls":["https:\/\/investinghaven.com\/crypto-blockchain\/crypto-and-ai-can-help-you-to-build-next-generation-wealth\/"],"sources":["investinghaven.com"],"descriptions":["Next-generation wealth is going to be built within the next 2 to 3 years, through crypto and AI. Don't be late to the party."],"article_contents":["Home » Crypto & Blockchain » Crypto And AI Can Help You To Build Next Generation Wealth – If You Play Your Cards Right\nGenerational wealth is wealth that can be passed down from generation to generation. And opportunities to access this type of wealth do not occur all that often. The gold rush. The oil boom. The internet.\nIn the modern era, crypto and AI offer perhaps the best means to build next-level wealth. But only if you know how to play the game well and avoid emotional investment, the thief of all new investors and traders.\nMoney and property are not just about what you have; it’s about what you can do and what experiences can be accessed. Moreover, its benefits are passed down to your progeny, who will benefit from financial security.\nYet cryptocurrency is part of a much wider field known as ‘Web3’, consisting of M2M communications, smart cities, autonomous AI, no-code, and far more. When used correctly, this will help to reduce the red tape associated with all large bureaucracies (i.e. governments).\nPlus, it also has impressive implications for land ownership, with large properties swapping hands on the blockchain for a tiny fee. At present, it’s even possible for homeowners to mint an NFT of their property and list it for sale on a decentralized property registry.\nSo crypto does not just provide access to generational wealth – it redefines wealth, including how wealth is transferred. The market cap of crypto as a fraction of global wealth is also tiny. Especially when BTC and ETH are taken out of the equation. Currently, there is evidence that they are losing their dominance.\nAI is also sure to play a large role in redefining wealth, as the majority of labour will be executed autonomously by machines. This can be viewed positively or negatively, but either way, it’s best to get on board with the trend from a financial standpoint.\nIn order to really make the most out of crypto, you have to be especially disciplined due to false narratives and the volatility levels. The bond and equity markets, for example, are not subject to the speculation and unsubstantiated claims associated with crypto. Hacks are rampant, including the recent SEC hack.\nThe @SECGov twitter account was compromised, and an unauthorized tweet was posted. The SEC has not approved the listing and trading of spot bitcoin exchange-traded products.\n— Gary Gensler (@GaryGensler) January 9, 2024\nThis is due to regulation and industry standards, as well as historical data. With crypto, you have to make sure to avoid bad data. Most online content is speculation or wild claims with no technical information. You have, on one hand, traditional media promoting false narratives against the wider industry. On the other, you have crypto media, a large part of which consists of sponsored posts about the next moon coin.\nThen you have unsubstantiated claims on social sites including Reddit, X, and YouTube. Everybody is an influencer, or a marketer, or an expert, or an insider, and sometimes a combination of them all. Real gems get lost among competing voices – like the fact that 2024 is a hidden bull market in disguise.\nIt’s hard to doubt that we are entering a whole new era of crypto finance. Inflation is sky-high, central banks are printing, and CBDCs are being released. So if you want accurate price forecasts based on charting information, consider our premium newsletter.\nInvestingHaven is a repository of accurate calls and predictions regarding the crypto market, as the first blockchain-focused newsletter in the world. Some of our 2023 wins along, among others, include:\nCombining technical chart analysis with some fundamental information, we pick winning coins from trending sectors. We also pinpoint precise entry and exit points in line with market tops and bottoms, as a premium price forecasting outlet.\nGenerational wealth can be yours – provided you take the time to study the markets closely, follow prompts from experienced traders, and manage your bankroll well.\nIt’s a science – and we have the formula.\nDownload 50 crypto investing tips\nNo related posts.\nDaniel O’Keeffe is a Web3 copywriting specialist who began investing in Bitcoin in 2013. He previously worked for three years as a compliance analyst for J.P. Morgan and State Street. He holds a master’s degree in computer science from the University College Dublin and a legal degree from the University of Limerick.\nReceive top notch forecasts for free.\n*We hate spam as you do.\nPrecious metals market analysis including gold and silver price predictions. Crypto market analysis including highly accurate BTC ETH SOL XRP forecasts.\nCopyright © 2025 InvestingHaven\nCopyright © 2025 InvestingHaven"]}
{"date":"2024-02-02","titles":["Bitcoin Network Hits Historic 1 Million Milestone"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/bitcoin-network-hits-historic-1-million-milestone--how-will-btc-price-react-3291591"],"sources":["investing.com"],"descriptions":["Bitcoin Network Hits Historic 1 Million Milestone - How Will BTC Price React?"],"article_contents":[null]}
{"date":"2024-02-05","titles":["Where to Buy Spot Bitcoin ETFs in 2024"],"urls":["https:\/\/www.investopedia.com\/where-to-buy-the-new-spot-bitcoin-etfs-8557203"],"sources":["investopedia.com"],"descriptions":["Spot bitcoin ETFs are an exciting new alternative to investing directly in bitcoin. Learn how to get into spot bitcoin ETFs and what investors can expect."],"article_contents":["We independently evaluate all of our recommendations. If you click on links we provide, we may receive compensation.\nAnchiy \/ Getty Images\nFollowing the SEC's recent approval of spot bitcoin ETFs, investing in bitcoin is now more accessible to average investors eager to get into the cryptocurrency space. For investors and traders, buying a spot bitcoin ETF is like buying shares in any other ETF or security. Spot bitcoin ETFs are available on a variety of traditional platforms that offer popular services, like stock and options trading, retirement planning, advisory services, and automated investing. Tradeable on traditional exchanges like the New York Stock Exchange and Nasdaq, these ETFs allow investors to enjoy the leverage of investing in bitcoin without a need to hold it or understand how crypto platforms work. Before investing, you should be aware of how these ETFs work and the risks involved.\nSpot bitcoin ETFs are now available to trade on several online brokerage and robo-advisor platforms. These new ETFs are also eligible for use in many retirement accounts, like Bitcoin IRAs, traditional IRAs and Roth IRA accounts, and solo 401(k) plans.\nWhen picking spot bitcoin ETFs, it is critical for investors to analyze the fees involved. For now, some issuers are offering fee waivers to encourage investments. For example, VanEck Bitcoin ETF (HODL) is waiving its sponsor fees thru March 31, 2025 or until it hits $1.5 billion in Assets Under Management (AUM). It’s important to note that these platforms offering fee waivers for bitcoin ETFs are competing for investors, and these fee waivers are temporary.\nHigh management fees, like the one charged by Grayscale (1.50%), can cut into your ETF profits. Investors should aim for funds with annual management fees between 0.2% and 0.5%.\nInvesting in bitcoin ETFs requires a suitable account such as those listed above, most of which you can open in 30 minutes or less. Creating an account is easy and can typically be done online.\nThe launch of spot bitcoin ETFs fulfills a need for individuals and institutions to invest in bitcoin in a regulated, convenient manner without the need to hold it.\nThese are the benefits investors can enjoy from spot bitcoin ETFs.\nInvesting in spot bitcoin ETFs poses some risks. Bitcoin ETFs are still subject to market manipulation common with digital assets (especially cryptocurrencies).\nOther risks to consider include:\nSpot bitcoin ETFs are a new asset class. While exciting, there are other ways of investing for anyone looking to get into bitcoin. Bitcoin ETFs are subject to far more volatility than regular ETFs and could be caught in regulatory crossfires. Here are ways to invest in bitcoin directly or indirectly without buying a spot bitcoin ETF.\nSpot bitcoin ETFs are a new class of investments that allows investors to invest in bitcoin at their convenience with far less risk. They are available through retirement accounts, and on automated investing platforms (robo-advisors), and online brokerages during open market hours, but not on crypto exchanges. To get started with spot bitcoin ETFs, open and fund an account with a brokerage platform, continuously monitor the ETF, and be mindful of fees and commissions.\nBitcoin is the first virtual, decentralized cryptocurrency traded over a peer-to-peer network. Transactions on this network are recorded on the blockchain, a distributed ledger, to promote transparency and reduce intermediaries. Bitcoin is used for payments, investing, and speculation, and was created by a pseudonymous entity known as Satoshi Nakamoto in January 2009. The smallest unit of a bitcoin is a satoshi (100 millionths of a bitcoin).\nA spot bitcoin ETF invests directly in bitcoins as the underlying asset. This differs from bitcoin futures ETFs, which are based on derivatives contracts of their prices. Spot bitcoin ETFs comprise underlying bitcoins that are securely stored in a vault by the company offering the ETFs.\nBTC is the ticker symbol for bitcoin, and it’s how the cryptocurrency is abbreviated and represented in the financial markets. Investors can search the price of bitcoin and find bitcoin-related news by using the ticker symbol BTC with their preferred platform or investment research site.\nBuying a spot bitcoin ETF is a good idea for anyone who wants to gain exposure to cryptocurrencies without the hassle of owning and storing them. Like any investment, however, the potential for bitcoin to deliver positive returns varies depending on the time period under consideration. Bitcoin's price is volatile, influenced by market sentiment and external factors. If you believe in its long-term potential as a decentralized digital currency and store of value, now might be a suitable time to buy, considering its historical growth. However, be cautious of short-term fluctuations, as the volatility can be unsettling for risk-averse investors.\nU.S. Securities and Exchange Commission. \"Statement on the Approval of Spot Bitcoin Exchange-Traded Products.\"\nVanEck. \"Bitcoin ETF Trust.\"\nGrayscale. \"Grayscale Trust Bitcoin ETF.\"\nReuters. \"US SEC Approves Bitcoin ETFs.\"\nInternal Revenue Service. \"Tax Topics.\"\nCoinDesk. \"Fake Bitcoin ETF Approval.\"\nCointelegraph. \"BlackRock's Bitcoin ETF.\"\nCoinDesk. \"Crypto-Linked Stocks Rise With Bitcoin.\"\nStore and\/or access information on a device. Use limited data to select advertising. Create profiles for personalised advertising. Use profiles to select personalised advertising. Create profiles to personalise content. Use profiles to select personalised content. Measure advertising performance. Measure content performance. Understand audiences through statistics or combinations of data from different sources. Develop and improve services. Use limited data to select content."]}
{"date":"2024-02-06","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-02-07","titles":["Crypto Market Today: Ether Performs Better Than Bitcoin, Altcoins Reflect Prevailing Market Volatility"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-ether-price-today-profit-loss-tether-solana-cardano-dogecoin-india-5010586"],"sources":["ndtv.com"],"descriptions":["The overall crypto market cap rose slightly by 0.52 percent in the last 24 hours. While Bitcoin registered losses, Ether reeled-in small gains on Wednesday, Feb..."],"article_contents":["Photo Credit: Pexels\/ DS Stories\nThe crypto market cap, as of February 7, stands at $1.65 trillion\nBitcoin on Wednesday, February 7 recorded a small loss of 0.09 percent. With this, its trading value, at the time of writing, stood at $42,812 (roughly Rs. 35.5 lakh). In the last 24 hours, the most expensive crypto asset rose in value by $10 (roughly Rs. 830). As per market analysts, Bitcoin's market stability, despite volatile macro factors, has been encouraging as it surpassed $43,000 (roughly Rs. 35.6 lakh) levels briefly before coming down to its current pricing.\n“As BTC continues to trade in a subtle the uptrend narrow channel, its volatility continues to be on the lower side. BTC has already printed five consecutive monthly green candles in the wake of the recent ETF and upcoming halving in April. It should be interesting to see if we see one more monthly green close as it has only happened once in the last seven years,” the CoinSwitch Markets Desk told Gadgets360.\nEther, unlike Bitcoin, is trading in the greens on Wednesday. With a gain of 2.09 percent, Ether is presently trading at $2,361 (roughly Rs. 1.96 lakh). Over the last 24 hours, Ether rose in its price point by $50 (roughly Rs. 4,150).\n“ETH approached the upper boundary of its range, currently holding just below it the mark of $2,380 (roughly Rs. 1.97 lakh). It's also above the 20 and 50 Exponential Moving Averages (EMA), which is a positive signal,” the CoinDCX team told Gadgets360.\nWith Bitcoin and Ether taking different market trajectories on Wednesday, the crypto chart marked a clear internal division within itself with most altcoins trailing into losses behind BTC.\nBinance Coin, Solana, Ripple, Cardano, and Avalanche -- recorded losses on Wednesday.\nChainlink, Polkadot, Shiba Inu, Bitcoin Cash, and Leo also reflected price dips alongside Stellar, Near Protocol, and Monero.\n“The US might relook at shedding its cautious imagery surrounding crypto regulations as private companies come up with new use cases for digital assets. With the elections coming up, this could be a decisive factor. The William's percentage indicator indicates overbought conditions for the token, and the next few days will unveil whether this leads to a definitive uptrend, aligning with other bullish indicators,” Rajagopal Menon, Vice President, WazirX told Gadgets360.\nTether, Dogecoin, Tron, Polygon, Litecoin, Uniswap, and Cosmos meanwhile – reeled-in small profits and treaded behind Ether on Wednesday.\nThe overall crypto market cap rose slightly by 0.52 percent in the last 24 hours. At present, the sector valuation stands at $1.65 trillion (roughly Rs. 1,36,91,114 crore) as per CoinMarketCap. Despite the ongoing fluctuations in the crypto market, market experts are optimistic about the tables turning soon.\n“Microstrategy, a business intelligence enterprise known for its strong Bitcoin support has reported the acquisition of an additional 850 BTC for $37.2 million (roughly Rs. 308 crore) and now holds a total of staggering 190,000 BTC. At the same time, the Bitcoin spot ETF craze has not slowed down as BlackRock and Fidelity now own a combined of 138,489 BTC which is roughly worth around $5.9 billion (roughly Rs. 48,936 crore) in Bitcoin. All these moves only reflect positive institutional sentiments around Bitcoin before the halving,” said Shivam Thakral, CEO of BuyUcoin.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement"]}
{"date":"2024-02-08","titles":["crypto market movers today","Bitcoin To Reach ‘Just Shy of $200,000’ in 2025, According to Top Analyst – Here’s His Outlook"],"urls":["https:\/\/thestockmarketwatch.com\/news\/crypto-market-movers-today\/","https:\/\/dailyhodl.com\/2024\/02\/08\/bitcoin-to-reach-just-shy-of-200000-in-2025-according-to-top-analyst-heres-his-outlook\/"],"sources":["thestockmarketwatch.com","dailyhodl.com"],"descriptions":["Image Source: Unsplash","The trader who accurately called the crypto market crash of 2021 is predicting that Bitcoin (BTC) will soar to a massive value in 2025."],"article_contents":[null,"The trader who accurately called the crypto market crash of 2021 is predicting that Bitcoin (BTC) will soar to a massive value in 2025.\nPseudonymous analyst Dave the Wave tells his 144,400 followers on the social media platform X that Bitcoin could come close to the $200,000 level in less than two years.\n“BTC just shy of $200,000 in 2025 based on this prediction.”\nHe bases the estimate on Bitcoin’s logarithmic monthly moving average convergence divergence (LMACD), a long-term momentum indicator, as well as Fibonacci extension levels, which keep track of potential areas of support and resistance.\nLooking at his chart, the trader suggests the LMACD indicator is showing BTC has reached a market bottom and is in an uptrend that will reach nearly $200,000 by October 2025.\nThe trader also uses his version of logarithmic growth curves (LGCs), which aim to forecast Bitcoin’s market cycle highs and lows while filtering out short-term volatility.\n“BTC solid and sideward within the range so far.”\nAccording to the trader’s chart, the LGC’s support levels could be tested at the longer-term end of the channel near $30,000 or potentially at $38,000 if its shorter ascending channel stays intact.\nThe trader believes that the logarithmic chart accurately provides a longer-term view of Bitcoin’s price action.\n“It really is astounding the effect time has on our perceptions – just three years ago the current BTC price in the $40,000 range was blowing everyone’s mind, where today it is thought all a bit passé.\nThis has something I think to do with ‘time preference’, where those with a high-time preference are very much focused on the present (present-minded), while those with the low on the future (a more ‘elastic’ frame of mind).”\nBitcoin is trading for $44,149 at time of writing, up more than 2% in the last 24 hours.\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-02-09","titles":["HIVE Digital Provides January 2024 Production Update Increasing Bitcoin HODL by 14%","Bitcoin Prices Surge Past $48,000 As ETF Demand Drives Gains","VanEck Crypto Monthly Recap For January 2024"],"urls":["https:\/\/www.marketscreener.com\/quote\/stock\/HIVE-DIGITAL-TECHNOLOGIES-40680906\/news\/HIVE-Digital-Provides-January-2024-Production-Update-Increasing-Bitcoin-HODL-by-14-45921653\/","https:\/\/www.forbes.com\/sites\/digital-assets\/2024\/02\/09\/bitcoin-prices-surge-past-48000-as-etf-demand-drives-gains\/","https:\/\/seekingalpha.com\/article\/4669000-vaneck-crypto-monthly-recap-for-january-2024"],"sources":["marketscreener.com","forbes.com","seekingalpha.com"],"descriptions":["HIVE Digital Technologies Ltd.     is pleased to announce the unaudited production figures from the Company's global Bitcoin operations for the month of January...","Bitcoin prices rallied above $48,000 as strong demand for spot-based ETFs helped drive the cryptocurrency's notable gains.","Bitcoin’s 30-day volatility reached its highest level since April 2023 in January after the approval and listing of 10 new spot bitcoin ETFs in the US."],"article_contents":["This news release constitutes a \"designated news release\" for the purposes of the Company's amended and restated prospectus supplement dated August 17, 2023, to its short form base shelf prospectus dated May 1, 2023.\nVancouver, British Columbia--(Newsfile Corp. - February 9, 2024) - HIVE Digital Technologies Ltd. (TSXV: HIVE) (NASDAQ: HIVE) (FSE: YO0) (the \"Company\" or \"HIVE\") is pleased to announce the unaudited production figures from the Company's global Bitcoin operations for the month of January 2024, with 234.6 Bitcoin produced in January.  The Company has maintained over 3.88 Exahash (\"EH\/s\") of Bitcoin mining capacity on average for January 2024, including ASIC and GPU BTC hashrate (all amounts in US dollars, unless otherwise indicated).\nSummary Overview:\nThe Company's HODL position at the end of January 2024 was 1,939 BTC, which was 234.6 BTC higher than the prior month, representing a 14% increase.  All BTC produced was HODL during the month.\nArctic Cold Weather\nHIVE mines Bitcoin sourcing geothermal and hydroelectric renewable energy in Sweden, Iceland and Canada. There have been a few days of conserving electricity consumption due to cold weather. The Company's software system to balance the grid has worked smoothly and HIVE expects, based on seasonal weather patterns, milder weather in March.\nCold weather in Northern Sweden, where the Company's facilities are 100 miles south of the Arctic Circle, hit negative 40 degrees Celsius.  Fortunately, this seasonal pattern appears to be behind us.  In addition, HIVE does hedge its cost of energy in Sweden.\nBitcoin Halving Strategy\nFrank Holmes, Executive Chairman, of the Company stated \"We have upgraded our fleet of ASICs, to improve our global fleet efficiency to reduce our average production cost per Bitcoin.  In addition to this, we have been HODL'ing our Bitcoin reserves ahead of the Halving.  With the Halving event in April 2024, the global daily Bitcoin block reward will reduce from 900 Bitcoin per day to 450 Bitcoin per day.  This underscores the scarcity of Bitcoin, and thus we believe increasing our HODL will put HIVE in a strong position.\"\nBitcoin ASIC Upgrade with S21\nAydin Kilic, President & CEO of HIVE stated \"We are thrilled to announce that we have received and installed our January batch of Bitmain S21 Antminers, the latest and most efficient machines on the market.  These miners each have 200 TH\/s and efficiency of 17.5 J\/TH.  To put this into perspective, this means that at current Bitcoin network difficulty of 75.5T these machines can produce a Bitcoin at a cost of approximately $10,000, assuming a power price of $0.04 per KWHR.  HIVE has purchased 7,000 of these machines, which in total will provide 1.4 EH\/s of high efficiency mining capacity to our fleet.  Additionally, we note that our February batch will ship before Chinese New Year, and we anticipate receiving and installing them before the February month end.\"\nJanuary 2024 Production Figures\nThe Company's total Bitcoin production in January 2024 was:\nBitcoin Global Network Mining Difficulty Is Volatile\nNetwork difficulty factors are a significant variable in the Company's gross profit margins.  The Bitcoin network difficulty was 72.0T as of January 1, and decreased to 70.3 T as of January 31.  Accordingly, Bitcoin mining difficulty ended the month about 2% lower than the beginning of the month.\nThe Bitcoin network difficulty is a publicly available statistic, which reflects the total number of Bitcoin miners online. This is an important metric in analyzing a company's gross profit margins, along with the number of Bitcoin produced.  This data is publicly available on many websites, including www.Blockchain.com.\nAs more Bitcoin is mined (difficulty increases), the daily Bitcoin block reward (which presently is fixed at 900 Bitcoin per day), gets split amongst more miners; thus, each miner receives a smaller portion of the block reward.  Conversely, as Bitcoin prices fall, many miners may lose money and power down, thus taking their hashrate off the network, causing network difficulty to decrease.\nThose miners with the lowest costs of production, by virtue of having more efficient machines and\/or lower energy costs, are able to continue production during these volatile cycles. Not all miners will continuously mine during the month.  As a result, some miners will produce less Bitcoin than expected, relative to their advertised hashrate.  For the foregoing reasons, HIVE will self-curtail part of its operations if the unhedged spot energy prices are uneconomical, thereby leaving part of its total gross hashrate unutilized.\nBitcoin miners are striving to use the most efficient Bitcoin ASIC chips, and HIVE is happy that it has been able to upgrade its global fleet during this crypto market downturn.\nAbout HIVE Digital Technologies Ltd.\nHIVE Digital Technologies Ltd. went public in 2017 as the first cryptocurrency mining company listed for trading on the TSX Venture Exchange with a sustainable green energy focus.\nHIVE is a growth-oriented technology stock in the emergent blockchain industry.  As a company whose shares trade on a major stock exchange, we are building a bridge between the digital currency and blockchain sector and traditional capital markets.  HIVE owns green energy-powered data centre facilities in Canada, Sweden, and Iceland, where we endeavour to source geothermal and hydroelectric energy to mine digital assets such as Bitcoin on the cloud.  Since the beginning of 2021, HIVE has held in secure storage the majority of its treasury of ETH and BTC derived from mining rewards.  Our shares provide investors with exposure to the operating margins of digital currency mining, as well as a portfolio of Bitcoin.  Because HIVE also owns hard assets such as data centers and advanced multi-use servers, we believe our shares offer investors an attractive way to gain exposure to the cryptocurrency space.\nWe encourage you to visit HIVE's YouTube channel here to learn more about HIVE.\nFor more information and to register to HIVE's mailing list, please visit www.HIVEdigitaltechnologies.com. Follow @HIVEDigitalTech on Twitter and subscribe to HIVE's YouTube channel.\nOn Behalf of HIVE Digital Technologies Ltd.\n\"Frank Holmes\"Executive Chairman\nFor further information please contact:Frank HolmesTel: (604) 664-1078\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.\nForward-Looking Information\nExcept for the statements of historical fact, this news release contains \"forward-looking information\" within the meaning of the applicable Canadian and United States securities legislation and regulations that is based on expectations, estimates and projections as at the date of this news release. \"Forward-looking information\" in this news release includes but is not limited to: business goals and objectives of the Company; the results of operations for January 2024; the acquisition, deployment and optimization of the mining fleet and equipment; the continued viability of its existing Bitcoin mining operations; and other forward-looking information concerning the intentions, plans and future actions of the parties to the transactions described herein and the terms thereon.\nFactors that could cause actual results to differ materially from those described in such forward looking information include, but are not limited to, the volatility of the digital currency market; the Company's ability to successfully mine digital currency; the Company may not be able to profitably liquidate its current digital currency inventory as required, or at all; a material decline in digital currency prices may have a significant negative impact on the Company's operations; the regulatory environment for cryptocurrency in Canada, the United States and the countries where our mining facilities are located; economic dependence on regulated terms of service and electricity rates; the speculative and competitive nature of the technology sector; dependency on continued growth in blockchain and cryptocurrency usage; lawsuits and other legal proceedings and challenges;  government regulations; the global economic climate; dilution; future capital needs and uncertainty of additional financing, including the Company's ability to utilize the Company's at-the-market equity offering program (the \"ATM Program\") and the prices at which the Company may sell Common Shares in the ATM Program, as well as capital market conditions in general; risks relating to the strategy of maintaining and increasing Bitcoin holdings and the impact of depreciating Bitcoin prices on working capital; the competitive nature of the industry; currency exchange risks; the need for the Company to manage its planned growth and expansion; the effects of product development and need for continued technology change; the ability to maintain reliable and economical sources of power to run its cryptocurrency mining assets; the impact of energy curtailment or regulatory changes in the energy regimes in the jurisdictions in which the Company operates; protection of proprietary rights; the effect of government regulation and compliance on the Company and the industry; network security risks; the ability of the Company to maintain properly working systems; reliance on key personnel; global economic and financial market deterioration impeding access to capital or increasing the cost of capital; share dilution resulting from the ATM Program and from other equity issuances; the construction and operation of facilities may not occur as currently planned, or at all; expansion may not materialize as currently anticipated, or at all; the digital currency market; the ability to successfully mine digital currency; revenue may not increase as currently anticipated, or at all; it may not be possible to profitably liquidate the current digital currency inventory, or at all; a decline in digital currency prices may have a significant negative impact on operations; an increase in network difficulty may have a significant negative impact on operations; the volatility of digital currency prices; the anticipated growth and sustainability of electricity for the purposes of cryptocurrency mining in the applicable jurisdictions; the inability to maintain reliable and economical sources of power for the Company to operate cryptocurrency mining assets; the risks of an increase in the Company's electricity costs, cost of natural gas, changes in currency exchange rates, energy curtailment or regulatory changes in the energy regimes in the jurisdictions in which the Company operates and the adverse impact on the Company's profitability; the ability to complete current and future financings, any regulations or laws that will prevent the Company from operating its business; historical prices of digital currencies and the ability to mine digital currencies that will be consistent with historical prices; an inability to predict and counteract the effects of COVID-19 on the business of the Company, including but not limited to the effects of COVID-19 on the price of digital currencies, capital market conditions, restriction on labour and international travel and supply chains; and, the adoption or expansion of any regulation or law that will prevent the Company from operating its business, or make it more costly to do so;  and other related risks as more fully set out in the Company's disclosure documents under the Company's filings at www.sec.gov\/EDGAR and www.sedarplus.ca.\nThe forward-looking information in this news release reflects the current expectations, assumptions and\/or beliefs of the Company based on information currently available to the Company. In connection with the forward-looking information contained in this news release, the Company has made assumptions about the Company's objectives, goals or future plans, the timing thereof and related matters. The Company has also assumed that no significant events occur outside of the Company's normal course of business. Although the Company believes that the assumptions inherent in the forward-looking information are reasonable, forward-looking information is not a guarantee of future performance and accordingly undue reliance should not be put on such information due to its inherent uncertainty. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether because of new information, future events or otherwise, other than as required by law.\nTo view the source version of this press release, please visit https:\/\/www.newsfilecorp.com\/release\/197365",null,null]}
{"date":"2024-02-12","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-02-13","titles":["Bitcoin Hits $50,000 Mark for First Time in Two Years, Tether and USD Coin See Losses","January 2024 Month In Review: U.S. Spot Bitcoin ETFs Approved","Assessing Bitcoin's Fundamentals (Cryptocurrency:BTC-USD)"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-price-usd-50000-tether-usd-coin-see-losses-crypto-price-today-india-february-13-5048334","https:\/\/seekingalpha.com\/article\/4669687-january-2024-month-in-review-us-spot-bitcoin-etfs-approved","https:\/\/seekingalpha.com\/article\/4669774-assessing-bitcoins-fundamentals"],"sources":["ndtv.com","seekingalpha.com","seekingalpha.com"],"descriptions":["The overall crypto market cap rose by 3.78 percent in the last 24 hours. While Bitcoin is trading close to $50,000 (roughly Rs. 41.4 lakh), Ether is trading at ...","Ten years after the first spot Bitcoin exchange-traded fund application was filed in the US, the SEC finally approved spot Bitcoin ETFs on January 10, 2024.","Bitcoin's health can be evaluated through metrics such as market capitalization, conversion points, user experience, and legality. Read my deep dive."],"article_contents":["Photo Credit: Pexels\/ Rodnae Productions\nThe overall valuation of the crypto sector stands at $1.87 trillion as of February 13\nBitcoin on Tuesday, February 13, recorded a profit of 3.76 percent. At present, the world's oldest, most expensive crypto asset is trading at $49,917 (roughly Rs. 41.4 akh), after crossing the $50,000 mark. This is the first time since November 2021 that Bitcoin has managed to jump to $50,000 (roughly Rs. 41.4 lakh). In the last 24 hours, proving all expert predictions right, Bitcoin price swelled by $1,816 (roughly Rs. 1.50 lakh). As per market experts, this surge is due to the robust performance of the US stock market, substantial inflows into spot Bitcoin ETFs, and upcoming halving event.\nEther joined Bitcoin in reeling in gains on Tuesday. The second-most valued crypto asset, at the time of writing, is trading at $2,642 (roughly Rs. 21.9 lakh) after seeing a 5.51 percent surge in its price in the last 24 hours.\n“Bitcoin now faces its next resistance at $50,250 (roughly Rs. 41.7 lakh), leading towards the $51,200 mark (roughly Rs. 42.4 lakh). The prevailing positive investor sentiment manifests in an active bullish presence in the market. Concurrently, Ethereum maintains its position above $2,600 (roughly Rs. 2.15 lakh), with bulls targeting the $2,717 (roughly Rs. 2.25 lakh) threshold,” Edul Patel, CEO of Mudrex, told Gadgets360.\nMajority altcoins are rallying with profits on Tuesday. These include Ripple, Cardano, Avalanche, Dogecoin, and Polkadot.\nOther profit-making cryptocurrencies include Binance Coin, Solana, Chainlink, and Polygon.\nThe overall crypto market cap rose by 3.78 percent in the last 24 hours. With this, the valuation of the crypto sector has risen to $1.87 trillion (roughly Rs. 1,55,23,702 crore), as per CoinMarketCap.\n“With market picking up pace, the world's second biggest crypto by market cap, Ethereum (+6 percent), and its top layer-2 solutions, OP (+8.3 percent) and ARB (+7.5 percent), have also started to show strength to move towards another local high if the momentum in BTC is sustained with just two months to go in the most sought after event in the crypto ecosystem - the BTC halving,” the CoinSwitch Markets Desk told Gadgets360.\nTether, USD Coin, Bitcoin Cash, Leo, and NEM, meanwhile, registered losses on Tuesday.\n“Traders should pay attention to the US CPI announcement today, as it has the potential to impact market volatility. Being cautious in response to such events is advisable,” the CoinDCX team told Gadgets360.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement",null,null]}
{"date":"2024-02-14","titles":["Bitcoin Has Left the Station and Is Headed for Much Higher Prices, Says Analyst Who Called 2021 Crypto Collapse"],"urls":["https:\/\/dailyhodl.com\/2024\/02\/14\/bitcoin-has-left-the-station-and-is-headed-for-much-higher-prices-says-analyst-who-called-2021-crypto-collapse\/"],"sources":["dailyhodl.com"],"descriptions":["The trader who accurately called the crypto market crash of 2021 thinks Bitcoin (BTC) is primed to head to much higher prices."],"article_contents":["The trader who accurately called the crypto market crash of 2021 thinks Bitcoin (BTC) is primed to head to much higher prices.\nThe pseudonymous crypto analyst known as Dave the Wave shares a chart with his 144,800 followers on the social media platform X that outlines a possible scenario for the top crypto asset by market cap for the next year or so.\nThe chart has BTC jumping to around $70,000 in the first quarter of 2024, then correcting down to around $35,000 by the middle of the year, before taking off to $180,000 by early 2025. The analyst first shared the chart back in November but reposted it this past weekend.\nDave the Wave also shares a chart that suggests BTC has left the “buy zone” of his logarithmic growth curve (LGC), an investing model that aims to forecast Bitcoin’s market cycle highs and lows while filtering out short-term volatility.\nIn addition, the chart indicates that BTC is in the midst of an uptrend en route to Dave the Wave’s target of $70,000.\nSays Dave the Wave,\n“Market behavior: people always get interested in buying when price is high…. instead of buying rationally and relatively low.\nAfter well over a year in the BTC LGC buy zone, then the exit, and then the re-visit and the exit again, I’m amazed that people ask me whether it’s a good time to buy.”\nBitcoin is trading at $49,452 at time of writing. The crypto king is up nearly 15% in the past week and more than 17% in the past month.\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-02-15","titles":["Crypto Analyst Issues Bitcoin Alert, Says BTC Could Crash by up to 30% – Here’s the Timeline","DMG Blockchain Solutions Announces Relationship with Sygnum Bank to Provide Credit Facility","DMG Blockchain Solutions Announces Relationship with Sygnum Bank to Provide Credit Facility"],"urls":["https:\/\/dailyhodl.com\/2024\/02\/15\/crypto-analyst-issues-bitcoin-alert-says-btc-could-crash-by-up-to-30-heres-the-timeline\/","https:\/\/www.globenewswire.com\/news-release\/2024\/02\/15\/2830471\/0\/en\/DMG-Blockchain-Solutions-Announces-Relationship-with-Sygnum-Bank-to-Provide-Credit-Facility.html","https:\/\/financialpost.com\/globe-newswire\/dmg-blockchain-solutions-announces-relationship-with-sygnum-bank-to-provide-credit-facility"],"sources":["dailyhodl.com","globenewswire.com","financialpost.com"],"descriptions":["A closely followed crypto analyst is warning that Bitcoin (BTC) could have a severe market correction in the coming weeks.","VANCOUVER, British Columbia, Feb.  15, 2024  (GLOBE NEWSWIRE) -- DMG Blockchain Solutions Inc. (TSX-V: DMGI) (OTCQB US: DMGGF) (FRANKFURT: 6AX) (“DMG” or...","VANCOUVER, British Columbia, Feb.  15, 2024  (GLOBE NEWSWIRE) — DMG Blockchain Solutions Inc. (TSX-V: DMGI) (OTCQB US: DMGGF) (FRANKFURT: 6AX) (“DMG” or t..."],"article_contents":["A closely followed crypto analyst is warning that Bitcoin (BTC) could have a severe market correction in the coming weeks.\nIn a new strategy session video, pseudonymous analyst Rekt Capital tells his 54,700 YouTube subscribers that Bitcoin may repeat a historical pattern and crash by up to 30% before the halving event in April.\nThe halving event, when miners’ rewards are cut in half, occurs every four years.\n“So maybe 20% to 30% [decline] at most is something that we should be potentially aware of occurring in the future because a pre-halving retrace is going to occur after this pre-halving rally. Now that we’ve transitioned into this pre-halving rally we have to look at where we could potentially top out before the halving because this is where people are buying in anticipation of making a few dollars on the halving hype, and then they sell the rumor, they sell the news, essentially.”\nThe trader also says that Bitcoin may follow a historic pattern and go parabolic months after the halving event.\n“And then it’s after the halving, many many months after the halving, where we actually see price appreciate considerably as a result of the halving. This is a supply shock to the system, to the protocol itself. So buying a few weeks beforehand, and then selling around the halving, that’s typically what tends to happen as you’ll see from 2020, 2016. People buy in anticipation of profit potential and then sell just before the halving, that occurs across cycles.\nBut the thing to really notice is that it’s after the halving where we tend to see parabolic rallying towards the upside. So selling just to make a quick buck … is quite short-sighted in the perspective of the grander parabolic rally that comes several months after the halving. So this pre-halving retrace is caused to a great extent by the traders who want to play this move and profit off of this move. And of course, the sell side price action that occurs, this is where the so-called weak hands tend to sell and capitulate, afraid of seeing new lows, but this volatility around the pre-halving retrace is a shakeout moment.”\nBitcoin is trading for $51,688 at time of writing, up more than 4.5% in the last 24 hours.\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","February 15, 2024 18:36 ET\n\n\n | Source:\r\n            \nDMG Blockchain Solutions Inc.\n\n\n\n\n\nDMG Blockchain Solutions Inc.\nVANCOUVER, British Columbia, Feb.  15, 2024  (GLOBE NEWSWIRE) -- DMG Blockchain Solutions Inc. (TSX-V: DMGI) (OTCQB US: DMGGF) (FRANKFURT: 6AX) (“DMG” or the “Company”), a vertically integrated blockchain and cryptocurrency technology company, announces that it has established a relationship with Sygnum Bank, a Swiss bank specialized in servicing crypto-native companies, as a strategic banking partner providing US$9 million (equivalent) in a credit facility to increase its operational capacity ahead of the upcoming Bitcoin halvening expected in April 2024. The primary use of proceeds is for the purchase of 4,550 T21 190 TH\/s bitcoin miners from Bitmain Technologies for US$12,103,000 (US$14\/TH\/s), which was previously announced in December 2023.\nWith a first financing tranche of US$5.6 million already disbursed, DMG has been able to fulfill part of its payment obligation to Bitmain without the need to liquidate its bitcoin holding. DMG believes that modest amounts of debt enable it to better optimize its balance sheet, especially as it can help maintain its healthy bitcoin holding as well as lower its weighted average cost of capital, both of which should be positive for shareholders. In addition to this US$9 million credit facility, DMG intends to use some of its existing cash towards the purchase of these miners from Bitmain.\nThe loan is interest bearing at an annual rate of 7.8% for an indefinite term. Sygnum has the right to terminate the agreement at any time, at which time the loan would be due immediately. The loan is secured against the Company’s digital currency assets of 237.8 BTC, which are pledged and deposited with Sygnum. Because the collateral is subject to fluctuations in value, the Company may be required to provide additional collateral in order to restore the security margin on the loan. DMG may repay the amount of debt outstanding at any time.\nDMG’s CEO Sheldon Bennett commented, “We are very happy to announce this partnership with Sygnum as a strategic banking partner. We look forward to working closely with Sygnum Bank, as its mission includes decarbonization of the Bitcoin ecosystem, a value which we very much share.”\nNéstor Palao, Sygnum Bank’s Head of DLT & Corporate Clients commented, “As we see our footprint in the Bitcoin mining ecosystem growing and including several leading publicly listed players, Sygnum is pleased to work with DMG Blockchain Solutions in providing tailored service for its banking and lending needs and support growth in carbon-neutral crypto asset mining.”\nAbout Sygnum\nSygnum is a global digital asset banking group, founded on Swiss and Singapore heritage. Sygnum empowers professional and institutional investors, banks, corporates and digital ledger technology (DLT) foundations to invest in digital assets with complete trust. The team enables this through our institutional-grade security, expert personal service and a portfolio of regulated digital asset banking, asset management, tokenization and B2B services. In Switzerland, Sygnum holds a banking license and has CMS and Major Payment Institution Licenses in Singapore. The group is also regulated in the established global financial hubs of Abu Dhabi and Luxembourg.\nSygnum’s crypto-native team of banking, investment and digital asset technology professionals are building a trusted gateway between the traditional and digital asset economies that we call Future Finance. To learn more, please visit www.sygnum.com.\nSygnum media contactDom Castley, CMOT +41 58 508 21 01, media@sygnum.comSygnum Bank AG, Uetlibergstrasse 134a, 8045 Zurich, Switzerland\nAbout DMG Blockchain Solutions Inc.\nDMG is an environmentally friendly vertically integrated blockchain and cryptocurrency company that manages, operates, and develops end-to-end digital solutions to monetize the blockchain ecosystem. DMG’s sustainable businesses are segmented into two business lines under the Core and Core+ strategies and unified through DMG’s vertical integration.\nFor more information on DMG Blockchain Solutions visit: www.dmgblockchain.comFollow @dmgblockchain on X and subscribe to DMG's YouTube channel.\nFor further information, please contact:\nOn behalf of the Board of Directors,\nSheldon Bennett, CEO & DirectorTel: 516-222-2560Email: investors@dmgblockchain.comWeb: www.dmgblockchain.com\nInvestor Relations Contact:CORE IR 516-222-2560\nFor Media Inquiries:Jules AbrahamCORE IR917-885-7378julesa@coreir.com\nNeither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.\nCautionary Note Regarding Forward-Looking Information\nThis news release contains forward-looking information or statements based on current expectations. Forward-looking statements contained in this news release include statements regarding DMG’s use of the credit facility, the purchase of new miners, DMG’s strategies and plans, the expected increase in realized hashrate in the coming months, developing and executing on the Company’s products and services, increasing self-mining, efforts to improve the operation of its mining fleet, the launch of products and services, events, courses of action, and the potential of the Company’s technology and operations, among others, are all forward-looking information.\nFuture changes in the Bitcoin network-wide mining difficulty rate or Bitcoin hash rate may materially affect the future performance of DMG’s production of bitcoin, and future operating results could also be materially affected by the price of bitcoin and an increase in hash rate mining difficulty.\nForward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations, or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as \"may\", \"expect\", \"estimate\", \"anticipate\", \"intend\", \"believe\" and \"continue\" or the negative thereof or similar variations. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company, including but not limited to, market and other conditions, volatility in the trading price of the common shares of the Company, business, economic and capital market conditions; the ability to manage operating expenses, which may adversely affect the Company's financial condition; the ability to remain competitive as other better financed competitors develop and release competitive products; regulatory uncertainties; access to equipment; market conditions and the demand and pricing for products; the demand and pricing of bitcoins; security threats, including a loss\/theft of DMG's bitcoins; DMG's relationships with its customers, distributors and business partners; the inability to add more power to DMG's facilities; DMG's ability to successfully define, design and release new products in a timely manner that meet customers' needs; the ability to attract, retain and motivate qualified personnel; competition in the industry; the impact of technology changes on the products and industry; failure to develop new and innovative products; the ability to successfully maintain and enforce our intellectual property rights and defend third-party claims of infringement of their intellectual property rights; the impact of intellectual property litigation that could materially and adversely affect the business; the ability to manage working capital; and the dependence on key personnel. DMG may not actually achieve its plans, projections, or expectations. Such statements and information are based on numerous assumptions regarding present and future business strategies and the environment in which the Company will operate in the future, including the demand for its products, the ability to successfully develop software, that there will be no regulation or law that will prevent the Company from operating its business, anticipated costs, the ability to secure sufficient capital to complete its business plans, the ability to pay off any outstanding debt (including credit facilities), the ability to achieve goals and the price of bitcoin. Given these risks, uncertainties, and assumptions, you should not place undue reliance on these forward-looking statements. The securities of DMG are considered highly speculative due to the nature of DMG's business. For further information concerning these and other risks and uncertainties, refer to the Company’s filings on www.sedarplus.ca. In addition, DMG’s past financial performance may not be a reliable indicator of future performance.\nFactors that could cause actual results to differ materially from those in forward-looking statements include, failure to obtain regulatory approval, the continued availability of capital and financing, equipment failures, lack of supply of equipment, power and infrastructure, failure to obtain any permits required to operate the business, the impact of technology changes on the industry, the impact of Covid-19 or other viruses and diseases on the Company's ability to operate, secure equipment, and hire personnel, competition, security threats including stolen bitcoins from DMG or its customers, consumer sentiment towards DMG's products, services and blockchain technology generally, failure to develop new and innovative products, litigation, adverse weather or climate events, increase in operating costs, increase in equipment and labor costs, equipment failures, decrease in the price of Bitcoin, failure of counterparties to perform their contractual obligations, government regulations, loss of key employees and consultants, and general economic, market or business conditions. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The reader is cautioned not to place undue reliance on any forward-looking information. The forward-looking statements contained in this news release are made as of the date of this news release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise. Additionally, the Company undertakes no obligation to comment on the expectations of or statements made by third parties in respect of the matters discussed above.\nVANCOUVER, British Columbia, April  02, 2025  (GLOBE NEWSWIRE) -- DMG Blockchain Solutions Inc. (TSX-V: DMGI) (OTCQB: DMGGF) (FRANKFURT: 6AX) (\"DMG\" or the \"Company\"), a vertically integrated...\nVANCOUVER, British Columbia, March  03, 2025  (GLOBE NEWSWIRE) -- DMG Blockchain Solutions Inc. (TSX-V: DMGI) (OTCQB: DMGGF) (FRANKFURT: 6AX) (\"DMG\" or the \"Company\"), a vertically integrated...","VANCOUVER, British Columbia, Feb. 15, 2024 (GLOBE NEWSWIRE) — DMG Blockchain Solutions Inc. (TSX-V: DMGI) (OTCQB US: DMGGF) (FRANKFURT: 6AX) (“DMG” or the “Company”), a vertically integrated blockchain and cryptocurrency technology company, announces that it has established a relationship with Sygnum Bank, a Swiss bank specialized in servicing crypto-native companies, as a strategic banking partner providing US$9 million (equivalent) in a credit facility to increase its operational capacity ahead of the upcoming Bitcoin halvening expected in April 2024. The primary use of proceeds is for the purchase of 4,550 T21 190 TH\/s bitcoin miners from Bitmain Technologies for US$12,103,000 (US$14\/TH\/s), which was previously announced in December 2023.\nWith a first financing tranche of US$5.6 million already disbursed, DMG has been able to fulfill part of its payment obligation to Bitmain without the need to liquidate its bitcoin holding. DMG believes that modest amounts of debt enable it to better optimize its balance sheet, especially as it can help maintain its healthy bitcoin holding as well as lower its weighted average cost of capital, both of which should be positive for shareholders. In addition to this US$9 million credit facility, DMG intends to use some of its existing cash towards the purchase of these miners from Bitmain.\nGet the latest headlines, breaking news and columns.\nBy signing up you consent to receive the above newsletter from Postmedia Network Inc.\nA welcome email is on its way. If you don't see it, please check your junk folder.\nThe next issue of Top Stories will soon be in your inbox.\nWe encountered an issue signing you up. Please try again\nInterested in more newsletters? Browse here.\nThe loan is interest bearing at an annual rate of 7.8% for an indefinite term. Sygnum has the right to terminate the agreement at any time, at which time the loan would be due immediately. The loan is secured against the Company’s digital currency assets of 237.8 BTC, which are pledged and deposited with Sygnum. Because the collateral is subject to fluctuations in value, the Company may be required to provide additional collateral in order to restore the security margin on the loan. DMG may repay the amount of debt outstanding at any time.\nDMG’s CEO Sheldon Bennett commented, “We are very happy to announce this partnership with Sygnum as a strategic banking partner. We look forward to working closely with Sygnum Bank, as its mission includes decarbonization of the Bitcoin ecosystem, a value which we very much share.”\nNéstor Palao, Sygnum Bank’s Head of DLT & Corporate Clients commented, “As we see our footprint in the Bitcoin mining ecosystem growing and including several leading publicly listed players, Sygnum is pleased to work with DMG Blockchain Solutions in providing tailored service for its banking and lending needs and support growth in carbon-neutral crypto asset mining.”\nAbout Sygnum\nSygnum is a global digital asset banking group, founded on Swiss and Singapore heritage. Sygnum empowers professional and institutional investors, banks, corporates and digital ledger technology (DLT) foundations to invest in digital assets with complete trust. The team enables this through our institutional-grade security, expert personal service and a portfolio of regulated digital asset banking, asset management, tokenization and B2B services. In Switzerland, Sygnum holds a banking license and has CMS and Major Payment Institution Licenses in Singapore. The group is also regulated in the established global financial hubs of Abu Dhabi and Luxembourg.\nSygnum’s crypto-native team of banking, investment and digital asset technology professionals are building a trusted gateway between the traditional and digital asset economies that we call Future Finance. To learn more, please visit www.sygnum.com.\nSygnum media contactDom Castley, CMOT +41 58 508 21 01, media@sygnum.comSygnum Bank AG, Uetlibergstrasse 134a, 8045 Zurich, Switzerland\nAbout DMG Blockchain Solutions Inc.\nDMG is an environmentally friendly vertically integrated blockchain and cryptocurrency company that manages, operates, and develops end-to-end digital solutions to monetize the blockchain ecosystem. DMG’s sustainable businesses are segmented into two business lines under the Core and Core+ strategies and unified through DMG’s vertical integration.\nFor more information on DMG Blockchain Solutions visit: www.dmgblockchain.comFollow @dmgblockchain on X and subscribe to DMG’s YouTube channel.\nFor further information, please contact:\nOn behalf of the Board of Directors,\nSheldon Bennett, CEO & DirectorTel: 516-222-2560Email: investors@dmgblockchain.comWeb: www.dmgblockchain.com\nInvestor Relations Contact:CORE IR 516-222-2560\nFor Media Inquiries:Jules AbrahamCORE IR917-885-7378julesa@coreir.com\nNeither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.\nCautionary Note Regarding Forward-Looking Information\nThis news release contains forward-looking information or statements based on current expectations. Forward-looking statements contained in this news release include statements regarding DMG’s use of the credit facility, the purchase of new miners, DMG’s strategies and plans, the expected increase in realized hashrate in the coming months, developing and executing on the Company’s products and services, increasing self-mining, efforts to improve the operation of its mining fleet, the launch of products and services, events, courses of action, and the potential of the Company’s technology and operations, among others, are all forward-looking information.\nFuture changes in the Bitcoin network-wide mining difficulty rate or Bitcoin hash rate may materially affect the future performance of DMG’s production of bitcoin, and future operating results could also be materially affected by the price of bitcoin and an increase in hash rate mining difficulty.\nForward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations, or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as “may”, “expect”, “estimate”, “anticipate”, “intend”, “believe” and “continue” or the negative thereof or similar variations. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company, including but not limited to, market and other conditions, volatility in the trading price of the common shares of the Company, business, economic and capital market conditions; the ability to manage operating expenses, which may adversely affect the Company’s financial condition; the ability to remain competitive as other better financed competitors develop and release competitive products; regulatory uncertainties; access to equipment; market conditions and the demand and pricing for products; the demand and pricing of bitcoins; security threats, including a loss\/theft of DMG’s bitcoins; DMG’s relationships with its customers, distributors and business partners; the inability to add more power to DMG’s facilities; DMG’s ability to successfully define, design and release new products in a timely manner that meet customers’ needs; the ability to attract, retain and motivate qualified personnel; competition in the industry; the impact of technology changes on the products and industry; failure to develop new and innovative products; the ability to successfully maintain and enforce our intellectual property rights and defend third-party claims of infringement of their intellectual property rights; the impact of intellectual property litigation that could materially and adversely affect the business; the ability to manage working capital; and the dependence on key personnel. DMG may not actually achieve its plans, projections, or expectations. Such statements and information are based on numerous assumptions regarding present and future business strategies and the environment in which the Company will operate in the future, including the demand for its products, the ability to successfully develop software, that there will be no regulation or law that will prevent the Company from operating its business, anticipated costs, the ability to secure sufficient capital to complete its business plans, the ability to pay off any outstanding debt (including credit facilities), the ability to achieve goals and the price of bitcoin. Given these risks, uncertainties, and assumptions, you should not place undue reliance on these forward-looking statements. The securities of DMG are considered highly speculative due to the nature of DMG’s business. For further information concerning these and other risks and uncertainties, refer to the Company’s filings on www.sedarplus.ca. In addition, DMG’s past financial performance may not be a reliable indicator of future performance.\nFactors that could cause actual results to differ materially from those in forward-looking statements include, failure to obtain regulatory approval, the continued availability of capital and financing, equipment failures, lack of supply of equipment, power and infrastructure, failure to obtain any permits required to operate the business, the impact of technology changes on the industry, the impact of Covid-19 or other viruses and diseases on the Company’s ability to operate, secure equipment, and hire personnel, competition, security threats including stolen bitcoins from DMG or its customers, consumer sentiment towards DMG’s products, services and blockchain technology generally, failure to develop new and innovative products, litigation, adverse weather or climate events, increase in operating costs, increase in equipment and labor costs, equipment failures, decrease in the price of Bitcoin, failure of counterparties to perform their contractual obligations, government regulations, loss of key employees and consultants, and general economic, market or business conditions. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The reader is cautioned not to place undue reliance on any forward-looking information. The forward-looking statements contained in this news release are made as of the date of this news release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise. Additionally, the Company undertakes no obligation to comment on the expectations of or statements made by third parties in respect of the matters discussed above.\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information.\nThis website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Use and Privacy Policy.\nYou can manage saved articles in your account.\nand save up to 100 articles!\nYou can manage your saved articles in your account and clicking the X located at the bottom right of the article."]}
{"date":"2024-02-16","titles":["Building an Investment Portfolio: Unconventional Assets, Strategies for Investors"],"urls":["https:\/\/www.investing.com\/analysis\/building-an-investment-portfolio-unconventional-assets-strategies-for-investors-200646121"],"sources":["investing.com"],"descriptions":["Market Overview Analysis by Anais Osipova covering: Charles Schwab Corp, SPDR® Gold Shares, iShares Silver Trust, GameStop Corp. Read Anais Osipova's latest ar..."],"article_contents":[null]}
{"date":"2024-02-19","titles":["Smaller Retail Investors Begin to Reappear to Crypto As Markets Stage Comeback: Report"],"urls":["https:\/\/dailyhodl.com\/2024\/02\/19\/smaller-retail-investors-begin-to-reappear-to-crypto-as-markets-stage-comeback-report\/"],"sources":["dailyhodl.com"],"descriptions":["Smaller crypto investors are reportedly beginning to return to retail trading apps like Robinhood and Coinbase as BTC has rallied 25% in the last month."],"article_contents":["Smaller crypto investors are reportedly beginning to return to retail trading apps like Robinhood and Coinbase as BTC has rallied 25% in the last month.\nAccording to a new Bloomberg report, small, “mom-and-pop” investors are creeping back into the crypto markets, though they’re nowhere near the same level of involvement as the last bull market.\nBoth Robinhood and Coinbase released positive earnings reports last week. Specifically, Coinbase announced a surge in revenue and users, and had its first profitable quarter in two years, sending its share price vertical.\nKyle Doane, a trader at Arca told Bloomberg,\n“There are signs that the retail audience is starting to get back into the market, but not nearly to the extent of the last bull market yet… Even crypto stocks like COIN and miners are exhibiting more volatility than many tokens.”\nAccording to Owen Lau, an analyst at Oppenheimer & Co.,\n“We are only at 16% of the last peak retail volume. With the money returning from the bankrupt entities, there is a lot of room to run potentially.”\nCoinbase CFO Alesia Haas also told Bloomberg that the firm has seen “good momentum drivers,” noting that the Bitcoin halving, which is slated for April and will cut miners’ BTC rewards in half, has historically resulted in more retail engagement and growth.\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-02-20","titles":["Here’s a Rational Bitcoin Price Prediction for This Cycle, According to Trader Who Called May 2021 Collapse","Marathon Digital: The Bitcoin Miner To Own Before Halving And Elections (NASDAQ:MARA)"],"urls":["https:\/\/dailyhodl.com\/2024\/02\/20\/heres-a-rational-bitcoin-price-prediction-for-this-cycle-according-to-trader-who-called-may-2021-collapse\/","https:\/\/seekingalpha.com\/article\/4671568-marathon-digital-the-bitcoin-miner-to-own-before-halving-and-elections"],"sources":["dailyhodl.com","seekingalpha.com"],"descriptions":["The trader who accurately called the May 2021 crypto market crash is predicting a price pattern for Bitcoin (BTC) in the current market cycle using a model with...","Marathon is the best Bitcoin miner to own ahead of these catalysts thanks to its industry-leading Bitcoin stash. Read why I have a Buy rating on MARA stock."],"article_contents":["The trader who accurately called the May 2021 crypto market crash is predicting a price pattern for Bitcoin (BTC) in the current market cycle using a model with historical reliability.\nPseudonymous analyst Dave the Wave tells his 145,100 followers on the social media platform X that he expects Bitcoin to continue to trade within the upper and lower bounds of his version of the logarithmic growth curve (LGC).\nThe LGC is an investing model that aims to forecast Bitcoin’s market cycle highs and lows while filtering out short-term volatility.\nAccording to Dave the Wave, it makes much more sense for Bitcoin to continue trading within the LGC in the long term as opposed to invalidating the model that has stood the test of time so far.\n“The speculators in this space can roughly be divided into those that believe in diminishing returns and those that don’t. Adherents to the DM (diminishing marginal returns) principle would roughly agree that price will track the channel as sketched in the first chart.\nThose rejecting the principle see price transgressing it as in something like the second chart, and possibly breaking to both sides. The first seems a lot more rational to me for at least it has something empirical and historical to go on.”\nThe analyst first shares a chart suggesting that BTC will print higher highs and higher lows over the years while trading inside the LGC.\nDave the Wave’s second chart shows BTC breaking above the upper bound of the LGC before witnessing a steep corrective move that sends the crypto king below the lower bound of the model.\nThe trader also uses the Fibonacci extensions to predict a $180,000 price target for BTC in 2025. Fibonacci extensions are used in technical analysis to estimate profit targets and price pullbacks. They are based on Fibonacci ratios.\n“BTC Fib extension gives target of $180,000.”\nBitcoin is trading for $51,966 at time of writing, up 4% in the past seven days.\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl",null]}
{"date":"2024-02-21","titles":["Bitcoin Back Above $50k – But What Comes Next?"],"urls":["https:\/\/www.forbes.com\/sites\/digital-assets\/2024\/02\/21\/bitcoin-back-above-50k--but-what-comes-next\/"],"sources":["forbes.com"],"descriptions":["The market conditions are showing that the demand on Bitcoin is increasing, which is expected to reflect positively on the prices in the near future."],"article_contents":["ByVictoria Chynoweth\nByVictoria Chynoweth,\nFormer Contributor.\nHONG KONG, CHINA - FEBRUARY 15: Pedestrians walk past an advertisement displaying a Bitcoin ... More cryptocurrency token on February 15, 2022 in Hong Kong, China. Cryptocurrencies are gaining popularity worldwide as investors seek to diversify into the new asset class.  (Photo by Anthony Kwan\/Getty Images)\nBitcoin bulls received a long-awaited vindication last week as the flagship crypto scaled new yearly highs to reach $50,000. Only a few days later, it went on to regain its $1 trillion market capitalization for the first time since 2021, creating a widespread sentiment that the worst of this cycle’s crypto winter is firmly in the past.\nFollowing a breakthrough of the symbolic $50,000 barrier, hopes are high that the upward trajectory will continue. But with Genesis just having been cleared to sell GBTC shares worth $1.3 billion and some analysts warning that BTC is overbought, could the tide still turn?\nAlthough Bitcoin’s\nBTC\n infamous volatility doesn’t manifest quite as aggressively as it used to, it’s only less than fourteen months since prices were languishing around $16,000 following the tumultuous events of 2022. Despite having recovered $20,000, BTC struggled to gain much traction over the entire first half of 2023. However, as speculation grew about the possibility of a Bitcoin ETF finally getting the long-awaited green light from the US SEC, the markets began to heat up in the final quarter.\nEugene Chung, VP & Head of Institutions at Bybit, believes there are reasons to remain confident. He told me in an interview that, “open interest for Bitcoin on Bybit is at an all-time high, currently $8.4 billion, showing a strong bid at these prices from our traders.”\nOpen interest is a metric that refers to the number of open positions, both long and short, that are present on an exchange. In January 2024, this metric exceeded $20 billion and recorded its 16-month-high. The surge of this metric was expected to push Bitcoin prices higher which turned into fruition as Bitcoin exceeded the $50,000 barrier within a month after this surge.\nJohn Patrick Mullin, CEO and Co-Founder of compliant DeFi ecosystem MANTRA agreed that Bitcoin will continue its upward trajectory in the future by stating:\n“Despite technical indicators suggesting overbought conditions, which typically precede a market correction, [we are seeing] appetite for call options at or above Bitcoin’s lifetime high [which] reflects a conviction that Bitcoin’s price will continue to rise. This optimism is likely fueled by the underlying fundamentals of Bitcoin, recent market dynamics, and possibly anticipation of positive developments within the crypto space.”\nThe “underlying fundamentals” of Bitcoin are a reference to the upcoming halving event, which is slated to happen around April 20 or 21. Despite the building excitement, there has been a considerable lag of twelve to eighteen months between previous halving events and the next all-time high. However, some are suggesting that this time around is different, given that there’s already significant traction in the market.\nBybit’s Chung breaks it down to pure numbers, explaining the supply shock that the halving will create: “On the demand side, we have the new ETFs that have already attracted about $10B inflows since launch and have recently seen about $500M inflows per day, which is the equivalent to 10,200 bitcoins. The daily issuance of new bitcoins from the blockchain is only 900 per day, and when the halving happens in April, issuance will be slashed to 450 bitcoins per day.”\nTristan Dickinson, Head of Marketing and Communications at dYdX\nDYDX\n\nETHDYDX\n Foundation, acknowledges the ETF effect, stating: “BTC breaking the $50k barrier signals early positive sentiment. The halving typically brings price fluctuations and a peak in interest in the cryptocurrency sector; however, with the influx of Bitcoin ETF – the most successful US-launched ETF in 30 years – it’s increasingly likely that April will surpass previous trends and usher in the start of a bullish market.”\nThe 2024 halving will be the fourth halving even the crypto community experiences. Using the existing data on halving trends, analysts divided the halving into four phases: The first stage is 70 days before the halving and the prices are downwards. The second stage takes place around 60 days from the halving and records a bullish movement due to opened short positions that are looking to reap the rewards of the halving hype.\nThe third phase starts weeks before the halving and is expected to record falling prices due to the selling pressure on investors and miners. Finally, the fourth stage occurs around 100 days after the halving event, where Bitcoin records an ATH.\nBitcoin ETFs’ effect on the market is not something to be undermined. It is expected to show itself in the third phase of the halving by providing a barrier against the selling pressure in the market, therefore preventing the Bitcoin price from falling too much. In this case, the ATH Bitcoin records in the fourth stage are likely to be even higher than expected.\nShinsuke Sato, CEO and Founder of Slash concurs, stating: “The halving milestone, coupled with the influx of funds from traders introducing newly launched Bitcoin ETFs, is stimulating the market and will potentially propel Bitcoin to new heights.”\nAlthough they are currently driving much of the headlines, it’s worth noting that ETFs and halvings aren’t the only factors that can drive Bitcoin’s value. One of the few bright spots in the otherwise bleak year that was 2023 was the launch of the Ordinals protocol on Bitcoin in January 2023, which proved hugely popular thanks to the ability to inscribe assets onto the Bitcoin blockchain, giving rise to NFT-like capabilities.\nThe correct combinations of different Ordinals could potentially allow dynamic content creation on the Bitcoin blockchain and make interactive content possible. Moreover, they could be utilized similarly to Ethereum’s\nETH\n smart contracts to unlock even more complex functionalities on the blockchain. Even though the first few months after the launch were slow for the Ordinals NFTs, their trading volume reached its peak in May 2023 and hit over $452 million.\nSome in the industry believe that these kinds of developments could continue to propel Bitcoin’s price and profile in 2024. Kyle Ellicott, a member and investor of the Stacks\nSTX\n Bitcoin Layer 2 ecosystem, is optimistic based on the current pipeline. He said: “We can anticipate similar upward price movements as technical innovations occur through the maturing Bitcoin ecosystem. Since January, an increasing pipeline of new projects, including BitVM, B2 Network, Botanix, new Bitcoin L2 and DeFi applications, and privacy standards have come to market, partly due to increased demand in Bitcoin L2s transaction volumes.”\nHe added: “This year is shaping up to be the most expansive technical year so far for the industry.”\nBitVM is an upgrade that will allow smart contracts to be executed on the Bitcoin blockchain, while B2 Network, is a layer-2 solution that aims at increasing transaction speed and expanding the potential use cases. Botanix, on the other hand, is another layer-2 system that will have the ability to deploy the smart contracts of Ethereum on the Bitcoin blockchain. All these technical updates aim at increasing the scope of capabilities, transaction speeds, and amounts of the Bitcoin blockchain, which are expected to reflect positively on the prices.\nSlash’s Shinsuke Sato believes that Bitcoin’s lower volatility could support the rise of more payment-based utilities for the flagship crypto, further driving demand. He told Forbes: “Crypto offers swift, secure transactions without the need for a central authority, making cross-border payments easy and efficient. However, volatility in crypto prices still poses a challenge to its use in everyday transactions. Overall, the coming months will be pivotal for Bitcoin and the crypto market in general, and digital payments are set to evolve with the broader acceptance and integration of cryptocurrencies.”\nWith Bitcoin on a more solid regulatory footing and a further supply constraint arriving imminently, there is a sense of the familiar bullish optimism setting in. Short-term price fluctuations and the odd naysayer notwithstanding, most in the industry agree that 2024 is shaping up to be a dynamic year.\nThere’s no denying that the 2024 halving will be a unique event. It will be the first halving in Bitcoin history with demand coming from traditional markets as well. While some experts are certain that the inflows through Bitcoin ETFs will perform as a hedge against the expected price drops usually recorded close to halving, some disagree. Senior analyst Nicholas Sciberras from Collective Shift is one such person.\nHe points out that even the inflow through Bitcoin ETFs is considerably high, the 2024 halving will dramatically cut the Bitcoin supply. Thus, it is a gamble. Increasing scarcity will create a strong sell pressure on short-term investors and miners. According to Sciberras, there is no way of properly knowing if the inflows will overcome the sell pressure, or vica-versa.\nWhile signs are pointing to a very likely price increase in Bitcoin, the mainstream adoption is still a big question mark. The market conditions are showing that the demand on Bitcoin is increasing, as well as its technical capabilities, which are expected to reflect positively on the prices in the near future. However, concerns over energy consumption and technical safety hinders gradual mainstream adoption for Bitcoin, which might reflect negatively on the prices in the near future as well."]}
{"date":"2024-02-22","titles":["Advantages and disadvantages of cryptocurrency","Why It’s Practical to Buy and Hold Cryptocurrencies Today"],"urls":["https:\/\/economictimes.indiatimes.com\/markets\/cryptocurrency\/advantages-and-disadvantages-of-cryptocurrency\/articleshow\/107916590.cms","https:\/\/www.financemagnates.com\/thought-leadership\/why-its-practical-to-buy-and-hold-cryptocurrencies-today\/"],"sources":["economictimes.indiatimes.com","financemagnates.com"],"descriptions":["Cryptocurrency in India offers financial inclusion, protection against inflation, remittance benefits, new investment avenues, fast transactions, and decentrali...","The crypto market has expanded from individual traders and brokers to business establishments and government agencies."],"article_contents":["Did you Know?\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors.\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\nDelhivery-Ecom Express deal: A Big win for Delhivery but could Ecom Express have a longer runway?\nBollywood’s creative crisis: Why Hindi cinema is losing the shared experience economy battle\nModel Context Protocol: The secret handshake changing how businesses talk to AI\nWhy investors must keep in mind Marks’ ‘Pendulum Psychology’ of markets\nTurning Trump tariffs into an opportunity for India\nThe party’s over; what next?\nStories you might be interested in","For a long time, the cryptocurrency market has been surrounded by questions about its volatility and security. But ever since the pandemic, it has drawn more attention from investors of varying risk appetites and tolerance.\nCryptocurrencies are now a popular trend even if they have not fulfilled their promise of a decentralized financial system. There are over 400 million cryptocurrency owners worldwide, led by India, the US, and Vietnam, with 93M, 48M, and 20M, respectively.\nGiven this, cryptocurrency trading has become part of our daily lives. The market has expanded from individual traders and brokers to business establishments and government agencies. It has become more attractive recently as the market continues to heat up.\nIn this article, we will discuss why it’s wise to hold cryptocurrencies now.\nIn 2021, the price of any type of cryptocurrency rose substantially and set a new all-time high. Bitcoin (BTC), for instance, broke $60,000 during the first quarter. By November, it reached $69,004, the highest value since its inception.\nBut in only a few months, the celebration turned into panic among investors as crypto prices took a nosedive. It coincided with the skyrocketing global inflation during the first half of 2022. For instance, the US inflation exceeded 8% for the first time in many years before climbing to its 9.1% peak. In response, crypto prices had a steep plunge.\nIn the following months, prices started to move sideways, mainly due to the contrasting impact of lower inflation and higher interest rates in the US. As such, crypto prices became deeply tied to macroeconomic indicators. This supposition was fortified in 2023 when crypto prices accelerated as inflation decreased and the Fed maintained rate hike pauses.\nIn 3Q23, the market indicated slowdowns when inflation rebounded, and the Fed expressed its hawkish view. But today, prices have bounced back, showing that the market is heating up.\nGiven all these, cryptocurrencies are not wise choices for inflation hedges. Yet, their inverse correlation with macroeconomic indicators shows their potential for a sustained price rally this FY. The improving macroeconomic environment will even drive the bullish market. This can be supported by the anticipated Fed rate cuts this year.\nBuying cryptocurrencies today is ideal, so investors must take advantage of price dips and pullbacks to buy them at a discount. There may be a double-digit upside potential if inflation keeps decreasing. As such, cryptocurrencies are still cheap today.\nTo support our views, here are Bitcoin (BTC), Ethereum (ETH), and Litecoin (LTC) charts with a Simple Moving Average (SMA) Line. You can compare their respective trends to inflation.\nIt is no longer a secret that many business owners have already entered the world of cryptocurrency trading. It has become more apparent in recent years as many online businesses have emerged, especially during the COVID-19 pandemic.\nMany businesses are now operational even without brick-and-mortar stores. These are the primary drivers of the e-commerce boom and fintech revolution. And as cashless payment methods take flight, the crypto market is seeing more opportunities to penetrate new niches.\nIn the US, 41% of Americans no longer use cash for transactions. It substantially increased from 24% in 2015 to 29% in 2018. This contrasts the percentage of Americans with cash transactions, contracting from 24% in 2015 to 18% in 2018 and 14% in 2022.\nCredit cards and mobile wallets are the top payment methods today. And since many banks are now into crypto trading, credit cards have started working hand-in-hand with cryptocurrencies. Even mobile wallets like PayPal (PYPL) are used to top up crypto wallets. Given all these, cryptocurrencies will become more common even in small and medium businesses (SMBs).\nMoreover, cryptocurrencies have become part of our daily lives. For instance, Amazon (AMZN) and Shopify accept crypto payments to check out orders.\nMore interestingly, cryptocurrencies are already accepted in many restaurants. Starbucks (SBUX), Burger King (QSR), and KFC (YUM) are just some of the notable brands accepting these payments. SBUX is a famous coffee shop, while the other two are known quick-service restaurants (QSRs). So whether casual dining, fine dining, or quick service, whatever best POS system for restaurants implemented, cryptocurrencies are already accepted.\nDespite being unregulated, government agencies have become more open to crypto as a product of the fintech revolution. Of course, many developed economies, such as the US, are still wary of cryptocurrencies, particularly Bitcoin. Its decentralized nature remains the primary reason behind this.\nPolicymakers are apprehensive about its capacity to circumvent government-imposed capital controls. While it promises freer financial transactions, governments see risks of unmanageable capital flows across nations. According to Chainalysis, more than $50B of Bitcoin moved from East Asia to other countries in 2020.\nOn a lighter note, some nations view cryptocurrencies as an opportunity to drive more capital inflows to boost economic activities. These will be pivotal to their rebound as their respective capital markets draw an influx of investors.\nIn Singapore, government agencies accept Ethereum contracts as payment for their services. This is one of their ways to veer away from siloed centralized payment systems. We can attribute it to Ethereum leading the blockchain technology, making it more secure today.\nNote that Singapore is one of the most robust economies in the world. Hence, it will not be surprising if its neighboring countries emulate its economic recovery and development roadmap.\nThe cryptocurrency market is expanding and thriving today. Given its enticing growth prospects and rising popularity, trading and holding can be practical for individuals and entrepreneurs.\nFor a long time, the cryptocurrency market has been surrounded by questions about its volatility and security. But ever since the pandemic, it has drawn more attention from investors of varying risk appetites and tolerance.\nCryptocurrencies are now a popular trend even if they have not fulfilled their promise of a decentralized financial system. There are over 400 million cryptocurrency owners worldwide, led by India, the US, and Vietnam, with 93M, 48M, and 20M, respectively.\nGiven this, cryptocurrency trading has become part of our daily lives. The market has expanded from individual traders and brokers to business establishments and government agencies. It has become more attractive recently as the market continues to heat up.\nIn this article, we will discuss why it’s wise to hold cryptocurrencies now.\nIn 2021, the price of any type of cryptocurrency rose substantially and set a new all-time high. Bitcoin (BTC), for instance, broke $60,000 during the first quarter. By November, it reached $69,004, the highest value since its inception.\nBut in only a few months, the celebration turned into panic among investors as crypto prices took a nosedive. It coincided with the skyrocketing global inflation during the first half of 2022. For instance, the US inflation exceeded 8% for the first time in many years before climbing to its 9.1% peak. In response, crypto prices had a steep plunge.\nIn the following months, prices started to move sideways, mainly due to the contrasting impact of lower inflation and higher interest rates in the US. As such, crypto prices became deeply tied to macroeconomic indicators. This supposition was fortified in 2023 when crypto prices accelerated as inflation decreased and the Fed maintained rate hike pauses.\nIn 3Q23, the market indicated slowdowns when inflation rebounded, and the Fed expressed its hawkish view. But today, prices have bounced back, showing that the market is heating up.\nGiven all these, cryptocurrencies are not wise choices for inflation hedges. Yet, their inverse correlation with macroeconomic indicators shows their potential for a sustained price rally this FY. The improving macroeconomic environment will even drive the bullish market. This can be supported by the anticipated Fed rate cuts this year.\nBuying cryptocurrencies today is ideal, so investors must take advantage of price dips and pullbacks to buy them at a discount. There may be a double-digit upside potential if inflation keeps decreasing. As such, cryptocurrencies are still cheap today.\nTo support our views, here are Bitcoin (BTC), Ethereum (ETH), and Litecoin (LTC) charts with a Simple Moving Average (SMA) Line. You can compare their respective trends to inflation.\nIt is no longer a secret that many business owners have already entered the world of cryptocurrency trading. It has become more apparent in recent years as many online businesses have emerged, especially during the COVID-19 pandemic.\nMany businesses are now operational even without brick-and-mortar stores. These are the primary drivers of the e-commerce boom and fintech revolution. And as cashless payment methods take flight, the crypto market is seeing more opportunities to penetrate new niches.\nIn the US, 41% of Americans no longer use cash for transactions. It substantially increased from 24% in 2015 to 29% in 2018. This contrasts the percentage of Americans with cash transactions, contracting from 24% in 2015 to 18% in 2018 and 14% in 2022.\nCredit cards and mobile wallets are the top payment methods today. And since many banks are now into crypto trading, credit cards have started working hand-in-hand with cryptocurrencies. Even mobile wallets like PayPal (PYPL) are used to top up crypto wallets. Given all these, cryptocurrencies will become more common even in small and medium businesses (SMBs).\nMoreover, cryptocurrencies have become part of our daily lives. For instance, Amazon (AMZN) and Shopify accept crypto payments to check out orders.\nMore interestingly, cryptocurrencies are already accepted in many restaurants. Starbucks (SBUX), Burger King (QSR), and KFC (YUM) are just some of the notable brands accepting these payments. SBUX is a famous coffee shop, while the other two are known quick-service restaurants (QSRs). So whether casual dining, fine dining, or quick service, whatever best POS system for restaurants implemented, cryptocurrencies are already accepted.\nDespite being unregulated, government agencies have become more open to crypto as a product of the fintech revolution. Of course, many developed economies, such as the US, are still wary of cryptocurrencies, particularly Bitcoin. Its decentralized nature remains the primary reason behind this.\nPolicymakers are apprehensive about its capacity to circumvent government-imposed capital controls. While it promises freer financial transactions, governments see risks of unmanageable capital flows across nations. According to Chainalysis, more than $50B of Bitcoin moved from East Asia to other countries in 2020.\nOn a lighter note, some nations view cryptocurrencies as an opportunity to drive more capital inflows to boost economic activities. These will be pivotal to their rebound as their respective capital markets draw an influx of investors.\nIn Singapore, government agencies accept Ethereum contracts as payment for their services. This is one of their ways to veer away from siloed centralized payment systems. We can attribute it to Ethereum leading the blockchain technology, making it more secure today.\nNote that Singapore is one of the most robust economies in the world. Hence, it will not be surprising if its neighboring countries emulate its economic recovery and development roadmap.\nThe cryptocurrency market is expanding and thriving today. Given its enticing growth prospects and rising popularity, trading and holding can be practical for individuals and entrepreneurs.\nShare this article"]}
{"date":"2024-02-23","titles":["Coinbase Returns To Profit Amid ETF Hype: Sustainable Recovery Or Short-Lived Success? - Coinbase Glb (NASDAQ:COIN)","Bitcoin Halving's Relevance Challenged by ETFs"],"urls":["https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/02\/37286562\/coinbase-returns-to-profit-amid-etf-hype-sustainable-recovery-or-short-lived-success","https:\/\/www.financemagnates.com\/cryptocurrency\/does-the-bitcoin-halving-still-matter-in-2024\/"],"sources":["benzinga.com","financemagnates.com"],"descriptions":["Coinbase Global, Inc.","Growth and adoption can make the Bitcoin halving less important. However, market psychology and supply and demand could make it influential."],"article_contents":["Benzinga Rankings give you vital metrics on any stock – anytime.\nCoinbase Global, Inc. COIN previously projected that the launch of the spot Bitcoin BTC\/USD ETFs could add billions to the crypto market cap, opening new opportunities for asset-class investments.\nThrough its primary roles as a crypto custodian and trading associate for ETF issuers, COIN’s financials have seen a considerable uptick, proving the forecast to be accurate.\nCOIN posted its first quarterly profit in two years, primarily driven by increased trading activity fueled by restored investor enthusiasm for digital assets.\nInvestors responded ardently to the company’s return to profit, resulting in an over 13% increase in COIN's shares in pre-market trading on Feb. 16 following the release of its fourth quarter and full year 2023 financial results the prior day. Over the past year, the stock has gained about 175%.\nLet’s now dive deeper into COIN’s fourth-quarter results and identify possible contributory elements.\nCOIN’s total revenue rose 41.5% quarter-over-quarter to $953.80 million, outpacing analysts' predictions – primarily propelled by an 83.4% quarter-over-quarter spike in transaction revenue. This surge was attributed to increased volatility and higher cryptocurrency prices following the much-awaited spot Bitcoin ETFs approval.\nMoreover, the positive outlooks around improved economic conditions in 2024 led to robust 'risk-on' activity in capital markets, thereby driving the company’s transaction revenues higher.\nCOIN's total trading volume grew 102.6% sequentially due to impressive growth in Markets and Coinbase Prime – the former majorly involving market maker activity and the latter leading to a higher average fee rate. Anticipation of Bitcoin ETF approval enhancing market conditions and COIN’s expanding product portfolio can also explain the strength of Prime volume.\nAs of the fourth quarter, 33% of the world’s top 100 hedge funds by reported AUM decided to onboard with COIN. The company saw increased client onboarding and high reactivation rates among large-scale institutional clientele across its product range. COIN's custodial fee revenue rose 24.7% quarter-over-quarter to $19.70 million, driven by high crypto asset prices.\nThe investment community was primarily buoyed by the impressive surge in COIN's annual total subscription and services revenue, which shot up by 77.5% year-over-year. Stablecoin interest income, along with standard fiat interest income, constituted the main drivers of growth for COIN in 2023 – primarily tied to macroeconomic factors like climbing interest rates that were beyond COIN's immediate control.\nCOIN’s total operating expenses reduced 29.2% year-over-year to $838.18 million in the fourth quarter. This decline resulted in a robust net income of $273.44 million, or $1.04 per share, compared to the net loss of $557 million, or a loss of $2.46 per share in the year-ago quarter.\nCOIN Asserts Dominance in the Bitcoin ETF Custody Space\nThe spot Bitcoin ETF market has witnessed unprecedented expansion, seizing the runner-up position among commodity ETFs. COIN has distinguished itself as a pivotal force by offering trading, custody, and other services for various digital assets. Holding the custodial reins for eight out of the 11 newly-incepted bitcoin spot ETFs substantiates COIN's influential role in this booming domain.\nBut what precisely does the role of a custodian encompass? Essentially, COIN is a regulated financial establishment entrusted with ensuring the security and safety of the bitcoin assets underpinning these ETFs – this additional safeguarding measure fortifies trustworthiness.\nThis tactical approach aligns with COIN’s broader objective of fostering cryptocurrency adoptions within traditional financial institutions. The stability and prosperity of these bitcoin spot ETFs indicate the potential for an influx of more prominent financial players. This development could usher in breakthroughs for COIN.\nUnsurprisingly, a staggering 90% of the investment funds have been procured by COIN, emphasizing its escalating role in shaping the junction of traditional financing and the digital currency realm.\nPotential Investor Worries Regarding COIN Shares\nFees: Despite COIN’s commendable financial strides in 2023, some issues persist. The Bitcoin ETFs launched with annual fees of 0.25% or lower, which is lower than the fees when procuring cryptocurrencies on the COIN platform, putting pressure on its pricing for consumers. Consequently, it raises a thought-provoking question: with an option to seek exposure to Bitcoin at reduced transactional costs in a conventional brokerage account, what does COIN offer as a unique proposition?\nThere was an expectation that lower trading fees would divert investors from exchanges like COIN toward the ETF. Surprisingly, COIN remains unfazed by these trends, refusing to believe that ETFs are causing a flight of investors.\nValuation: COIN's shares are trading at a remarkably high multiple of earnings. The company's forward price-to-earnings (P\/E) ratio of 78.74x and forward EV\/EBITDA multiple of 23.06 suggest an elevated valuation that its limited growth prospects do not adequately justify.\nAnalyst’s Skepticism: JPMorgan analyst Kenneth Worthington remains skeptical about the materialization of COIN’s promised benefits. His critique centers on a perceived ambiguity surrounding the company's operations. However, it's noteworthy that Worthington has revised his formerly bearish position. His newly set 12-month price target is $95, the least among Wall Street analysts, but he still maintains his Neutral rating for COIN.\nRegulatory Hurdles: COIN presently finds itself embroiled in a lawsuit with the SEC, which, last June, accused the company of unlicensed cryptocurrency securities exchange, broker, and clearing agency operations, thereby imperiling its future earnings. The company chose to mount a legal challenge, and its CEO, Brian Armstrong, has been notably forthright in expressing his disagreements with the SEC's accusations.\nRegulatory transparency remains a critical discussion for COIN. Armstrong consistently states the exchange’s commitment to advocating for lucid regulation in the cryptocurrency sector. Notably, he underscores COIN’s preparedness to pursue all available means – including litigation and engagements with federal lawmakers – in its quest for clarity.\nLooking Ahead\nNot long after the SEC approved applications for spot Bitcoin ETFs, the apex crypto's value climbed to over $50,000, exceeding early predictions, with issuers observing an astronomical upswing in demand.\nUnprecedented net inflows channeled into spot bitcoin ETFs, smashing previous records. By comparison, it took gold ETFs one year following their inception in November 2004 to amass $3 billion – a feat bitcoin ETFs achieved within mere weeks, signaling an extraordinary inception.\r\nBitwise Asset Management’s chief investment officer, Matt Hougan, predicts an upward trajectory in bitcoin demand as further national account platforms appear and interest from large institutions heightens. He foresees that spot bitcoin ETFs could even claim the title of the “biggest ETF launch of all time.’’ He said, “I don’t think demand is slowing down for the next 18 months. I expect these ETFs to set records.”\nAlso Read: Nvidia Spikes To $2 Trillion Market Cap As FOMO Drives Traders Into Stock: The Journey To Tech Supremacy\nCurrent trends suggest bitcoin’s overall upward trajectory will likely prevail, potentially revisiting and surpassing its all-time high of $69,000 leading up to the fourth mining reward halving on April 19. Bitcoin typically reaches its low point between 12 and 16 months before a halving, subsequently embarking on an uptrend in the year following the event.\nAlso, Bitcoin's halving indirectly impacts transaction fees. As miners' block rewards diminish, competition among users vying for their transactions to be included in each block's limited space may escalate. This increased competition could lead to heightened transaction costs since users might propose higher fees to fast-track the processing of their transactions.\nAs per Armstrong, every institution is adopting crypto and the asset class is being integrated into diversified portfolios as a standard part. Armstrong says that formalized acceptance of digital currency within the global financial structure constitutes a substantial achievement, with COIN situated as a principal trusted partner at the core of this transition.\nCOIN projects subscription and services revenue for the fiscal first quarter of 2024 to fall between $410 million and $480 million, and these figures hinge greatly upon fluctuations in cryptocurrency values.\nHowever, custodial services are not the sole means by which COIN profits from this flourishing sector. The platform also facilitates trading via its service, Prime, and offers financing for trade settlement, creating multiple streams of revenue generation.\nThe Coinbase CEO elucidates an ongoing focus on international expansion, complemented by the launch of new derivative products. He further moots the idea of morphing the COIN wallet into a “super app” designed to boost the broader adoption of crypto payments.\nCOIN's dedication to adhering to regulations and its robust fiscal position are underscored as pivotal advantages over competitors. This, in turn, fortifies the firm's identity as a dependable, pioneering force within the crypto marketplace. Industry experts foresee these endeavors enhancing COIN's market position and spurring a more widespread embrace of digital currency, thus advancing the progression of the world's financial systems.\nBottom Line\nThe surge in Bitcoin ETFs coupled with COIN's strategic initiatives has catapulted the shares of the exchange near their two-year high, thanks to the attention of both individual and institutional investors.\nThere's growing investor confidence that bitcoin ETFs will serve as a magnet for increased institutional capital infusion into the crypto sector. COIN's tactful decision earlier this month to reduce fees has stoked its current success, in appealing to high-volume traders to bolster its institutional business. This step could be beneficial for COIN’s resilience in the times to come.\nAside from dominating the custodial services sphere, COIN boasts an array of achievements, one of which includes launching its international division successfully, along with the introduction of a layer-2 network known as the Base.\nNow Read: Jamie Dimon Cashes Out $150M In JPMorgan Stock As Stock Hits 52-Week Highs: What Investors Should Know\nPhoto: Shutterstock\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.","Every four years, the Bitcoin halving occurs, meaning that the amount of new coins issued through mining rewards is cut in half. When Bitcoin first launched, mining rewards were 50 BTC. Currently, that figure is 6.25 BTC, and after the next halving, it will be reduced to 3.125 BTC.\nThe halving occurs every 210,000 blocks rather than on pre-specified dates, but this corresponds to a roughly four-year cycle, which means that the next reduction in issuance should reach us this April. Notably, a glance at BTC’s price action since inception reveals a repeating pattern of vertical gains, deep corrections, and drawn-out recoveries, and this sequence appears to correspond closely with the halvings, leading among bitcoin traders to an entrenched belief in halving-driven movements.\nHowever, as Bitcoin has matured and grown in market capitalization, and with the introduction now of spot Bitcoin ETFs in the United States, some are questioning whether the halving event is still relevant, while you can also find a few voices asserting that the halving was in fact never as important as assumed, arguing instead that other, less obvious factors have fueled price movements up to now.\n#Bitcoin ETFs were (finally) just approved for trading tomorrow, after ten years. Maybe the politics in Congress around cryptocurrency will get better once they realize it's backstopping pension funds and retirement accounts.\nAs described, the halvings cut miner rewards in half, but there is an argument that this had more impact when most of the final supply had not yet been issued. However, as of right now, around 93.5% of Bitcoin  \n            Bitcoin\n           \n      While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n     \n    While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n    Read this Term’s total supply is already in circulation. That means less than 1.4 million BTC, from the capped total supply of 21 million BTC, remains to be created, and so, as a result, new issuance is creating a smaller splash in a larger pool.\nOn top of this, the Bitcoin market cap is far larger now than in the early days of the asset’s existence, currently sitting just above $1 trillion, which is approaching the November 2021 all-time high of over $1.2 trillion. This still puts BTC a long way off gold (for which it is touted as a digital replacement), which has a market cap of around $13.6 trillion, but nonetheless, BTC is a weightier asset than it once was, which corresponds to reduced volatility.\nAnd then there is the fact that if BTC really is here for the long run, is growing in value and adoption as supply nears its cap, and is now a Wall Street asset sold through ETPs into the portfolios of investors who have no special interest in crypto, then halvings must, at some point, cease to influence the determination of a fair price.\nUltimately, after fifteen years, Bitcoin has moved towards the mainstream: spot ETFs reposition BTC within the investing landscape; if institutional adoption catches on, it will reinforce that shift and banking institutions are currently pushing the SEC to allow them to custody crypto. While the halvings might have been influential in BTC’s infancy, meaningful acceptance at scale may start a transition away from those early dynamics.\nJUST IN: A coalition of leading banking and financial institutions has petitioned the SEC for an amendment to “SAB 121,” a regulation that has restricted banks from participating in the digital currency space. pic.twitter.com\/QV8GnUo6IC\nAlthough it may not be a widely adhered to point of view, it’s worth being aware of the case for the halving not simply becoming reduced in significance but never having actually been a critical factor affecting bitcoin's price cycles.\nEssentially, it’s a simple argument: larger rises and falls in Bitcoin’s price may appear to match up with halving events, but they also correspond closely with ups and downs in the global M2 money supply, and from there, it's plausible that it is in fact the latter influence, liquidity  \n            Liquidity\n           \n      The term liquidity refers to the process, speed, and ease of which a given asset or security can be converted into cash. Notably, liquidity surmises a retention in market price, with the most liquid assets representing cash.The most liquid asset of all is cash itself.·      In economics, liquidity is defined by how efficiently and quickly an asset can be converted into usable cash without materially affecting its market price. ·      Nothing is more liquid than cash, while other assets represent\n     \n    The term liquidity refers to the process, speed, and ease of which a given asset or security can be converted into cash. Notably, liquidity surmises a retention in market price, with the most liquid assets representing cash.The most liquid asset of all is cash itself.·      In economics, liquidity is defined by how efficiently and quickly an asset can be converted into usable cash without materially affecting its market price. ·      Nothing is more liquid than cash, while other assets represent\n    Read this Term, that is the primary driving factor.\nOn the other side of the fence, most arguments for the importance of the halving come down to straightforward matters of supply and demand, which aren’t eclipsed by the arrival of spot ETFs. In fact, this view takes into account the ETFs: last week, ETF inflows were eating up, on average, around 9,000 BTC per day, while new coin issuance is only around 900 BTC per day, an amount which, after the halving will be reduced to around 450 BTC per day.\nThe halving is coming. pic.twitter.com\/15QCzlWwEf\nThat means the ETFs–as things stand, pre-halving–are taking in around ten times more bitcoin than is being newly issued, and so on the surface of it, cutting issuance in half looks significant. But there’s also another, less quantifiable factor at work, which is trading psychology, along with the influence of popular narratives and shared beliefs.\nLook at any of the visualized, long-term Bitcoin projections that circulate online, running from launch in 2009 to the current moment and then out into the next decade, and the halvings feature prominently. In fact, they are often the central columns from which emanate blow-off tops and crypto-winter troughs, and what’s more, BTC's repeating price swings appear remarkably well-ordered.\nNEW: Chart by @TimmerFidelity shows how the 2024 halving will cause Bitcoin's Stock-to-Flow ratio to jump from 57 (same as gold's) to 121 making it the \"hardest\" asset on earth 👀🙌 pic.twitter.com\/9ABGk7d8sN\nAs such, the idea that the halvings are fundamental to price action has become ingrained, and from this perspective, even if the halvings didn’t matter from a technical standpoint, they would still be critical simply because they influence expectations, and expectations influence behavior.\nOr, to put it another way, as long as enough people believe that the halvings matter, then the halvings may still continue to be important.\nEvery four years, the Bitcoin halving occurs, meaning that the amount of new coins issued through mining rewards is cut in half. When Bitcoin first launched, mining rewards were 50 BTC. Currently, that figure is 6.25 BTC, and after the next halving, it will be reduced to 3.125 BTC.\nThe halving occurs every 210,000 blocks rather than on pre-specified dates, but this corresponds to a roughly four-year cycle, which means that the next reduction in issuance should reach us this April. Notably, a glance at BTC’s price action since inception reveals a repeating pattern of vertical gains, deep corrections, and drawn-out recoveries, and this sequence appears to correspond closely with the halvings, leading among bitcoin traders to an entrenched belief in halving-driven movements.\nHowever, as Bitcoin has matured and grown in market capitalization, and with the introduction now of spot Bitcoin ETFs in the United States, some are questioning whether the halving event is still relevant, while you can also find a few voices asserting that the halving was in fact never as important as assumed, arguing instead that other, less obvious factors have fueled price movements up to now.\n#Bitcoin ETFs were (finally) just approved for trading tomorrow, after ten years. Maybe the politics in Congress around cryptocurrency will get better once they realize it's backstopping pension funds and retirement accounts.\nAs described, the halvings cut miner rewards in half, but there is an argument that this had more impact when most of the final supply had not yet been issued. However, as of right now, around 93.5% of Bitcoin  \n            Bitcoin\n           \n      While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n     \n    While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n    Read this Term’s total supply is already in circulation. That means less than 1.4 million BTC, from the capped total supply of 21 million BTC, remains to be created, and so, as a result, new issuance is creating a smaller splash in a larger pool.\nOn top of this, the Bitcoin market cap is far larger now than in the early days of the asset’s existence, currently sitting just above $1 trillion, which is approaching the November 2021 all-time high of over $1.2 trillion. This still puts BTC a long way off gold (for which it is touted as a digital replacement), which has a market cap of around $13.6 trillion, but nonetheless, BTC is a weightier asset than it once was, which corresponds to reduced volatility.\nAnd then there is the fact that if BTC really is here for the long run, is growing in value and adoption as supply nears its cap, and is now a Wall Street asset sold through ETPs into the portfolios of investors who have no special interest in crypto, then halvings must, at some point, cease to influence the determination of a fair price.\nUltimately, after fifteen years, Bitcoin has moved towards the mainstream: spot ETFs reposition BTC within the investing landscape; if institutional adoption catches on, it will reinforce that shift and banking institutions are currently pushing the SEC to allow them to custody crypto. While the halvings might have been influential in BTC’s infancy, meaningful acceptance at scale may start a transition away from those early dynamics.\nJUST IN: A coalition of leading banking and financial institutions has petitioned the SEC for an amendment to “SAB 121,” a regulation that has restricted banks from participating in the digital currency space. pic.twitter.com\/QV8GnUo6IC\nAlthough it may not be a widely adhered to point of view, it’s worth being aware of the case for the halving not simply becoming reduced in significance but never having actually been a critical factor affecting bitcoin's price cycles.\nEssentially, it’s a simple argument: larger rises and falls in Bitcoin’s price may appear to match up with halving events, but they also correspond closely with ups and downs in the global M2 money supply, and from there, it's plausible that it is in fact the latter influence, liquidity  \n            Liquidity\n           \n      The term liquidity refers to the process, speed, and ease of which a given asset or security can be converted into cash. Notably, liquidity surmises a retention in market price, with the most liquid assets representing cash.The most liquid asset of all is cash itself.·      In economics, liquidity is defined by how efficiently and quickly an asset can be converted into usable cash without materially affecting its market price. ·      Nothing is more liquid than cash, while other assets represent\n     \n    The term liquidity refers to the process, speed, and ease of which a given asset or security can be converted into cash. Notably, liquidity surmises a retention in market price, with the most liquid assets representing cash.The most liquid asset of all is cash itself.·      In economics, liquidity is defined by how efficiently and quickly an asset can be converted into usable cash without materially affecting its market price. ·      Nothing is more liquid than cash, while other assets represent\n    Read this Term, that is the primary driving factor.\nOn the other side of the fence, most arguments for the importance of the halving come down to straightforward matters of supply and demand, which aren’t eclipsed by the arrival of spot ETFs. In fact, this view takes into account the ETFs: last week, ETF inflows were eating up, on average, around 9,000 BTC per day, while new coin issuance is only around 900 BTC per day, an amount which, after the halving will be reduced to around 450 BTC per day.\nThe halving is coming. pic.twitter.com\/15QCzlWwEf\nThat means the ETFs–as things stand, pre-halving–are taking in around ten times more bitcoin than is being newly issued, and so on the surface of it, cutting issuance in half looks significant. But there’s also another, less quantifiable factor at work, which is trading psychology, along with the influence of popular narratives and shared beliefs.\nLook at any of the visualized, long-term Bitcoin projections that circulate online, running from launch in 2009 to the current moment and then out into the next decade, and the halvings feature prominently. In fact, they are often the central columns from which emanate blow-off tops and crypto-winter troughs, and what’s more, BTC's repeating price swings appear remarkably well-ordered.\nNEW: Chart by @TimmerFidelity shows how the 2024 halving will cause Bitcoin's Stock-to-Flow ratio to jump from 57 (same as gold's) to 121 making it the \"hardest\" asset on earth 👀🙌 pic.twitter.com\/9ABGk7d8sN\nAs such, the idea that the halvings are fundamental to price action has become ingrained, and from this perspective, even if the halvings didn’t matter from a technical standpoint, they would still be critical simply because they influence expectations, and expectations influence behavior.\nOr, to put it another way, as long as enough people believe that the halvings matter, then the halvings may still continue to be important.\nShare this article"]}
{"date":"2024-02-26","titles":["Crypto Price Today: Bitcoin Survives Weekend Volatility Trading Above $51,000, Ether Touches $3,000 in Pricing","Bitcoin price expectations amid a state of chaos in the markets?!","How Much Bitcoin Should We Allocate To the Portfolio?"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-price-today-ether-profit-polkadot-polygon-avalanche-5129790","https:\/\/www.investorideas.com\/news\/2024\/cryptocurrency\/02262MarketAnalyst-Bitcoin-Price.asp","https:\/\/quantpedia.com\/how-much-bitcoin-should-we-allocate-to-the-portfolio\/"],"sources":["ndtv.com","investorideas.com","quantpedia.com"],"descriptions":["The overall crypto market cap dropped by 0.67 percent in the last 24 hours. Bitcoin, on Monday, February 26 is trading at $51,490 (roughly Rs. 42.6 lakh). Ether...","","After years of waiting, the recent launch of spot Bitcoin ETFs marked a significant milestone in the cryptocurrency market, making Bitcoin even more accessible ..."],"article_contents":["Photo Credit: Pexels\/ Rodnae Productions\nThe overall crypto market cap stands at $1.99 trillion\nThe overall crypto price chart on Monday, February 26 reflected instability in the market. Bitcoin recorded a loss of 0.25 percent on Monday, with which its trading value currently stands at $51,490 (roughly Rs. 42.6 lakh). It is notable, that over the weekend the price of Bitcoin did rise by $473 (roughly Rs. 39,200). Bitcoin fanatics have been waiting for the asset to cross the resistance of $53,000 (roughly Rs. 43.9 lakh). However, Bitcoin has failed to cross the mark in the last two weeks.\n“Bitcoin is experiencing consolidation over the last few weeks. A breakout above this level would push the price of the biggest cryptocurrency up to $60,000 (roughly Rs. 49.7 lakh) soon,” Shivam Thakral, CEO of BuyUcoin told Gadgets360.\nA bunch of cryptocurrencies are trading in the losses on Monday. These include Tether, Solana, Ripple, Cardano, Dogecoin, Tron, and Chainlink.\nUniswap, Litecoin, Near Protocol, Leo, Elrond, and Bitcoin SV also logged losses on Monday.\nThe overall crypto market cap dropped by 0.67 percent in the last 24 hours. At the time of writing, the sector valuation stood at $1.99 trillion (roughly Rs. 1,64,94,960 crore) -- showed CoinMarketCap. The dominance of BTC on this market cap is presently 50.7 percent whereas the dominance of ETH has claimed the mark of 18.7 percent.\nEther performed better than Bitcoin on the price chart on Monday. Having minted a profit of 2.05 percent, the asset is trading at $3,004 (roughly Rs. 2.49 lakh). This is the second time in recent days that ETH has breached the value point of $3,000 (roughly Rs. 2.48 lakh).\n“Ethereum sustains a robust upward trend despite bearish attempts near $3,000, supportedby an ascending 20-day EMA and an overbought RSI. A dip below the 50-SMA may signal weakening buyer resolve, potentially leading to further decline,” Rajagopal Menon, Vice President, WazirX told Gadgets360.\nCryptocurrencies trading in profits on Monday include Binance Coin, USD Coin, Avalanche, Polkadot, Polygon, and Shiba Inu.\nCosmos, Stellar, Cronos, and Monero also managed to reel-in minor gains.\n“In the altcoin universe, UNI, Uniswap's governance token, surged 60 percent on Friday evening following a proposal from a prominent Uniswap Foundation member to revamp the protocol's fees-sharing arrangement for token holders. Since then, the token has been able to hold its level around $11 (roughly Rs 910). Simultaneously, Avalanche (AVAX, +0.57 percent) suffered a major outage on Friday, failing to produce blocks for more than four hours due to network strain,” Parth Chaturvedi, Investments Lead, CoinSwitch Ventures told Gadgets360.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement","January 26, 2024 (Investorideas.com Newswire) Bitcoin prices started trading on Monday at $51,350, and with the loss of significant volatility in Bitcoin prices, the markets have entered a clear state of chaos. Here, I believe that the anticipated collapse mentioned in previous articles is imminent for BTC, or at least a significant price movement for short-term readjustment, so to speak. However, this does not rule out the ongoing consolidation's impact, which could lead to a rapid move towards the next key level at $60,000. Amid this chaos, let's explore what might happen next with the Bitcoin price.\nCurrently, the Bitcoin price is trading between the weekly resistance level of $52,062 and the support level of $45,156 after a 37% rise in the last 28 days. Given the nature of this movement, it seems to me that a rebound is imminent. This scenario is supported by the presence of a bearish price fractal, suggesting significant liquidity is expected in the next couple of weeks.\nFrom my perspective, the approval of Spot BTC ETFs in the United States has marked a fundamental global shift in the Crypto market. Despite positive sentiments regarding Bitcoin adoption improvement, the largest source of Bitcoin ETFs in Canada, Purpose Bitcoin ETF, sold substantial amounts of Bitcoin during the week. Thus, buying Bitcoin is now more focused in the United States than in other regions like Canada, Germany, and Sweden, which have recently witnessed cautious Bitcoin purchases.\nThe United States has now surpassed Canada in Bitcoin ETF market share after the Securities and Exchange Commission approved exchange-traded Bitcoin funds. It has positioned itself as the leading country with assets totaling $34.78 billion across 10 exchange-traded Bitcoin funds, representing 83.3% of the global $41.74 billion immediate Bitcoin ETF market.\nDespite all this, I do not anticipate further upward momentum in Bitcoin in the short term. Blackrock has significantly expanded its presence in the Cryptocurrency space, accumulating nearly 110,000 bitcoins for the iShares Bitcoin Trust (IBIT) exchange-traded fund.\nWith expectations that Bitcoin's price could reach $100,000 by June of this year and after the anticipated halving event, it's undeniable that the AI-backed cryptocurrency sector has seen a significant surge. Over $10 billion has been added to its market value in just 17 days, amid growing anticipation for the Bitcoin halving event, historically causing price fluctuations, including a drop before the event, which I believe is likely to happen again.\nOver the weekend, something surprising and chaotic occurred in the crypto market as well. Emails purportedly from Bitcoin developer Satoshi Nakamoto appeared on Friday, thanks to Marty Malmi, one of the early contributors to the leading Crypto asset. These emails emerged during a legal battle in London involving Australian entrepreneur Craig Wright, who claimed to be Nakamoto, making his claims seem less credible.\nThe dialogue between Nakamoto and Malmi revealed that the decision to cap Bitcoin supply at 21 million tokens was not arbitrary but a deliberate choice. Nakamoto described it as a \"calculated guess,\" aiming to align Bitcoin pricing mechanics with other cryptocurrencies and acknowledging uncertainty about future market conditions.\nFurthermore, Nakamoto affirmed that the 21 million Bitcoin cap represents a small part of the global trade, ensuring scalability for the global currency system. He stated that this decision was made with the anticipation that the valuation of Bitcoin would fluctuate compared to traditional fiat currencies. Nakamoto cautioned against exaggerating the privacy features of Bitcoin, warning that transaction histories could potentially reveal user identities, adding more chaos to the price movements in the critical times of the cryptocurrency markets.\nMore Info:\nDisclaimer\/Disclosure: Investorideas.com is a digital publisher of third party sourced news, articles and equity research as well as creates original content, including video, interviews and articles. Original content created by investorideas is protected by copyright laws other than syndication rights. Our site does not make recommendations for purchases or sale of stocks, services or products. Nothing on our sites should be construed as an offer or solicitation to buy or sell products or securities. All investing involves risk and possible losses. This site is currently compensated for news publication and distribution, social media and marketing, content creation and more. Disclosure is posted for each compensated news release, content published \/created if required but otherwise the news was not compensated for and was published for the sole interest of our readers and followers. Contact management and IR of each company directly regarding specific questions.\nMore disclaimer info: https:\/\/www.investorideas.com\/About\/Disclaimer.asp Learn more about publishing your news release and our other news services on the Investorideas.com newswire https:\/\/www.investorideas.com\/News-Upload\/\nGlobal investors must adhere to regulations of each country. Please read Investorideas.com privacy policy: https:\/\/www.investorideas.com\/About\/Private_Policy.asp","Introduction\nAfter years of waiting, the recent launch of spot Bitcoin ETFs marked a significant milestone in the cryptocurrency market, making Bitcoin even more accessible for investors. Spot ETFs provide a convenient and regulated way to gain exposure to Bitcoin without the need to hold the digital asset directly, potentially attracting a broader range of market participants. Many investors are waiting to see this change’s long-term impact on the cryptocurrency’s price while putting their faith in the potentially significant returns from Bitcoin within their investment portfolios. These events are taking place after two significant milestones in Bitcoin’s history – the introduction of BTC futures in 2017 and the launch of the BTC futures ETF (BITO) in 2021. While examining the whole history of Bitcoin may give the impression of a new super asset, we need to set realistic expectations. What have all these historical changes brought, and what lessons can we learn from similar occurrences involving other assets throughout history?\nExamining the whole graph, covering the period from 2013 to 2023, it’s easy to get the impression that becoming a millionaire is within reach. The strategy to hold BTC between 2013 and 2023 exhibits a CAR (Compound Annual Return) of 103,77%. However, using the entire 11-year graph and extrapolating any long-term conclusions is misleading. From 2013 to 2017, cryptocurrencies were an obscure asset class known only to enthusiasts. This period represented a unique chapter in the evolution of digital currencies – when cryptocurrencies were still beginning, with limited mainstream recognition. It was a time of experimentation, with various cryptocurrencies emerging, often driven by passionate communities of supporters. Such a period is unlikely to happen again – it was a singular, once-in-a-lifetime occurrence. But what significant event reshaped the world of cryptocurrency in 2017?\nFinancialization\nThe introduction of futures trading on Bitcoin by the Chicago Board of Options Exchange (CBOE) on December 10, 2017, followed by the Chicago Mercantile Exchange (CME) on December 18, 2017, marked a milestone development in the cryptocurrency space. A liquid financial instrument became available legally for the first time in history, allowing funds and hedge funds to buy and sell Bitcoin in their portfolios without needing to open accounts in unregulated (and often very very shady) crypto exchanges. This event facilitated the financialization of cryptocurrency markets, a term describing how a market becomes integrated into the broader financial system and gains characteristics similar to traditional financial assets.\nThe financialization of cryptocurrency markets mirrors similar developments in emerging markets and commodities. Once considered obscure asset classes, emerging markets and commodities underwent a similar transformation. Initially, only specialized funds traded in these markets, but introducing indexes and ETFs in the mid-2000s made commodities more accessible to mainstream investors.\nA similar path can be expected for cryptocurrencies. As cryptocurrencies continue to become more increasingly integrated into the global financial system and attract demand from institutional investors, they will undergo a process of financialization. This evolution will likely involve introducing more financial instruments, such as active ETFs and broad indexes, making cryptocurrencies more accessible to a broader investor base. However, it’s essential to approach this transformation with caution. Similar to commodities, past performance of cryptocurrencies may not accurately reflect future outcomes, especially as market dynamics shift with increased institutional involvement. Investors should be mindful of the changing landscape and adjust their strategies accordingly, looking at the history of Bitcoin in two different periods – pre-financialization and post-financialization.\nFirst, let’s look at the first period – until 2017. The cryptocurrency experienced extraordinary growth, with a remarkable compounded annual return of 283.33%. However, this period was also marked by significant volatility, with fluctuations in price reaching 95.83%. The maximum drawdown during this time was -81.15%. This pre-financialization period offered exceptional Bitcoin’s risk-return characteristics with a Sharpe ratio of 2.96 and Calmar ratio (CAR\/MaxDD) of 3.49.\nAs we can see on the graph below, futures trading on Bitcoin was launched by the Chicago Board Options Exchange (CBOE) on December 10, 2017, followed closely by the Chicago Mercantile Exchange (CME) on December 18, 2017. Secondly, on October 19, 2021, another milestone was reached with the launch of the first Bitcoin futures exchange-traded fund (BITO). Introducing a Bitcoin futures ETF represented an important step towards mainstream acceptance of cryptocurrencies within traditional financial markets. Finally, on January 10, 2024, the launch of spot Bitcoin ETFs marked a significant milestone in the cryptocurrency market. Unlike futures-based ETFs like BITO, spot ETFs would directly hold Bitcoin, offering investors exposure to the actual cryptocurrency itself rather than futures contracts.\nIn contrast to the enormous rise experienced in Bitcoin’s earlier years, 2018 to 2023 presented a compounded annual Return of 21.95%. Volatility stayed high, though less than before, at 70.89%, showing Bitcoin might be getting steadier, but still with a significantly high maximum drawdown of -79.75%. Bitcoin’s risk-return ratios in the post-financialization period are nothing spectacular, with a Sharpe ratio of just 0.31 and a Calmar ratio of 0.28.\nNaturally, questions arise: How much Bitcoin should we allocate to the portfolio?\nMain Analysis\nThe main analysis examines a globally diversified portfolio across various asset classes, offering exposure to various geographic regions and investment instruments. The equally weighted portfolio consists of\n2013-2017\nIn our initial analysis, we examined an equally weighted portfolio over the period from 2013 to 2017. This allocation yielded a notable return of 22.86% alongside volatility of 11.76% and a maximum drawdown of -18.02%. Subsequently, we used the Portfolio Analysis to analyze correlations between different assets and Bitcoin, the Markowitz model to find the optimal portfolio that realizes the highest possible Sharpe ratio, and the Risk Parity for an alternative way to build a portfolio with a reduced concentration of the risk.\nCorrelation Table\nFirstly, we looked into the Correlation Table to understand the relationship between Bitcoin and other assets. We found that the correlation of Bitcoin with other assets in the period of 2013-2017 was nearly negligible, with values ranging between -0.02 to 0.03. This near absence of correlation underscores the diversification benefits Bitcoin offered in this period.\nMarkowitz Model\nNext, we used the Markowitz Model to analyze portfolio combinations based on expected returns and standard deviations (variance). The Longest Period Efficient Frontier chart displays portfolios with all the different combinations of assets that result in efficient portfolios (i.e., with the lowest risk, given the same return, and portfolios with the highest return, given the same risk). Risk is depicted on the X-axis, and return on the Y-axis.\nThe Efficient Frontier chart also displays the Tangency portfolio – the optimal portfolio that realizes the highest possible Sharpe ratio, Minimum Variance portfolio – the portfolio with the lowest risk and Equal Risk Portfolio (ERP) shows how your portfolio (in this case, our equally weighted portfolio) can be improved in return with the same amount of risk.\nThe Tangency portfolio (TP) – the optimal portfolio realizing the highest possible Sharpe ratio – representing the portfolio with the highest risk-adjusted return – tells us to allocate 14,42% to Bitcoin. This tangency portfolio would give us approximately 48.7% return with a 14.97% volatility and respectable Sharpe ratio of 3.25. The portfolio’s extraordinary results are driven mainly by its allocation to Bitcoin. But of course, a minimal number of people had any allocation to Bitcoin at that time, and those times will never return!\nRisk Parity\nIn the next step, we looked into Risk Parity, an investment management strategy focusing on risk allocation. The main aim is to find weights of assets selected in the Portfolio Manager that ensure an equal level of risk for all assets. To allocate the correct risk parity weight to an asset, we must measure its risk (e.g. historical 126-day volatility). This approach helps to reduce the concentration of risk in a few assets and enhances diversification. The initial graph (Equally-Weighted Benchmark Volatility Contribution) shows how much BTC contributed to risk over the years. Over time, BTC remained the main contributor to risk in our equally weighted portfolio.\nNext, let’s look at the equity curve of the Naive Risk Parity strategy in contrast to our equally weighted portfolio. Naive risk parity or naive risk weighting uses the inverse risk approach instead of equal weights. This approach gives lower weight to riskier assets and greater weight to less risky assets, ensuring that the risk contribution of each asset is the same. As we can see in the Naive Risk Parity Performance Table, this method significantly lowered the strategy’s volatility (from 9.38% to 5.26%). However, this risk reduction came at the expense of lower returns (from 13.43% to 5.61%).\nThis approach ensures that no single asset, including Bitcoin, dominates the portfolio’s risk exposure. As a result, Bitcoin’s high volatility led to a smaller allocation within the risk parity portfolio to maintain a balanced risk profile across all assets. What’s the Risk Parity’s average allocation to Bitcoin? It’s only approximately 2% due to Bitcoin’s excessively high risk.\n2018-2023\nIn the second part of our analysis, we examined an equally weighted portfolio of the ten assets including Bitcoin from 2018 to 2023. This allocation resulted in an annual return of only 9.05% (compared to 22.86% from the previous period), with a higher volatility of 13.93% (compared to 11.76% of the prior period) and a maximum drawdown of -24.92% (compared to -18.02% from the previous period). Similar to the previous part of our analysis, during the time interval from 2018 to 2023, we conducted a study that examined the Correlation Table, applied the Markowitz Model, and implemented the Naive Risk Parity strategy. So, how much Bitcoin should we allocate to the portfolio based on post-financialization period data?\nUnderlying Component Analysis\nAdditionally, in this phase of our analysis, we performed an Underlying Component Analysis to examine the individual performances of various assets within our equally weighted portfolio. This allows us to understand how each asset contributes to portfolio performance throughout the years.\nBitcoin’s post-financialization Sharpe ratio of 0.31 makes it an average asset. It’s outmatched by S&P 500, commodities, and gold and is approximately in the same category as high-yield bonds, MSCI EAFE, or US REITs. Bitcoin had a higher performance but was the most risky asset in the whole portfolio (by a high margin).\nCorrelation Table\nIn the previous part (years 2013-2017), we found that the correlation of Bitcoin with other assets in the Correlation Table ranged from -0.02 to 0.03. As we can see, looking at the different periods, they changed a lot. Bitcoin maintained a consistently low correlation solely with IEF (iShares 7-10 Year Treasury Bond ETF). The highest correlation with SPY (SPDR S&P 500 ETF) and EFA (iShares MSCI EAFE ETF) equals 0.25.\nThis higher correlation suggests a stronger simultaneous movement or dependency between Bitcoin and these traditional market assets. Such findings are not surprising and underscore the evolving dynamics of Bitcoin’s relationship with mainstream financial instruments. Commodities and emerging markets also had low correlations in the pre-financialization period, and those correlations significantly increased in the post-financialization period. We can expect that the correlation of Bitcoin to the main asset classes will increase even more in the future, and if you intend to allocate to cryptocurrencies, you should include this expectation in your decision process.\nMarkowitz Model\nIn applying the Markowitz Model to analyze the portfolio from 2013 to 2017, the Tangency portfolio (TP), representing the optimal portfolio with the highest risk-adjusted return, advised allocating approximately 14.42% to Bitcoin, maximizing the Sharpe ratio. However, the analysis shifted from 2018 to 2023, and the Tangency portfolio suggested allocating only 2.94% to Bitcoin. This adjustment reflects changes in market conditions, risk profiles, and expected returns over the specified period. The Markowitz Model’s analysis acknowledged the decrease in Bitcoin’s performance and simultaneously considered its elevated risk relative to other asset classes. The resultant Tangency portfolio has a 9.82% return and 12.93% volatility, and Bitcoin’s contribution to the performance is minimal (just 0.6%).\nRisk Parity\nAs we can see on the Equally-Weighted Benchmark Volatility Contribution graph for 2018-2023, Bitcoin remained a significant contributor to overall portfolio volatility in equally weighed portfolio. What happens when we run a Naive Risk Parity in this period?\nThe Naive Risk Parity strategy mitigated some risk, decreasing portfolio volatility from 14.27% to 9.84% compared to the equally weighted portfolio. Once again, this risk reduction was accompanied by a decrease in returns, declining from 14.00% to 6.54%.\nThe outcome of the Naive Risk Parity strategy was again a significant decrease in allocation to Bitcoin (once again, to approximately 2%). This adjustment reflects the strategy’s focus on allocating more weight to less risky assets and reducing exposure to riskier ones. By decreasing Bitcoin’s allocation, the strategy aimed to mitigate the impact of Bitcoin’s volatility on the overall portfolio risk.\nConclusion\nThe comparison between the two periods, 2013-2017 and 2018-2023, reveals a significant shift in the Bitcoin and cryptocurrency investments landscape. During the earlier period, the methods employed, such as the Markowitz Model, may suggest allocating a considerable portion of the portfolio to Bitcoin due to its high return despite its inherent volatility and risk. At the same time, the absence of correlation with other assets underscores the diversification benefits Bitcoin offered in this period. However, as time progressed and the financialization of Bitcoin occurred in December 2017, the dynamics of the cryptocurrency market underwent a fundamental change. Bitcoin and cryptocurrencies became part of the mainstream financial ecosystem, increasing their adoption and recognition as a legitimate asset class while increasing the correlation with mainstream financial instruments.\nWhen optimizing portfolios from 2018 to 2023, Bitcoin is now viewed as average compared to other asset classes and has a relatively high risk. Therefore, while Bitcoin may have shown exceptional growth and returns in its early years, the changing market dynamics and increased institutional involvement have altered its risk-return profile, and our analysis suggests that it’s prudent to cap allocation to Bitcoin (or the whole pool of cryptocurrencies as an asset class) to maximally 2-3% of the portfolio. The higher allocation to this new asset class is probably not justified and bears an unnecessary risk.\nThe analysis underscores the need for caution and realistic expectations when interpreting historical data and extrapolating long-term conclusions. While past performance may offer valuable insights, it does not guarantee future outcomes, especially in a rapidly evolving and volatile cryptocurrency market. For those interested in learning how to buy Bitcoin, it is essential to thoroughly research and understand the risks involved, ensuring that any investment aligns with their financial goals and risk tolerance.\nAuthors:\nJuliana Javorská, Quant Analyst, QuantpediaRadovan Vojtko, Head of Research, Quantpedia\nAre you looking for more strategies to read about? Sign up for our newsletter or visit our Blog or Screener.\nDo you have an idea for systematic\/quantitative trading or investment strategy? Then join Quantpedia Awards 2024!\nDo you want to learn more about Quantpedia Premium service? Check how Quantpedia works, our mission and Premium pricing offer.\nDo you want to learn more about Quantpedia Pro service? Check its description, watch videos, review reporting capabilities and visit our pricing offer.\nAre you looking for historical data or backtesting platforms? Check our list of Algo Trading Discounts.\nOr follow us on:\nFacebook Group, Facebook Page, Twitter, Linkedin, Medium or Youtube\nWe’ve already analysed tens of thousands of financial research papers and identified more than 700 attractive trading systems together with hundreds of related academic papers.\nSign up for Quantpedia Newsletter!\nGet updates from our Blog via RSS Feed\nCheck offered Algo Trading Discounts!\nJoin our Facebook Group\nYou’ve reached your limit for viewing up to 5 strategies for free\nAfter free sign-up you’ll be able to browse all free strategies in our library for free\nThis website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful.\nStrictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings.\nIf you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again."]}
{"date":"2024-02-27","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-02-28","titles":["VanEck Monthly Bitcoin ChainCheck","Bitcoin soars close to record high"],"urls":["https:\/\/seekingalpha.com\/article\/4674183-vaneck-monthly-bitcoin-chaincheck","https:\/\/uk.finance.yahoo.com\/news\/bitcoin-soars-close-record-high-182930260.html?.tsrc=rss"],"sources":["seekingalpha.com","finance.yahoo.com"],"descriptions":["VanEck Monthly Bitcoin ChainCheck presents on-chain indicators for investors to directly assess Bitcoin blockchain's health and adoption.","Bitcoin has topped $60,000 for the first time in more than two years amid a flurry of excitement after the approval of wider trading methods in the US."],"article_contents":[null,"Something went wrong\nBitcoin has topped $60,000 for the first time in more than two years amid a flurry of excitement after the approval of wider trading methods in the US.\nThe world’s largest cryptocurrency has surged by more than 42pc in February in what is the largest monthly gain since December 2020 during the pandemic-era boom.\nBitcoin was last up about 6pc today to $60,376 -  its highest since November 2021, when it hit a record just below $70,000.\nIt comes as traders have poured money into the digital token following the approval of so-called spot exchange traded funds, known as ETFs.\nThe financial instruments allow investors to speculate on movements in the price of crypto without the risk of owning the asset.\nJoseph Edwards, head of research at Enigma Securities, said: “Essentially, we’re seeing the ETF effect ahead of schedule.\n“Inflows into them stepped up quickly last week and have been sustained, and we think it’s reflective of advisors getting out there very quickly to start selling the ETFs to clients.”\nAntoni Trenchev, co-founder of Nexo crypto exchange, added: “If $60,000 doesn’t whet the appetite, consider that 70pc of bitcoin supply has remained unmoved for a year, and the little that’s left is being hoovered up by the likes of BlackRock and Fidelity, just as rewards for miners are about to be slashed in half. The stars are aligning for bitcoin.”\nRead the latest updates below.\nThanks for joining Chris and me today. We’ll be back on the blog tomorrow, but there among the stories elsewhere on The Telegraph site, here are four key business ones:\nAsda’s private equity backer snaps up stake in UK pet shop\nSunak pledges to retain triple lock for millions of pensioners\nBBC to write headlines using artificial intelligence\nPolestar secures £750m lifeline after Volvo pulls backing\nIn a glimpse of what Europe’s central bankers are thinking, Gediminas Simkus, a European Central Bank governing council member, has told Econostream Media:\nAs I see it, June is really the month to consider the rate cut.\nExtinction Rebellion activists have been protesting in the City of London for a third day today, demanding that companies stop insuring fossil fuel projects. Here, police officers detain a protester who set off a smoke flare.\nThe FTSE 100 closed down 0.76pc today. The biggest riser was Rolls-Royce, up 3.32pc, followed by JD Sports, up 2.44pc. The biggest faller was investment firm St James’s Place, which plunged 18.55pc, followed by Strepsils maker Reckitt, down 13.29pc.\nThe FTSE 250 fell 0.78pc. The biggest riser was Bank of Georgia, up 1.77pc, followed by component manufacturer Essentra, up 1.60pc. The biggest faller was magazine publisher Future, down 7.64pc, followed by Rolex retailer Watches of Switzerland, down 6.45pc.\nProfits in Baidu, China’s most popular search engine, plunged by 48pc in the last quarter of 2023 amid rising marketing spending and increased investment in artificial intelligence.\nRobin Li, Baidu’s chief executive, said that that company was “paving the way for the gradual creation of a new growth engine”. He said the internet giant would “enhance operational efficiencies” during 2024.\nIn the final quarter, revenues were up 6pc to $4.92bn, while profits fell to $366m.\nFor the whole of 2023, revenues rose 9pc to $18.96bn, while profits rose 169pc to $2.86bn.\nLord Hammond, the former chancellor, is to become chairman of Railsr, the fintech business best known for buying the UK arm of Wirecard.\nSky News said that Lord Hammond will replace Rick Haythornthwaite, who is taking over as chairman of NatWest Group in April.\nIn a statement released to Sky News, Lord Hammond said he was joining Railsr at a “pivotal moment in its development”.\nThe peer chairs Copper Technologies, is a senior adviser to OakNorth Bank and is a partner at investment firm Buckthorn.\nFrance wants a new push for a global minimum tax on the super-rich. During a visit to a G20 meeting in Sao Paulo, today, its finance minister Bruno Le Maire said:\nCurrently the richest people can avoid paying the same level of tax as other people who are less rich. We want to avoid such tax optimisation ...\nHe said it only made sense to crack down on tax optimisation by the super-wealthy at the international level in line with what has been achieved with a global minimum corporate tax.\nMore than 140 countries have so far backed a 2021 agreement to apply a corporate income tax of at least 15pc from this year to discourage multinational groups from shopping around for countries with the best tax rates.\nA US-led push to reform the World Trade Organisation’s embattled dispute settlement system sparked divisions at a WTO meeting in Abu Dhabi today, with India accusing Washington of bringing the trade body to a “standstill”.\nThe Trump presidency brought the system to a grinding halt in 2019 by blocking the appointment of new judges to the WTO’s appeals court.\nWashington has accused the appeals court of over-interpreting WTO rules, with US Trade Representative Katherine Tai today saying the now-defunct body was formerly more powerful than member states.\nIt was “extremely activist, extremely powerful, more powerful than even the members, where members could secure new rules through litigation and not have to rely on the very hard work of negotiating with each other,” she said.\nWashington’s push for reform has angered India.\nIndia threatened to hold off on any new deals before progress is made on the appeals court, which could imperil agreements on fisheries subsidies and agriculture, largely seen as the main agenda items of the current ministerial talks.\nAmerica’s Federal Aviation Administration (FAA) is giving Boeing 90 days to come up with a plan to fix quality problems and meet safety standards for building new planes.\nThe regulator said the directive follows meetings with top Boeing officials including the company’s boss at the FAA’s headquarters in Washington.\nMike Whitaker, the FAA Administrator, said:\nBoeing must commit to real and profound improvements. Making foundational change will require a sustained effort from Boeing’s leadership, and we are going to hold them accountable every step of the way …\nThe new deadline is being set as the FAA finishes an audit of assembly lines at the factory near Seattle, where Boeing builds planes including the 737 Max that suffered a door-panel blowout in January. Investigators say bolts that help keep the panel in place were missing after repair work on the Alaska Airlines jet at the Boeing factory.\nA Boeing spokesman said:\nBy virtue of our quality stand-downs, the FAA audit findings and the recent expert review panel report, we have a clear picture of what needs to be done. Transparency prevailed in all of these discussions. Boeing will develop the comprehensive action plan with measurable criteria that demonstrates the profound change that Administrator Whitaker and the FAA demand. Our Boeing leadership team is totally committed to meeting this challenge.\nShares in Boeing are up 2.66pc in trading today.\nThe FTSE 100 housebuilder Taylor Wimpey has continued to slide on the stock market today, with shares down around 4.5pc after saying it would build fewer homes this year and revealing disappointing results.\nAarin Chiekrie, an equity analyst at Hargreaves Lansdown, explains:\nTaylor Wimpey’s put in a relatively resilient showing given the difficult market conditions of 2023. Full-year operating profits came in at the top end of group guidance, but this still represents a roughly 50pc fall from the prior year’s levels.\nDirect Line has confirmed it received an initial bid from Belgian insurer Ageas as it became the latest British listed company to become the focus of a potential foreign takeover.\nIn a stock market announcement, the company said it “received a highly conditional, non-binding indicative proposal” at 233p per share.\nIt added:\nThe board considered the proposal with its advisers and considered it to be uncertain, unattractive, and that it significantly undervalued Direct Line Group and its future prospects while also being highly opportunistic in nature.\nIt advised shareholders to “to take no action in relation to the possible offer”.\nWith that, I will head off for the day and hand you over to the ever eager Alex Singleton, who is poised to furnish you with the latest updates into the evening.\nBitcoin’s intense rally has put the world’s largest cryptocurrency on pace for its biggest monthly gain since December 2020, when the digital token jumped 50pc to around $9,600.\nBitcoin has more than tripled in value since the start of last year, climbing back from a 64pc plunge in 2022, in a remarkable comeback from a series of crypto-industry scandals and bankruptcies that had raised questions about the viability of digital assets.\nMany analysts believe the recent surge has also been driven by the fear of missing out, known as FOMO.\nZaheer Ebtikar, founder of crypto fund Split Capital, added:\nWe are starting to see a pretty clear FOMO kind of rally.\nAn upcoming reduction in bitcoin’s supply growth, known as the halving, is adding to the optimism which has driven its price towards its record high.\nAfter the halving, expected in late April, the number of new coins mined daily will decline to 450 from 900 currently.\nIf this demand stays constant, with supply of new coins cut in half, advocates are predicting that the price has room to rally.\nDan Slavin, founder of Chainview Capital, a crypto hedge fund, said:\nAll of this combined makes for a supply and demand imbalance.\nRyan Kim, head of derivatives at digital-asset prime brokerage FalconX, added: “It’s pretty nuts.”\nCountries around the world are borrowing relentlessly at a scale far above pre-pandemic levels, credit ratings agency Standard and Poor’s has warned, raising the risk of permanently higher taxes.\nOur deputy economics editor Tim Wallace has the details:\nWar, energy subsidies, welfare spending and high interest rates are all forcing governments to borrow more as they fail to bring their finances under control.\nThis graph shows how Britain’s debt bill is surging and see below how global debt is growing.\nExchange-traded funds (ETFs) linked to bitcoin have theoretically enabled a wider public to invest in the cryptocurrency without having to hold it directly.\nThe funds themselves, however, do invest in the digital currency. Bitcoin ETFs were approved by US securities regulators on  January 10, when the price was around $46,412.\nMikkel Morch of specialist fund ARK36 said US ETFs have “injected a fresh wave of optimism, propelling trading volumes and spotlighting crypto-linked firms”.\nBitcoin, which last traded at about $60,123, is closing in on its all-time high of $68,991 hit in November 2021.\nUS stock markets dropped at the opening bell as official figures showed the US economy grew 3.2pc at the end of last year, in a sign the Federal Reserve is unlikely to change its stance on interest rates any time soon.\nThe Dow Jones Industrial Average has fallen 0.5pc to 38,754.79, while the benchmark S&P 500 fell 0.4pc to 5,060.17.\nThe tech-heavy Nasdaq Composite was down 0.6pc to 15,949.64.\nThe ATP Tour and Saudi Arabia’s Public Investment Fund (PIF) have signed a multi-year strategic partnership, the governing body of men’s tennis said, in a move highlighting the growing influence of the Gulf nation on global sport.\nThe PIF will now become the official naming partner of the men’s rankings as well as partner ATP tournaments in Indian Wells, Miami, Madrid, Beijing, the season-ending ATP Finals in Turin and the Next Gen ATP Finals in Jeddah.\nIn a joint statement, the two bodies said the partnership marked “a significant shared commitment to enhancing global tennis”.\nBitcoin has topped $60,000 for the first time in more than two years amid a flurry of excitement after the approval of wider trading methods in the US.\nThe world’s largest cryptocurrency has surged by more than 42pc in February in what is the largest monthly gain since December 2020 during the pandemic-era boom.\nBitcoin was last up about 6pc today to $60,376 -  its highest since November 2021, when it hit a record just below $70,000.\nIt comes as traders have poured money into the digital token following the approval of so-called spot exchange traded funds, known as ETFs.\nThe financial instruments allow investors to speculate on movements in the price of crypto without the risk of owning the asset.\nJoseph Edwards, head of research at Enigma Securities, said: “Essentially, we’re seeing the ETF effect ahead of schedule. Inflows into them stepped up quickly last week and have been sustained, and we think it’s reflective of advisors getting out there very quickly to start selling the ETFs to clients.”\nAntoni Trenchev, cofounder of Nexo crypto exchange, added: “If $60,000 doesn’t whet the appetite, consider that 70pc of bitcoin supply has remained unmoved for a year, and the little that’s left is being hoovered up by the likes of BlackRock and Fidelity, just as rewards for miners are about to be slashed in half. The stars are aligning for bitcoin.”\nUS stock indexes look poised to slump at the start of trading later after growth in the US economy was revised lower for the end of last year - but not enough to trigger a rethink in Federal Reserve policy on interest rates.\nMany investors are also keeping their power dry ahead of the personal consumption expenditures (PCE) price index on Thursday, the Fed’s preferred inflation gauge, which is likely to show prices rose on a monthly basis in January.\nStocks have struggled in the days leading up to the report after a scorching rally in the previous week that was fuelled by upbeat earnings reports and euphoria around the potential for artificial intelligence.\nThe rally looks poised to hit the buffers, at least temporarily, after official figures showed US GDP grew by 3.2pc in the final quarter of 2023.\nIn premarket trading, the Dow Jones Industrial Average was down 0.2pc, the S&P 500 had dropped 0.3pc and the Nasdaq 100 had fallen 0.4pc.\nThe US economy grew by a robust 3.2pc in the final three months of last year as it was buoyed by healthy consumer spending, official figures show.\nThe expansion in the nation’s gross domestic product (GDP) — the economy’s total output of goods and services — slipped from a red-hot 4.9pc between July and September, according to the Commerce Department.\nHowever it was a slight downgrade from initial estimates of 3.3pc.\nUS growth has now topped 2pc for six straight quarters, defying fears that high interest rates would tip the world’s largest economy into a recession.\nFar from stumbling, the economy grew 2.5pc for all of 2023, topping the 1.9pc growth in 2022.\nBelgian insurer Ageas has confirmed that it is considering making a £3.1bn bid for Direct Line after losses hit its share price.\nAgeas said it was examining a possible offer 233p per Direct Line share, representing a premium of 42.8pc on its closing share price of 163.35p.\nShares in the British insurer have leapt 27.4pc following the announcement.\nLast year it agreed to sell its brokered commercial insurance business after revealing deepening losses.\nThe company, based in Bromley, south-east London, posted a pre-tax loss of £76.3m in the first half of 2023, compared to £197m in profits recorded in the previous year.\nSam Bankman-Fried is pleading with a US court to reject a recommended 100-year prison term, as lawyers for the disgraced crypto tycoon described the sentence as “barbaric”.\nOur senior technology reporter Matthew Field has the latest:\nIn a court filing released on Tuesday, Mr Bankman-Fried’s lawyers claimed the FTX founder should only serve up to six years for his role in the fraud.\nRead why lawyers have urged judges to implement a more lenient sentence.\nThousands of farmers are expected to descend on Cardiff today for what could be one of the biggest farming protests the country has seen.\nNiamh Robinson and Emma Gatten have the details:\nUp to 10,000 farmers, vets and other agricultural workers are expected to protest around the Senedd as ministers meet for talks on changes to the Welsh farming system.\nFollow our live blog on the protests.\nThe Co-operative Bank revealed its yearly profit nearly halved after it set aside cash to compensate mortgage customers from more than a decade ago.\nThe bank, which has about 2.6m customers and says it is the UK’s leading ethical bank, said 2023 had been “a year of transformation” as it spent more money on improving its own systems.\nIt reported a pre-tax profit of £71.4m, shrinking from the £132.6m it made in 2022, after it set aside nearly £29m to cover the costs of a redress scheme to compensate mortgage customers from 2011 and 2012.\nIt followed complaints being upheld by the Financial Ombudsman Service relating to an increase in the rate of its standard variable mortgage rate, which most people move to once their fixed-term deal comes to an end.\nCo-op Bank said it had decided to compensate customers who might have been affected, regardless of whether or not they had complained.\nMeanwhile, chief executive Nick Slape said the bank continues to be in “exclusive discussions” with Coventry Building Society over a possible merger of the two high street lenders, which was first announced at the end of last year.\nAs Scotland’s GDP contracted at twice the pace of the UK, Scottish Secretary Alister Jack said:\nThe UK Government has halved inflation and, in doing so, we’ve broken down the single biggest barrier to growth.\nShares in Direct Line jumped after reports that it has rejected a takeover approach from Belgian insurer Ageas.\nThe British insurer rose by more than 12pc after it rebuffed the approach, according to Bloomberg News.\nDirect Line has been contacted for comment.\nThe pound has slipped for the first time in seven days against the dollar despite the Bank of England deputy governor Sir Dave Ramsden saying he felt inflation risks remains “elevated”.\nSterling has fallen 0.3pc today to $1.26 but remains the best performer among the G10 group of major currencies so far this year amid expectations that interest rates will stay high for longer in Britain.\nIn the debt market, the yield on benchmark 10-year UK gilts has fallen two basis points to 4.17pc.\nBuy-now-pay-later company Klara revealed shrinking losses as it gears up for one of the biggest stock market listings of the year.\nThe Swedish fintech company said losses fell by 76pc last year to 2.5bn Swedish krona (£190m) while revenue rose by 22pc to 23.5 billion krona (£1.8bn).\nThe company suffered a 400m krona loss in the fourth quarter of 2023, after recording its first quarterly profit in four years in the previous three months.\nChief executive Sebastian Siemiatkowski said:\nWhile we continue on our journey to long-term profitability, we made a conscious decision to invest in growth in the peak shopping season of Q4.\nIt comes as the company, which offers short term interest-free loans for online and offline purchases, is preparing for an initial public offering (IPO) which could value the business at about $20bn (£15.8bn), according to Bloomberg News.\nConsumer confidence fell across the eurozone in February, official estimates show, indicating the European economy “is close to recession”.\nThe European Commission’s (EC) Economic Sentiment Indicator (ESI) decreased slightly across the single currency bloc by 0.7 points to 95.4.\nIt follows lower confidence among services, retail trade and construction managers. Sentiment deteriorated most markedly in Italy, followed by Germany and Poland.\nAndrew Kenningham, chief Europe economist at Capital Economics, said:\nThe EC business and consumer survey for February reinforces the message that the economy is close to recession and that, although price pressures in the services sector eased slightly, they remain uncomfortably high.\nGDP in Scotland fell by twice as much as it did in the UK in the final three months of last year, official figures show.\nBut Scotland has not yet gone into recession, according to the data, despite the economy shrinking by 0.6pc over the period October to December.\nIn the UK as a whole, GDP fell 0.3pc over the same period - putting the country into recession as it was the second consecutive quarter of negative economic growth.\nIn Scotland, the fall of 0.6pc came after growth of 0.4pc between July and September, meaning there have not been two consecutive quarters where GDP has fallen - which defines a recession.\nA Scottish Government report said:\nIn 2023 quarter four (October to December), Scotland’s GDP fell by 0.6pc in real-terms compared to quarter three, following growth of 0.4% in quarter three.\nThe data shows that in the final three months of 2023, the services sector, which makes up the bulk of Scotland’s economy, decreased by 0.1pc.\nOil prices have fallen as the US increased its stockpiles.\nGlobal benchmark Brent crude dropped 0.9pc below $83 a barrel after advancing by 2.5pc across Monday and Tuesday.\nWest Texas Intermediate was down 1.1pc to $78.\nIt comes after the industry-funded American Petroleum Institute said nationwide crude holdings had risen by more than eight million barrels.\nCommodity and stock markets have been subdued so far this week ahead of the closely-watched PCE report in the US, which is the Federal Reserve’s preferred measure of inflation.\nAston Martin has pushed back its plans for its first electric car as its chairman pushes ahead with its turnaround plan.\nThe luxury car maker said it expects to launch its first battery electric vehicle (EV) in 2026, delaying its previous ambitions by a year.\nLast year it struck a deal with Saudi-backed US luxury electric car company Lucid as it seeks to design its next generation of luxury cars with batteries. Lucid took a 3.7pc stake in Aston as part of the deal.\nThe delay comes after the boss of German car giant Mercedes-Benz has said it will make petrol cars “well into the 2030s” as it watered down its targets for electric vehicle sales.\nMeanwhile, Sir Jim Ratcliffe last week accused British and European governments of forcing electric cars “down the consumer’s throat”, as he prepares to sell a new battery-powered 4x4 that will have a backup petrol engine.\nAston Martin revealed operating losses improved by 22pc to £111.2m last year, while revenues increased by 18pc to £1.6bn as average selling prices hit record levels.\nIts billionaire chairman Lawrence Stroll, who is also the company’s biggest shareholder, is hunting for his fourth chief executive in four years.\nAston Martin’s shares seesawed in early trading but were last up 0.1pc.\nSt James’s Place has set aside £426m for customers who overpaid for advice and fees sparking a 31pc fall in the company’s share price.\nOur money reporter Madeleine Ross has the details:\nThe wealth manager announced a major overhaul of its fees last year, following the introduction of new consumer duty rules by the financial watchdog.\nRead how its latest results have wiped £392m off its valuation.\nTaylor Wimpey said it will build fewer homes this year, only days after Britain’s competition watchdog concluded that the sector limited supply to maintain its prices.\nThe housebuilder said its first-half operating profit margin would reflect slightly lower pricing in the homes it has coming through, blaming cost inflation and investment.\nTaylor Wimpey joins other developers that have cut back their building targets as the Bank of England hiked borrowing costs to tame inflation, making houses more expensive.\nThe industry routinely complains that Britain’s complex planning system is delaying the delivery of new homes.\nChief executive Jennie Daly said there were some signs of improvement as mortgage rates ease which was “positively impacting” affordability, after reporting a 49pc slump in annual profit, in line with market expectations. She said:\nLooking ahead we are well-positioned in an attractive market, with significant underlying demand for our quality homes and are poised for growth from 2025, assuming supportive market conditions.\nThe company said it expects to build about 9,500-10,000 homes in Britain in 2024, excluding joint ventures, with the midpoint of the range about 7pc lower than last year’s 10,438.\nTaylor Wimpey’s shares fell 3.4pc in early trade.\nGas prices are showing the first signs of recovery amid speculation that the low prices will stimulate demand.\nEurope’s benchmark contract has risen for a third consecutive day after slumping 30pc since the start of the year.\nDutch front-month futures have gained as much as 3pc today to more than €25 per megawatt hour as temperatures are also forecast to be on the colder side in March.\nTraders think there could be a revival of demand in China and Asia as buyers capitalise on the fall in global gas prices.\nThe UK equivalent gas contract has risen as much as 2.3pc today to 62p per therm.\nUK stock indexes have fallen as they were dragged down by a raft of dismal profits updates.\nThe FTSE 100 index slid 0.2pc and the mid-cap FTSE 250 dropped by 0.5pc.\nSt. James’s Place slumped 29.3pc to the bottom of the UK’s blue chip index after the wealth manager swung to an annual loss.\nI was hit by a £426m provision made for potential client refunds over historic ongoing servicing complaints.\nReckitt lost 9.8pc after the consumer goods group missed fourth-quarter like-for-like net sales estimates, while Taylor Wimpey slipped 2.6pc after the homebuilder said it would build fewer homes this year and posted a 49pc slump in annual operating profit.\nAston Martin was down 2.6pc after initially opening higher as investors remained at the luxury carmaker’s continuing annual losses, which more than halved as selling prices hit record levels.\nBesides the corporate updates, investors are also awaiting the consumer prices data from the US and Europe due later this week for insights into the central banks’ monetary policy path.\nDettol and Durex maker Reckitt has plunged in early trading after revealing a £55m hit after staff “acted inappropriately” in the Middle East.\nThe consumer goods giant’s shares have fallen 9.7pc after it also revealed a drop in sales over the latest quarter, amid declines in its health and nutrition arms.\nThe company admitted making “an understatement of trade spend in two Middle Eastern markets” which meant revenue performance was £55m lower than previously expected.\nIt said: “Following investigation, we concluded a small group of employees had acted inappropriately and we are taking necessary disciplinary action.”\nThe household goods giant said like-for-like net revenues fell by 1.2pc over the final quarter of 2023, with overall net revenues down 7pc to £3.6nn.\nIt added that like-for-like revenues for the full-year were up 3.5pc in 2023 against the previous year.\nKris Licht, chief executive of Reckitt, said:\nWhile our performance in Q4 was unsatisfactory, we look to 2024 and beyond with confidence.\nHalfords has slashed its profits guidance for the current financial year as wet weather put shoppers off cycling and motoring improvements.\nThe retailer’s share price plunged by 22pc as it said “weak customer confidence and unusually mild and very wet weather” were partly to blame, weighing on demand for both cycling and motoring products.\nThe retailer said that it expects to deliver pre-tax profits of between £35m and £40m for the year to March 29, having previously forecast between £48m and £53m.\nIt said it cut the guidance after weakness in its cycling, retail motoring and consumer tyres operations caused a “significant drop” in retail revenues.\nHalfords said cycling and retail motoring were weak as lower confidence among customers and mild, wet weather affected footfall into stores but also reduced demand for some products, such as winter car accessories and car cleaning products.\nThe cycling market has also “become more challenging and competitive” amid consolidation in the sector, resulting in higher levels of promotions to drive sales.\nStock markets in London were little changed as trading began after a Bank of England deputy governor reiterated that policymakers need to see more evidence about the persistence of inflation before they can cut interest rates.\nThe FTSE 100 was flat at 7,685.64 while the FTSE 250 was down 0.1pc to 19,142.19 after Sir Dave Ramsden said that there were still “elevated” risks to inflation.\nTaylor Wimpey has warned about the impact of planning delays as it revealed pre-tax profits nearly halved last year.\nThe developer said revenues dropped 20.5pc to £3.5bn in 2023, while profits before tax dropped 47.8pc to £473.8m as buyers grappled with higher mortgage costs.\nIt completed 3,306 fewer homes last year, down 23pc to 10,848, as chief executive Jennie Daly said the “planning environment remains challenging”.\nThe company highlighted “delays and resource pressures impacting housing land supply”.\nIt comes as the competition watchdog found this week that planning systems across Britain were “unpredictable”, with many local authorities under-resourced and several without an up to date local plan for housing.\nTaylor Wimpey was also named as one of eight of Britain’s biggest housebuilders that are under investigation for suspected illegal information sharing amid fears that collusion in the industry has pushed up prices.\nThe developer’s shares had gained 24pc over the last six months amid hopes that the Bank of England was poised to begin cutting interest rates this year.\nMobile phone giant Vodafone has confirmed talks to sell its Italian business to Switzerland’s Swisscom in a deal worth €8bn (£6.8bn).\nThe pair said they are in advanced exclusive discussions, with the proposed agreed price on a cash basis and including debts, although the full terms of the deal are yet to be finalised.\nVodafone said: “Vodafone has engaged extensively with several parties to explore market consolidation in Italy and believes this potential transaction delivers the best combination of value creation, upfront cash proceeds and transaction certainty for Vodafone shareholders.”\nIt comes after FTSE 100-listed Vodafone rebuffed attempts by France’s Iliad to merge the two companies’ Italian businesses, which would have created the country’s biggest mobile phone company.\nVodafone and Iliad had revealed the talks in December last year.\nThe sale to Swisscom tops the €6.6bn (£5.6bn) it was set to have received as part of the Iliad tie-up.\nSwisscom said it plans to merge Vodafone Italia with its business in the country, called Fastweb.\nAston Martin’s losses shrank last year as it completed the first deliveries of its next generation DB12 sports car and overcame production delays.\nThe luxury car maker revealed operating losses improved by 22pc to £111.2m, while revenues increased by 18pc to £1.6bn.\nIt comes as its billionaire chairman is hunting for his fourth chief executive in four years.\nLawrence Stroll, who is also the company’s biggest shareholder, is said to have contacted current and former bosses of other luxury car manufacturers to ask whether they would be interested in taking the top job.\nMr Stroll said:\nCritical to the long-term success of Aston Martin is the strength of our iconic global brand and loyal, as well as evolving, customer base.\nAston Martin shares are down 93pc over the last five years and have fallen by 18pc since the start of 2024.\nThanks for joining me. China’s largest private property developer has been hit with a winding up petition as the country’s real estate crisis deepens.\nCountry Garden racked up more than £150bn in debt in a property bubble that economists say has burst as demand from buyers dries up.\nThe petition, filed by a lender demanding payback of approximately 1.6bn Hong Kong dollars (£161m), came weeks after the city’s high court granted a similar petition against peer Evergrande, which is more than $300bn (£237bn) in debt.\nLast week, Moody’s suddenly removed credit ratings for 10 Chinese developers for “business reasons”.\nCountry Garden said in its disclosure to the Hong Kong Exchange that it will “oppose the petition vigorously”.\nIt said: “The company intends to continue to proactively communicate and work with its offshore creditors on its restructuring plan, with the objective of announcing terms to the market as soon as practicable.”\n1) Britain to consider tariffs on flood of cheap Chinese electric cars | Carmakers fear they are being undercut by brands that are being subsidised by Beijing\n2) Surge in sick days to cost Britain £66bn | Number of working days lost to illness to more than double by 2030, warns Zurich\n3) Apple scraps plans for electric cars | The cancellation comes as investors show signs of nervousness about the company’s growth potential\n4) Asda loses out in battle for supermarket shoppers in new blow for Issa brothers | Billionaire owners face fresh pressure as sales growth lags behind rivals\n5) How the Barclay family is losing grip on its shopping empire | A much-needed lifeline for Very Group has come at the price of control\nAsian markets were mostly lower on Wednesday after US stocks held near their record levels in a quiet day of trading.\nTokyo stocks ended slightly lower on Wednesday, with the benchmark Nikkei 225 index closing down 0.1pc, or 31.49 points, to end at 39,208.03, while the broader Topix index lost 0.1pc, or 3.51 points, to 2,674.95.\nChinese markets fluctuated, with Hong Kong’s Hang Seng rising 0.2pc to 16,825.00, while the Shanghai Composite lost 0.7pc to 2,995.40.\nChina’s largest private property developer, Country Garden, said that it is facing a liquidation petition after failing to repay a term loan facility worth 1.6bn Hong Kong dollars (£161m). The first hearing in the case is scheduled for May 17.\nThe move comes after China Evergrande, the world’s most heavily indebted real estate developer, was ordered to undergo liquidation following a failed effort to restructure $300bn in late January.\nHong Kong was due to release its fiscal budget, which is expected to include measures to revitalise the distressed property market.\nAustralia’s S&P\/ASX 200 was little changed at 7,663.50 after the Australian Bureau of Statistics said the country’s inflation rate held at a two-year low in January, triggering hopes that the Reserve Bank may cut its benchmark interest rate.\nSouth Korea’s Kospi gained 0.8pc to 2,646.55, while Thailand’s SET was down 0.5pc\nIn Wall Street, the S&P 500 rose 0.2pc, to 5,078.18. The Dow Jones Industrial Average of 30 leading US companies fell 0.2pc, to 38,972.41. Meanwhile, the Nasdaq Composite index rose 0.4pc, to 16,035.30.\nThe yield on 10-year US Treasury edged up to 4.31pc from 4.27pc late on Monday."]}
{"date":"2024-02-29","titles":["'Rich Dad Poor Dad' Author Robert Kiyosaki Credits Bitcoin For 'Kicking The Fake US Dollar's B*tt' As Apex Crypto Breaches $64K","1 Top Cryptocurrency to Buy Before It Soars 700% to 2,900%, According to Certain Wall Street Analysts","Study reveals the most popular cryptocurrencies in America"],"urls":["https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/02\/37385401\/rich-dad-poor-dad-author-robert-kiyosaki-credits-bitcoin-for-kicking-the-fake-us-dollars-b","https:\/\/finance.yahoo.com\/news\/1-top-cryptocurrency-buy-soars-100000237.html","https:\/\/www.investorideas.com\/news\/2024\/cryptocurrency\/02291Most-Popular-Cryptocurrencies-America.asp"],"sources":["benzinga.com","finance.yahoo.com","investorideas.com"],"descriptions":["Bestselling author of “Rich Dad Poor Dad,” Robert Kiyosaki on Wednesday lauded Bitcoin (CRYPTO: BTC) for its rally to $64,000, marking the highest point it?...","Several financial professionals have issued bullish price targets for Bitcoin that imply triple-digit upside for investors.",""],"article_contents":["Benzinga Rankings give you vital metrics on any stock – anytime.\nBestselling author of “Rich Dad Poor Dad,” Robert Kiyosaki on Wednesday lauded Bitcoin BTC\/USD for its rally to $64,000, marking the highest point it’s reached since November 2023.\nWhat Happened: Kiyosaki in a post on X said, \"Thank you BITCOIN for doing your job….kicking the fake US dollar's b*tt and bringing integrity back to money.\"\nThank you BITCOiN for doing your job….kicking the fake US dollar's butt and bringing integrity back to money.\nBitcoin saw a surge in value on Wednesday, rising 9.5%—its most significant leap in a single day since late October. The rise comes amid growing interest in Bitcoin Exchange Traded Funds (ETFs) on Wall Street.\nKiyosaki is a well-known Bitcoin advocate and has endorsed BTC several times.\nOn Feb. 23, Kiyosaki addressed concerns about potential volatility in the Bitcoin market.\nIn a post on X, he shared his strategy, saying, “I am often asked ‘What happens if Bitcoin crashes?’ My reply is the same for Bitcoin, gold or silver. My reply is ‘I would be happy and I would buy more, once the crashing stops.’ All market crashes are, are assets going on sale.”\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\nWhy It Matters: Earlier in January, the ‘Rich Dad Poor Dad’ author said that he believes Bitcoin could hit $100,000 by mid-2024.\nAfter the SEC approved Bitcoin ETFs, Kiyosaki upgraded his stance on Bitcoin, adjusting his previous price target from $120,000 to $150,000. \"BITCOIN ETF. Yay. Glad I bought years ago. Bitcoin to $150k soon,” he posted.\nConfirming his confidence in the cryptocurrency, Kiyosaki revealed an acquisition of five additional Bitcoins early in 2024.\nPrice Action: At the time of writing, BTC was trading at $61,759, up 8.22% in the last 24 hours, according to Benzinga Pro.\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\nPhoto via Shutterstock.\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe price of Bitcoin (CRYPTO: BTC) is based on supply and demand. However, because supply will never exceed 21 million coins, demand for the cryptocurrency is the only variable of consequence. That means the future price trajectory of Bitcoin depends entirely on whether demand increases or decreases from its current level.\nWith that in mind, certain Wall Street analysts believe two catalysts will boost demand for Bitcoin in the future, so much so that the cryptocurrency could soar 700% or more from its current price of about $50,000 by the end of the decade. Here's what investors should know.\nA Fidelity report recently identified several signs of growing demand for Bitcoin. Monthly active addresses, monthly new addresses, and monthly transactions are all trending higher. The illiquid supply of Bitcoin (i.e., the percentage that has not moved in over a year) is near a record high and trending upward, meaning more investors are holding the cryptocurrency. And the number of accounts with at least 0.1 Bitcoin hit a record high in December 2023.\nBeyond those trends, two catalysts could create more demand for Bitcoin in the future. First, the Securities and Exchange Commission recently approved several spot Bitcoin exchange-traded funds (ETFs). Those investment vehicles provide direct exposure to the cryptocurrency without the hassle of buying and storing Bitcoin. By reducing friction, spot Bitcoin ETFs could draw more retail and institutional investors into the market. Indeed, the collective inflows across spot Bitcoin ETFs during the first month of trading were higher than the inflows of any other ETF launch in history.\nSecond, Bitcoin mining rewards are reduced by 50% every time 210,000 blocks are added to the blockchain, which happens about once every four years. The next halving event is scheduled to take place in April and it will effectively boost demand by reducing selling pressure. To elaborate, miners sell Bitcoin to monetize their operations, but they will have 50% less Bitcoin to sell after the April halving event.\nThere is a historical precedent for Bitcoin increasing in value after mining rewards are cut in half, as shown in the table below.\nHalving Event\nBitcoin Return (2 Years Later)\nNovember 2012\n2,964%\nJuly 2016\n922%\nMay 2020\n348%\nData source: Fidelity Digital Assets.\nAnthony Scaramucci, founder and managing partner at Skybridge Capital, recently told podcast host Scott Melker that Bitcoin could reach $240,000 within 18 months of the April halving event. Scaramucci also said Bitcoin would eventually achieve half the market capitalization of gold, bringing its per-coin value to roughly $400,000. That implies 700% upside from its current price of $50,000.\nTom Lee, managing partner and head of research at Fundstrat Global Advisors, recently told CNBC that Bitcoin could reach $500,000 in the next five years, implying 900% upside from its current price. \"There's a finite supply and now we have a potentially huge increase in demand with spot Bitcoin [ETF] approval, so I think in five years something around half a million would be potentially achievable,\" Lee said in January.\nCathie Wood, founder and chief executive officer of Ark Invest, recently discussed her Bitcoin valuation model with CNBC. Her base-case valuation is roughly $600,000 by 2030, implying 1,100% upside from its current price. But her bull-case valuation is $1.5 million by 2030, implying 2,900% upside from its current price. Wood said spot Bitcoin ETF approval makes the bull case more likely.\nBitcoin could be worth more (perhaps much more) in the future. But investors cannot make informed decisions without understanding the risks.\nFirst, historical data is limited. Bitcoin was created less than two decades ago, whereas stocks and bonds have been around for centuries. That makes speculation difficult where Bitcoin is concerned. For instance, there is no precedent for its performance during a deep recession.\nSecond, Bitcoin has historically been quite volatile. It has fallen at least 50% from a record high three times in the past five years, and it plunged more than 75% during the most recent cryptocurrency market crash. Investors should expect that volatility to persist in the future.\nThird, Bitcoin has been associated with fraud, money laundering, and other criminal activity. Certain countries have banned the cryptocurrency and other countries are still building regulatory frameworks. Future changes in the regulatory landscape could damp demand for Bitcoin.\nPatient investors comfortable with those risks should consider buying Bitcoin today.\nShould you invest $1,000 in Bitcoin right now?\nBefore you buy stock in Bitcoin, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bitcoin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nTrevor Jennewine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin. The Motley Fool has a disclosure policy.\n1 Top Cryptocurrency to Buy Before It Soars 700% to 2,900%, According to Certain Wall Street Analysts was originally published by The Motley Fool","February 29, 2024 (Investorideas.com Newswire) The study, conducted by crypto experts at Bombastic.com used Google Search data to analyze and compare different cryptocurrencies from the top 100 (by market cap) to determine which crypto is the most popular.\nAccording to the results, the top 10 cryptocurrencies are:\nBitcoin (BTC)\nBitcoin is the most popular cryptocurrency not just but across many of the states. Bitcoin was the first decentralized digital currency and in recent years has gained immense popularity across the globe. Bitcoin has captured the imagination of individuals, investors, and institutions alike, as they recognize its potential to revolutionize traditional financial systems and reshape the future of money. Being the most widely accepted and recognized, it makes sense why it is the most popular crypto.\nShiba Inu\nShiba Inu Coin has gained immense popularity in the cryptocurrency world due to its unique branding and enthusiastic community. It is a decentralized, community-driven cryptocurrency inspired by the Shiba Inu dog breed, which gained fame through its resemblance to the \"Doge\" meme. Shiba Inu Coin stands out for its low price and large circulating supply, making it an accessible investment option for many. Moreover, its community has actively engaged in various social media platforms, fostering a sense of unity and excitement around the coin. The popularity of Shiba Inu Coin also stems from its potential for significant price volatility, attracting traders and speculators looking for quick gains.\nRipple (XRP)\nRipple, has gained significant popularity in the world of cryptocurrencies. Developed by Ripple Labs, XRP stands out among other digital currencies due to its unique features and widespread adoption. Its popularity can be attributed to several factors. Firstly, XRP offers fast and low-cost international transactions, making it an attractive choice for cross-border payments. Its blockchain technology enables near-instant settlement, eliminating the need for traditional intermediaries and reducing transaction fees. Secondly, XRP has secured partnerships with numerous financial institutions and banks worldwide, which has enhanced its credibility and increased its user base. These partnerships have facilitated the integration of XRP into existing financial systems, making it a viable option for mainstream adoption.\nDogecoin\nDogecoin has gained unprecedented popularity in recent years, captivating both crypto enthusiasts and the general public alike. What started as a light-hearted meme cryptocurrency based on the popular \"Doge\" internet meme featuring a Shiba Inu dog, has transformed into a cultural phenomenon. Dogecoin's charm lies in its simplicity and accessibility, attracting a diverse community of supporters who appreciate its fun and friendly nature. The coin's distinctive logo and vibrant online community have propelled its rise, with influential figures and celebrities often endorsing it on social media platforms. Dogecoin's popularity has also been fuelled by its charitable initiatives, as the community frequently rallies together to raise funds for various causes. Despite its initially satirical origins, Dogecoin has managed to capture the imagination of millions and become a symbol of the growing acceptance and mainstream recognition of cryptocurrencies.\nEOS (EOS)\nThe EOS Network provides a world class, robust, smart contract functionality that enables developers to build the best-in-class decentralized applications (dApps) easily. It is an open source blockchain platform that prioritizes high performance, flexibility, security, and developer experience. As a third-generation blockchain platform powered by the EOS virtual machine, EOS has an extensible WebAssembly engine for deterministic execution of near-feeless transactions, which makes it a popular investment.\nA spokesperson from Bombastic.com commented: \"The rise in popularity of cryptocurrencies shows a big change happening not just in America but across the globe. More and more people are getting interested in digital assets because they see how they can transform many industries.\nThe rise in popularity of crypto in America represents a collective realization that the future of finance and other sectors, such as art, music and gaming, are all being shaped and driven forward by blockchain technology.\"\nENDS\ncredit to Bombastic.com\nSources: Google Trends\nMethodology\nData of the average monthly searches across the last 12 months was collected to find which cryptos are currently the most popular in America.\nMore Info:\nDisclaimer\/Disclosure: Investorideas.com is a digital publisher of third party sourced news, articles and equity research as well as creates original content, including video, interviews and articles. Original content created by investorideas is protected by copyright laws other than syndication rights. Our site does not make recommendations for purchases or sale of stocks, services or products. Nothing on our sites should be construed as an offer or solicitation to buy or sell products or securities. All investing involves risk and possible losses. This site is currently compensated for news publication and distribution, social media and marketing, content creation and more. Disclosure is posted for each compensated news release, content published \/created if required but otherwise the news was not compensated for and was published for the sole interest of our readers and followers. Contact management and IR of each company directly regarding specific questions.\nMore disclaimer info: https:\/\/www.investorideas.com\/About\/Disclaimer.asp Learn more about publishing your news release and our other news services on the Investorideas.com newswire https:\/\/www.investorideas.com\/News-Upload\/\nGlobal investors must adhere to regulations of each country. Please read Investorideas.com privacy policy: https:\/\/www.investorideas.com\/About\/Private_Policy.asp\nGet more Bitcoin, Blockchain, Digital Currency stock investor ideas - news, articles, podcasts and stock directories"]}
