{"date":"2024-10-01","titles":["Crypto Analyst Says Bitcoin Due for Breakout After Successful Macro Price Retest – Here’s His Outlook"],"urls":["https:\/\/dailyhodl.com\/2024\/10\/01\/crypto-analyst-says-bitcoin-due-for-breakout-after-successful-macro-price-retest-heres-his-outlook\/"],"sources":["dailyhodl.com"],"descriptions":["A popular analyst and trader says Bitcoin (BTC) may be gearing up for a breakout after holding a key support level."],"article_contents":["A popular analyst and trader says Bitcoin (BTC) may be gearing up for a breakout after holding a key support level.\nThe analyst pseudonymously known as Rekt Capital says in his newsletter that Bitcoin is looking bullish on the weekly time frame and could soon make a run to around $67,000 to kick-off October.\n“Bitcoin recently formed a new higher high and performed a weekly close above the late August resistance of $64,300 (green), which now means that BTC will try to reclaim this old resistance into new support. There may be downside volatility on this retrace but if BTC is able to weekly close above this green level, then price will likely re-challenge the downtrending channel top (black) in early October.”\nHe tells his 502,100 followers on the social media platform X that Bitcoin is also looking bullish for confirming a successful retest of the $58,696 level on the quarterly or three-month timeframe.\nThe analyst also says that Bitcoin has had its best September performance in its history, suggesting market strength moving forward.\n“Don’t let a -5% dip distract you from the fact that Bitcoin has experienced its best September of all-time by producing a +7% monthly return.”\nThe analyst says that Bitcoin may be on the verge of a parabolic breakout this cycle if it follows a similar time window to the 2020 halving, when miners’ rewards were cut in half.\n“It is 163 days after the halving [as of September 30th]. Which is exactly the amount of days after the halving that Bitcoin broke out from its re-accumulation range in 2020.”\nBitcoin is trading for $62,552 at time of writing, down nearly 2% in the last 24 hours.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-10-02","titles":["Bitcoin's 'Next Big Jolt' To Be From ETF Options, Says Galaxy CEO Michael Novogratz: '...Don't Know If It's In Three Weeks Or A Month' - ARK 21Shares Bitcoin ETF Common Shares of Beneficial Interests ","BTC202: Bitcoin Mastermind 3rd Quarter 2024 w\/ Joe Carlasare, Jeff Ross, and American Hodl"],"urls":["https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/10\/41135635\/bitcoins-next-big-jolt-to-be-from-etf-options-says-galaxy-ceo-michael-novogratz-dont-know-","https:\/\/www.theinvestorspodcast.com\/bitcoin-fundamentals\/bitcoin-mastermind-3rd-quarter-2024-w-joe-carlasare-jeff-ross-and-american-hodl\/"],"sources":["benzinga.com","theinvestorspodcast.com"],"descriptions":["In a recent interview, Michael Novogratz, CEO of Galaxy, predicted a significant boost for Bitcoin (CRYPTO: BTC) with the advent of options trading on ETFs.","Here's the long-awaited Bitcoin Mastermind discussion for 3rd Quarter 2024 with Preston Pysh, Joe Carlasare, Jeff Ross, and American Hodl."],"article_contents":["Benzinga Rankings give you vital metrics on any stock – anytime.\nIn a recent interview, Michael Novogratz, CEO of Galaxy, predicted a significant boost for Bitcoin BTC\/USD with the advent of options trading on ETFs. This forecast comes amidst ongoing discussions about the Federal Reserve’s interest rate decisions and their potential impact on Bitcoin prices.\nWhat Happened: Novogratz, speaking to CNBC on Tuesday, emphasized that the next catalyst for Bitcoin will be the introduction of options trading on ETFs. He noted that while the market had expected a quicker rollout, the process has been slower than anticipated. However, he remains optimistic that the introduction of these options will be transformative for Bitcoin.\n“The next big jolt to bitcoin is going to be when we have options that trade on the ETFs. The SEC said they are coming. I don’t know if it’s in three weeks or a month,” Novogratz said.\nNovogratz highlighted that platforms are gradually beginning to offer these options, and this trend is expected to continue. He drew a parallel to MicroStrategy Inc. MSTR, which offers leverage on Bitcoin for retail investors and trades at more than twice the value of its Bitcoin holdings, largely due to options trading.\nSee Also: If You Invested $1,000 In Dogecoin When Mark Cuban And The Dallas Mavericks Welcomed The Meme Crypto, Her\nHe pointed out the evident demand for leveraged crypto investments, especially among younger investors using platforms like Robinhood Markets Inc. HOOD.\nWhy It Matters: Bitcoin has recently experienced notable price movements. On Sep. 27, Bitcoin surged past $66,000, marking a 14% gain over two weeks. This rise was driven by positive fund flows into Bitcoin spot ETFs for six consecutive days, with significant contributions from Ark 21Shares’ ETF ARKB and BlackRock’s ETF IBIT.\nHowever, geopolitical tensions have also impacted the crypto market. On Tuesday, Bitcoin plummeted to a two-week low of $60,370 following Iran’s missile attack on Israel, before recovering slightly. This incident underscores the volatility and sensitivity of the cryptocurrency market to global events.\nPrice Action: According to Benzinga Pro, at the time of writing, Bitcoin had slightly recovered by 1.41% and was trading at $61,503.80. Meanwhile, in the after-hours market, Microstrategy was down by 1.41% while Robinhood was trading 0.76% lower. Among the Bitcoin ETFs, ARKB was down by 1.26% while IBIT was 1.45% lower around the same time.\nRead Next:\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors.\nImage via Shutterstock\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.","01 October 2024\nIn this episode, we dive into SAB 121’s implications on Bitcoin, discuss BNY Mellon’s crypto custody services, and explore how regulatory changes and institutional adoption could shape Bitcoin’s future value. We also examine BlackRock’s demands on Coinbase, changes in M2 money supply, and Basel III’s risk weight requirements for cryptoassets.\nFOLLOW\nFOLLOW\nDisclaimer: The transcript that follows has been generated using artificial intelligence. We strive to be as accurate as possible, but minor errors and slightly off timestamps may be present due to platform differences.\n[00:00:00] Intro: You’re listening to TIP.\n[00:00:03] Preston Pysh: Hey everyone, welcome to this Wednesday’s release of the Bitcoin Fundamentals podcast. On today’s show, I have the Mastermind Group, and they’re back. We’ve got Joe Carlasare to talk about all things policy and legal, and I have Jeff Ross to talk about macro and the broader market conditions, and I have American HODL here who’s the best BS filter that the community has ever heard.\n[00:00:22] We cover a wide range of topics from the Saab B121 situation with legacy banks, the BNY Mellon being able to now custody services like Coinbase for digital assets and what that means for the competition of custody for ETFs, banks being able to mint their own stable coins, where we’re at with the Bitcoin cycle versus everything else that’s happening in traditional markets, right?\n[00:00:44] And the list goes on. There’s a ton of ground we cover here. So sit back, relax, and enjoy this quarter’s release of our mastermind discussion.\n[00:00:56] Intro: Celebrating 10 years. You are listening to Bitcoin Fundamentals by The Investor’s Podcast Network. Now for your host, Preston Pysh.\n[00:01:15] Preston Pysh: Hey everyone. Welcome to the show. I am here with American HODL, Joe Carlasare, Jeff Ross, mastermind discussion, third quarter, still the third quarter. Little late on this one. Guys, welcome to the show.\n[00:01:28] American Hodl: Good to be here. Good to be back.\n[00:01:30] Jeff Ross: Thanks for having me. It’s going to be fun.\n[00:01:32] Preston Pysh: It’s going to be fun. Lots to talk about here last week. Let’s just kick it off into high gear. Cause last week I’m looking at two massive, massive announcements. The first one being the custody that the SEC is giving to BNY Mellon. And then the other one is now we can do derivatives on top of iBit.\n[00:01:53] And the, is it just iBit or is it all the ETFs that they’re allowing this? Do you guys know?\n[00:01:58] Joe Carlasare: Yeah, for now it’s iBit, but now it’ll be all of them eventually.\n[00:02:01] Preston Pysh: So, you know, I’m reminded of this clip that I don’t know, it was like a year, a year and a half old with Saylor. He was on, in some spaces and he said, there’s three things that are going to take Bitcoin to a multimillion dollar price point in USD terms.\n[00:02:19] And those three things, the first one was the change in the gap accounting treatment, which happened, I don’t know, about a year ago, the approval of an ETF, which happened about nine months ago, and then banks being able to custody Bitcoin. So last week, and he’s not even talking the derivative options being traded on top of it, but with the custody now being approved for BNY, it seems like they’re doing like some type of test run.\n[00:02:45] The SEC gave them some type of approval. What are your thoughts? Is this a big deal? Are we making a big deal out of this? Let’s just go around the horn. Anybody want to start?\n[00:02:55] Jeff Ross: Well, so is it a big deal? For sure, right? This is all inevitable. We all knew this was coming. Everything that’s happening and that’s going to happen continues to be inevitable.\n[00:03:03] We’re watching Wall Street embrace Bitcoin fully. We’re watching the SEC start to embrace it. We’re watching the regulatory framework get built up around it. The financial rules get built up around it. It chaps the hides of lots of true Bitcoiners, right? They’re very concerned about, is it stealing the soul of Bitcoin to have Wall Street so involved and can they do something deleterious to the network because of this, that remains to be seen, right?\n[00:03:28] But to me, this is all just as expected. So it’s kind of exciting. Like if you’re into price going up, number go up, and I’m sure we’ll get talking about our bullish sentiment a little later in the show. This is all very encouraging. This is going to increase the volume. It’s going to increase the interest for Wall Streeters to get on board.\n[00:03:45] Having options available to trade is a super important next step. It basically means that Bitcoin has moved up a level in the maturity scale. And the seriousness of it as an asset. So I think it’s all really natural. I think there’s going to be snafus along the way. I think there’s going to be people who can abuse it, right?\n[00:04:01] There’s always bad apples that might do bad things with this. They may manipulate the price that everybody always talks about price manipulation. But in general, it’s good because it adds a ton of volume in general. And when you have a lot of volume, the big institutional investors like that, they don’t want to come in with a billion dollar buy order and just jack the price up 20, 000 because they want to buy or they want to sell.\n[00:04:23] When you have these much larger pools of liquidity, this much higher volume, that means institutional investors and endowments and other big hedge funds and things will be much more interested in Bitcoin as an asset. So I think it’s a net good in general for Bitcoin.\n[00:04:38] American Hodl: Yeah, the way I look at the options announcement recently, and by the way, I was thinking about the same tweet, the spaces that you had referenced with sailor.\n[00:04:45] And I think if he had had a little more, you know, just slightly more prescience there, not that he didn’t already have a ton, obviously he nailed it, but like he probably would have put the options, you know, treatment in as the fourth thing. Right. Yeah. And for me, this options market is just this big amplifier for the Bitcoin price.\n[00:05:03] I mean, it’s like this massive capital unlock for the smart money. There’s a lot, I mean, there’s so many different things we could talk about with it. And like, I don’t fully understand a lot of it. So I’d love to get like Joe’s take on it. Cause I think he understands the plumbing of the options markets a lot better than I do.\n[00:05:16] But you know, just something that comes to the top of my head is that, you know, Bitcoin now is more competitive with real estate because you now have different cashflow strategies using covered calls and et cetera. Yeah. But you don’t have to deal with the underlying headache of real estate. That’s just one of like many different options that this unlocks.\n[00:05:32] And I think it’s just going to be a massive, yeah, it’s a massive amplifier. And it’s, it’s like a 10 X in terms of inbound liquidity for Bitcoin. So, I mean, to me, it’s like wildly bullish and I don’t know that we’ve ever seen an options market, like the one we’re going to see on Bitcoin. I think it’s going to be wild, both directions, upside and downside.\n[00:05:48] Preston Pysh: I will say this Hodl. So I was interviewing Saylor in Madeira. This is I think February of 2024. And on stage he was saying that within, I think he was saying like within nine months to a year that derivatives were going to get approved on top of the ETFs and it was going to be a massive, massive big deal.\n[00:06:08] Because of the amount of liquidity, the amount of volume, the amount of reinforcement of all the legacy dollars and legacy Fiat system, basically plugging itself in, not just the ETF was like plugging it in and then all of this was like plugging 40 other cables into this thing in order to just kind of like add a whole new layer of access.\n[00:06:31] To Bitcoin. You need to go back and listen to his real comment. Not my, my Jerry rigged interpretation of it, but that’s what I remember him distinctly saying back. And I want to say it was like February of this year, but Joe go ahead and take it away.\n[00:06:44] Joe Carlasare: Yeah. So options for those that are unfamiliar, that may not be as savvy in terms of the old school derivatives type systems that we have in the legacy markets.\n[00:06:52] They provide contract exposure, right? There’s a reason you call it an options contract is derivative exposure where you can either establish long exposure or you can protect yourself against downside exposure via put options. These are extremely attractive to institutional investors because they let them calculate defined risk benefit reward, right?\n[00:07:09] Rather than just going along only exposure, rather than just buying the spot exposure, what they can do with an options contract is they can do a variety of different things. They can do a cross asset exposures, right? Long equity, short Bitcoin, short Bitcoin, long equities, hedge the books, however they want.\n[00:07:22] And it provides much more flexibility that you’d want if you’re trying to build out, you know, cross asset allocations. So from the standpoint of Bitcoin, it’s extraordinarily interesting, right? Because you have the first finite asset. That we have, and you have the attraction to ETFs and Dr. Jeff is exactly right.\n[00:07:37] What you’re effectively doing is you’re pouring in leverage into the space. You’re letting it be attractive to a lot of institutional investors who would not feel comfortable just having naked long exposure into Bitcoin. We’re not just want to buy the spot, right? They want to have that hedge, even if they want to just get a long exposure.\n[00:07:52] They can’t risk the downside of a 20 percent negative move in Bitcoin. They can hedge that with a spot position. And the interesting thing about that is, and this is the real story. I think if you are buying options, say there’s overwhelming demand in the options market for calls or for longs in any way in the market, What has to happen is the market makers then have to effectually position against the imbalance, right?\n[00:08:13] So if there’s a long exposure, they have to be positioned short to correct the imbalance. Same is true, right? If there’s a ton of call selling, right? And I hear people really eager and salivating at the idea to sell calls against their spot iBit position, right? The dealers actually have to bid that. So it’s interesting, right?\n[00:08:29] Like, they actually have to go into the supply, buy the iBit share, which then in turn buys the Bitcoin. So you have this reflexive loop. All of it, in many ways, tampers down volatility when there isn’t a balance in the market. So you might not see as painful of the drawdowns. You might see somewhat more capped upside.\n[00:08:45] But what that effectively does is it provides a more institutionally safe investment. Right. We’re like in 2017 market where you had just the spot exposed. You want to buy Bitcoin? Sure. There was GBTC, but a lot of people just buy the spot exposure, right? There wasn’t an easy way until really the CME futures launch to get derivative exposure and to hedge.\n[00:09:03] So you see these rapid swings up to like 19 six at the end of the year. Now you’re going to have a lot of institutions that can play that and that can tamper tampon down the volatility and it makes it more attractive. Now, some people want to say, Oh, that means you’re not going to have these blow off tops.\n[00:09:17] I strongly disagree with that because there are plenty of options markets where, you know, for example, Jimmy, right. Where there was massive market demand. You saw that thing just get bid and go to the moon, right? Options do not necessarily mean that you can’t have an absolute run in the market. What we’ve seen in the spy, for example, and QQs.\n[00:09:36] If you look at the zero DT expiration options contracts, those have actually moved the market significantly. There’s many days where zero DTs are moving the market more than actually spot bidding. So it is like pouring gasoline on a fire. I think it’s really exciting. And I think it’s exactly what institutions want to get at least excited in the spot exposure.\n[00:09:53] Preston Pysh: How long until you can do this on some of the other products? Not just iBit, you think Joe?\n[00:09:58] Joe Carlasare: Well, my guess is they will all launch together. There’s a couple different layers they have to go through, just because the FCC approved it. You also have to get some CFTC approval. So, we’re still a little confused as to when they’re actually going to launch.\n[00:10:09] Eric Valchunis, I think, was speculating. He’s the Bloomberg analyst. That it was going to be a couple months. My source tells me it could be a little quicker than that. Six months we could see, or six weeks, excuse me, we could see them launch. And I would place a heavy pepty wager that many of the spot ETFs will launch with options on the same day.\n[00:10:25] Preston Pysh: Wow.\n[00:10:26] Jeff Ross: And if I can jump in one of the things that’s exciting as a fund manager myself, I, you know, I run a small fund. I’ve been waiting for this because what this does then is it opens up the possibility within my fund, which is based at interactive brokers. So in a standard brokerage account, if we do get another peak, if we have this exponential move higher into 2025 and say, Bitcoin goes to 200 or 400 or 600, 000 or whatever it goes to, instead of having to sell everything and take that massive tax hit, what I can do is go out.\n[00:10:53] And by puts as Joe was talking about, right. And I can hedge my exposure to the downside without having to sell and hold on to the assets that I have. So, and a lot of institutional investors are going to do that same sort of thing. If you don’t have to take that big tax hit at the end of a bull cycle, that’s pretty exciting.\n[00:11:08] So\n[00:11:09] Joe Carlasare: just one thing to round out this conversation, some people might hear this and they make it all excited about selling call options against their Bitcoin and getting all levered up with those. There are many call option type ETFs that are in the market. I know Dr. Jeff knows some of these, they will actually try to generate the income and they’ll make money from the call option sales, right?\n[00:11:27] The reality is many of these products have underperformed just by and holding the equity ETFs, right? So if you’re doing that, it’s kind of a way to get Bitcoin exposure, but you’re capping your upside to some degree. When these, when Bitcoin goes on these absolute tears, sure, you get your premium from selling high implied volatility contracts at 10 percent out of money.\n[00:11:45] You’ll capture that premium, right? But then when you get Bitcoin going on a tear, you’re going to miss out on that upside and you’re gonna actually underperform. So anybody thinking about doing this, just be careful. You could potentially miss out on some of the most epic Bitcoin runs that we could see coming.\n[00:11:58] Preston Pysh: How do we communicate the importance of still buying your own coins and taking self custody? Because I think in the coming four years to especially eight years, the way that a majority of people are participating in the markets are going to be through these ETF vehicles. What’s your point of view?\n[00:12:17] Explain your point of view on this.\n[00:12:19] American Hodl: That is a really hard predicament, pressing that question you just asked, because I mean, it’s two totally different types of Bitcoiners, right? So you got the guys who bought Bitcoin when it was 5, and they’ve been holding onto it for dear life, and securing it against cyber threats, and using their cold card, and their multi sigs, and their geographically distributed this and that, and you know, practicing OPSEC, Then on the polar opposite end of the bell curve, you got the guy who got rich off the Fiat system.\n[00:12:44] Who’s got a hundred million dollars with Goldman and he can just call them up and be like, yo, I’m already trusting you with a hundred million dollars in this relationship. Pick up some Bitcoin for me. You know what I mean? And that guy is not going to be interested in taking custody of his own keys because there’s a slew of problems that come with it.\n[00:12:57] I mean, there was just a social engineering attack for 250 million, like 4, 000 Bitcoin. These kids who were in LA and Miami got this guy who was a Genesis creditor. It was a single, a single Bitcoin whale to give up 4, 000 Bitcoin, just via a social engineering scheme where they called him up and pretended to be Google and Coinbase and Kraken and whatever they pretended to be.\n[00:13:18] We’ll learn the details later. Through the FBI, but a lot of people look at that, especially people with real money and they go, that’s a headache. That’s a headache, you know, and I don’t want to deal with that headache. And so, because I don’t want to deal with that headache, I’m just going to continue path of least resistance.\n[00:13:32] I’m going to continue trusting my broker, who I already know and like, and who I believe has my best interests at heart. That’s the path I’m going to take. So it’s just two ends of the bell curve. I think Bitcoin’s going to sort of bifurcate in that sense that like the Bitcoiners that have their keys, like myself, are never going to get rid of them.\n[00:13:46] And the Bitcoiners that are just now entering the market are probably never going to take a custody there of their coins.\n[00:13:51] Jeff Ross: And I’ll just throw that in there just to piggyback on what you said. This is like a first world problem, right? I mean, Americans, we’re into Bitcoin for the profit. Wall Street’s going to come in because they want to make a lot of money, right?\n[00:14:01] They see this asset that has historically high returns, incredible sharp ratio, risk adjusted returns. They want a piece of this action and they’re going to get into it for the first time in this cycle. And that’s what’s going to really help propel the price higher. You start talking to people like Alex Gladstein and people who are in other countries and in developing nations, they’re not in here to make a million dollars on a quick hit, right?\n[00:14:20] They’re not going to be selling options, trading options. They’re not going to be buying calls on Bitcoin. They’re using it as life support to get away from their government fiat currency and to maintain their purchasing power. So this is like a completely just foreign discussion to people like that.\n[00:14:33] And so that’s to your point, how to like, why are you in Bitcoin? There’s so many different reasons why people are in Bitcoin, and it can vary by geography, it varies by your income status, all these different things, your experience. And so I think that what I love about Bitcoin, though, is all of this nonsense that’s just gonna happen because of Wall Street getting on board and driving the fiat price higher.\n[00:14:53] It’s going to help people all around the world who are, you know, sitting in Africa right now, and they only have just a couple sets to their names and they’re just barely trying to make it. And this is going to help increase the value of the entire network and it will benefit those people as well. So that’s a good thing.\n[00:15:06] Joe Carlasare: Yeah. I’ll just say, I think that we’re thinking far too limited. We’re not thinking big enough with respect to these ETFs. My particular view is by the end of the decade, you will see a seamless integration between Bitcoin and most financial services, including brokerage accounts. I think you’ll be able to deposit Bitcoin in your brokerage account.\n[00:15:22] You’ll be able to buy any security with it. And I think the ETFs will be a revolving door where you can port some of your wealth to the ETF if you want. You’ll be able to withdraw in kind from bitcoins by ETFs. There’s no technological reason why that can’t exist. It’s a regulatory bureaucracy, legal headache, which those are the easiest ones to fix.\n[00:15:38] The tech is easy, right? If you’ve got, you know, three, four, 500, 000 in an ETF and that becomes a million and you want to port some 200, 000 worth of Bitcoin out of there, I think that they’re going to open those up at some point by the end of the decade. And it’s not going to be as bilateral as we think that, oh, you either have to have all your keys or all of your point in when you custody provider.\n[00:15:57] I think you’re going to be able to move back and forth seamlessly integrating between it. I think every bank’s going to be able to custody it. I just think we’re just early days and it’s going to take, you know, six, eight more years.\n[00:16:06] American Hodl: So Joe, I have heard from people like sources inside BlackRock that they’re expecting in kind treatment within the next two years. So not even six to eight.\n[00:16:15] Joe Carlasare: Well, that’s different. So you’ve got two different things, right? Right. And this is really, there’s a ton of confusion on this and what you’re talking about is correct, the in kind contribution, but those are from authorized participants. So right now, the way the trust acquires the iBit or other trusts require the Bitcoin, they go through the authorized participants and right now it’s through cash creates, right?\n[00:16:34] Cash create system is what the SEC was insistent on. They did not want people to be able to port their Bitcoin from the authorized participants into the ETF structures. Some people say that was just a, you know, proverbial screw you to GBTC, but we’ll leave that aside. But however it shook out, it shook out now where there’s cash creates for the shares.\n[00:16:51] That is expected to change within the near term. What I’m talking about is a little different. I’m talking about Dr. Jeff Ross has X amount of shares of iBit. And he wants to convert 40 percent of those shares into spot Bitcoin. There is no technological reason why those shares could not convert and move into spot Bitcoin with a withdrawal minus the fees or whatever processing transaction you need to have.\n[00:17:11] So you can have something you can’t do with GLD, right? Unless you are significant with size and the, the gold ETF the GLD, the main gold ETF, you cannot withdraw and take the gold. Okay. For obvious reasons, right? It’s really hard and difficult to transport the gold. There’s no reason that can’t happen with Bitcoin and Bitcoin spot ETFs.\n[00:17:29] American Hodl: Yeah, the big winner in me is very conspiratorial. When I hear you say that, because I think, well, why the hell would they want to let people take Bitcoin out of what is effectively a government honeypot? I mean, come on, let’s be real. BlackRock is like a financial terrorist organization. I won’t say terrorists, but they’re like financial, like, you know, operatives for the U S government.\n[00:17:47] I mean, they’re juiced in, right? Like the Winklevoss twins do an ETF. And they wait in the line for 10 years being like, please, sir, fill my soup bowl with just whatever you can spare. And then BlackRock files and six months later, there’s ETFs galore, right? So to me, I think that if the government is smart here, they’re going to want to trap as much Bitcoin as they possibly can.\n[00:18:07] And they would stop that sort of revolving door, like you put it. Although that said, if you want to get as many Bitcoin as you possibly can into these ETF products, you would allow Bitcoiners to put their Bitcoin in and be able to margin against their Bitcoin, because that’s very tantalizing to be able to do because you don’t have to sell your Bitcoin and you can start using it to purchase things that you want.\n[00:18:27] So I don’t know. We’ll see how it all shakes out.\n[00:18:30] Joe Carlasare: Yeah. The only thing I’ll say is that the market factors could influence BlackRock’s decision. You know, if they’re losing market share, If you get some smaller players to launch an ETF that allows you to withdraw in kind in Bitcoin, if that came to market, right, I would doubt more money would flow to the bigger players.\n[00:18:45] I think at least you’d capture a significant market share from the smaller players. And we see this, right? There’s a reason why all of the brokerage houses drop fees. Robinhood started as an upstart, right? And then everybody followed suit. They all drop fees. You know, you would make the same argument, but why, why should Schwab and Fidelity And these bigger players, why should they have fees on transactions?\n[00:19:04] Well, because the upstarts come and the upstarts start to cannibalize their efforts. And this is why like even GBTC, right? GBTC had to launch the mini Bitcoin, the BT symbol BTC, because they couldn’t compete with fees with BlackRock and the other providers. So I think it happens naturally as new participants come to the market and they say, Hey, we want a portion of the Bitcoin spot market, and we’re going to be better.\n[00:19:25] We’re going to be, we’re going to have on chain addresses for all of our Bitcoin. We’re going to allow withdrawals. It seems right for takeover. If you actually bring a product to market, that is better.\n[00:19:33] Preston Pysh: Joe, I’ve got a question for you. Just today I read BlackRock amends their custody agreement with Coinbase.\n[00:19:38] Filed it with the SEC. As detailed in the SEC filing, the amendment updates the section 2. 1 of the custodial service agreement. Coinbase custody now must process withdrawals of digital assets to a public blockchain address within 12 hours of receiving instructions from the trust or its authorized representatives.\n[00:19:57] What’s happening here? Why are they updating this to 12 hours? It used to be 24 or 48.\n[00:20:03] Joe Carlasare: I think it was 24.\n[00:20:04] Preston Pysh: It was 24.\n[00:20:05] Joe Carlasare: I think it’s just for the sake of efficiency. They wanted to move quicker. I mean, it’s a good thing. It’s positive, right? Yeah. We want to supplement real and on a faster basis. And I don’t view it as anything nefarious or negative.\n[00:20:14] I just think it’s more of a faster way of updating the instructions where they’re giving the addresses to the institutions or authorized participants. And they’re trying to fulfill balance requirements. Okay.\n[00:20:24] Preston Pysh: Is this because they’re getting a little bit of slippage or just.\n[00:20:27] Joe Carlasare: I haven’t heard that at all. First off, we hear all the time about these rumors that I categorically reject that BlackRock or other ETFs do not have the Bitcoin. I think that is preposterous. Putting that aside, my view is that they’re just trying to be more efficient and they’re trying to get hold of the Bitcoin on a faster basis, which is a good thing, right?\n[00:20:45] Preston Pysh: Any other thoughts on this one?\n[00:20:46] American Hodl: Yeah. When I read it, I just viewed it as black rock dictating terms to coinbase for, like Joe said, for greater market efficiency. Like they were like, all right, listen, like speed it up. Like 24 is too slow. We’re black rock. We say 12, it’s 12. I mean, like that’s, that was the takeaway I had from it.\n[00:21:01] Preston Pysh: What do you guys think about now that BNY Mellon is going to start doing custody services, do you see them starting to eat into some of the Coinbase custody?\n[00:21:10] American Hodl: You would think that 10 years from now we’re not going to live in a world where Coinbase has control of as many coins as they currently do as a custodian.\n[00:21:16] Right now that is a risk, like The centralization of coins at a single custodian. I think Fidelity’s the only ETF provider that’s not Cusing coins with Coinbase and then iBit and Grayscale and a few others are. Some of the smaller players are. So there, it’s a real central point of failure there. Now, like I’m sure that the keys are in Multisig, et cetera, but still there, you know, there’s some process at Coinbase that is the central point of failure.\n[00:21:41] So, yeah, I would think that just as a differentiation point in the markets that you’ll want to have different, like for me personally, I, you know, in my retirement account, I bought Fidelity instead of iBit because I like the fact that Fidelity is doing their own custody. Right. I also don’t like BlackRock because of ESG and a bunch of other reasons, but you know what I mean?\n[00:21:58] That was calming to me as an investor. And I know people who did, you know, half and half, they were like, I’ll buy half iBit and I’ll buy half Fidelity because of the custodial risk. And so I think we’re going to see more of that Bitcoin separate. And yeah, why wouldn’t it go to sophisticated players like BNY Mellon or JP Morgan Chase or whomever, right? Gets involved.\n[00:22:16] Preston Pysh: Isn’t it interesting that a lot of the ESG stuff is really starting to spin the other way? Like I just read this week, And it seems that AI is really kind of driving the trend reversal where everybody’s like, all right, well, we need lots of energy. So now all of a sudden we’re all about nuclear, right?\n[00:22:33] The Microsoft, I guess, is firing up three mile Island again, or whatever. I mean, it’s pretty fascinating to see it all taking place right now. And great for Bitcoin that. I guess everybody looks at AI and they’re saying there’s a use case. There’s no use case with Bitcoin mining. So they weren’t on board until AI came along. But I think this is really a good development for Bitcoin to continue to scale and for more energy to come online.\n[00:22:57] Yeah, absolutely. I mean, because basically what they figured, what big tech has figured out is that if you have an LLM model. And you can throw the most amount of power at it. You win, which, what does that sound like as Bitcoiners?\n[00:23:08] It sounds very similar to the way Bitcoin mining works. I mean, there’s no direct output there. They believe it’s going to be a winner take most or a winner take all market, which is probably correct. And so, you know, I think it’s great that they’re subsidizing nuclear power and they’re using their political connections to get it done because we were not able to get it done at all.\n[00:23:24] We’ve been, we’ve been on this beat for 10 years and nobody cared about us. We were just like the weirdos in the corner. But when Bill Gates is like, we need to build power plants, suddenly, you know, it starts happening, which is fantastic. I also think like, you know, ESG sort of went away as like a, it was a zero interest rate policy phenomenon, like the minute ZERP ends and all of a sudden, like we can’t be mandating, you know, political ideology to companies for whatever reason.\n[00:23:48] Okay. Anything else on the ESG part before we move on guys?\n[00:23:52] Jeff Ross: All I’ll say with that is the, to me, it’s very clear that the Overton window is shifting, right? Yeah. I think it’s gone about as far left as it could go of all the socially acceptable topics like ESG, like, I don’t want to get into all that right now, but I think we’re starting to shift back towards the center again.\n[00:24:08] And to Hodl’s point and to your point, Preston, we just realized, look, we did these unreliable renewable energy sources. They just don’t work. They’re super crappy. Brownouts are terrible to live through. We actually need legitimate baseload energy. And nuclear is awesome, you know, and so it’s starting to shift and now it’s socially acceptable for people on the left to talk about that and to say those things.\n[00:24:28] So I can’t believe it took this long because it’s been really annoying, but I’m really excited to see that we’re finally moving back to the center for these topics. So that’s all I have to say.\n[00:24:36] Preston Pysh: I want to talk about this SAB 121. SAB stands for Staff Accounting Bulletin 121. I’m assuming Joe, you’re really well versed on this.\n[00:24:45] Effectively, just to kind of simplify this for folks. So if banks are going to custody and obviously BNY Mellon, I don’t think falls under this with this announcement this past week, but banks, if they’re going to custody Bitcoin or any type of digital asset, they have to treat it as a liability on their balance sheet.\n[00:25:04] And then they have to have cash reserves or some type of asset to offset this liability that they would be holding on behalf. So let’s say they have a hundred million dollars of Bitcoin that they’re custodying. They then have to have a certain amount of assets in excess of that hundred million dollars that they would be custodying to offset that quote unquote risk on their balance sheet.\n[00:25:26] So SAB 121 is trying to, there’s a lot of banks, a lot of bankers that are trying to get this overruled so that the treatment isn’t that it’s held as a liability on their balance sheet. Interestingly, Basel three came out, I want to say near the beginning of this year, and it specifically broke out two different groups.\n[00:25:45] You had group one, you had group two, and basically they’re saying that crypto assets need to have a A 1, 250 percent risk weighting. So in the example I used earlier, if you’re squatting on a hundred million dollars worth of Bitcoin, you basically have to have 1. 25 billion of assets on your balance sheet to offset the custody of that a hundred million dollars worth of Bitcoin.\n[00:26:11] So this makes it impossible for banks to want to touch it. There’s been a lot of Howard Lutnick, who is from Cantor Fitzgerald, has come out. He talked a lot about this openly in a couple different interviews saying, there’s no way we can get banks to ever touch this for all these reasons that I just described.\n[00:26:29] Joe, I’m curious, First of all, did I get that right that my description is that I\n[00:26:34] Joe Carlasare: don’t see it’s connected to the story we just talked about to be a BNY Mellon. Okay, because they actually got the exemption from SAB 121. Okay, so just for your viewers and listeners, the backstory starts with the SEC basically puts for this bulletin.\n[00:26:51] Okay, staff counting bulletin 121 and this imposes these restrictions on custody arrangements for various institutions. Okay. And then at that point, there was widespread sort of animosity towards this, so much so that they actually got a bipartisan bill passed by some Democrats through the Congress, sent it to Biden’s desk, and lo and behold, it gets vetoed.\n[00:27:13] Okay. Disappointment. Right? Then you get this exemption from it, where they point to various, there was a speech actually, that’s the big news, right? Where you got a speech basically from one of the head regulators saying, we’re going to grant an exemption to be NY Mellon. And the question becomes, why? And there’s collaboration agreements they’ve signed with state regulators and other institutional custody risk management controls that are in place.\n[00:27:35] But the long and the short of it is, they’re already pivoting away from the requirements of SCB 121, which is extraordinarily unpopular. So much so that it had bipartisan support to repeal. So the question is, where do we go from here? You know, BNY Mellon was able to successfully navigate the FCC’s requirements to get this exemption, which is not really fair, and people are crying, well wait a second, you’re again picking and choosing favorites, you’re not giving this to other major players, people like Custodia Bank and others that are trying to, in good faith, comply with the requirements.\n[00:28:03] You’re picking and choosing winners. Once again, SEC, which is not your role is supposed to do, supposed to be agnostic as opposed to banking and institutions, supposed to have a level playing field for consumer protection. You’re not doing that. So the question is in the new administration, whether it’s a Harris administration or a Trump administration, will you get a repeal?\n[00:28:21] Finally of 121 and I for one think you do I think regardless of the administration that takes a hold I think you do get a repeal just because there’s broad bipartisan support for it and I still am confused That’s why the biden administration felt the need to veto it in the first place considering, you know Even people like chuck schumer voted for the repeal that is so, you know from my standpoint here I think this all goes away.\n[00:28:41] I think obviously if Former President Trump captures the White House in November. I think that is going to be almost a done deal that 121 goes away. Harris administration is going to be a little bit different, probably less likely. But overall, I think there’s enough bipartisan support and there’s enough of Wall Street money behind it.\n[00:28:57] That’s the key. Wall Street money and influence lobbying to eventually get it to go away.\n[00:29:02] Preston Pysh: What do they have to match it with? So I’m assuming they’re still listing it as a liability, but how much assets do they have to have, let’s say if they have a hundred million dollars worth of Bitcoin on their balance sheet that they’re custodying.\n[00:29:14] Joe Carlasare: Well, this is the confusing thing because they haven’t been really clear about it. We only have this speech, right? Where they have said that they qualify for the exemption, but we don’t know what the specific factors that they’re looking at that, you know, they’re all soft, right? It’s kind of, we don’t know under the hood what specifically led them to that variance.\n[00:29:29] They call it variance from the requirements. So I wish I could give you a more direct answer. I know I have clients that would love to have a more direct answer on it, but unfortunately we don’t, we, with the sec, it’s always sort of, you know, tell us everything and we’ll, you’ll hear from us at some point down the line.\n[00:29:43] Which is very frustrating, right? That’s not a good way to conduct major policies, specifically in areas as important as Bitcoin.\n[00:29:49] Preston Pysh: So the question really becomes like, so why do you think that it was declined? Is it just to give them a headstart over everybody else? Is this, I would imagine it’s very political.\n[00:29:59] I mean, what’s the tinfoil hat rationale behind these actions? Cause the actions don’t make any sense whatsoever.\n[00:30:05] Joe Carlasare: I mean, look, when I need a tinfoil hat answer, I go to American huddle. That’s just generally where I try to\n[00:30:12] American Hodl: get. The government’s not an efficient Joe. How dare you say that by the way, somebody will knock at your door shortly.\n[00:30:19] And also they love you and want what’s best for you.\n[00:30:23] Preston Pysh: Well, we’ll see, you know, I don’t really know what to make of it. It seemed like it came out of left field. Were you expecting that this week? I was not expecting this at all. Yeah.\n[00:30:32] Joe Carlasare: Many industry participants were taken off guard by it. I mean, it seems strange.\n[00:30:37] I do know that there was some signaling from the fed. The fed had issued a non objection letter to be in line, which is interesting why they would do that. I’m not quite sure. But yeah, I’m sure we will find out in the coming weeks and months. I think some of the most interesting news of the week came, I don’t know if you guys saw the threads about Silvergate, right?\n[00:30:57] And some of the affidavits that were filed and declarations on that and how we know now definitively that Silvergate was taken out back and shot because it was pro crypto. So we learn these things after the fact and I’m sure there is a story here that has yet to be reported that we will learn after the fact.\n[00:31:12] Preston Pysh: Yeah, so for people that aren’t tracking back when a silver gate went down, there was a lot of debate as to whether it actually was short on capital and that they went through bankruptcy or they were purposely killed because they were basically the banker to all these businesses that are dealing in crypto.\n[00:31:28] And this past week, there’s been a lot of evidence that came out that it was actually the latter is that they were in fact killed by the government on purpose and that they actually had liquidity to service all their obligations. So Nick Carter had a major role in first reporting on it. And then I know this week he was putting out amazing content.\n[00:31:49] I think Caitlin was also putting out some stuff with respect to that. What I find so really frustrating is for Caitlin. Dotted every I crossed every single T for years. I think what was the bank originally? It wasn’t custodian bank It was originally guys remember the name. Oh, yeah. Yeah. It’s been a while.\n[00:32:07] Yeah, it’s been a while But like I mean, it’s like four years ago. She was Maybe even longer on that But anyway, so my point is is that she’s been at this for a really long time trying to get a Fed master account the irony That she’s saying, yeah, I’m going to fully reserve everything. And then basically saying, well, we can’t have one person like doing things honestly here and everybody else is fractional reserved.\n[00:32:31] So they slow rolled the approval. Then they just flat out declined and said, it’s not approved. And then they go this week and approve, you know, BNY Mellon to basically provide custodial services. So she was pretty vocal, obviously online about a lot of this for good reason. And I can only imagine, you know, the case that she has against the Fed, but I guess from my vantage point, it’s like, Well, they, in a way, because they slow rolled it and whatever shenanigans were played in the background, you’re still going to end up losing regardless of how good your case is, because now they’re all in this game and you’re still not, or you’re starting, or even if they gave her approval, now you’re starting from like zero and like flat footed and they’re all just off to the races.\n[00:33:16] So it’s really insanely frustrating to see like that level of corruption playing out and. You know, I’m very comfortable saying that I think you all three would agree. It’s just total government corruption in that particular case.\n[00:33:29] Joe Carlasare: Avanti Bank was the one you’re talking about. Avanti,\n[00:33:31] Preston Pysh: Avanti. Avanti Bank.\n[00:33:33] But that was renamed into Custodia Bank. Here’s where I’m going with all this. Sorry I’m talking so much. What I find so fascinating. Is I did an interview with Paulo from tether. They’re now at 119 billion of assets under treasuries that they’re squatting on. And they have tokens that are issued on top of this.\n[00:33:55] I can’t say I’ve audited. One to one, but I’d be pretty shocked at this point that for the number of bear markets that they’ve gone through and how they’ve continued to hold their peg that they’re not backed the fact that you’re kicking off a 5 percent coupon on, you know, three month money, and then he’s plowing that into Bitcoin, which then hasn’t had a compound annual growth rate lower than 25 percent over any four year period.\n[00:34:19] Tells me that he’s probably deeply over collateralized on the assets, the 119 billion of assets under management. And what I find fascinating is effectively he’s doing fully reserved banking, right? Like we look at Silicon Valley bank, how long ago was this now? Two, almost two years ago. Almost two years ago, right?\n[00:34:38] Yeah. Two years. Yeah. And everybody ready to poop their pants, whether they were going to get bailed out By the central bankers, or they were going to get their 250 K FDIC check, even if they had 10 million on deposit, that’s the fractional reserve game. And you look at now some of these stable coin issuers and it almost, and I’m going to get a lot of crap for this, but.\n[00:35:01] It almost feels like that might be safer because it’s fully backed and fully reserved a hundred percent versus these fractional reserve banks that are being kept out of this market because they’re not allowed to custody. I see Joe’s disagreeing and I want you to disagree.\n[00:35:15] Joe Carlasare: I actually agree, but I think that I have to be whipping boy to play devil’s advocate here for the Fed.\n[00:35:22] And we can talk about that if you want. I hate fully reserved banking operations, right? Okay. Okay. So let’s, again, this is not Joe’s view. I have full disclaimer, so don’t add me, but I’ll just say, okay. So the whole premise behind the entire system, right? Is credit creation. Credit creation is the heart of the system.\n[00:35:39] So if you have a fully reserved banking Institute, you inhiBit credit creation.\n[00:35:44] Preston Pysh: Yeah.\n[00:35:44] Joe Carlasare: So fed oppose the fed opposes that largely because in their mind, in times of market turmoil and times of downturn, their influence, their transition mechanism precedent to affect monetary policy is muted. They do not have the ability to play on the levers of monetary system to incentivize.\n[00:36:01] In other words, they would say it’s inflexibility to borrow. Another term from a recent debate we’ve had all over Twitter is they would say you have created an inelastic money supply with a fully reserved banking system that is pernicious to our system. That inelastic system says that in times of downturn, we do not have liquidity tools to incentivize and restart the system.\n[00:36:22] The system freezes up like a patient going into cardiac arrest and it dies. So from their perspective, they think that these types of ideas are dangerous. They actually undermine their authority and their ability to control the system, right or wrong. That’s their thought process. The inflexibility that is associated with full reserve back systems.\n[00:36:39] Is what is, I think, in their mind, a threat to the stability of the greater monetary policies.\n[00:36:45] Preston Pysh: I totally agree with what you just said. That’s how they view it. I\n[00:36:48] Joe Carlasare: don’t,\n[00:36:48] Preston Pysh: I don’t, no, no, no. I’m saying I agree that from their vantage point, that’s how they see it, right? This is a threat against them and the way that they implement policy.\n[00:36:58] If you would allow fully, of course, I don’t want that. I think that’s, it’s a way to mask the printing is what it is, because you’re just doing it through the credit creation. But I’m curious if you guys this is the question I had, do you see tether and circle basically doing like an end around fully reserved banking?\n[00:37:17] And they’re doing it in a way that the fed really doesn’t understand that that’s what they’re providing in their service. And it’s interesting because they’re really not playing by the rules, but then you have people like Caitlin long that are out there, like knocking on the front door at the fed and saying, Hey.\n[00:37:34] I’m willing to do all the paperwork. I’m willing to do all this stuff. And because she’s willing to play by the quote unquote rules and be fully reserved, they’re basically saying, yeah, you’re trying to play a game that’s unfair and you’re trying to play it fairly, like get lost.\n[00:37:47] American Hodl: Yeah, there was a Willy woo tweet tweeted recently.\n[00:37:50] He said BlackRock has 19, 800 employees and it has 10. 4 trillion AUM, which is 10 percent of the world GDP. And they make 5. 5 billion profit. Tether has 50 employees. They have 119 billion AUM, which is 0. 1 percent of world GDP. And they make 6. 2 billion in profit.\n[00:38:09] Preston Pysh: An extra\n[00:38:09] American Hodl: 700 million more than BlackRock does annually.\n[00:38:14] So like the, but the thing is that. 10. 4 trillion AUM for Blackrock. That’s the actual key number. Cause that number says I’m in the club. Not only am I in the club, I’m a big part of the club, right? Tether, I think is too big to fail at this point. I think tether is going to be, I think they’re going to bring tether into the club.\n[00:38:33] That’s what I think is going to happen. But this like sort of shadow banking system with stable coins, I don’t think they’re going to be able to end run around it for that much longer. I think basically like if you’re big enough, You’re going to be offered a seat at the table or a half seat at the table, at least.\n[00:38:47] And if you’re smaller, you’re going to get clipped. That’s the way I see it happening.\n[00:38:50] Preston Pysh: I think this is why the SAB 121 thing is such a big deal is because I think these too big to fail banks are looking at the old legacy fractional reserve banking system. And they’re saying, look at these guys over this rag tag team of call it a hundred people.\n[00:39:07] They’re making more profit than BlackRock in the last 12 months. We want to play that game. We don’t want to, you know, have to obey these 121 rules. We want to be able to play in this stable coin market and back. We’ll buy all the short duration issuance you want U. S. government. And we’re just going to issue a coin on top of it and, you know, Keep the coupon, right?\n[00:39:30] Or at least most of it. And I think that that’s kind of the game that they’re trying to get into. I think the big banks are trying to get into the game that tether and circle and others are playing. And it’s fascinating to me because they’re wanting to undo the fractional reserve game that they’re so well versed at.\n[00:39:48] And. One other thing that I find fascinating about this is think about their revenue for like, if you’re a traditional banker and a Max Kai said this to me when I was doing an interview, he said, think about traditional banking and fractional reserve banking. If you take a 10 deposit and you can lend out a hundred, you’re making revenues off of the hundred that you’re lending out the percentage of the interest off of the 10 that’s on deposit.\n[00:40:12] He’s like, so you’re collapsing multiples. If you start. Fully reserving everything because you’re not going to be able to lend out 10 times as much and it was a really interesting comment And you can see how they’re kind of if you’re a legacy banker You’re at odds with you want to be still playing this fractional reserve game because you’ve got multiples of 10 on The deposits that you can lend out and the money that you can make off of it But at the same time, you’re looking over here at this guy who’s like eating your lunch from a profit standpoint with a hundred employees and he’s fully reserved.\n[00:40:44] So it’s, I don’t know. It’s really at odds. He’s the legacy system. And I think where we’re all going with. Stable coins. I don’t know. What, what are your thoughts guys? What do you think, Jeff?\n[00:40:55] Jeff Ross: Well, love it or hate it. Tether is just an astonishingly good business model. And I wish I would’ve thought of it first.\n[00:41:00] And it’s so interesting to think about it. The difference between going out and building a business and then asking him, asking for permission versus doing it to Caitlin Longway and doing everything by the book and asking him for permission and just getting stonewalled the entire way along. I feel so bad for Caitlin because she works so hard and she’s trying so hard to do what’s right and she just keeps getting stuff.\n[00:41:22] American Hodl: Yeah,\n[00:41:22] Jeff Ross: you know, it’s really frustrating to\n[00:41:24] American Hodl: watch. This is also the why I don’t invest in lawyers. No offense, Joe. Sorry. Lawyers are too bound by the rules of convention. You know what I mean? You know,\n[00:41:33] Preston Pysh: Okay, here’s where I want to go next. So, And when I look at Tether, a majority of these tokens are issued on Tron, okay?\n[00:41:42] Some are issued on Ethereum. Some are issued on Solana, I think. So where I want to go with this is when I look at these other quote unquote blockchains, and we all, we’re all hardcore Bitcoiners here. It seems that the sole purpose. Of these other blockchains that we all know are centralized and from different degrees, right?\n[00:42:04] They’re all centralized in different ways. And they’re very different than Bitcoin with respect to being able to run a full node. And like actually governments, if they really want to shut down any of these things, they can go in there and they can lay the screws to these very centralized servers that are running.\n[00:42:19] All this massive amounts of data that are, you know, these ones that I just named. In addition to that, these stable coin issuers are highly centralized themselves. I mean, I was doing an interview with Paul, like if somebody comes knocking at my door, I have to oblige. I have to answer this. I’m controlling a ledger of how many coins are issued against these treasuries that I’m buying that some bank is custodying.\n[00:42:44] So it seems like this whole hodgepodge of quote unquote crypto, if I had to say what the point of all of this was, as we were banging our heads and trying to fight this battle for a decade at this point, it’s to basically tokenize fiat, right? It’s to tokenize the dollar. It’s to tokenize the Euro. And beyond that, it doesn’t really appear to have much of a use case.\n[00:43:06] Now people are trying to tokenize real equity. There’s a company called Stalker that is doing that in Europe, which is really an interesting discussion. There’s some other, you know, edge cases, but for all intents and purposes, I’m curious if you guys agree with this. It seems like the whole point of all these other blockchains is to tokenize the dollar and to expand the dollar’s reach and to make it more saleable and immediately settling all around the world.\n[00:43:30] Would you guys agree with that?\n[00:43:31] American Hodl: I mean, I think that the coins that did well, realized that early on, like tether realized that early on and did really well. And at any given time, if you go look at the top 10 digital currencies, like half of them are digital dollars. And the other half are just trying to put up a narrative front to appear credible enough as a challenger to Bitcoin to soak in enough liquidity.\n[00:43:51] So that they can abscond with the funds and then basically slow rug where you sort of sunset the project in public by saying, Oh, we’re doing ETH2. What happened to ETH1? It’s dead. So yeah, I think basically that is what’s going on. And I think the U. S. government really doesn’t have a problem with it.\n[00:44:08] They just have a problem with who the players are. They’d like to switch some of the players out. Like they want BlackRock to be one of the players. And speaking of BlackRock. BlackRock is heavily interested in RWA as real world assets. And the reason they’re probably going to be successful at them, or at least moderately successful with them is because you can get around the Oracle problem.\n[00:44:27] If you’re BlackRock by just being the Oracle, we’re the Oracle, we’re BlackRock. We’ll tell you what’s what, you know, so you don’t have to do the same sort of. Left hand, right hand, slight of hand that goes on in cryptocurrency or with algorithmic stable coin or any of that stuff. You can just straight up say, we’re the authority and this is what it does, you know?\n[00:44:46] Joe Carlasare: Yeah, I view it as all being traced back to the exchange activity, okay? So, if you look at the idea of cross border payments, remittances, peer to peer transfers, all that, it accounts for less than a fourth of the overall volume for the stable coins. The vast majority of the stable coin volume is on chain or is is on exchange activity, right?\n[00:45:03] So people trading Bitcoin, ether, other alt coins, and they’re trading them against the dollar pairs, right? The peg tokens. So they can hedge in and out of volatility. And why are they doing that? They’re doing it because a lot of the quote unquote crypto exchanges cannot deal with the regulatory environment.\n[00:45:19] So they are forced to not have banking accounts. So most notably Binance and others, they only deal in stable coins because that makes it harder, not Impossible, but harder to shut them down. So the entire stable coin market developed largely as a product for these casinos to fund them and allow trading activity where people could get in and out of these various tokens or assets into something more stable and hedge that volatility.\n[00:45:40] So although there is in the emerging markets there’s obvious uses for cross border payments and remittances, it still makes up overall a minority of the overall volume for the stable coin market. So it all goes back to the exchanges. And I look at it mostly as just how do we create exchanges without having to have bank accounts frozen.\n[00:45:55] And the obvious answer was the stable coins. You create a buffer where you have these centralized entities tokenize the dollar so that you can get in and out of assets for trading purposes.\n[00:46:03] American Hodl: I think Joe gave a very charitable explanation to, you know, I would say they were straight up for evading taxes.\n[00:46:10] That’s what they were for. I mean, talk to the average crypto trader. They have a erroneous belief that if they go from Bitcoin to a stable coin to Monero back to a stable coin, that there were no transactions that were traced that were taxable. In that chain, it’s like, no dude, they were all taxable.\n[00:46:29] Preston Pysh: Each one of them.\n[00:46:29] Oh boy. Yeah. That’s trouble. Something interesting seems when you’re looking at a theory, Ethereum has been getting destroyed lately in price terms, right? In dollar terms against Bitcoin and others. It was interesting. I remember this back and forth that I had online. This was probably four to six years ago.\n[00:46:50] I’m thinking with Adam back and Adam said to me, you know, very casually, he’s like, well, now you have a Solana and now you have Tron. And it just seems like they’re just a lot better from a fee settlement standpoint and a speed of settlement standpoint, and they’re all centralized. He’s like, so if you’re going to cheat, you might as well just cheat better than the other ones.\n[00:47:14] And it seems that Ethereum is kind of caught in this situation where they were still trying to be decentralized. I mean, it was proof of work for a very long time. When did they come off? When did they go to proof of stake? Like 2022 or? 20 years ago, three years ago, they moved from proof of work to proof of stake.\n[00:47:35] So they were still trying to keep it together and still trying to be decentralized. But these other ones came along. We’re like, yeah, well, we’re not actually decentralized. We just say that we’re faster, we’re cheaper, and we’re going to win because that’s what people actually want. And they don’t really, they really don’t care whether we’re decentralized or not.\n[00:47:52] The government doesn’t seem to be shutting us down. So we’re just going to. Continue to cheat, right? It’s all legacy thinking, right? The best ones that cheat are the ones that win. So I guess it’s interesting to me to see Ethereum really losing a lot of market share right now because they just didn’t cheat well enough or they weren’t.\n[00:48:12] Am I framing this correctly or am I kind of out to lunch? What do you guys think?\n[00:48:16] American Hodl: Well, I, I think one thing you were keying on there is that the main difference between Ethereum Ethereum enforces a lot of the cost of running the system on the users and Solana enforces a lot of the cost of running the systems on the developers.\n[00:48:29] And obviously if you’re trying to create consumer applications, which one of those is going to have more buy in, it’s going to be the one that doesn’t penalize consumers, right? So, I mean, that’s the main reason why this Solana and Tron and whatever are doing better than Ethereum. And I think Ethereum is, I’ve thought for a long time that it’s like a slow rug and that, you know, Vitalik is looking for a way out.\n[00:48:49] I mean, a lot of people got rich off of it and like good for them and now they can ride off into the sunset and buy Bitcoin and stop going to their weird conferences where they dance around on stage and sing and sing. Okay.\n[00:49:02] Preston Pysh: Anything else there? Are we good?\n[00:49:04] Joe Carlasare: I think we’re good. Yeah. I mean, I think it’s.\n[00:49:05] That’s the spot on. I mean, at the end of the day, right? Most of these chains are for minting useless tokens meme coins, right? And trading them between one another. And if you can do that cheaper and you have the backing of VCs, which Solana has a ton of make no mistake. They have a ton of very important firms backing the operation, right there.\n[00:49:23] So they’ve got the institutional side behind them. Plus they’ve got the cheaper product. So it seems like a real recipe to steal market share from ETH.\n[00:49:30] Preston Pysh: All right. Final topic. 50 BIP cut this past week. We have been tightening, we’ve been, from a global liquidity M2 standpoint, have been going sideways for what, two years now guys, and I just saw that global M2 broke out, and we have the Fed cutting, I just saw tonight that China is aggressively adding liquidity into the market.\n[00:49:57] I’m throwing this over to Jeff. He’s been very quiet. This is the topic he loves to talk about. Where are we at? Are we gonna continue to chop sideways or are we about to break out into a bull market? Jeff, what’s happening?\n[00:50:06] Jeff Ross: The bull crab market is over. Oh wow. And we declared it. It’s the bull market officially.\n[00:50:11] So we have, for all these reasons, we’re talking about liquidity is breaking out. Global. M two is rising. It doesn’t really matter what most people are US-centric. But what, when you’re talking about global assets like Bitcoin, which is the premier global asset. You want to see global M2 monetary supply rising, and that’s where you have the strongest correlation.\n[00:50:30] When the Fed dropped by 50 bps, other central banks are dropping as well. That’s lowering the cost of capital for people, right? So for people in the audience who don’t know this, right? Like the prime rate is what most variable shorter term borrowing rates are based off, and the prime rate is based off the federal funds rate.\n[00:50:48] So when the Fed funds rate dropped from five and a half to five, the prime rate dropped from about eight and a half percent. to 8%. And if you have something like a HELOC or credit card debt, or you’re a small business with small business loans, those kinds of things, that means literally the next day your rates dropped by about 50 bit 50 basis points.\n[00:51:06] What does that mean you have more cash in your pot, your cash flows just instantly improve, right? I have a HELOC, my cash flows just improved a couple days ago. That’s fantastic. And they’re going to drop they’re probably going to, I think they’re going to do a couple of 25 bit. Cuts in November and December.\n[00:51:20] So it’ll be a full like 100 basis point cut by the end of this year. That’s my take on it. That’s real money. So what that does, that means you have more money in your checking and your savings account or in your money market fund or in your CD. That’s what globe, that’s what M2 is, right? It’s the cash that’s floating around.\n[00:51:36] It’s checking savings accounts. It’s a retail. Money market funds and CDs. And so that just means that supply is rising. That means just regular people all over the world suddenly have more cash. And what do they do with that? Yeah, they pay their bills. That’s going to be a bit of a relief for them from a consumption side.\n[00:51:53] But now they have more money to play with. And that’s why you start seeing the risk curve. People start to move out on the risk curve when this starts to happen. And I think what we’re starting to see and if you look at past cycles, obviously, well, how do I talk about this all the time? It feels just like it did back in 2016.\n[00:52:07] It feels just like it did back in 2020. When you have that kind of everybody’s just chomping at the bit. They’re just getting so impatient. I see people bailing. They’re like, I thought Bitcoin was awesome. I thought you said it was going to go up and I bought in at 55 or 60k and it’s just still sitting at 60k, 58k forever.\n[00:52:23] I hate this. And they’re bailing and I’m like, please, please don’t like this is when you want to be in right now. And so I think that the next 13 months we’re doing this on September 23rd. I think the next 13 to 14 months are just going to be lit and we’re going to start slowly at first. And then I think we’re going to get that exponential move higher as people start getting confidence.\n[00:52:42] The other thing I think people aren’t realizing. is there’s doom and gloom recessionistas all over the place still. I listen to them every morning. They’re good people. They’re smart economists, and they’re wrong. They’re just totally wrong. We are not headed into a recession. I think GDP is going to surprise to the upside.\n[00:52:59] I think manufacturing is going to start shooting higher and quickly. And once everybody figures that out, and we see that economies are actually starting to grow again, especially here in the US, it’s just going to be off to the races and it’s going to be bananas. So I’m very much looking forward to 2025.\n[00:53:13] Preston Pysh: Joe, do you agree with that?\n[00:53:15] Joe Carlasare: Yeah, I mean, look, I think it’s, it’s very hard for me to listen to recessionistas with some of the economic data we have. You see several cyclical sectors, which have been lagging, right? But overall aggregate growth, which is how you measure a recession has been robust, right?\n[00:53:31] You see unemployment, which is significantly below the 50 year average, hovering right above the 4%, 4. 2 percent actually ticked down last data point we had. You see that now we’re in an environment where inflation has effectively cratered, right? And you basically have seen inflation come down by the government standards at around 2.\n[00:53:48] 5. If you believe the private sector data, like we’re well under 2%, we’re well under the target. So why shouldn’t the Fed cut? I mean, honestly, the Fed, I was surprised they cut 50. I think that perhaps the deflation out of China. Is perhaps scaring them more than people expect. But reality is you look at the inflation data, they’re at target minus OER, which is the single laggard that’s holding up the basket.\n[00:54:10] And that’s going to take time to come down. So what is the reason for not cutting? And I was saying this months ago, like they probably should have cut it. The last meeting, I think it would have been better for them to cut 25 and 25 again. But I think they wanted to come out knowing that they’re going to have to wait until November for the next meeting to do a cut.\n[00:54:24] And they wanted to come out and signal that the cutting cycle is here. And what I will note is that if you were following the rates market, if you were following the bond market before the fed did anything right, the two year, the 10 year, most of the curve already told you that cuts were coming. They dropped significantly.\n[00:54:38] Mortgage rates reached a significant low, even before the first cut. So the transmission mechanism by the time the Fed is acting is really delayed. They’re really just following what the market had already done and already signaled with cutting rates, which is responding to the inflation impulse. So to me, I think it’s positive.\n[00:54:53] I still am frustrated beyond belief. I want to pull out my hair when I hear these things about, Oh, well, whenever the Fed’s cutting the stock market’s about to implode and go down 60%. I see these ridiculous charts and I’m sorry for getting worked up, but they’re infuriating where you see 2008.\n[00:55:08] Preston Pysh: We’re at all time, we’re at all time highs right now.\n[00:55:11] And if you think it’s going hot, it’s going to rip. We’re going to have a melt up from here.\n[00:55:15] Joe Carlasare: I don’t necessarily believe in the melt up thesis. I think you could do very well. You know, 15%, 20 percent move, mostly because some of these guys, the melt up guys have been calling for a melt up for like, you know, four years, there’s guys on Twitter that have, have said this, but I mean, look like this is an environment.\n[00:55:32] Where inflation has come down, you’ve had effectively a Goldilocks scenario where real growth remains above trend, nominal growth remains significantly high. You’ve got household net worth at all time record highs. Where is the weakness coming from? Explain, now obviously something can happen, right? You can get a catalyst any day.\n[00:55:49] You can get something to, You know, come out of left field and change the game. And that could be a significant headwind for the U S economy. But it’s not, I find it very difficult for, to look at some of these examples where an unemployment goes shooting up and people pull up a chart of 2020, or they pull up a chart of 2008, where you literally a contagion in the banking system, like the banking system was on the ropes, ready to fall apart.\n[00:56:09] And they’re going to say like, Oh, well, that’s going to happen next month. Next month, we’ll tune into this program. And all of a sudden there’s going to be 25 million Americans out on the street, eating cat food under a bridge. Like that just seems very unlikely. Hodl.\n[00:56:21] American Hodl: Well, you know, listen, Preston, Jeff and Joe are much smarter than me, especially about economics.\n[00:56:26] And they really get in the weeds with these kind of guys. And they argue all the finer points.\n[00:56:30] Joe Carlasare: No, I mean, like guys, you go back a little over a month ago. You could go on Twitter and there were people talking about great depression, like events from the yen carry trade blowup. I mean, I, I know Dr. Jeff heard some of these people, like,\n[00:56:44] American Hodl: I can’t, I’d love to hear his thoughts about it.\n[00:56:46] Oh, that was, that was a, that was a hilarious weekend. Everybody was an expert on the, the yen carry trade. It was amazing. Tell us all why we were all gonna be doomed,\n[00:56:54] Joe Carlasare: You know, and then a week later, okay, we’re off to all time highs .\n[00:56:57] Preston Pysh: Like, it wasn’t even a week later, it was two days later. It was two days later, it was like Monday hit.\n[00:57:04] And I mean, it looked like Armageddon Tuesday, I think was bad. And then Wednesday we were back to where we were at, like the market bid, whatever percent it was crazy.\n[00:57:15] Joe Carlasare: So what I would love to hear your take Preston, what message do you think that’s sending? I mean, if you look at these broad ray of at markets and you see them sending the message, what do you think they’re, what is the signal?\n[00:57:25] Preston Pysh: I don’t know. I think they’re going to plug any type of liquidity gap immediately. Like I don’t, and this was the crazy part with that one. I don’t even know what they actually did. I would assume they opened swap lines, but I, I didn’t read that anywhere in the wall street journal or anywhere, right? Like what did they do to plug that to stop the unwinding that was happening?\n[00:57:44] I mean, it is aggressive. Those two days were really aggressive. What did they do? I don’t know. Do you guys know?\n[00:57:51] Jeff Ross: I don’t know. I just think some trades unwinded and the markets settled at the new level and now we’re carrying on as usual.\n[00:57:57] Joe Carlasare: Yeah. I mean, there were some public reports about some of the BOJ finance ministers saying that they were prepared to hold off on future hikes and you know, that’s a really interesting subject, right?\n[00:58:06] The fact that. There’s still potential out there for hikes with Japan, right? Like further BOJ hikes to defend their currency, which if you go back six months or a year, right, all you heard about was when is the yen going to stop selling off against the dollar? Now it’s the exact opposite. What is the dollar going to find a bid against the yen, right?\n[00:58:22] And I think there’s reasons for driving that. One of which is, you know, the Fed ending, entering a cutting cycle, which was well telegraphed. And then the BOJ saying, we still are concerned somewhat about inflation. We want to continue to hike. So that differential is driving that action. And, That leverage unwind is not a systemic risk.\n[00:58:39] In my mind, it’s more of an isolated risk for traders. Like those traders in a mechanical way have to close their positions and sell down to draw down their margin effectively.\n[00:58:48] Preston Pysh: Well, in general, I think everybody’s bullish for the coming year. Like Christmas of 25. If we are, you know, fourth quarter.\n[00:58:56] Quarter of 25. If we’re recording where you think we’re talking about not the 58 K gang, we’re talking about the 580 K gang. Is that what’s what, what do you guys think?\n[00:59:06] Jeff Ross: Can we run sticking with my, this is the, I’m breaking all the Cardinal rules. You don’t pick a date and a price, but I’m doing both. I’m saying at Halloween of 2025, we’ll be at 475K.\n[00:59:17] Preston Pysh: Whoa, that’s really, Jeff, I’m surprised you’re saying this. Okay, I like it.\n[00:59:21] Jeff Ross: I’ve been saying this for like a year though, this is nothing new.\n[00:59:22] Preston Pysh: Wow, okay, 475, Halloween 25. Okay, Joe.\n[00:59:27] Joe Carlasare: I have no idea. I’ve had this hat, I don’t know if you can see it, probably blurry. You’re getting blurs.\n[00:59:33] Yeah, so I have had this hat. Let’s see. It’s a Bitcoin 100K hat right here. I have wanted to put this on since 2021. I got this as a gift from a client and I really hope I can wear it in the next year. That will make me happy. If I can wear the 100K Bitcoin hat, that’s a victory.\n[00:59:49] Jeff Ross: Joe, I’m going to guarantee that you’re going to wear the hat in 2025.\n[00:59:52] Joe Carlasare: I’m not going to take it off once I get it.\n[00:59:55] Preston Pysh: Hodl. Do you remember this guy? Parabolic Trab from the 2017 cycle and his shorts were going to a hundred K back then. Go ahead. Hodl. What do you think in the coming year?\n[01:00:07] American Hodl: Well, I already, I have promised a hundred K by this Thanksgiving, or I will eat a pumpkin pie and pumpkin pie is disgusting.\n[01:00:16] Okay. It’s the grossest food. It’s just a dirty gourd. You know, it’s horrible, horrible. All you pumpkin pie people are communist. Hey, we need to kick you out of America. Okay.\n[01:00:28] Preston Pysh: This is how I feel about, this is how I feel about sparkling water, but this is a whole another topic.\n[01:00:34] American Hodl: So yeah, I told somebody if we don’t hit a hundred K by Thanksgiving, I will eat a whole pumpkin pie by myself. This Thanksgiving.\n[01:00:41] Preston Pysh: Hold on. Doesn’t Peter have a bet with like Mike Green or something this year to hit a hundred K. I think he does. I think he does. I don’t know. Maybe he won’t.\n[01:00:51] American Hodl: Usually, historically, we do get bullish towards the end of the year. I think we have a bit of an overhang on taxes, which will settle out mid October, because crypto people are just total degens, and they don’t pay their taxes until the last possible minute.\n[01:01:05] And I know because I’m one of them, right? And it’s like, we got that coming up mid October. And then you always get the Thanksgiving effect where people are telling their family is about Bitcoin and people start getting bullish, et cetera. And like, I don’t know, things just tend to ramp up towards the end of the year.\n[01:01:18] I mean, that happened in 2020. It happened in 2016. I don’t see a reason why it wouldn’t happen again this time around. And then going forward, like Christmas time of 2025. I’m just as bullish as Jeff. And I do think that there’s a possibility that we take out this sort of higher lows thesis. You know, there’s always some sacred cow to be killed in Bitcoin in terms of narrative.\n[01:01:38] Last time it was never below the prior all time high. Well, we took that one out. Yeah, we did. We went down to 15 and I cried a little bit, but I got my big boy pants back on and I was, I’m doing okay now. But, you know, after I got done wiping my eyes with Kleenex, I was looking forward to the next cycle and I said, what’s the next sacred cow that we’re going to get rid of?\n[01:01:55] And I think maybe it’s higher lows. All right. Sorry. Yeah. Diminished return. Diminishing returns. Yeah.\n[01:02:01] Preston Pysh: You know what the Hodl, I think you might be right on that one. I would not be surprised. I hope I would not be surprised if you were right on that one.\n[01:02:07] American Hodl: And so if we do get to a level, let’s say, here’s how I anticipate it going.\n[01:02:11] We get to this level that’s like 180, 200 around there, right? Yeah. And everybody goes, right, this is it. We did it. This is the new all time high. I’m diminishing returns,\n[01:02:19] right? Yeah, yeah. I’m gonna sell. I’m gonna sell a\n[01:02:20] bunch of my Bitcoin. Look at me, I’m so smart. And then boom, it catches a crazy bid. It goes up to 500, and then everybody’s going, oh my God, I gotta get back in.\n[01:02:29] I gotta get back in. This is going to a million dollars.\n[01:02:30] Preston Pysh: It’s gotta go to 580. It has to go.\n[01:02:33] American Hodl: Well, and then once people pile back into the trade, that’s when you could get a real crazy problem going up because that’s when you could legitimately take a run at a million dollars because I mean, sitting on the sidelines, like if you got out at one 80 and Bitcoin goes to 500, you can’t sit on the sidelines, especially if you’re a longterm modeler.\n[01:02:52] No, no way. Right. So like, to me, I think if we do take out the diminished returns narrative, we could legitimately take a run at a million dollars and I, you know, it’s either going to be one or the other. We’re either going to stick low at like 200 or we’re going to a million.\n[01:03:05] Joe Carlasare: Well, what do you do? Any of you think that there’s a possibility that we go higher and in the six figures next year and then go higher the following year and then go higher the following year?\n[01:03:13] Because that’s usually my base. I mean, when I think about it, that’s my base case. I don’t believe. I think that people are screwed up from the collapse in the crypto markets, FTX institutional collapses in 2022. And they believe that the 80 percent drawdown is guaranteed. I don’t expect that this time.\n[01:03:27] Preston Pysh: Not with the wild card is what happens with the derivatives, what happens with the ETFs, what happens with these really large institutions that are just showing up. And James lavish says this all the time. He’s like, they don’t care what the price is. They’re just being told, Hey, I need, you know, this many millions or this many billions.\n[01:03:45] Of allocation into this thing, go get it. And I don’t know, I think it’s, yeah, it might be a little bit different, Joe. I don’t know.\n[01:03:53] American Hodl: I would love to be of the same opinion as you, Joe, but I’m just not, I think three greens, one red is an immutable law of the universe where your cycle is real. You know what I mean?\n[01:04:02] Jeff Ross: I think in, in Joe, to answer your question. If Global M two, you know, I’m very simple minded. If Global M two is still accelerating higher, then I would say it can keep going up in 2026. But I think we’re just gonna follow the cycle again. I think that’s, and it’s gonna roll over. I think it’s gonna roll over and then I’m gonna start telling everybody to get cautious and I’m gonna turn into mean, and Dr. GaN.\n[01:04:23] Joe Carlasare: Well, why do you think Global M Twos gonna, sorry, I gotta hear this. Why, why do you think Global M two is gonna decline in 2022?\n[01:04:27] Jeff Ross: ’cause it always, it’s just everything is cyclical and so it can’t keep going up for, it just just doesn’t go up in a, up into the right path. It’s always, it goes up too far too fast.\n[01:04:36] And then it’s going to roll over and then all the risk assets are going to follow and Bitcoin will lead the way. That’s what I think.\n[01:04:41] Preston Pysh: I’m with you, doctor.\n[01:04:43] Jeff Ross: I hope not though. I would love it, Joe. If you’ve talked about this before, I would love it. If it went up to like 75 K at the end of this year, and then the end of 25 was like 120 and then at 20, 26, it was like 150, like that would be fantastic, would be trading it.\n[01:04:57] You’d just be riding it higher.\n[01:04:59] Joe Carlasare: Everybody points to the equity market as being driven by the liquidity cycle. And you had a, you know, 20 year bull market in the equity market. Obviously you have sell offs and drawdowns, but you have a solid bull market that’s continued basically since the great financial crisis.\n[01:05:12] Preston Pysh: Yeah. But M2 was going up that whole time, Joe.\n[01:05:14] Joe Carlasare: Right. So why would Bitcoin sell off?\n[01:05:16] Preston Pysh: I think all Jeff was saying is you might get a respite for a year or two.\n[01:05:20] Jeff Ross: I, yeah, I’m a huge believer in this secular bull market continuing. I’m talking about, well, I think we can get a 75 percent drawdown though. I think if we go up to four, we hit my four 75 K target.\n[01:05:30] I’m going to be telling people, I think it’s going to go down to 75 K in 2026.\n[01:05:34] Preston Pysh: I mean, huddle saying it’s just one red dot. He’s not saying it’s two red dots, right? It’s just one red dot, a big deal. Yeah. It hurts. This is real analysis here, Joe.\n[01:05:46] Joe Carlasare: Yeah. Well, you know, that’s the meme that’s going to die. It’s going to die this time.\n[01:05:50] Preston Pysh: We’ll see. We’ll see. I like the confidence.\n[01:05:53] Jeff Ross: We make two promises to you. One is you’re going to get to wear your a hundred K Bitcoin hat this in 2025. I hope so. Hono, you’re going to be wrong. You’re going to lose another bet for being too bullish too soon. You’re going to eat a pumpkin pie and I want to watch that.\n[01:06:03] You should film that.\n[01:06:04] Preston Pysh: I mean, I like pumpkin pie, but the way he was describing it, it sounded disgusting.\n[01:06:12] Jeff Ross: My last thing is if we do get 475k in 2025 in fourth quarter, I am going to be using those options and I’m going to be buying What’s at that point,\n[01:06:22] Joe Carlasare: You know, how expensive that’s going to be.\n[01:06:26] Jeff Ross: That’s what I love about options. If it’s ripping higher, buying puts is going to be dirt cheap at that moment, because everyone’s going to be buying calls.\n[01:06:35] Preston Pysh: Cause they’re going to be listening to people saying, there’s going to be a lot of all that’s priced into that. Yeah. You’re right. Yeah. Everybody’s going to want the long.\n[01:06:42] American Hodl: Yeah. I’m going to do the dumb thing and just Hodl my way through, you know, up to a million down to 75. I’m just going to huddle. You know?\n[01:06:51] So that’s what I’ll be doing.\n[01:06:52] Preston Pysh: You and me both.\n[01:06:52] Jeff Ross: That’s what I do personally, by the way, I’m two different people when I’m a fund manager and when I’m just myself. Right. Yeah.\n[01:06:57] Preston Pysh: Yeah. All right. Let’s wrap right there. Guys. I can’t thank you enough. This was so much fun. I’m glad we just let our hair down there at the end and just kind of had a little bit of fun.\n[01:07:07] Hodl. Where can people find you?\n[01:07:09] American Hodl: I’m on Nostr. Check me out on Nostr. I don’t know how to give you the end pub or whatever. Just figure it out. You know, it’s complicated. You’ll get there.\n[01:07:15] Preston Pysh: Just look at how many followers he has and if he has a bunch, you’re probably looking at the right guy. Jeff Ross, and we’ll have a link in the show notes to primal or wherever you want us to link to, but I’ll have a link in primal, Jeff?\n[01:07:26] Jeff Ross: Saying for me, I’m just, and so people know I’m only on Nostr now. So if you see me anywhere else on telegram or LinkedIn or Twitter, it’s not me. So it’s a scam.\n[01:07:35] Preston Pysh: Two for two on Nostr only wow. We’ll have your link, primal link. So people know where you’re at on the Nostr. Joe, are you only on the Nostr?\n[01:07:45] Joe Carlasare: I’m not only on Nostr, I’m also on Twitter. Also known as X at Joe Carlasare.\n[01:07:49] If you have a litigated dispute, you can reach out to me. I am almost at a hundred percent crypto cases and new cases being generated. I try to get rid of some of my old ones, but that’s awesome. So any litigated disputes in the broader mining space or crypto space or Bitcoin space, I’d love to help you and just Google my name.\n[01:08:05] You’ll find my website, but yes, I am on Nostr, but I do not post enough. I’m told that I should be more active, which I will make a New Year’s Eve resolution to do this year and probably do it. I love it.\n[01:08:16] Preston Pysh: We’ll make sure you do that in the fourth quarter update. So, gents, this was awesome. Thank you so much for your time.\n[01:08:22] I really, really look forward to doing these every quarter and you guys are amazing. So, appreciate all of it.\n[01:08:28] Jeff Ross: Thanks Preston.\n[01:08:29] American Hodl: Thanks guys.\n[01:08:30] Outro: Thank you for listening to TIP. Make sure to follow Bitcoin Fundamentals on your favorite podcast app and never miss out on episodes to access our show notes, transcripts, or courses, go to theinvestorspodcast. com. This show is for entertainment purposes only. Before making any decision, consult a professional. This show is copyrighted by The Investor’s Podcast Network. Written permission must be granted before syndication or rebroadcasting.\nHelp us reach new listeners by leaving us a rating and review on Spotify! It takes less than 30 seconds, and really helps our show grow, which allows us to bring on even better guests for you all! Thank you – we really appreciate it!\nSupport our free podcast by supporting our sponsors:\nCONNECT WITH PRESTON\nCONNECT WITH JOE\nCONNECT WITH JEFF\nCONNECT WITH HODL\nWe are an exclusive business podcast network which aims to educate people all over the world about how to grow financially and personally.\nWe Study Billionaires Bitcoin Fundamentals Richer, Wiser, Happier The Intrinsic Value Podcast Millennial Investing Real Estate 101 The Good Life Silicon Valley\nTIP Academy TIP Finance Forum Advertising Contact Us\nPrivacy Policy Terms & Conditions Disclaimer Cookie Policy Consent Preferences\nWe are an exclusive business podcast network which aims to educate people all over the world about how to grow financially and personally.\nWe Study Billionaires Bitcoin Fundamentals Richer, Wiser, Happier The Intrinsic Value Podcast Millennial Investing Real Estate 101 The Good Life Silicon Valley\nTIP Academy TIP Finance Advertising Contact Us\nPrivacy Policy Terms & Conditions Disclaimer Cookie Policy\nWe are an exclusive business podcast network which aims to educate people all over the world about how to grow financially and personally.\nJOIN OUR NEWSLETTER:\nSHOWS\nWe Study Billionaires Bitcoin Fundamentals Richer, Wiser, Happier The Intrinsic Value Podcast Millennial Investing Real Estate 101 The Good Life Silicon Valley\nQUICKLINKS\nTIP Academy TIP Finance Forum Advertising Contact Us\nPrivacy Policy Terms & Conditions Disclaimer Cookie Policy\nThe Investor’s Podcast Network © 2025 All Rights Reserved.\nThe Investor’s Podcast Network © 2025\nAll Rights Reserved."]}
{"date":"2024-10-03","titles":["1 Top Cryptocurrency With 5,789% Upside by 2030, According to Cathie Wood","Next Big Crypto to Explode for Next Bull Run [2024 Updated List]"],"urls":["https:\/\/finance.yahoo.com\/news\/1-top-cryptocurrency-5-789-081200741.html","https:\/\/financefeeds.com\/next-big-crypto-to-explode-for-next-bull-run-2024-updated-list\/"],"sources":["finance.yahoo.com","financefeeds.com"],"descriptions":["Cathie Wood's most recent price target for Bitcoin is even higher than the target issued by her own firm.","What if the next big crypto boom could turn you into a millionaire?"],"article_contents":["Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCathie Wood is the founder and chief investment officer of Ark Investment Management, which operates several exchange-traded funds focused on innovative technology stocks. Electric vehicles, e-commerce, space exploration, artificial intelligence (AI), and cryptocurrency are just some of the areas Ark is betting on right now.\nArk is very bullish on Bitcoin (CRYPTO: BTC), which is the world's largest cryptocurrency by market capitalization. The firm's official research suggests Bitcoin could soar 2,193% by 2030, but Wood herself came out with a new price target earlier this year which implies a whopping 5,789% upside instead.\nBullish sentiment appears to have returned to the cryptocurrency market, and Bitcoin is trading near a record high right now. But is Wood's prediction realistic?\nBitcoin is a truly decentralized cryptocurrency because it isn't governed by any one person or institution. It's built on a blockchain, which is an accurate, transparent, and autonomous system of record. For those reasons, many crypto enthusiasts have often touted Bitcoin as a viable alternative to traditional money.\nHowever, it's incredibly volatile. Bitcoin is up over 17,000% in the last 10 years alone, obliterating the return of every other major asset class. But it has also plunged 70% from its all-time high on two occasions during that period:\nVolatility makes cash flow management almost impossible for any business accepting Bitcoin as a primary means of payment for goods and services, which is probably why only 9,331 merchants in the entire world are willing to do so (according to CryptWerk). If consumers can't spend their Bitcoin at their favorite stores, they don't have much incentive to own it.\nBitcoin investors, however, will cite Bitcoin's favorable supply-and-demand dynamics as a reason for further upside. Supply is limited to 21 million coins, which are paid to miners who use powerful computers to add new blocks to the blockchain. A halving occurs with every 210,000 new blocks, which cuts the mining reward in half. According to most estimates, the last Bitcoin will be mined sometime around the year 2140.\nSince supply is capped, any new source of demand will theoretically drive the price per Bitcoin higher. As of this writing, more than 46 million crypto wallets hold Bitcoins or partial Bitcoins, and that number is gradually trending higher. Plus, the approval of exchange-traded funds (ETFs) earlier this year by the Securities and Exchange Commission is creating new demand from institutional investors.\nHowever, those factors alone probably won't be enough for Bitcoin to reach Cathie Wood's lofty price target.\nArk outlines eight potential reasons for further upside in Bitcoin in the coming years. Some are a little fanciful -- for example, Ark thinks high-net-worth individuals will buy Bitcoin because it's a seizure-resistant asset, but regulators have successfully confiscated significant amounts of the cryptocurrency in recent years, so that doesn't hold much water in my opinion.\nHowever, three of the eight catalysts stand out to me as viable drivers of potential upside:\nEmerging market currency: The decentralized nature of Bitcoin makes it an intriguing replacement for traditional money in countries with political and economic instability or corruption, because the blockchain can't be manipulated by governments. El Salvador is running this experiment right now, so time will tell whether Bitcoin works in that setting.\nInstitutional investment: Bitcoin ETFs provide financial advisors and institutions with a legitimate, regulated way to add the cryptocurrency to their portfolios. Buying an ETF is still a speculative bet on further upside, but having a broader investor base could be a positive catalyst for higher prices over the long term.\nDigital gold: Ark thinks between 20% and 50% of the money investors normally allocate to gold could flow into Bitcoin instead. Since it's more portable than gold and has also significantly outperformed the yellow metal, that isn't a crazy prediction.\nBitcoin is trading at $64,518 as of this writing, but Ark thinks the above catalysts could catapult it to $1.48 million per coin by 2030. That represents a potential return of 2,193%.\nBut Wood issued a fresh price target of $3.8 million when she was speaking at the Bitcoin Investor Day back in March, which implies a staggering potential upside of 5,789% from here.\nWood cites the approval of Bitcoin ETFs as her main reason for the $3.8 million target. So far, more than 30 cryptocurrency funds have been approved by the SEC (including two managed by Ark), and they have a combined $61 billion in assets under management. She says if institutional investors allocated just 5% of their total assets under management to Bitcoin and Bitcoin ETFs, that alone would be enough to warrant a price of $3.8 million per coin.\nThere are a couple of problems with that prediction. First, Bitcoin ETF inflows have tapered off since earlier this year, which suggests demand from institutional investors is slowing. Second, Bitcoin would have a fully diluted market capitalization of $79.8 trillion if it reached a price of $3.8 million per coin, making it almost three times as valuable as the entire U.S. economy by gross domestic product.\nBitcoin would also be 23 times more valuable than Apple, which is the world's largest company, and four times more valuable than all the above-ground gold reserves on Earth.\nTherefore, a Bitcoin price of $3.8 million is extremely unlikely, in my opinion. Using Bitcoin as a store of value does make sense, but in that case, I think investors should be targeting the market cap of gold, which currently stands at $17.9 trillion. That would translate to a Bitcoin price of $852,380, which still represents a 13-fold gain from where it currently trades.\nBefore you buy stock in Bitcoin, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bitcoin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $716,988!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of September 30, 2024\nAnthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Bitcoin. The Motley Fool has a disclosure policy.\n1 Top Cryptocurrency With 5,789% Upside by 2030, According to Cathie Wood was originally published by The Motley Fool","The Canadian Securities Administrators (CSA) have issued a set of coordinated blanket orders effective April\nThe Ontario Securities Commission (OSC) has reached a detailed settlement with Blockratize Inc. and Adventure\nECB cuts rates, Fed holds steady; trade tensions persist; global economic data influences rate expectations\nAfter years of uncertainty, stablecoin regulation is finally gaining momentum on Capitol Hill. Three competing\nInstitutional DeFi is accelerating, with tokenized assets moving on-chain, and stablecoin transactions surpassing $15.6 trillion\nThis Week in FX Webull is now listed on Nasdaq after merging with SK Growth.\nCrypto exchange Kraken has added foreign exchange (forex) perpetual futures to its Kraken Pro platform,\nDiscount broker Webull and SPAC company SK Growth have closed their previously announced business combination,\nThe Cyprus Securities and Exchange Commission (CySEC) has slapped Lee Ron More, the Executive Director,\nBrent crude oil can be expected to rise to the next round resistance level 70.00,\n24 Exchange reported a record daily volume of $7.5 billion in foreign exchange non-deliverable forward\nTrading software and liquidity services provider Finalto will sponsor the 2025 Alphaville London Pub Quiz,\nFor fintech startups, 2025 presents a paradox: immense opportunities paired with significant challenges. With Trump’s\nWith Bitcoin going through the roof in 2024 and the entire crypto market showing substantial\nBitcoin has stood the test of time, proving itself as the most secure decentralized network.\nCross-border e-commerce is expected to exceed $3 trillion globally by 2028, and the need for\nMoneyGram has selected Plaid as its pay-by-bank provider in the United States, integrating Plaid’s account\nUnit No: BA857 DMCC Business Centre Level No 1 Jewellery & Gemplex 3 Dubai, United Arab Emirates.\nInternational House, 10 Admirals Way, London, England, E14 9XL."]}
{"date":"2024-10-04","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-10-07","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-10-08","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-10-09","titles":["Ancient Bitcoin (BTC) Whales Still Sleeping, According to CryptoQuant CEO"],"urls":["https:\/\/dailyhodl.com\/2024\/10\/09\/ancient-bitcoin-btc-whales-still-sleeping-according-to-cryptoquant-ceo\/"],"sources":["dailyhodl.com"],"descriptions":["The head of blockchain analytics platform CryptoQuant says that ancient Bitcoin (BTC) whales are largely remaining dormant."],"article_contents":["The head of blockchain analytics platform CryptoQuant says that ancient Bitcoin (BTC) whales are largely remaining dormant.\nKi Young Ju tells his 363,800 followers on the social media platform X that the Spent Output Age Bands (SOAB) metric indicates long-term holders of Bitcoin are not moving their coins.\nThe SOAB bundles spent coins into categories depending on their age and presents them in colored bands as a proportion of total coins moved.\n“Ancient Bitcoin whales are still sleeping. Moving Bitcoins dormant for seven-plus years has historically triggered market volatility, depending on source and destination. (Mt. Gox excluded in this chart). If you were an ancient whale, what would you do now?”\nJu also says this cohort of Bitcoin holders is largely not sending their coins to crypto exchanges, which would indicate a sell-off is potentially imminent.\n“No signs of significant BTC deposits to exchanges from these ancient whales as well.”\nBitcoin is trading for $62,126 at time of writing, down slightly in the last 24 hours.\nWeighing in on the altcoin market, Ju says that a lack of regulatory clarity in the United States for crypto is creating a headwind for many digital asset projects, including UNI, the native asset of the Uniswap decentralized exchange (DEX).\n“Some altcoins with real value aren’t rising due to regulatory hurdles. They can generate revenue but are very cautious in doing so. For example, if Uniswap’s fee switch had been activated, its treasury could hold $314 million. Currently, there are $408 million worth of UNI on centralized exchanges. If the treasury were used for buybacks, prices could have surged by 10x-100x, depending on order book depth. (Not financial advice; I don’t hold UNI.)\nIf [Donald] Trump wins [the US presidential election in November], expect regulatory changes, including fee switches enabling token burns for revenue-generating projects… Alts could rally if Trump wins, but for now, it’s all gambling in an unregulated space.”\nUNI is trading for $7.30 at time of writing, up 3.5% in the last 24 hours.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-10-10","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-10-11","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-10-14","titles":["Mortgages and Cryptos: How Well They Work Together?"],"urls":["https:\/\/financefeeds.com\/mortgages-and-cryptos-how-well-they-work-together\/"],"sources":["financefeeds.com"],"descriptions":["Cryptos have become one of the most used currencies in the world. According to certain studies, at least 617 million people use BTC or other kinds of token to"],"article_contents":["Cryptos have become one of the most used currencies in the world. According to certain studies, at least 617 million people use BTC or other kinds of token to buy products or pay services online and in physical stores. However, how good are they when it comes to paying mortgages? Well, the answer can be found right here.\nA cryptocurrency is a form of digital money that isn’t backed up by any sort of government or bank. The name of these so-called “coins” or “tokens” comes from the fact that they use a special type of cryptography to make each of them unique, a person with 1 Bitcoin won’t ever find another one with the exact same coin.\nThe first crypto ever made was Bitcoin in 2009, since then there have been hundreds of new tokens in the market. According to recent reports, there’s at least over 10,000 different cryptos circulating right now, and it doesn’t seem the number will go down anytime soon.\nA few years ago, these currencies were mostly obtained through “mining” which involved solving mathematical problems using a computer. However, many important platforms like Solana and Cardano have begun shifting recently to a Proof of Stake system, which requires “staking” coins as a collateral for the chance of validating blocks and earning more of them.\nOf course, mining and staking coins is not the only way to access cryptos. Many people often exchange them for FIAT currencies like USD, EUR or GBP.\nThe short answer is: they don’t. Banks in the UK and US tend to only operate with FIAT currencies, so they won’t accept payments with cryptos. With that said, some Fintech companies like Milo in the USA have begun offering mortgages loans with crypto wallets as the collateral and also accept them as payment, so things could change in the future.\nPeople can also exchange cryptos for FIAT currencies and use that money to pay the bank or request mortgages with it. Some countries like El Salvador have even started accepting Bitcoin as a legal tender, so it might be possible to use it in the future for any kind of transaction.\nWhen it comes to mortgages, there are steps that can be extremely complicated, specially for those who are inexperienced in this area, and that is where a mortgage broker can be useful.\nSome of these experts accept cryptocurrencies as payment, but it’s not common, so those interested in hiring one will likely have better luck paying with FIAT currencies.\nSince cryptocurrencies can’t be used in banks, a lot of people tend to discard them as an option for mortgages entirely, without noticing some of the following benefits:\nWith all this said, it’s important to note that cryptos can also lose their value over time, and while they are unaffected by governments, they can set laws and regulations that can forbid their use in any sort of transaction related to mortgage.\nAlthough cryptocurrencies have a lot of advantages, lenders across different countries tend to deny mortgages for people who use them, due to two simple reasons: money-laundering and volatility.\nTransfers made with crypto are completely anonymous. While this ensures the security of both parties, it also opens the gates for anyone who is looking to launder FIAT currencies without tracking.\nDue to anti-money laundering regulations, anyone looking for a mortgage in the UK, must prove the origins of their funds, which isn’t always easy to do with cryptocurrencies.\nBesides regulations, cryptos are also constantly affected by a huge market volatility, which can severely impact the value of any coin, turning thousands of sterling pounds to cents in a matter of seconds. Since that market is completely unregulated, it can leave lenders in a tight spot where the funds used as collateral can end up with no value.\nThere are people who only earn money either by trading crypto or through mining, in these cases, the best option is to contact a broker with experience on cryptocurrencies, since these are most likely to know lenders who accept these coins.\nCrypto Holders should also make a proper register of each transaction or exchange made with the crypto wallet, so it can be traced back and avoid issues with any law.\nAfter registering the exchanges, all that is left is to declare the incomes obtained to the HMRC and pay the respective taxes, so everything is in order.\nThe subject matter and the content of this article are solely the views of the author. FinanceFeeds does not bear any legal responsibility for the content of this article and they do not reflect the viewpoint of FinanceFeeds or its editorial staff.\nUnit No: BA857 DMCC Business Centre Level No 1 Jewellery & Gemplex 3 Dubai, United Arab Emirates.\nInternational House, 10 Admirals Way, London, England, E14 9XL."]}
{"date":"2024-10-15","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-10-16","titles":["Michael Saylor Issues Bitcoin 'To Moon' as BTC Hits $68,000 Price By U.Today"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/michael-saylor-issues-bitcoin-to-moon-as-btc-hits-68000-price-3666974"],"sources":["investing.com"],"descriptions":["Michael Saylor Issues Bitcoin 'To Moon' as BTC Hits $68,000 Price"],"article_contents":[null]}
{"date":"2024-10-17","titles":["The 10 Best Bitcoin ETFs to Buy Right Now"],"urls":["https:\/\/medium.com\/@isreal_20144\/the-10-best-bitcoin-etfs-to-buy-right-now-8827cdd26b4a"],"sources":["medium.com"],"descriptions":["The continuous rise of Bitcoin as a mainstream asset class has led to a growing interest in Bitcoin ETFs (Exchange-Traded Funds). These financial products offer..."],"article_contents":["Sign in\nSign in\nUEEx Technology Ltd\nFollow\n--\nThe continuous rise of Bitcoin as a mainstream asset class has led to a growing interest in Bitcoin ETFs (Exchange-Traded Funds). These financial products offer investors a way to gain exposure to Bitcoin without having to directly purchase or manage the cryptocurrency themselves.\nThis also solves the issue of security risks and crypto market volatility for investors. However, with various Bitcoin ETFs available, choosing the right one can be challenging.\nTo solve this problem, we have created this article that will review the 10 best Bitcoin ETFs to buy, analyzing their suitability for different types of investors.\nKey Points:\nA Bitcoin exchange-traded fund (ETF) provides an opportunity for investors to gain exposure to Bitcoin without directly purchasing the cryptocurrency. This simplifies the investment process by allowing users to bypass the need to sign up for a crypto exchange or manage digital wallets.\nIn traditional investing, an ETF is a type of investment fund that tracks the price of a single asset or a group of assets. ETFs offer a convenient way to invest in multiple assets simultaneously without the need to hold the actual assets.\nFor example, instead of buying gold bars, you buy ETFs that track the price of gold known as Gold ETFs.\nIn the case of Bitcoin, a Bitcoin ETF tracks the price of Bitcoin (BTC). By investing in a Bitcoin ETF, investors can benefit from Bitcoin’s price movements without having to purchase the cryptocurrency themselves.\nThis helps to avoid the complexities of setting up an exchange account and undergoing various verification processes.\nBitcoin ETFs use various mechanisms to replicate Bitcoin’s price movements, resulting in different types of ETFs. Here are the two primary types:\nThis type of ETF invests in Bitcoin futures contracts instead of holding Bitcoin directly, These contracts are agreements to buy or sell Bitcoin at a predetermined price on a specific date in the future.\nFutures contracts are typically used for speculation or hedging, and while anyone can purchase Bitcoin directly at any time, a futures ETF allows users to gain exposure to Bitcoin and its futures contracts without the hassle of dealing with exchanges.\nFurthermore, the value of the ETF is linked to the performance of these futures contracts, rather than the actual price of Bitcoin. This is the structure used by the ProShares Bitcoin Strategy ETF (BITO), the first Bitcoin ETF launched in the U.S in October 2021.\nNote that this approach often comes with lower fees compared to many cryptocurrency exchanges. However, since futures ETFs don’t track Bitcoin at its spot price, some crypto enthusiasts may not view them as “true” crypto investments.\nAdditionally, companies offering a Bitcoin futures ETF may charge annual fees, prompting some investors to seek alternative ETF options that better align with their expectations.\nUnlike Bitcoin ETFs, a spot Bitcoin ETF invests directly in the cryptocurrency itself, providing more direct exposure to Bitcoin’s market movements. Therefore, when an investor buys shares of a spot Bitcoin ETF, they are essentially buying a portion of the Bitcoin held by the fund, similar to how a physically backed gold ETF operates.\nSpot Bitcoin ETFs have historically faced regulatory challenges due to concerns about market manipulation and the inherent volatility of cryptocurrencies. However, on January 10th, 2024, the United States Securities and Exchange Commission (SEC) approved 11 spot Bitcoin ETFs, marking a significant policy shift.\nThese approved ETFs include offerings from prominent financial institutions such as ARK Invest, 21Shares, Bitwise, BlackRock, Grayscale, and Fidelity, among others.\nIn essence, Spot Bitcoin ETFs are designed to closely mirror Bitcoin’s price fluctuations. This offers investors a more precise alignment with the cryptocurrency’s market performance compared to futures-based ETFs, which can sometimes deviate from the actual price of Bitcoin.\nIn light of this, we can imply that this direct holding strategy makes spot Bitcoin ETFs a more straightforward option for investors seeking exposure to Bitcoin’s price movements.\n“The SEC’s approval acts as a crucial regulatory endorsement for the world’s largest crypto asset, potentially alleviating some investor concerns about entering the cryptocurrency market.”\nChoosing the best Bitcoin ETF involves considering several critical factors to ensure that your investment aligns with your goals. Here are some key steps to help you select the right Bitcoin spot ETF:\nBy carefully evaluating these factors, you can select a Bitcoin spot ETF that best suits your investment strategy and risk tolerance.\n“While spot Bitcoin ETFs are intended to closely track the price of Bitcoin by holding the actual asset, there is no guarantee that they will deliver returns identical to those of the cryptocurrency itself”\nProshares Bitcoin Strategy ETF image\nOur top pick for the 10 best Bitcoin ETFs to buy is the ProShares Bitcoin Strategy ETF (BITO). This was the first Bitcoin-linked ETF to launch in the U.S., making headlines in October 2021. Unlike some ETFs that hold Bitcoin directly, BITO invests in Bitcoin futures contracts, providing indirect exposure to the cryptocurrency.\nBITO’s performance is closely tied to the movements of Bitcoin futures, which can differ from the spot price of Bitcoin due to backwardation in futures markets. As such, its performance may not perfectly mirror Bitcoin’s spot price.\nBITO is suitable for investors seeking exposure to Bitcoin through futures contracts and who are comfortable with the potential for tracking error relative to the spot price of Bitcoin.\nThe Valkyrie Bitcoin Strategy ETF (BTF) is another futures-based Bitcoin ETF that offers exposure to Bitcoin through futures contracts traded through Nasdaq.\nBTF’s performance is influenced by the dynamics of Bitcoin futures, which can result in differences from Bitcoin’s spot price. Therefore, investors should be aware of the potential for discrepancies due to the nature of futures contracts.\nBTF is ideal for investors who want to diversify their exposure to Bitcoin futures and are interested in a product from a firm known for its focus on digital assets.\nThe VanEck Bitcoin Trust (HODL) provides investors with passive exposure to Bitcoin’s price movements by purchasing shares, enabling them to track Bitcoin’s performance without the need to directly own or manage the digital currency.\nHODL passively tracks Bitcoin’s market price by using the MarketVector Bitcoin Benchmark Rate, which aggregates data from the top five Bitcoin trading platforms. This benchmark rate is backed by the CCData Centralized Exchange Benchmark Review Report, employing a methodology that assesses a variety of risk factors across eight categories.\nConversely, this approach is intended to enhance transparency and accountability within the digital asset trading sector.\nHODL is suitable for investors looking for a lower-cost option and who value the reputation of the VanEck brand.\nThe Global X Blockchain & Bitcoin Strategy ETF (BITS) is an actively managed fund designed to capture the long-term growth potential of blockchain and digital assets. Rather than investing directly in Bitcoin, BITS provides exposure to blockchain companies through investments in other ETFs, such as the affiliated Global X Blockchain ETF (BKCH).\nThis approach offers investors exposure to both Bitcoin futures prices and the returns of publicly traded companies within the crypto ecosystem, such as miners and exchanges.\nBITS provides efficient access to both Bitcoin futures and blockchain technology stocks through a single trade.\nBITX is ideal for investors who prefer to somewhat diversify within crypto and are seeking a lower expense ratio.\nAnother one of our 10 best Bitcoin ETFs to buy is GBTC. Although not an ETF in the traditional sense, the Grayscale Bitcoin Trust (GBTC) operates similarly to an ETF by providing exposure to Bitcoin. GBTC is designed to passively invest in Bitcoin, with the aim to reflect the value of Bitcoin held by the Trust, minus expenses and other liabilities.\nGBTC’s performance is closely aligned with Bitcoin’s spot price but can be influenced by the premium or discount at which shares trade relative to the Net Asset value (NAV).\nGBTC is suitable for investors seeking exposure to Bitcoin and who are willing to accept potential premiums or discounts relative to the NAV.\nARK Invest, led by renowned investor Cathie Wood, has teamed up with 21Shares to launch the ARK 21Shares Bitcoin ETF (ARKB). This ETF is designed to provide direct exposure to Bitcoin by holding the digital currency itself in a secure manner.\nWhile ARKB is a newer entrant to the market, its performance is expected to closely mirror the price of Bitcoin. ARK Invest’s reputation for identifying high-growth opportunities suggests that ARKB could have strong long-term potential, especially as Bitcoin adoption continues to grow.\nARKB stands out for its focus on innovation, reflecting ARK Invest’s broader strategy of investing in disruptive technologies. The ETF caters to long-term investors who believe in the transformative potential of Bitcoin and other blockchain technologies. ARK Invest’s collaboration with 21Shares, a leader in crypto ETPs, adds credibility and expertise to the fund.\nThe Invesco Galaxy Bitcoin ETF is an exchange-traded product that issues common shares, trading on Cboe BZX under the ticker symbol “BTCO.” The Trust aims to mirror the performance of the spot price of Bitcoin, as determined by the Lukka Prime Reference Rate, minus the Trust’s expenses and other liabilities.\nGiven its direct exposure to Bitcoin, BTCO’s performance is closely tied to the cryptocurrency’s price movements. The ETF’s structure ensures that it closely follows Bitcoin’s market price, making it a reliable vehicle for those looking to capitalize on Bitcoin’s potential growth.\nBTCO is suitable for investors who prioritize security and transparency in their Bitcoin investments. It’s also an excellent choice for those who trust established names in both traditional finance and the cryptocurrency sector, and who want a straightforward way to gain exposure to Bitcoin.\nBitwise, known for its innovative approach to cryptocurrency investment, offers the Bitwise Bitcoin ETF (BITB). This ETF provides direct exposure to Bitcoin, focusing on delivering accurate and reliable pricing through regulated exchanges.\nBITB’s performance is expected to align closely with the price of Bitcoin due to its direct exposure model. As one of the more cost-efficient options in the market, BITB is particularly attractive for long-term investors who want to maximize their returns by minimizing fees.\nBITB is ideal for cost-conscious investors who want straightforward Bitcoin exposure without unnecessary complexities. It’s also suitable for those who value transparency and want a reliable investment vehicle managed by a firm with deep expertise in cryptocurrency.\nThe WisdomTree Bitcoin Fund (BTCW) is an exchange-traded fund designed to provide exposure to the price of Bitcoin by holding the cryptocurrency directly, minus any expenses and liabilities. The Fund typically values its shares daily based on an independently calculated price derived from the aggregated trade data of major Bitcoin spot exchanges.\nDirect exposure: BTCW benefits from WisdomTree’s reputation for creating investor-friendly products. It offers an easy-to-understand structure with direct exposure to Bitcoin, making it accessible to a wide range of investors.\nCost-effective: WisdomTree’s focus on providing a cost-effective, transparent investment pathway enhances its appeal. Conversely, the total asset is modest at just $226,676, while the expense is 0.25%.\nAs with other direct exposure Bitcoin ETFs, BTCW’s performance is tightly correlated with Bitcoin’s market price. The fund’s design ensures that investors receive a transparent and cost-effective way to invest in Bitcoin, making it a reliable option for those looking to diversify their portfolios with cryptocurrency exposure.\nBTCW is suitable for investors looking for a straightforward, no-frills approach to Bitcoin investment. It’s particularly appealing to those who prefer established ETF providers and are focused on cost efficiency.\nRounding off our 10 best Bitcoin ETFs to buy is the iShares Bitcoin Trust ETF (IBIT). This passively managed fund is designed to track the spot price of Bitcoin, with the aim to minimize expenses and liabilities. It offers investors a way to gain exposure to Bitcoin without the complexities of directly acquiring, holding, or trading the cryptocurrency on digital asset platforms.\nIBIT is suitable for investors seeking access to Bitcoin through an exchange-traded product, eliminating the operational, tax, and custody complexities associated with direct Bitcoin holdings.\nAfter going through our 10 best Bitcoin ETFs to buy, you might be wondering if it’s time to go ahead and invest.\nWhether a Bitcoin ETF is a good investment depends significantly on an individual’s financial situation, risk tolerance, and investment goals. Due to Bitcoin’s inherent price volatility, a Bitcoin fund may be unsuitable for risk-averse investors with short-term goals. However, an aggressive investor with a high-risk tolerance and a long-term horizon might consider adding a Bitcoin ETF to their portfolio.\nRegardless of risk tolerance, financial advisors generally recommend limiting high-risk investments, such as crypto-related securities and technology sector funds, to no more than 5% of a portfolio.\nIt’s crucial to conduct thorough research and, if necessary, consult with a financial advisor to ensure that a chosen Bitcoin ETF aligns with your investment objectives and risk tolerance. Additionally, staying informed about market conditions and the ETF’s performance over time is essential.\nInvesting in Bitcoin ETFs offers a convenient way to gain exposure to the cryptocurrency market without the need to directly handle or store Bitcoin. Each of the 10 Bitcoin ETFs highlighted provides unique features and benefits tailored to different investor needs.\nHowever, when choosing a Bitcoin ETF, consider your investment goals, cost preferences, and the type of exposure you seek. Each ETF has its own advantages and trade-offs, making it important to align your choice with your investment strategy and risk tolerance.\nThe World’s Leading Digital Wealth Management Platform\nHelp\nStatus\nAbout\nCareers\nPress\nBlog\nPrivacy\nRules\nTerms\nText to speech"]}
{"date":"2024-10-18","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-10-21","titles":["NYSE gets green light to list bitcoin ETF options as SEC broadens market access","The SEC greenlit Bitcoin ETF options trading. Here come the big fish","Bitcoin Is Up 53% This Year, But This Cryptocurrency Is Doing Even Better"],"urls":["https:\/\/financefeeds.com\/nyse-gets-green-light-to-list-bitcoin-etf-options-as-sec-broadens-market-access\/","https:\/\/qz.com\/spot-bitcoin-etfs-options-trading-sec-nyse-cboe-1851677472","https:\/\/finance.yahoo.com\/news\/bitcoin-53-cryptocurrency-doing-even-091700765.html"],"sources":["financefeeds.com","qz.com","finance.yahoo.com"],"descriptions":["The SEC has given the green light for 11 exchange-traded funds (ETFs) to begin trading options tied to Bitcoin spot prices on the New York Stock Exchange.","Spot Bitcoin ETF options trading will further increase Bitcoin’s adaptability among investors","This meme token is a shadow of its former self, but it's still outperforming the world's biggest cryptocurrency in 2024."],"article_contents":["The U.S. Securities and Exchange Commission (SEC) has given the green light for 11 exchange-traded funds (ETFs) to begin trading options tied to Bitcoin spot prices on the New York Stock Exchange.\nBack in January, the SEC made headlines by approving Bitcoin ETFs to track the cryptocurrency directly, a pivotal moment for both Bitcoin and the broader crypto market. Now, several major funds have received approval to offer these options.\nAccording to memos published by the SEC, the New York Stock Exchange (NYSE) will now be able to list and trade options on several Bitcoin-related funds, including the Grayscale Bitcoin Trust (GBTC), Grayscale Bitcoin Mini Trust (BTC), and the Bitwise Bitcoin ETF (BITB). Meanwhile, Cboe Global Markets received approval to list options on the Fidelity Wise Origin Bitcoin Fund (FBTC) and the ARK 21Shares Bitcoin ETF (ARKB).\nThis move follows the SEC’s recent approval for Nasdaq to list and trade options on BlackRock’s iShares Bitcoin Trust (IBIT). Many believe this will lead to increased institutional interest in crypto, boosting liquidity and market activity.\nThese options, which allow investors to buy or sell Bitcoin-related assets at a set price within a specific timeframe, are designed to provide institutional investors with a new tool to manage their Bitcoin exposure. This could make investing in Bitcoin more accessible and manageable, particularly for those looking to hedge against market volatility.\nEarlier in August, US-based Cboe Exchange  filed an amended application with regulators to list options on Bitcoin and Ether exchange-traded funds (ETFs).\nOptions contracts provide the right to buy or sell an underlying asset at a specific price, functioning as a hedge or a speculative instrument. Interest in cryptocurrency derivatives on regulated exchanges is growing in the U.S.\nPlans to list Solana (SOL) ETFs also remain active. VanEck’s plans for a Solana ETF are “still in play,” despite Cboe Global Markets withdrawing a regulatory filing proposing to list the fund on its exchange, according to VanEck’s head of digital assets research.\nThe SEC’s stance on Solana was not unexpected, as the agency previously labeled Solana as a security in various court filings. Issuers are now considering new filings or amendments to the 19b-4 forms to argue more effectively that Solana should not be classified as a security.\nWhile Bitcoin and Ethereum ETFs have successfully cleared regulatory hurdles and started trading, market analysts have remained skeptical about the chances for Solana ETFs.\nUnit No: BA857 DMCC Business Centre Level No 1 Jewellery & Gemplex 3 Dubai, United Arab Emirates.\nInternational House, 10 Admirals Way, London, England, E14 9XL.","The Securities and Exchange Commission (SEC) has granted approval for the NYSE American LLC and CBOE to list options on spot Bitcoin exchange-traded funds (ETFs), marking a significant development in cryptocurrency history. This approval paves the way for institutional investors, or “big fish,” to gain greater access to Bitcoin through more traditional financial products.\nNYSE American LLC (ICE), a subsidiary of the New York Stock Exchange (NYSE) Group, facilitates trading across various financial instruments, including equities, options, and exchange-traded products (ETPs). Meanwhile, CBOE, formerly known as the Chicago Board Options Exchange, stands as one of the largest and most influential options exchanges in the world.\nAccording to two statements from the SEC, NYSE will be allowed to list and trade options on the Grayscale Bitcoin Trust (GBTC) (GBTC), the Grayscale Bitcoin Mini Trust (BTC), and the Bitwise Bitcoin ETF (BITB), while Cboe Global Markets received approval to list and trade options on the Fidelity Wise Origin Bitcoin Fund (FBTC) and the ARK 21Shares Bitcoin ETF (ARKB).\nOption trading involves speculating on the value of an asset by purchasing or selling options contracts. An option is a type of financial contract that grants the buyer the right, but not the obligation, to buy (call option) or sell (put option) an asset at a predetermined price (the strike price) by a specific date (the expiration date). To acquire this right, the buyer pays the seller a premium.\nThe approval for option trading for spot Bitcoin ETFs  will provide institutional investors and traders with an alternative way to hedge their exposure to Bitcoin — in this case, Bitcoin ETFs at a predetermined price within a certain time frame.\nMany in the financial community expect that allowing options on Bitcoin ETFs will draw more institutional investors to the crypto market while also boosting liquidity, making Bitcoin more mainstream in the financial market.\nIn the SEC’s approval for the NYSE, the agency emphasized that options on Bitcoin ETFs will support hedging strategies, promote greater liquidity, and improve price accuracy while reducing volatility for the underlying funds. Additionally, the SEC believes this will lead to better market transparency and efficiency for Bitcoin ETFs and correlated products.\nOver the past 30 years, more than 5,000 ETFs have been launched across various sectors, but Bitcoin ETFs have outpaced them all, including the highly successful gold ETFs. Since U.S. Bitcoin ETFs’ debut in January 2024, they have accumulated over $21 billion in total net flows, a remarkable achievement considering the typical challenges faced by new ETFs.\nAccording to Eric Balchunas, a senior ETF analyst at Bloomberg, net flows represent the “most difficult metric to grow” for ETFs, highlighting the rapid and widespread adoption of Bitcoin funds. By comparison, it took gold ETFs around five years to reach the same level of net inflows.\nAdding option trading for spot Bitcoin ETFs will further increase Bitcoin’s adaptability among investors.\nOur free, fast, and fun briefing on the global economy, delivered every weekday morning.","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBitcoin (CRYPTO: BTC) is the world's biggest cryptocurrency. Its market capitalization of $1.3 trillion accounts for more than half of the market cap of the entire crypto market, which currently stands at $2.4 trillion.\nThe crypto industry went through a challenging bear market in 2022 following the collapse of a number of high-profile projects and exchanges. However, Bitcoin is up 53% this year, and it's trading near a record high on the back of renewed positivity among investors.\nThat bullish sentiment appears to be spreading to all corners of the crypto market. Shiba Inu (CRYPTO: SHIB) is sitting on a year-to-date gain of 79%, so it's doing even better than Bitcoin at the moment. It isn't the first time this meme token has outperformed the industry leader, because it delivered one of the best gains in the history of financial markets in 2021.\nHowever, here's why investors shouldn't expect Shiba Inu to outperform forever.\nBitcoin is a decentralized cryptocurrency, which means it isn't controlled by any single person or government. Supply is capped at 21 million coins, and it operates on the blockchain, which is an autonomous, reliable system of record. Therefore, many crypto enthusiasts consider Bitcoin a viable alternative to traditional money, because supply can't be manipulated or \"printed\" to degrade its purchasing power.\nHowever, adoption has been lackluster. Only 9,224 businesses worldwide accept Bitcoin as payment for goods and services, (according to Cryptwerk), and if people can't spend it at their favorite stores, they don't have much incentive to own it. Volatility might be one reason merchants are reluctant to enter the ecosystem -- any currency that can plunge in value by more than 50% in a single year (as Bitcoin did in 2022), with the potential to rise unpredictably by a similar amount, makes cash flow management a nightmare.\nAs a result, many investors prefer to look at Bitcoin as a store of value, sort of like a digital version of gold. That use case received further validation when the U.S. Securities and Exchange Commission started approving Bitcoin exchange-traded funds (ETFs) earlier this year. Dozens of them have hit the market, and they give investors a safe, regulated way to park money in Bitcoin.\nETFs are creating new demand for the cryptocurrency, which is probably a key reason it's trading near an all-time high. But the speculative end of the market hasn't been so fortunate. Although Shiba Inu is up more than Bitcoin in 2024, it's still down 78% from its all-time high, which was set during 2021.\nShiba Inu generated a return of 45,278,000% between Jan. 1, 2021 and Dec. 31, 2021, which could have turned a perfectly timed investment of $3 into over $1 million. Its spectacular collapse since then confirms that the incredible bull run was driven by rampant speculation rather than fundamentals.\nAs of this writing, just 989 merchants accept Shiba Inu as payment, so it's faring significantly worse than Bitcoin in terms of adoption. That's no surprise, since it's far more volatile. It isn't a very good store of value either, given its decline since 2021. So a Shiba Inu ETF probably wouldn't receive much demand, nor is one likely to get regulatory approval.\nThe developer community is trying to create new use cases for the token, but progress has been limited. In 2022, a Shiba Inu metaverse was in the works which promised to give enthusiasts a way to spend their tokens within the digital realm, but it still hasn't launched.\nDevelopers did release Shibarium last year, which is a Layer-2 blockchain solution designed to make it cheaper and faster to transact with Shiba Inu tokens. The goal was to eliminate some of the clunkiness associated with the legacy Ethereum network upon which Shiba Inu is built, in the hope it would encourage more people to buy and spend tokens.\nBut Shibarium hasn't really boosted adoption, nor has it bolstered the price of Shiba Inu tokens. The bottom line is this: Without widespread adoption, it's going to be very hard for Shiba Inu to create (or maintain) value. Speculation isn't enough to generate long-term returns, as proven by the token's post-2021 performance.\nSince ETFs have given financial advisors and institutional investors a legitimate avenue through which to buy Bitcoin, it's probably going to be a safer investment than Shiba Inu from now on. However, an element of speculation will always be responsible for the performance of every cryptocurrency. This asset class doesn't generate revenue or earnings, so investors only buy into it in the hope that other investors are willing to pay higher prices in the future.\nIn my view, it's a much better idea to buy high-quality stocks instead. The benchmark S&P 500 (SNPINDEX: ^GSPC) is filled with them. The index has a stellar track record of delivering reliable returns since it was established in 1957, and there is an abundance of ETFs that make it easier than ever to track its performance.\nWhile the S&P 500 will probably never soar by millions of percentage points in a single year like Shiba Inu did in 2021, it's also far less likely to plunge 70% or more. When we look back on this moment in 20 years, I think investors who invest in the broader stock market today will have done much better than those who bought Shiba Inu (and maybe even Bitcoin).\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\nAmazon: if you invested $1,000 when we doubled down in 2010, you’d have $21,285!*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $44,456!*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $411,959!*\nRight now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.\nSee 3 “Double Down” stocks »\n*Stock Advisor returns as of October 14, 2024\nAnthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin and Ethereum. The Motley Fool has a disclosure policy.\nBitcoin Is Up 53% This Year, But This Cryptocurrency Is Doing Even Better was originally published by The Motley Fool"]}
{"date":"2024-10-22","titles":["Will Bitcoin hit $100K? Here’s Everything you need to know"],"urls":["https:\/\/www.techjuice.pk\/will-bitcoin-hit-100k-heres-everything-you-need-to-know\/"],"sources":["techjuice.pk"],"descriptions":["Is Bitcoin set for a $100K surge? Discover the key trends, market signals, and expert insights driving the next big move"],"article_contents":["In light of Bitcoin’s recent increases, many are wondering if it could soon make the incredible jump to $100,000. The stage is set for possible breakthroughs with the increasing interest from institutions and the changing dynamics of the market. Will Bitcoin hit $100k next, given its current price of $67,632.06? What role will market mood, ETF approvals, and the US election play in determining its path?\nDelve into the variables that have the potential to propel this digital currency to new heights of success!\nAs the “Uptober” effect spreads through the crypto market, Bitcoin (BTC) has been on a great bull run, rising more than 2% in the last week.\nBy October 22, BTC was selling at $67,632.06, a price it hasn’t seen since late July and a three-month high. For a short time, BTC did reach $69,500, but it quickly dropped as bears tried to stop the rise.\nBitcoin Price\nThe mood of the market is also changing quickly. The crypto fear and greed measure is now at 63, which means “greed.” This is a big change from September 7, when it was 26 and fear ruled the market.\nAlthough the U.S. presidential election is coming up on November 5, investors still seem to be hopeful. In the polls, former President Donald Trump is gaining support because he has suggested policies that would be good for crypto.\nMany people think that if he wins, it will make Bitcoin even more popular because his policies are seen as good for the crypto industry.\nWhat will happen next with BTC? Where do you think BTC will go in the next few days? Important economic events are coming up and the political scene is very tense. Let’s find out.\nNow that the U.S. Securities and Exchange Commission has changed some rules, spot Bitcoin exchange-traded funds will trade more. This is great news for the Bitcoin market.\nThe SEC passed a new rule on October 18 that lets the New York Stock Exchange (NYSE) and the Chicago Board Options Exchange trade options for a number of spot Bitcoin ETFs. This change suggests that there will be more money available and prices will move more smoothly in the cryptocurrency world.\nSome well-known names will be changed because of this. The NYSE can now list choices for the Bitwise Bitcoin ETF (BITB), the Greyscale Bitcoin Trust (GBTC), and the Greyscale Bitcoin Mini Trust (BTC).\nAt the same time, Cboe Global Markets can list choices for the ARK 21Shares Bitcoin ETF (ARKB) and the Fidelity Wise Origin Bitcoin Fund (FBTC).\nThese events happened just a few weeks after the SEC permitted Nasdaq to list options for BlackRock’s iShares Bitcoin Trust (IBIT).\nOptions are contracts that let investors buy or sell an item at a certain price before a certain date, but they don’t have to. Here, a Bitcoin ETF serves as the foundational asset.\nThere are no set dates for when these choices will be available, but experts think that the approval could have a huge effect.\nMore financial products on major U.S. exchanges means that more people can access crypto, which could bring in a bigger range of participants, from big investors to small ones.\nIt couldn’t be more convenient. Recently, a huge amount of money has been pouring into Bitcoin ETFs. CoinGlass data shows that spot Bitcoin ETFs increased their total assets under control to a strong $52 billion in the week ending October 18.\nThe money that came into Bitcoin ETFs last week was the most in about seven months, which shows that investors are becoming more confident in crypto.\nMany industry insiders have flocked to social media to provide their predictions for the future of the Bitcoin market as the price approaches $70,000.\nThe current situation of Bitcoin has been described by crypto expert Michaël van de Poppe as being in the “Boring Zone.” Having said that, this doesn’t indicate bad news.\n#Bitcoin is currently in the Boring Zone.#Altcoins are currently reversing and ending the longest bear market in history.\nThis means it’s time for Banana Zone, and depending on how long it will take with liquidity, this Banana Zone is going to be epic. pic.twitter.com\/XNNBpvUomr\n— Michaël van de Poppe (@CryptoMichNL) October 21, 2024\nAltcoins have been quietly showing signs of revival, while Bitcoin has been consolidating around the $68,000 level.\nThis stage is like a coil spring waiting for a sudden release of liquid, says van de Poppe. He defines it as “Altcoins are currently reversing and ending the longest bear market in history”.\nBitcoin is going through a pivotal “Boring Zone” right now, where the price is very stable yet is gaining momentum. When investors see a floor in the price of Bitcoin, they typically leap back in, causing the price to rise sharply. This pattern has happened many times before.\nAnother well-known crypto analyst, Ali, has used a certain measure to predict Bitcoin’s next move on the technical front.\nOne of my go-to indicators for gauging #Bitcoin‘s trend, the MVRV Momentum, has flipped bullish again!!! pic.twitter.com\/qOtIJgXTWe\n— Ali (@ali_charts) October 20, 2024\nA bullish trend has recently emerged in the market value to realized value momentum indicator, which tracks the price of Bitcoin relative to its previous significant movement.\nIf this indication turns positive, it usually means that prices will continue to keep going up. A significant psychological component in price movement is the belief that the market is prepared for a surge higher, which is why individuals are essentially holding onto their Bitcoin.\nSellers are feeling less pressure to unload their Bitcoin holdings as confidence among investors grows. As selling pressure decreases, it becomes simpler to maintain the upward momentum, which in turn pushes Bitcoin higher.\nAccording to crypto futures specialist Maartunn, another important cause is the surge in Bitcoin CME Futures Open Interest, which just reached a record high of $12 billion.\nBitcoin: CME Futures Open Interest hits an ALL-TIME-HIGH with $12.0B$BTC #OpenInterest #Futures pic.twitter.com\/NSDCy6ozMS\n— Maartunn (@JA_Maartun) October 20, 2024\nWhen discussing futures contracts, “open interest” means the sum of all unresolved contracts. A rise in open interest indicates that more investors are speculating on the direction of Bitcoin’s price.\nWithin the larger context of Bitcoin’s present velocity, the rise in open interest makes sense. The current macroeconomic circumstances are perhaps the driving force behind the traders’ expectations of a breakout.\nBut there’s a catch: more open interest doesn’t always mean less volatility. This is particularly true when many traders are taking the same optimistic or negative stance. The market’s movement against those positions could cause liquidations, which in turn could cause unexpected price fluctuations.\nAnother crypto expert Ash Crypto is highlighting a common pattern observed in Bitcoin’s price cycles.\nEach Bitcoin cycle shows a repeating\npattern.\nThe price enters the re-accumulation\nphase before the big parabolic run.\ncurrently, the re-accumulation phase\nis about to end and the price will start\na new uptrend. Bitcoin is going to\n$100k sooner than you think. pic.twitter.com\/a4cLlmlM17\n— Ash Crypto (@Ashcryptoreal) October 19, 2024\nHe explains that Bitcoin typically goes through different phases, one of which is the “re-accumulation” phase. This phase happens after a price correction, where investors start buying Bitcoin again at lower prices, preparing for the next big price surge.\nAccording to him, this re-accumulation phase is coming to an end, meaning Bitcoin is getting ready for its next significant upward movement, which he believes will take it to $100,000 sooner than most people expect. Essentially, he’s predicting a major price rally based on these cyclical trends in Bitcoin’s market.\nThe US presidential election on November 5 and the Federal Reserve’s upcoming meeting on November 7 are two examples of macroeconomic factors that could impact the price movement of Bitcoin.\nMany people view former president Donald Trump, who is currently leading in the polls, as being crypto-friendly. If Trump wins, investors may be more sure of the industry’s safety and support, which could make Bitcoin’s price go up.\nIt is more difficult to forecast how the market will respond if Kamala Harris is elected. Uncertainty may arise since Harris has not made her position on crypto clear.\nThere’s also the Federal Reserve’s interest rate decision coming up soon. At its meeting on November 7, the Federal Reserve is expected to decrease rates by 25 basis points, with a current probability of 90.5%.\nMore money would flow into the economy if interest rates were to fall, which is good news for risky assets like Bitcoin. Bitcoin stands to gain substantially from an increase in market liquidity, as a result of more cash coming into the cryptocurrency.\nIf both Trump wins and the Fed lowers interest rates, it could be the right storm for Bitcoin’s price to go over $70,000.\nOne crypto expert thinks that $98,000 is the next goal for Bitcoin. The community as a whole thinks that momentum is slowly building and that people are becoming more sure that BTC is ready for its next leg up.\n#Bitcoin Next Target: $98,000 🎯\nMomentum is building.\nThings are starting to smell good for #BTC 🚀 pic.twitter.com\/30kOF5GA1w\n— Titan of Crypto (@Washigorira) October 20, 2024\nIn the meantime, well-known crypto expert Rekt Capital says that we are now between $65,000 and $70,000, and the next big step could be anywhere from $90,000 to $160,000.\nSince Bitcoin is getting stronger around $70,000, the next level of resistance could be $90,000. But if Bitcoin quickly breaks through $90K, it could quickly speed up to $100K or even higher.\nIn this case, Bitcoin prices tend to go much higher very quickly once they reach price discovery, which means they are trading above their previous all-time highs.\nThe current trend appears to be in favor of Bitcoin’s rise. But buyers should stay alert and keep an eye on both the technicals and the bigger picture of the economy to figure out what BTC will do next. Always be smart about your trades and never put more money into them than you can afford to lose.\nKarachi: The Federal Investigation Agency (FIA) has filed a new case against Armaghan, the prime suspect in the Mustafa Amir murder case, unveiling a…\nIn a surprising yet strategic move set to reverberate across global fintech and crypto circles, Pakistan’s Crypto Council CEO Bilal Bin Saqib has officially…"]}
{"date":"2024-10-23","titles":["Crypto Price Today: Bitcoin Records Minor Losses as Most Altcoins Move Sideways in Volatile Market","How do crypto presales differ from established coins like Bitcoin?","Bitcoin Bears Lose Control As BTC Net-Taker Volume Shifts Positive"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/crypto-price-today-bitcoin-most-altcoins-loss-market-volatile-6854415","https:\/\/dataconomy.com\/2024\/10\/23\/how-do-crypto-presales-differ-from-established-coins-like-bitcoin\/","https:\/\/www.newsbtc.com\/news\/bitcoin\/bitcoin-bears-lose-control-as-btc-net-taker-volume-shifts-positive\/"],"sources":["ndtv.com","dataconomy.com","newsbtc.com"],"descriptions":["The altcoin market is following Bitcoin’s trajectory, trading sideways owing to market volatility.","When it comes to cryptocurrency, most people are familiar with big names like Ethereum and Bitcoin (BTC). These coins are powerhouses in the market, with","Bitcoin holds crucial support at $66,000 after recent surge. Analyst warns of potential pullback to $63,000. Breakout above $70,000?"],"article_contents":["Photo Credit: Unsplash\/ Viktor Forgacs\nThe global crypto market cap presently stands at $2.31 trillion\nBitcoin, in the last 48 hours, managed to retain its trading price above the mark of $65,000 (roughly Rs. 54.6 lakh) despite volatility affecting the overall crypto market. On Wednesday, October 23 Bitcoin reflected a minor loss of 0.62 percent on the price chart. On international exchanges, BTC is trading at the price point of $67,095 (roughly Rs. 56.4 lakh), showed CoinMarketCap. Meanwhile, on Indian exchanges like CoinDCX and CoinSwitch, BTC's price is hovering over the mark of $68,029 (roughly Rs. 57.1 lakh).\n“In the last 24 hours, Bitcoin saw a slight dip amid rising US Treasury yields impacting riskier assets. The cryptocurrency market is still thriving, as evidenced by the impressive $2.2 billion (roughly Rs. 18,497 crore) inflow into Ethereum and Bitcoin ETFs in the last week, which suggests strong institutional interest. This surge reflects growing confidence as investors anticipate potential bullish trends. As we look ahead, the outlook remains positive for Bitcoin and other cryptocurrencies,” Shivam Thakral, CEO of BuyUcoin told Gadgets360.\nEther registered a drop of 1.14 percent over the last 24 hours. On foreign exchanges, ETH is trading at $2,613 (roughly Rs. 2.19 lakh). Nationally, ETH is currently priced around $2,657 (roughly Rs. 2.23 lakh), showed the crypto price tracker by Gadgets360.\n“Ethereum which is currently trading at about $2,610 (roughly Rs. 2.19 lakh), on the other hand, has stuck at the critical 100 day EMA resistance, making its recovery to $3,000 (roughly Rs. 2.52 lakh) more difficult. Further losses to $2,400 (roughly Rs. 2.01 lakh) or possibly $2,200 (roughly Rs. 1.84 lakh) are probable if there is weak support below $2,600 (roughly Rs. 2.18 lakh),” Avinash Shekhar, Co-Founder and CEO, Pi42 told Gadgets360.\nAvalanche, Shiba Inu joined Solana, Ripple in registering losses on Wednesday.\nDogeocoin, Cardano, Avalanche, and Shiba Inu also reflected price dips on the price chart.\nThe overall valuation of the crypto market valuation dropped by 0.75 percent in the last 24 hours. At the time of writing, the global crypto market cap stood at $2.31 trillion (roughly Rs. 1,94,21,625 crore) as per CoinMarketCap.\n“The altcoin market is following Bitcoin's trajectory. Despite technical indicators remaining unidirectional, Crypto Fear and Greed Index continues to stay above 70 in the greed territory,” Vikram Subburaj, CEO, Giottus told Gadgets360.\nUSD Coin, Tron, and Monero registered minor price hikes on Wednesday. Circuits of Value and Augur also joined this relatively short list.\n“On a brighter note, we observed a modest uptick in gaming tokens yesterday, indicating renewed interest in that sector. Additionally, Avalanche has launched a VISA crypto card, enabling users to spend their crypto at Visa-accepting merchants, marking a significant step towards mainstream adoption,” the CoinSwitch Markets Desk noted.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:49\n01:14\n03:21\n01:32\n03:13\nAdvertisement","When it comes to cryptocurrency, most people are familiar with big names like Ethereum and Bitcoin (BTC). These coins are powerhouses in the market, with billions in market cap and years of history behind them. But what about presales?\nIf you’ve dipped your toes into the crypto world, you’re probably heard of presale tokens. They’re those shiny new coins being offered before they even hit the mainstream exchanges. Yet how do presales differ from more established coins like Bitcoin?\nFirst things first, crypto presales are the stage where cryptocurrency projects offer tokens to investors before the coins are publicly available on an exchange. The goal is to raise awareness about the new coming tokens and let you choose among first. Also, the capital for the projects’ development could be raised as well.\nDon't miss out on the latest insights, trends, and analysis in the world of data, technology, and startups. Subscribe to our newsletter and get exclusive content delivered straight to your inbox.\nThink of it like a startup raising funds from investors before launching their product. These tokens are sold at a discount rate, which makes them attractive to early adopters who hope the coin will skyrocket once it officially launches.\nPresales are often made in stages. The price of the token gradually increases as each phase progresses. When you invest early, you get the best deal.\nBTC is like the granddaddy of cryptocurrency. It was launched in 2009 by the mysterious Satoshi Nakamoto. Unlike presales, Bitcoin didn’t have a fundraising stage. It was born out of decentralized movement, and its early adoption was mostly by tech-savvy people who believed in the idea of a digital currency free from government control.\nThe key difference here is that Bitcoin is an established, tested asset. While its price fluctuates, there’s a level of security and recognition that comes with it. Meanwhile presales are still trying to find their place in the market.\nBTC is a relatively safer bet in a volatile crypto market. Sure, it’s had its ups and down (remember the crazy 2021 price surge followed by a dip?), but it’s not going anywhere anytime soon. It’s a staple in the market, and many governments and institutions are no longer shy in accepting it.\nPresales are a bit risky. There’s no guarantee that the token will take off, and there’s a possibility the project could fizzle out altogether. The upside? If the project is successful, early adopters can see astronomical returns that aren’t usually possible with more traditional investments like gold and silver, or when trading forex or stocks. Imagine getting into Bitcoin when it was just a few bucks. Presales offer a similar kind of early-bird opportunity.\nOne of Bitcoin’s main advantages is liquidity. It’s available on nearly every cryptocurrency exchange in the world. You can buy, sell, and trade it easily. Even some retailers accept it, and it can be converted through Bitcoin ATMs into cash. The accessibility is high too–you can get into Bitcoin on any crypto platform.\nOn the other side, presale tokens are often not available on exchanges right away. You’re essentially buying a future promise. There’s no guarantee when (or if) the token will be listed on a major exchange. The lack of liquidity means you might have to wait a while before you can cash out or trade your tokens. You’re in it for a long haul, or at least until the project moves to the next phase.\nBitcoin is somewhat volatile, but it has a certain level of price stability compared to presale tokens. It’s been around long enough that there are patterns, trends, and massive institutional investments to help stabilize the price to some degree.\nPresale tokens? They can be all over the place. At first the price is usually low to attract investors, but once the token hits the market, it can either moon (skyrocket in value) or tank (ouch). This extreme volatility makes presales high-risk, high-reward investments.\nBitcoin is the definition of transparency. Every transaction is recorded on the blockchain for anyone to see, and the security of the Bitcoin network is second to none. It’s one of the most secure decentralized networks on the planet.\nPresales, however, are often attached to new, unproven objects. The transparency can vary significantly, which depends on the project team. Some presales are part of reputable projects with clear roadmaps and active communities. Others? Not so much. So remember to always do your research before diving into a presale.\nBitcoin has a huge, well-established community. From online forums to social media groups, there’s no shortage of discussions, news, and analysis. The hype around Bitcoin can drive market activity, but the coin is largely driven by major institutional and retail investors these days.\nPresales rely a lot on hype and community support. A strong, engaged community can propel a presale token to new heights. But the reliance on hype also makes it vulnerable to manipulation. Celebrities and influencers can create buzz around a presale, but sometimes that can only create a short-lived price spike.\nFeatured image credit: Gerd Altmann\/Pixabay","Strict editorial policy that focuses on accuracy, relevance, and impartiality\nMorbi pretium leo et nisl aliquam mollis. Quisque arcu lorem, ultricies quis pellentesque nec, ullamcorper eu odio.\nBitcoin has been on an impressive surge since early September, rising by 31% from local lows around $53,000. However, after testing the $69,500 supply level, the cryptocurrency faces selling pressure. Despite this, Bitcoin remains strong, holding above the previous high of around $66,000, a crucial level determining its next move.\nKey data from CryptoQuant reveals that, despite recent bearish attempts, bears are losing control in the futures market. A key indicator has flipped bullish for the first time since July, suggesting that the current selling pressure may not be enough to push Bitcoin lower.\nWith Bitcoin in a critical phase, holding above the $66,000 level would signal continued strength and maintain the uptrend for the coming weeks. Investors are watching closely, as Bitcoin’s ability to stay above this support could pave the way for new highs and further momentum in the bullish cycle.\nCrypto analyst Maartunn shared recent data from CryptoQuant, revealing that Bitcoin taker buyers in the futures market have struggled to gain an advantage over taker sellers throughout the past year. Maartunn highlighted a chart showing that the BTC net taker volume has turned positive for the first time since July, signaling a potential shift in momentum.\nThe present trend change suggests that bears are beginning to lose control over Bitcoin’s price action, with buyers starting to gain strength.\nThis data points to an accumulation phase, where Bitcoin’s price has been suppressed by large investors, keeping it from making significant gains or marking new monthly lows. The fact that BTC hasn’t posted new lows despite previous bearish pressure reinforces the view that an accumulation period may end, and a new bullish phase could be on the horizon.\nThe coming weeks are critical for Bitcoin, particularly with the approaching U.S. presidential election on November 5. Historically, elections introduce volatility and uncertainty into financial markets; this year is no exception.\nBroader market trends likely influence Bitcoin’s price action, and traders are watching closely to see how BTC responds to these developments. If Bitcoin maintains its upward momentum, a rally to new highs could follow in the weeks after the election.\nBitcoin is currently trading at $66,400 after a healthy retrace from its recent high of $69,500. The price now finds support at $66,000, which acted as a key resistance in late September and has since flipped into a crucial demand zone for BTC. This support is essential for the bulls to maintain control, as holding above $66,000 signals strength and keeps the momentum alive for another attempt at breaking the $70,000 mark.\nIf Bitcoin can hold steady above this support level, the next logical target would be to challenge the $70,000 resistance, which has proven difficult to breach. A successful push past this level would likely trigger further upside, potentially driving BTC into new price discovery.\nHowever, if the price exceeds $66,000, a retrace to lower demand levels could occur. In this case, the daily 200 moving average at $63,300 is the next key area where Bitcoin could find support before resuming its upward trend. The coming days will be crucial in determining whether BTC can maintain its bullish trajectory or if a deeper pullback is on the horizon.\nFeatured image from Dall-E, chart from TradingView\nSebastian's journey into the world of crypto began four years ago, driven by a fascination with the potential of blockchain technology to revolutionize financial systems. His initial exploration focused on understanding the intricacies of various crypto projects, particularly those focused on building innovative financial solutions. Through countless hours of research and learning, Sebastian developed a deep understanding of the underlying technologies, market dynamics, and potential applications of cryptocurrencies.\nSebastian's journey into the world of crypto began four years ago, driven by a fascination with the potential of blockchain technology to revolutionize financial systems. His initial exploration focused on understanding the intricacies of various crypto projects, particularly those focused on building innovative financial solutions. Through countless hours of research and learning, Sebastian developed a deep understanding of the underlying technologies, market dynamics, and potential applications of cryptocurrencies.\nTo share his insights with others, Sebastian became an active contributor to online discussions on platforms like X and LinkedIn. His focus on fintech and crypto-related topics quickly established him as a trusted voice in the online crypto community. Sebastian's goal was to educate and inform his audience about the latest trends and insights in the rapidly evolving crypto landscape.\nTo further enhance his expertise, Sebastian pursued a UC Berkeley Fintech: Frameworks, Applications, and Strategies certification. This rigorous program equipped him with valuable skills and knowledge regarding Financial Technology, bridging the gap between traditional finance and decentralized finance. The certification deepened his understanding of the broader financial landscape and its intersection with blockchain technology.\nSebastian's passion for finance and writing is evident in his work. He enjoys delving into financial research, analyzing market trends, and exploring the latest developments in the crypto space. In his spare time, Sebastian can often be found immersed in charts, studying 10-K reports, or engaging in thought-provoking discussions about the future of finance.\nSebastian's journey as a crypto pioneer has been marked by a relentless pursuit of knowledge and a dedication to sharing his insights. His ability to navigate the complex world of crypto, combined with his passion for financial research and communication, makes him a valuable contributor to the industry. As the crypto landscape continues to evolve, Sebastian remains at the forefront, providing valuable insights and helping to shape the future of this revolutionary technology.\nDisclaimer: The information found on NewsBTC is for educational purposes\n\t\t\t\t\t\t\tonly. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any\n\t\t\t\t\t\t\tinvestments and naturally investing carries risks. You are advised to conduct your own\n\t\t\t\t\t\t\tresearch before making any investment decisions. Use information provided on this website\n\t\t\t\t\t\t\tentirely at your own risk.\nThis Sunday, the market’s leading cryptocurrency, Bitcoin (BTC), has once again crossed the $87,000 mark, following what analysts describe as...\nBitcoin price is slowly moving higher above the $86,500 zone. BTC is gaining pace and might continue higher in the...\nInvestors in Dogecoin were sent mixed signals this week after market analysts disclosed forecasts regarding the future price action of...\nStrict editorial policy that focuses on accuracy, relevance, and impartiality\nMorbi pretium leo et nisl aliquam mollis. Quisque arcu lorem, ultricies quis pellentesque nec, ullamcorper eu odio.\nBe the first to get the latest important crypto news & events to your inbox.\nNewsBTC is a cryptocurrency news service that covers bitcoin news today, technical analysis & forecasts for bitcoin price and other altcoins. Here at NewsBTC, we are dedicated to enlightening everyone about bitcoin and other cryptocurrencies.\nWe cover BTC news related to bitcoin exchanges, bitcoin mining and price forecasts for various cryptocurrencies.\n© 2025 NewsBTC. All Rights Reserved.\n© 2025 NewsBTC. All Rights Reserved."]}
{"date":"2024-10-24","titles":["Bitcoin, Ethereum, Dogecoin Sink Amid Stocks Decline, Treasury Yields Climb: Analyst Sees 'Promising Signs' — Retest 'Successful' If King Crypto Stays Above This Level - Grayscale Bitcoin Mini Trust (","Step-by-Step Guide: How to Buy Cryptocurrency Safely and Secure Your Investments"],"urls":["https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/10\/41507397\/bitcoin-ethereum-dogecoin-sink-amid-stocks-decline-treasury-yields-climb-analyst-sees-prom","https:\/\/usethebitcoin.com\/crypto\/step-by-step-guide-how-to-buy-cryptocurrency-safely-and-secure-your-investments\/"],"sources":["benzinga.com","usethebitcoin.com"],"descriptions":["Leading cryptocurrencies joined stocks in a broader sell-off on Wednesday as the market lost momentum seen at the beginning of the week.","Diving into the world of cryptocurrency can feel like stepping into a new frontier, filled with both opportunities and risks. As digital currencies gain"],"article_contents":["Benzinga Rankings give you vital metrics on any stock – anytime.\nLeading cryptocurrencies joined stocks in a broader sell-off on Wednesday as the market lost momentum seen at the beginning of the week.\nWhat Happened: Bitcoin plummeted as low as $65,188 during trading hours before recouping losses overnight.\nEthereum sank below $2,500 for the first time in nearly 10 days, hitting an intraday low of $2,463. Over the last week, Bitcoin's dominance has steadily increased at the cost of Ethereum and other altcoins.\nTotal cryptocurrency liquidations topped $277 million in the last 24 hours, the highest in a week. Upside bets to the tune of $203 million were wiped out.\nBitcoin's Open Interest dropped 0.87% in the last 24 hours, while Ethereum recorded a 1.15% decline in funds locked in unsettled contracts.\nThat said, the number of traders longing Bitcoin significantly exceeded those betting against the cryptocurrency, as per the Long\/Shorts Ratio.\nAdditionally, market participants remained greedy as of this writing, according to the Cryptocurrency Fear & Greed Index.\nTop Gainers (24-Hours)\nThe global cryptocurrency stood at $2.28 trillion, following a drop of 2.19% in the last 24 hours.\nStocks recorded a third straight session of losses. The Dow Jones Industrial Average plunged 409.94 points, or 0.96%, to end at 42,514.95. The S&P 500 slipped 0.92% to close at 5,797.42, while the tech-heavy Nasdaq Composite fell 1.60% to 18,276.65.\nThe benchmark 10-year Treasury yield continued its climb, briefly exceeding 4.25%, its highest since last week of July. Interestingly, the yield has risen significantly since the aggressive 0.5% interest rate cut enacted by the Federal Reserve last month.\nMeanwhile, investors expected a 91% chance of a 25 basis point rate cut during the next FOMC meeting, as per the CME FedWatch tool.\nSee More: Best Cryptocurrency Scanners\nAnalyst Notes: Popular cryptocurrency analyst and trader Rekt Capital said that the ongoing retest would be deemed \"successful\" if Bitcoin managed to stay above $66,200 until the new weekly close.\n\"Promising signs so far,\" the trader remarked.\n#BTC Bitcoin has already produced a wick below the Channel Top & has returned above it, holding it as support (black)As long as BTC stays above ~$66200 until the new Weekly Close, this will be confirmed as a successful retestPromising signs so far$BTC #Crypto #Bitcoin https:\/\/t.co\/VAc9MV7ohp pic.twitter.com\/jR4eL6qsTa\nWidely-followed cryptocurrency market researcher Michaël van de Poppe attributed Bitcoin's sideways movement to rising Treasury yields and the U.S. dollar.\nHowever, he predicted volatility once more macroeconomic data starts trickling in.\n#Bitcoin is currently having that consolidation, as both the $DXY and Yields are running upwards.Close to the sweet spot.The macroeconomic data season starts tomorrow.Time for volatility! pic.twitter.com\/NdbIreLKR4\nRead Next:\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.","Join our growing community\nEntering the world of cryptocurrency can feel like stepping into a new frontier, full of both opportunities and risks. As digital currencies grow in popularity, it’s essential to understand how to navigate this volatile market securely. Many newcomers are initially overwhelmed by the jargon and technical aspects, but with proper guidance, buying cryptocurrency can be a safe and rewarding experience.\nThrough extensive exploration of crypto trading, safety should always be a priority. Each step, from selecting a reputable exchange to securing digital assets, requires careful planning. By following best practices and staying informed, you can confidently join this digital revolution. This article offers essential tips to help you make informed choices and protect your investments as you venture into the cryptocurrency market.\nCryptocurrency can seem baffling at first, but understanding the basics can greatly boost confidence. This guide breaks down what cryptocurrency is, explores the types available, and explains how transactions work.\nWhat Is Cryptocurrency?\nCryptocurrency is digital currency. It uses cryptography to secure financial transactions. No central authority controls it, making it decentralised. Most operate on blockchain technology. This public ledger records transactions across many computers. It guarantees transparency and security. Bitcoin, introduced in 2009, was the first cryptocurrency. Since then, other forms like Ethereum have arisen. They offer unique features and benefits. Familiarity with these basics is crucial.\nTypes Of Cryptocurrencies\nCryptocurrencies come in many forms. Bitcoin (BTC) is the original and most recognised. Ethereum (ETH) offers smart contracts. Litecoin (LTC) is faster in processing transactions. There are also various altcoins, each serving different purposes. Some focus on privacy, like Monero. Others, like Ripple, target banking solutions. It’s key to understand their unique features. This helps in making informed investment choices. Researching market trends and community feedback also aids your decisions.\nHow Cryptocurrency Transactions Work\nCryptocurrency transactions occur on a blockchain. Transactions are broadcast to the network. They are then verified through mining or staking. Miners solve complex algorithms to confirm transactions. Once confirmed, transactions enter blocks. These add to the blockchain’s history. The decentralised nature ensures no single point of failure. Smart contracts may automate transactions without intermediaries. Wallets store your digital assets for managing cryptos. Public keys allow others to send funds to you. Understanding these mechanics is vital for safe participation in the crypto economy.\nIt’s essential to choose the right platform when buying cryptocurrency. This decision affects security, costs, and user experience.\nEvaluating Exchange Security Features\nAlways prioritise security when selecting an exchange. Check if the platform uses two-factor authentication (2FA). This feature adds an extra layer of protection to your account. Look for exchanges with robust encryption protocols and cold storage practices. Exchanges like Coinbase, though facing occasional breaches, are reliable due to strong security measures. Regulatory compliance is another key consideration. Ensure the exchange follows the necessary regulations and has a history of protecting users. Platforms providing a Proof of Reserves (PoR) audit can be trustworthy. PoR verifies that the exchange has enough assets to cover client balances, enhancing transparency.\nComparing Fees And Limits\nUnderstanding fees and limits is vital for budget planning. Exchanges usually charge transaction and withdrawal fees. Some platforms also have a fee structure based on transaction volume or account type. Always compare these costs before opening an account. It’s important to check any deposit or withdrawal limits. These limits can vary and affect your trading strategy. High-volume traders may benefit from exchanges with lower fees and higher limits. Some platforms might offer discounts or incentives. Consider this when evaluating costs. Choose an exchange that aligns with your trading needs and financial goals.\nReviewing User Experience And Support\nUser experience can make or break your trading journey. Evaluate the platform’s interface and ease of use. Is the exchange straightforward? Are key features easy to find? A user-friendly design can significantly impact efficiency. Customer support is crucial for resolving issues. Look for 24\/7 support channels, like live chat or email. Fast response times improve user satisfaction. Explore user feedback in forums and reviews. An active community indicates a responsive support team. Positive experiences from other traders can guide your decision. Opt for exchanges known for reliability and helpful support.\nCryptocurrency ownership starts with a secure digital wallet. Hot and cold wallets serve different needs, and both have unique benefits. Recognising these differences is crucial for safety.\nUnderstanding Wallet Types\nChoosing the right wallet type is essential for security. Hot wallets, like apps or online platforms, offer quick access but higher risk. Cold wallets, such as hardware devices, are offline and less susceptible to hacking. Hardware wallets, for example, provide robust protection by disconnecting from the internet. Some users prefer paper wallets, which involve printing keys on paper for offline storage. It’s vital to assess your needs and risk tolerance before settling on a wallet type.\nSelecting A Reputable Wallet Provider\nWhen selecting a wallet provider, reputation matters. Check reviews and ratings to determine reliability. Trusted providers often offer enhanced security features. Good customer support is essential. Reputable providers comply with regulations and privacy standards, ensuring your data’s safety. Providers with open-source code allow users to verify security independently. Value transparent communication, which builds trust. Some leading wallet providers include Ledger, Trezor, and Exodus. Always research thoroughly to make an informed choice.\nImplementing Strong Security Measures\nEnhancing wallet security requires active measures. Use strong passwords, mixing letters, numbers, and symbols. Two-factor authentication (2FA) adds an extra layer of protection. Prefer using authenticator apps over SMS for 2FA. Securely store seed words offline to prevent unauthorised access. Seed words should never be stored digitally or online. Regularly update software to protect against vulnerabilities. Backup your wallet to avoid data loss. Avoid sharing sensitive information to maintain control over assets.\nEntering into cryptocurrency requires awareness of various risks. Understanding these risks can save you from costly mistakes.\nVolatility And Market Risk\nCryptocurrencies are known for their extreme price volatility. Prices often change rapidly, leading to potential big gains or losses. Always remind yourself to invest only what you can afford to lose. Market conditions can drastically influence crypto values. An investment might vanish if the value drops suddenly. Staying informed about market trends can help mitigate some uncertainties. Experts often advise diversifying investments to spread risk. Knowing your risk tolerance is crucial before committing funds.\nSecurity And Fraud Risks\nChoosing a secure exchange is vital to protect your investments from scams. Prioritise platforms with a strong security track record. Two-factor authentication (2FA) adds an extra layer of protection to accounts. Using strong, unique passwords is a basic yet effective measure. Cold storage options protect most assets offline, minimising risks of theft. Being aware of phishing attempts can save you from fraudulent schemes. Staying informed about security updates ensures constant protection of assets.\nRegulatory Risks\nRegulatory environments vary by region and influence crypto legality. Always verify the legal status of cryptocurrencies in your area. Changing regulations can affect trading practices and taxation. Staying updated on upcoming legislations is necessary for compliance. Authorities might impose restrictions on certain digital assets. Failing to comply with local laws can result in penalties. Consulting experts can provide clarity on regulatory matters. Informed decisions minimise risks associated with evolving regulations.\nBefore entering into cryptocurrency investments, ensure to spend time on research. Exploring deep into market trends, white papers, and community feedback can be the key to making informed decisions.\nAnalysing Market Trends\nStart by examining market trends to understand how various cryptocurrencies behave. This involves tracking price changes, trading volumes, and market capitalisations across platforms. Websites like CoinMarketCap offer updated data and charts on several coins. Also check for historical price patterns. This helps you gauge potential growth or volatility in investments. Sources such as news websites, financial analysis platforms, and social media yield valuable insights on expected market movements. By keeping a close eye on these trends, stay inform about any shifts or emerging opportunities in the crypto landscape.\nReading White Papers\nWhen a new cryptocurrency piques your interest, read its white paper carefully. A white paper details the project’s goals, technology, and purpose, helping you evaluate its potential. It shows the project’s vision, technological foundations, and problem-solving approach. Look for the roadmap, describing project milestones and timelines. These details indicate the team’s progress and dedication. Verifying the project’s legitimacy is essential, so cross-reference the white paper’s claims with other credible sources and expert reviews. Positive scrutiny assures you of the project’s reliability.\nAssessing Community Feedback\nValue community feedback in understanding public sentiment about a cryptocurrency. Active forums like Reddit and Bitcointalk host user discussions about various projects. These platforms unveil honest opinions about usability and reliability. Community sentiment can reflect potential issues with the project. Listening to others’ first-hand experiences helps you assess the credibility of claims made by the project team. Trustworthy projects often maintain strong ties with their user base. Transparency and regular updates foster investor confidence. By assessing community feedback, you gain an additional lens to evaluate a cryptocurrency’s true potential.\nEntering the cryptocurrency landscape can be complex. Prioritising safe purchasing methods is essential for protecting your investments.\nVerifying Identity And Completing KYC\nAn essential step in buying cryptocurrency involves identity verification. Exchanges require Know Your Customer (KYC) procedures. Provide personal information to comply with regulations. You might need a government-issued ID and proof of residence. This helps prevent fraud and ensures legal compliance. By completing KYC, I access more exchange features. It’s crucial to comply with these requirements to maintain account security. Understanding an exchange’s KYC procedures can enhance your buying experience and protect your assets. Check the exchange’s privacy policies to ensure data protection.\nPlacing Orders And Executing Trades\nOnce verified, you can place orders on the exchange. Choose between market and limit orders depending on your strategy. Market orders buy crypto instantly at current prices. Limit orders let you set your desired price, offering more control. It’s crucial to understand fees for each order type. Higher fees might apply for immediate market orders. Reviewing orders before executing avoids mistakes. Exchanges offer advanced trading features; use them cautiously. Always monitor your trades and manage risks. Sticking to your strategy helps in volatile markets. Thoughtfully placing orders safeguards your investments.\nNavigating Withdrawal Processes Safely\nWithdrawing funds is critical post-trade. Check withdrawal limits set by the exchange. Sometimes, additional verification is needed for large withdrawals. It’s vital to add your crypto wallet address correctly. Errors can result in permanent loss of funds. Double-check details before confirming withdrawals. Many exchanges have withdrawal fees; understanding them helps avoid surprises. Track withdrawal transactions using available tools. Using exchanges with efficient processes ensures smooth experiences. Stay informed about the exchange’s processing times. Choosing the right withdrawal method ensures prompt fund receipt.\nKeeping your cryptocurrency safe is crucial. Here are key practices to secure your digital assets.\nMonitoring Your Investments Regularly\nCheck your investments frequently. It’s important to stay informed about market changes. Many platforms offer tools for tracking prices in real time. Use alerts to manage risks better. Watching trends helps you adjust your strategy promptly. With transparent blockchains, verify transactions easily. Keeping an eye on news about regulatory changes also guides your decisions. By monitoring, you can make informed choices quickly.\nImplementing Two-Factor Authentication\nAlways enable two-factor authentication (2FA) on every account. 2FA adds a robust layer of security and buys invaluable time against hackers. Using both a password and a second verification step, only authorised people can access your accounts. Many services offer 2FA options like SMS, email codes or authenticator apps. Often choose a method suitable to your needs. When logging in, the added step reassures you of safer transactions. With 2FA, I sleep better knowing your crypto is protected.\nStoring Cryptocurrency Offline\nStore most of your cryptocurrency in cold wallets. These aren’t connected to the internet, reducing hack risks. Hardware wallets are popular choices for offline storage. Ensure that your recovery keys are backed up securely. This approach combines convenience with strong security. Paper wallets serve as another alternative for offline storage. Keeping backups in safe locations is vital. Cold storage ensures that long-term investments remain secure.\nExploring the cryptocurrency market can be daunting but it’s crucial to approach it with a blend of curiosity and caution. By understanding the fundamentals and prioritising security, you can make informed decisions. Always choose reputable exchanges and secure your digital assets with good practices. Remember, the market’s volatile so invest wisely and only what you can afford to lose. Staying informed about market trends and technological advancements will enhance your ability to safeguard your investments. By following these guidelines, you can confidently explore the dynamic world of cryptocurrency while protecting your financial interests.\nLEARN CRYPTO IN UNDER 60 MINS\nQUICK & EASY TO READ BOOK FOR BEGINNERS!\nadvertisement\nadvertisement\n3 weeks Ago\n3 weeks Ago\n1 month Ago\n1 month Ago\n1 month Ago\n1 month Ago\n1 month Ago\n1 month Ago\nOur social media\nGet more exclusive access.\nJoin Our Newsletter\nBy pressing the \"Subscribe button\" you agree with our Privacy Policy"]}
{"date":"2024-10-25","titles":["Crypto Price Today: Bitcoin, Ether See Small Losses as Market Continues to Be Volatile","The Popular $100K Year-End Goal for Bitcoin Has Less Than 10% Probability in Options Market","Are New Highs Ahead For Bitcoin?"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-price-today-ether-india-trading-dogecoin-shiba-inu-cardano-6869975#rss-gadgets-news","https:\/\/finance.yahoo.com\/news\/popular-100k-end-goal-bitcoin-082550025.html","https:\/\/seekingalpha.com\/article\/4729683-are-new-highs-ahead-for-bitcoin"],"sources":["gadgets.ndtv.com","finance.yahoo.com","seekingalpha.com"],"descriptions":["The crypto market is experiencing heightened volatility amid the upcoming US elections and broader macroeconomic factors.","The low pricing seems consistent with stable and rangebound implied volatility.","Historically, bitcoin has reached new all-time highs between six and twelve months after each halving event. Click to read."],"article_contents":["Photo Credit: Reuters\nThe overall crypto market cap is currently valued at $2.32 trillion\nThe crypto market is experiencing heightened volatility amid the upcoming US elections and broader macroeconomic factors. On Friday, October 25, Bitcoin saw a slight decline of 0.40 percent, bringing its global trading value to $67,767 (roughly Rs. 56.9 lakh), according to CoinMarketCap. However, in India, Bitcoin's value remained stable, trading at $69,022 (roughly Rs. 58 lakh) on platforms like CoinSwitch and CoinDCX, with gains of just under one percent.\n“The upcoming weekly close of BTC on Sunday can prove to be a pivotal one as a closing above $68,000 (roughly Rs. 57 lakh) could mean a clear breakout of the bull flag Bitcoin has been consolidating in for since March, 2024. With US ETFs recording a $2.1 billion (roughly Rs. 17,655 crore) of inflows in the last five days, the highest ever so far, the total holding of all of the exchange traded funds could soon cross one million Bitcoin tokens,” the CoinSwitch markets desk told Gadgets360, commenting on the asset's trajectory.\nEther saw a 1.20 percent drop in value over the past day. At the time of writing, ETH was trading at $2,569 (roughly Rs. 2.16 lakh) on Indian exchanges, showed the crypto price tracker by Gadgets360. Internationally, ETH incurred a loss of 1.11 percent to trade at $2,489 (roughly Rs. 2.09 lakh).\n“Ethereum has bearish sentiment, and the decline in the ETH\/BTC ratio reveals a shift in investor interest. Historical trends would indicate that Bitcoin tends to enter a positive Q4 cycle and is likely to get into new all-time highs by December,” said Avinash Shekhar, Co-Founder and CEO, Pi42 predicting at a gradual recovery for ETH in the coming months.\nSolana, USD Coin, Ripple, Dogecoin, Cardano, Avalanche, and Shiba Inu saw losses on Friday alongside BTC and ETH.\nPolkadot, Near Protocol, Uniswap, Cronos, and Polygon -- also reflected price dips.\nDespite multiple cryptocurrencies logging losses on Friday, the overall sector valuation retained its place in the green zone with 0.34 percent profit over the last day. The crypto market cap currently stands at $2.32 trillion (roughly Rs. 1,95,03,927 crore), as per CoinMarketCap.\nTether, Binance Coin, Tron, Chainlink, and Bitcoin Cash showed small profits on Friday.\nLeo, Litecoin, Monero, Stellar, Bitcoin SV, and Cosmos also held onto minor gains on the price chart.\n“There is optimism in the crypto landscape echoed by the overall market sentiment, which remains cautiously positive despite recent fluctuations,” Shivam Thakral, CEO of BuyUcoin told Gadgets360.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:49\n01:14\n03:21\n01:32\n03:13\nAdvertisement","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe way BTC options trading on Deribit are currently priced suggests a 9.58% chance of prices rising above $100,000 by Dec. 27.\nThe possibility of prices rising to $82,000 is higher, according to one observer.\nOptions market probabilities can change quickly with market conditions.\nAs sophisticated and retail investors rally around the possibility of bitcoin's {{BTC}} price surging to at least $100,000 by the year-end, the options market tied to the cryptocurrency assigns a low probability of such a surge materializing.\nAt press time, the way options were priced on dominant exchange Deribit showed a 9.58% probability of BTC topping the $100,000 mark by the end of December, according to data source Deribit Metrics.\nOptions are derivative contracts that give the purchaser the right but not the obligation to purchase or sell the underlying asset at a predetermined price on or before a specific date. A call option confers the right to buy, representing a bullish bet, while a put protects against downside price swings.\nThe near 10% figure may seem puzzling to the bulls, given the market has moved beyond the supply overhang fears of the second and third quarters and is reportedly on an bullish trajectory, largely due to the Federal Reserve's renewed bias for interest rate cuts.\nThat said, it seems consistent with the steady bitcoin implied volatility, suggesting that market participants don't expect wild moves in the short term.\nDeribit's bitcoin implied volatility index (DVOL), which shows expected price turbulence over 30 days in annualized terms, remains locked between the three-month range of 50% to 60%, well below the 2024 high of 85% hit in March.\nOptions-implied probabilities are calculated by using the Block-Scholes model or other pricing models that take into account factors like current spot market price, strike price, time to expiration, volatility, and the risk-free rate. Options-based probabilities are positively correlated with implied volatility: The greater the volatility, the higher the odds of bitcoin hitting certain levels.\nSeveral traders recently told CoinDesk that prices could rise to around $80,000 by the end of the year, irrespective of who wins the pivotal U.S. election, due Nov. 5.\nThe options market does suggest a possibility of a 22% price swing in either direction by the end of December, which means scope for a rally above $80,000 by the year-end.\n\"The current market implied volatility of BTC at-the-money options expiring on Dec. 27 is 54%, which means that in the best-case scenario, the price of BTC will rise by more than 22% to around $82,000 by the end of the year,\" Griffin Ardern, head of options trading and research at crypto financial platform BloFin told CoinDesk.\n\"However, volatility is bi-directional, so an equivalent drop cannot be ruled out either,\" Ardern said.\nOptions market probabilities can change quickly with market conditions, meaning the odds of a move to $100,000 by the year-end could improve if implied volatility jumps and prices set new highs.\nThe impending U.S. presidential election due on Nov. 5 could have far-reaching regulatory implications for the digital assets industry and could inject volatility into the market. Currently, the supposedly-pro crypto Republican candidate Donald Trump is ahead of his rival, Democrat Kamala Harris, in election polls. The election result will be declared on Nov. 8.\n\"A Harris or Trump victory is not fully priced in and crypto investors need to be ready for a lot of volatility either way. This reminds me of biotech stocks on the dates the FDA determines if the drugs are approved. These stocks either fly or crash on those days and you can typically bet something volatile will happen,\" Alexander Blume, CEO of the SEC-registered digital assets advisory Two Prime, said in an email.\nBlume added that a Harris win wouldn't be positive, at least for some time, as traders anticipating a Trump victory could square off their leveraged bets, injecting bearish volatility into the bitcoin market.",null]}
{"date":"2024-10-28","titles":["‘Very Bullish Setup’ for Bitcoin Going Into Election, According to VanEck Executive Matthew Sigel – Here’s Why","Institutional Investment: Why Do Companies Invest Millions in Crypto?"],"urls":["https:\/\/dailyhodl.com\/2024\/10\/28\/very-bullish-setup-for-bitcoin-going-into-election-according-to-vaneck-executive-matthew-sigel-heres-why\/","https:\/\/hackernoon.com\/institutional-investment-why-do-companies-invest-millions-in-crypto"],"sources":["dailyhodl.com","github.com"],"descriptions":["The head of digital assets research at exchange-traded fund (ETF) provider VanEck says that Bitcoin (BTC) is looking bullish ahead of the US presidential electi...","As of early 2024 and way before that, institutional investors and companies have poured billions into the cryptocurrency space. Why is this happening?"],"article_contents":["The head of digital assets research at exchange-traded fund (ETF) provider VanEck says that Bitcoin (BTC) is looking bullish ahead of the US presidential election.\nIn a new interview on CNBC’s Squawk Box, VanEck executive Matthew Sigel says that Bitcoin may be gearing up for an explosive breakout partially due to a potential Donald Trump election victory on November 5th.\nRepublican presidential nominee Trump is generally considered more pro-crypto than Democratic challenger Vice President Kamala Harris.\n“Trump is clearly the more pro-crypto and Bitcoin candidate and VP Harris has not said a single word on it, so one doubts whether she truly understands it.\nBut to your question about the correlations, the most significant long-term correlations for Bitcoin are a negative correlation with the US dollar and a positive correlation with money supply growth, or M2. So clearly, on the latter front money growth has re-accelerated with the Fed pivot. That may be playing part of a role. [There’s] also some sellers exhaustion. The German government and the US government sold – spitefully – $2 billion worth of Bitcoin in the last couple months. That has eased, and I think the election is helping.”\nHe also says that Bitcoin may be repeating a pattern from 2020 of low volatility leading up to the election before entering into a strong uptrend once a winner began to emerge.\n“Our bet is that this is a very bullish setup for Bitcoin into the election. We saw the exact same pattern in 2020 where Bitcoin lagged with low volatility, and then once a winner was announced we had a high volume rally as new buyers come into this market. And that’s the great thing about Bitcoin, is that every day there’s new buyers being born.”\nBitcoin is trading for $68,694 at time of writing.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","Companies, small and big alike, are now involved in the cryptocurrency world more than ever. If we’re going to define what institutional investment is in this field, we can say it refers to businesses and large financial entities investing significant capital in the cryptocurrency space. This includes direct ownership of crypto assets, yes, but it could also extend to indirect investments such as venture capital for startups, crypto-focused funds, and exchange-traded funds (ETFs) linked to crypto.\nThey’re investing a pretty penny in this, too. As of early 2024, institutional investors and companies have poured billions into the cryptocurrency space. In Q1 2024, over $2.4 billion was invested by venture capital firms in crypto startups, signaling renewed interest after a period of decline. Besides, major firms like MicroStrategy alone hold over $14 billion in Bitcoin (BTC), and a report by the research firm Absrbd indicated that over 70% of institutional investors are planning to put money in crypto this year.\nOf course, this is a risky investment for retail and institutional investors alike. One major concern is the high volatility of cryptocurrencies, where prices can fluctuate dramatically, leading to potential losses. Regulatory uncertainty could be another risk, depending on jurisdiction. Liquidity issues can arise as well, as the market might not always have enough buyers or sellers to accommodate large transactions, making it harder for institutions to move in or out of positions smoothly. Three Arrows Capital (3AC), a crypto venture fund that went broke after the Terra (LUNA) fatal crash, would have to say a lot about this.\nAgainst all odds, there are several reasons why institutional investment in crypto keeps growing. Companies are learning to navigate the risks to reap the rewards.\nWell, these are just facts. Within a year (from September 2023 to September 2024), the total crypto market capitalization has grown by over 109% [CMC]. In 2021, Chainalysis calculated that all crypto investors made around $163 billion in realized gains. Not to mention what individual coins and crypto startups have achieved over the years, without no one fully expecting it. In 2023, for instance, the memecoin Pepecoin (PEPE) had a price rally of over 7,000% in a single month just after launching. And yes, companies are investing in that one too.\nAnother example is the crypto exchange Binance, founded in 2017. It raised a total funding of $21 million from several venture capital (VCs) firms, and now it has annual revenues surpassing $12 billion. Of course, it’s not the only case: other successful firms like Coinbase, Chainalysis, and Ripple have gotten their initial funding from VCs, which keep making huge investments in the sector. Indeed, they provided $527 million to crypto startups in July 2024 alone.\nIt’s difficult to imagine companies just avoiding such good investment opportunities on purpose, despite potential risks. Even if cryptocurrency prices decrease at some point, in most cases, history has shown that they tend to recover and go higher than before. Besides, the market continues to mature, with events like the development of new platforms and the rise of decentralized finance (DeFi) pushing interest further.\nDecentralization is a good idea when investing, and it’s used in traditional finance too. Portfolio diversification involves spreading investments across various assets to minimize risk. By avoiding concentration on a single type of investment, an individual or institution can reduce the impact of poor performance in one area, making their overall investment strategy safer and more stable. In other words: companies can (and should) invest in many things at the same time, including different coins or brands as well.\nCrypto, as a relatively new asset class, offers an alternative to traditional investments like stocks and bonds, providing opportunities that can complement and diversify existing portfolios. Incorporating cryptocurrency into a portfolio can be a strategic move, especially since it behaves differently from traditional assets.\nWhile cryptocurrencies are influenced by conventional market forces in the same way as stocks and bonds, cryptocurrencies often have their own unique market drivers too. This can offer potential benefits like reduced correlation with traditional assets, possibly improving overall portfolio performance. Besides, it’s more likely in crypto to reap huge rewards quickly if a startup or coin turns out to be successful.\nUnlike previous years, in 2024, companies are finding a friendlier environment for crypto investments thanks to improved regulations and expanded infrastructure. Many governments and regulatory bodies have worked toward clearer guidelines, reducing the uncertainty that once surrounded cryptocurrency.\nFor example, countries like the U.S. and Canada have made strides in approving crypto-related products, such as Bitcoin and Ethereum Exchange-Traded Funds (ETFs), which allow companies to invest in cryptocurrencies more easily through traditional financial markets. These regulatory improvements make it safer for institutional investors to engage in the crypto space, attracting more corporate interest.\nAdditionally, advancements in crypto custody services have made it easier for companies to securely store and manage their digital assets. Reputable financial institutions like Fidelity and Coinbase Custody offer enterprise-level solutions to protect crypto holdings. This improved security infrastructure has given businesses more confidence in entering the market, reducing the risk of theft or mismanagement that previously kept many companies from investing in crypto.\nOther investment services tailored for institutional clients have also expanded, providing more options for corporate crypto investment. Crypto-focused asset managers, such as Grayscale and Galaxy Digital, offer professionally managed products that allow companies to diversify their portfolios with crypto assets. As regulations continue to evolve and infrastructure matures, more businesses are expected to incorporate crypto into their investment strategies, benefiting from a growing environment.\nBeyond the mere holding of coins, the adoption of Distributed Ledger Technology (DLT) is becoming a key driver in institutional crypto investments. Many companies are recognizing the potential of DLT, which underpins most cryptocurrencies, as a powerful tool for a variety of applications. As a result, institutions aren’t only investing in crypto assets but are also funding the development and adoption of DLT to streamline business operations and improve transparency.\nMany companies are now using specific DLT platforms to build their own products and services. For example, industries such as finance, supply chain management, and healthcare are increasingly integrating distributed solutions to reduce costs and automate processes. Institutions like the firm R3 have developed their own DLT-based platforms, such as Corda, which is designed especially for business needs.\nOn the other hand, by building on top of existing DLT platforms, businesses can create tailor-made solutions that address their unique needs while leveraging the security and efficiency benefits of this technology. As more companies develop DLT-based products and services, we can expect to see increased investment in both crypto assets and the infrastructure that supports them, driving innovation and expanding the use cases for DLT across sectors.\nObyte, with its Directed Acyclic Graph (DAG) technology, offers significant advantages for businesses looking to build on decentralized ledger systems. Unlike blockchain networks, Obyte eliminates block producers, removing middlemen and gatekeepers. This allows everyone to operate without relying on centralized entities that could censor or delay transactions.\nFor industries where transaction speed and certainty are crucial, Obyte’s structure provides faster processing and deterministic finality, ensuring that once a transaction is confirmed, it remains final and cannot be rolled back. These features could make Obyte an appealing platform for businesses seeking reliable, censorship-resistant environments for their operations.\nOne practical example of Obyte’s business use is Aufort, a company that integrates Obyte’s DAG technology with its eCommerce platform for gold trading. By using Obyte, Aufort links its products and services seamlessly, providing secure storage for gold in audited vaults. Customers can buy, sell, or withdraw their gold with ease, while Aufort registers and handles the processes in the DAG.\nObyte offers predictable transaction costs, high throughput, and a truly decentralized infrastructure. This allows companies to develop and scale their own products on a robust platform. As industries might want to seek alternatives to blockchain-based solutions due to their high concentration of power and weak censorship resistance, this DLT platform provides an effective solution, combining speed, security, and, most importantly, decentralization for a wide range of institutional applications.\nFeatured Vector Image by Freepik"]}
{"date":"2024-10-29","titles":["Crypto Surge: BTC, ETH, DOGE Rally Amid Market Movements"],"urls":["https:\/\/www.gurufocus.com\/news\/2571772\/crypto-surge-btc-eth-doge-rally-amid-market-movements"],"sources":["gurufocus.com"],"descriptions":["The cryptocurrency market saw an impressive surge today, bolstered by significant market inflows. Bitcoin (BTC) experienced a notable price increase, with BTC's"],"article_contents":["The cryptocurrency market saw an impressive surge today, bolstered by significant market inflows. Bitcoin (BTC, Financial) experienced a notable price increase, with BTC's price rising by 4.86%, reflecting renewed investor interest in the digital currency landscape.\nBitcoin's recent movement is largely attributed to the influx of large investors, with Binance witnessing a substantial uptick in trading activity. Quantitative traders have identified a notable Bitcoin buying spree that was further propelled by $175 million in short position liquidations. This surge in trading volume allowed Bitcoin to surpass the resistance level, signaling robust market participation.\nOver the past two weeks, there has been a continuous inflow into Bitcoin ETFs, evident from the accumulation of 47,000 Bitcoin. This trend underscores growing confidence in Bitcoin as an investment vehicle, amid speculations of potential U.S. rate cuts and improved regulatory conditions post-U.S. election. Such developments are expected to favor growth stocks and speculative assets like Bitcoin.\nAnalyzing the stock data, Bitcoin (BTC, Financial) is currently priced at $6.47 with a price change percentage of 4.86%. Despite having a considerable volatility rate of 94.88, BTC doesn't show direct financial metrics such as a PE ratio or EBITDA growth, aligning with its nature as an ETF rather than a traditional equity. The stock shows a low predictability score and lacks a GF Value, evidenced in metrics like the GF Value.\nThe market dynamics have also been influenced by high-profile endorsements like Elon Musk's public support for Dogecoin (DOGE), which spiked in response to his recent remarks. This highlights the potential impact of influential figures on cryptocurrency valuations, particularly for meme coins.\nOverall, traders are seizing the current market conditions to drive the cryptocurrency market upward, reflecting a broader sentiment of optimism and strategic investments focused on future gains.\nWe'd love to learn more about your experiences on GuruFocus.com and how we can improve!"]}
{"date":"2024-10-30","titles":["Bitcoin Price Achieves New ATH Against Euro, Surpassing €68,000 for First Time"],"urls":["https:\/\/www.financemagnates.com\/cryptocurrency\/bitcoin-price-achieves-new-ath-against-euro-surpassing-68000-for-first-time\/"],"sources":["financemagnates.com"],"descriptions":["Although Bitcoin (BTC) fell short by $200 of establishing a new ATH against the US dollar, it achieved this milestone against several other fiat currencies."],"article_contents":["Although Bitcoin (BTC) fell short by $200\nof establishing a new ATH against the US dollar, it achieved this\nmilestone against several other fiat currencies. Most importantly, against the\neuro, where the crypto asset surpassed €68,000 for the first time in history.\nThe leading cryptocurrency reached €68,000\non major exchanges, including Binance, marking its first all-time high against\nthe European currency since March. This breakthrough comes as Bitcoin\ndemonstrates remarkable strength against several major fiat currencies,\nreflecting growing institutional adoption and market confidence.\nAgainst the US dollar, Bitcoin tested the\n$73,600 level on Binance this week. This means it came within less than $200 of\nthe previous ATH established on March 14 at $73,794.\nAlthough the euro is the second most\nimportant currency in the global trading system, it doesn't carry the same\nweight in the cryptocurrency market. Hence, setting an ATH on the BTC\/EUR chart\nisn't as significant for investors as the BTC\/USD pair.\nThe 350 million citizens of the Eurozone just experienced a new all-time high for #bitcoin: €67,443. pic.twitter.com\/F4yn3feISZ\nHistorical data shows that the vast\nmajority of trading volume occurs on dollar pairs or with dollar-based\nstablecoins such as FDUSD, USDT, and USDC. The highest trading volume on the\nBTC\/EUR pair is generated by Bitstamp and Binance exchanges, where it amounts\nto barely $40 million daily for each. In comparison, trading volume in Korean\nwon on the BTC\/KRW pair on Upbit and Bithumb exchanges reaches nearly $400\nmillion daily, ten times more.\n“In the context of increasing\nvolatility in the cryptocurrency market, Bitcoin has surprised investors by\nreaching an intraday high of nearly five months, climbing to an impressive\nfigure of around $73,600,” said Antonio Di Giacomo, Senior Market Analyst\nat XS.com.\n“This surge has brought the most\nwell-known cryptocurrency close to its all-time high of approximately\n$73,800.00 dollars,” he explained. “Analysts point out that speculation surrounding the\npotential victory of Donald Trump in the upcoming U.S. elections has been a\ncrucial factor behind this increase.”\nThe digital asset's performance extends\nbeyond the eurozone, with new records being established against multiple other\nmajor currencies. The Australian and Canadian dollars have also witnessed\nunprecedented Bitcoin  \n            Bitcoin\n           \n      While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n     \n    While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n    Read this Term valuations, highlighting the cryptocurrency's growing\ninfluence in traditional financial markets.\nMajor financial institutions are closely\nmonitoring Bitcoin's performance, with several predicting further upside\npotential. Bernstein Research maintains an optimistic outlook, projecting\npotential valuations reaching $200,000 by late 2025.\n“By 2024 end, we expect Wall Street to\nreplace Satoshi as the top Bitcoin wallet,” commented Bernstein. “Ten\nglobal asset managers now own ~$60Bn wrapped as regulated [exchange-traded\nfunds] compared with $12Bn in September 2022.”\nLegendary Research Broker Bernstein Has Just Published One of its Famed \"Black Books\" on #Bitcoin!160 Pages Explaining Why BTC Will Hit $200k by the end of 2025 and How Listed #Bitcoin Miners Will Continue to Consolidate the Industry. @gautamchhugani 👏 pic.twitter.com\/lDnAvWeYIe\nTrading volumes have also remained robust,\nwith daily activity exceeding $47 billion. The cryptocurrency's technical\nindicators suggest sustained momentum, with support levels consolidating around\nkey psychological barriers.\n“The recent increase in Bitcoin's\nprice to levels close to its all-time high has been influenced by political\nspeculation in the United States and the actions of large investors,”\nadded Di Giacomo. “As elections approach, uncertainty and expectations\nregarding the future regulatory framework for cryptocurrencies  \n            Cryptocurrencies\n           \n      By using cryptography, virtual currencies, known as cryptocurrencies, are nearly counterfeit-proof digital currencies that are built on blockchain technology. Comprised of decentralized networks, blockchain technology is not overseen by a central authority.Therefore, cryptocurrencies function in a decentralized nature which theoretically makes them immune to government interference. The term, cryptocurrency derives from the origin of the encryption techniques that are employed to secure the netw\n     \n    By using cryptography, virtual currencies, known as cryptocurrencies, are nearly counterfeit-proof digital currencies that are built on blockchain technology. Comprised of decentralized networks, blockchain technology is not overseen by a central authority.Therefore, cryptocurrencies function in a decentralized nature which theoretically makes them immune to government interference. The term, cryptocurrency derives from the origin of the encryption techniques that are employed to secure the netw\n    Read this Term are factors that\nwill continue to impact the market.”\nToday (Wednesday), 10X Research also\npresented a positive forecast for Bitcoin, suggesting that the cryptocurrency\nwill reach $100,000 by January 2025.\n🔥 #Bitcoin to 100,000 by January 2025 ??? pic.twitter.com\/KRJHi4Tbic\nAlthough these projections seem very\noptimistic, BTC still has a long way to go to reach them. At the moment, one\nBTC trades at $72,041 or €66,586 on Binance.\nAlthough Bitcoin (BTC) fell short by $200\nof establishing a new ATH against the US dollar, it achieved this\nmilestone against several other fiat currencies. Most importantly, against the\neuro, where the crypto asset surpassed €68,000 for the first time in history.\nThe leading cryptocurrency reached €68,000\non major exchanges, including Binance, marking its first all-time high against\nthe European currency since March. This breakthrough comes as Bitcoin\ndemonstrates remarkable strength against several major fiat currencies,\nreflecting growing institutional adoption and market confidence.\nAgainst the US dollar, Bitcoin tested the\n$73,600 level on Binance this week. This means it came within less than $200 of\nthe previous ATH established on March 14 at $73,794.\nAlthough the euro is the second most\nimportant currency in the global trading system, it doesn't carry the same\nweight in the cryptocurrency market. Hence, setting an ATH on the BTC\/EUR chart\nisn't as significant for investors as the BTC\/USD pair.\nThe 350 million citizens of the Eurozone just experienced a new all-time high for #bitcoin: €67,443. pic.twitter.com\/F4yn3feISZ\nHistorical data shows that the vast\nmajority of trading volume occurs on dollar pairs or with dollar-based\nstablecoins such as FDUSD, USDT, and USDC. The highest trading volume on the\nBTC\/EUR pair is generated by Bitstamp and Binance exchanges, where it amounts\nto barely $40 million daily for each. In comparison, trading volume in Korean\nwon on the BTC\/KRW pair on Upbit and Bithumb exchanges reaches nearly $400\nmillion daily, ten times more.\n“In the context of increasing\nvolatility in the cryptocurrency market, Bitcoin has surprised investors by\nreaching an intraday high of nearly five months, climbing to an impressive\nfigure of around $73,600,” said Antonio Di Giacomo, Senior Market Analyst\nat XS.com.\n“This surge has brought the most\nwell-known cryptocurrency close to its all-time high of approximately\n$73,800.00 dollars,” he explained. “Analysts point out that speculation surrounding the\npotential victory of Donald Trump in the upcoming U.S. elections has been a\ncrucial factor behind this increase.”\nThe digital asset's performance extends\nbeyond the eurozone, with new records being established against multiple other\nmajor currencies. The Australian and Canadian dollars have also witnessed\nunprecedented Bitcoin  \n            Bitcoin\n           \n      While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n     \n    While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that \n    Read this Term valuations, highlighting the cryptocurrency's growing\ninfluence in traditional financial markets.\nMajor financial institutions are closely\nmonitoring Bitcoin's performance, with several predicting further upside\npotential. Bernstein Research maintains an optimistic outlook, projecting\npotential valuations reaching $200,000 by late 2025.\n“By 2024 end, we expect Wall Street to\nreplace Satoshi as the top Bitcoin wallet,” commented Bernstein. “Ten\nglobal asset managers now own ~$60Bn wrapped as regulated [exchange-traded\nfunds] compared with $12Bn in September 2022.”\nLegendary Research Broker Bernstein Has Just Published One of its Famed \"Black Books\" on #Bitcoin!160 Pages Explaining Why BTC Will Hit $200k by the end of 2025 and How Listed #Bitcoin Miners Will Continue to Consolidate the Industry. @gautamchhugani 👏 pic.twitter.com\/lDnAvWeYIe\nTrading volumes have also remained robust,\nwith daily activity exceeding $47 billion. The cryptocurrency's technical\nindicators suggest sustained momentum, with support levels consolidating around\nkey psychological barriers.\n“The recent increase in Bitcoin's\nprice to levels close to its all-time high has been influenced by political\nspeculation in the United States and the actions of large investors,”\nadded Di Giacomo. “As elections approach, uncertainty and expectations\nregarding the future regulatory framework for cryptocurrencies  \n            Cryptocurrencies\n           \n      By using cryptography, virtual currencies, known as cryptocurrencies, are nearly counterfeit-proof digital currencies that are built on blockchain technology. Comprised of decentralized networks, blockchain technology is not overseen by a central authority.Therefore, cryptocurrencies function in a decentralized nature which theoretically makes them immune to government interference. The term, cryptocurrency derives from the origin of the encryption techniques that are employed to secure the netw\n     \n    By using cryptography, virtual currencies, known as cryptocurrencies, are nearly counterfeit-proof digital currencies that are built on blockchain technology. Comprised of decentralized networks, blockchain technology is not overseen by a central authority.Therefore, cryptocurrencies function in a decentralized nature which theoretically makes them immune to government interference. The term, cryptocurrency derives from the origin of the encryption techniques that are employed to secure the netw\n    Read this Term are factors that\nwill continue to impact the market.”\nToday (Wednesday), 10X Research also\npresented a positive forecast for Bitcoin, suggesting that the cryptocurrency\nwill reach $100,000 by January 2025.\n🔥 #Bitcoin to 100,000 by January 2025 ??? pic.twitter.com\/KRJHi4Tbic\nAlthough these projections seem very\noptimistic, BTC still has a long way to go to reach them. At the moment, one\nBTC trades at $72,041 or €66,586 on Binance.\nShare this article"]}
{"date":"2024-10-31","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
