{"date":"2024-03-01","titles":["Sky High Inflation, Base Rates, and Bitcoin: How UK Economic Performance Affects the GBP\/BTC Price","US Spot Bitcoin ETFs Daily Trading Volume Soars to 6 Billion USD","Earnings call: Marathon Digital posts record Bitcoin production in 2023 By Investing.com"],"urls":["https:\/\/financefeeds.com\/sky-high-inflation-base-rates-and-bitcoin-how-uk-economic-performance-affects-the-gbp-btc-price\/","https:\/\/fintechnews.ch\/blockchain_bitcoin\/us-spot-bitcoin-etfs-daily-trading-volume-soars-to-6-billion-usd\/69605\/","https:\/\/www.investing.com\/news\/stock-market-news\/earnings-call-marathon-digital-posts-record-bitcoin-production-in-2023-93CH-3321239"],"sources":["financefeeds.com","fintechnews.ch","investing.com"],"descriptions":["The years 2022-2023 were marked by record-high inflation in the UK.","Ten newly launched US spot bitcoin exchange-traded funds (ETFs) broke their daily volume records on February 28, 2024, totaling nearly US$7.7 billion worth of a...","Earnings call: Marathon Digital posts record Bitcoin production in 2023"],"article_contents":["In 2024, as inflation decreases, the general audience may start seeking more conservative investment tools. However, discussions about Bitcoin’s hedging function may resume with another rise in pound inflation in the next market cycle.\nThe sharp rise in inflation in the UK began in 2021 – prices for essential goods started to surge and by 2022 had reached double-digit figures. For example, by June 2023, bread prices had increased by 18% over the previous 12 months, while eggs had risen by 29%.\nConsumer Price Inflation (CPI) rate in 2021-2023. Source: ONS\nPeople’s real wages declined despite an increase in nominal salaries adjusted to inflation. The purchasing power of the pound decreased, and many people found themselves in a challenging financial situation.\nTo make ends meet, people started looking for investment vehicles that could help preserve their money. However, the effectiveness of traditional financial instruments proved to be limited.\nThe British indices FTSE 100 and FTSE 250, representing the combined value of the largest British companies, show a negative annual return. For example, the latter has depreciated by 7% over the past year. Real estate also doesn’t seem like a profitable investment: the annual price change for properties stood at only 3.5% as of April 2023. Even gold, with its 15% yield, can barely improve things when inflation soars to 10%.\nThe ability of Bitcoin to serve as a hedge against inflation has long been up for debate. Some cite data showing that the first cryptocurrency correlates with gold and does not lose value amidst crises. Others point to Bitcoin’s volatility and insufficient historical data – and they are also correct.\nThe reality is that people do see Bitcoin as a way to protect their funds from depreciation. This was especially evident on September 26, 2022, when the pound plummeted against the dollar by 4.3% in a single day. Trading volume in the BTC\/GBP pair that day increased by 1,200%, while the BTC\/USD pair remained intact.\nThe trading volume spike for BTC\/GBP on September 26, 2022. Source: TradingView\nThe reason why Bitcoin is often likened to gold lies in its scarcity. Both Bitcoin and gold have limited supplies, which can potentially make them store of value assets during times of economic uncertainty. BTC’s supply is capped by 21 million coins – and its emission pace is halved every four years, executing the pre-programmed deflationary mechanism.\nIn 2023, Bitcoin gained 150% amidst growing inflation in the UK. Skeptics may say that the first cryptocurrency grew due to unrelated reasons, but the folks who pushed the GBP\/BTC trading volume definitely got a great deal.\nIn any case, cryptocurrency investments should be done with special caution. In 2023, the UK Financial Conduct Authority (FCA) warned firms against using the term “inflation-resistant” in relation to cryptocurrencies. Indeed, Bitcoin has no strict anti-correlation with inflation and is more oriented towards long-term growth.\nWhen inflation soars, central banks take measures to cool down the economy and tackle currency devaluation. Since December 2021, the Bank of England has raised the key interest rate 14 times, reaching a 15-year high of 5.25%. The same happened in the United States: the Fed rate climbed to 5.25-5.50%, the highest since 2007.\nRaising base rates can cause volatility for Bitcoin: people may reduce their exposure to risky assets like cryptocurrencies as borrowing costs mount. The year 2022, marked by synchronized rate hikes in the US and the UK, was a year of prolonged crypto winter and a collapse of the BTC price from $47,600 to $16,600.\nOn the other hand, the decline in prices can be explained by other reasons. After the bull run of 2021, the market was overheated, and the drop seemed inevitable. In 2022, the depressive sentiment intensified with the collapse of several major cryptocurrencies and industry players. In 2023, the market resumed its growth in anticipation of the Bitcoin halving and BTC ETF approval.\nThe cryptocurrency market has its own dynamics, and while macroeconomic factors greatly influence it, their impact is limited.\nCurrently, the BoE interest rate remains high, and inflation is gradually beginning to decline. People’s need for safe-haven assets persists but is no longer as urgent.\nExperts anticipate a rate cut in the following months. It’s too early to judge when exactly it will happen, but a repetition of the cycle can be speculated. With rate cuts, the economy will start to pick up, gradually fueling inflation – and discussions about what can serve as a hedge against pound devaluation will become relevant again.\nAs rate cut discussions gain momentum, the potential GBP\/BTC price dynamic will remain a focal point for investors. A rate cut could weaken the pound, leading investors to seek alternative stores of value like Bitcoin. This increased demand could drive up the price of Bitcoin relative to GBP. However, the extent of this relationship will depend on various factors, including market sentiment, regulatory developments, and the overall economic outlook.\nDisclaimer: The subject matter and the content of this article are solely the views of the author. FinanceFeeds does not bear any legal responsibility for the content of this article and they do not reflect the viewpoint of FinanceFeeds or its editorial staff.\nUnit No: BA857 DMCC Business Centre Level No 1 Jewellery & Gemplex 3 Dubai, United Arab Emirates.\nInternational House, 10 Admirals Way, London, England, E14 9XL.","Get the hottest Fintech Switzerland News once a month in your Inbox\nTen newly launched US spot bitcoin exchange-traded funds (ETFs) broke their daily volume records on February 28, 2024, totaling nearly US$7.7 billion worth of assets being traded on that day alone, data shared on X by James Seyffart, an ETF analyst at Bloomberg Intelligence, reveal.\nThe figure represents a staggering 63.8% increase from their previous peak of US$4.7 billion from their first day of trading on January 11, 2024, and demonstrates booming interest from investors in the new asset class.\nBlackRock’s iShares Bitcoin ETF (IBIT) is emerging as the clear winner, leading the group with US$3.4 billion traded on February 28 through with nearly 97 million shares traded. IBIT is followed by Grayscale Bitcoin Trust BTC (GBTC) with US$1.9 billion and 34 million shares traded, and Fidelity Wise Origin Bitcoin Fund (FBTC) with US$1.4 billion and almost 27 million shares.\nThe new record for #Bitcoin ETF trading volume is officially $7.69 billion. Previous record was $4.66 billion from launch day. https:\/\/t.co\/rZsOSUqk35 pic.twitter.com\/QaOKe2LuVU\n— James Seyffart (@JSeyff) February 28, 2024\nThe US Securities and Exchange Commission (SEC) approved 11 spot bitcoin ETFs on January 10, 2024 from asset managers including BlackRock, Invesco and Fidelity. These regulated investment funds, which are traded on traditional securities exchanges, allow investors to gain exposure to bitcoin without directly owning the cryptocurrency, increasing access to the cryptocurrency for everyday investors.\nBitcoin ETFs operate by allowing investors to buy shares that represent ownership in actual bitcoins held by the fund. These issuers manage purchasing, storing, and safekeeping of bitcoin on behalf of ETF investors in exchange for an annual fund management fee.\nThe approvals of US-listed bitcoin ETFs were a win for the crypto industry, which faced turmoil over the prior two years with several high-profile collapses including crypto exchange FTX.\nSince their debut last month, ten of the newly listed spot bitcoin ETFs have witnessed tremendous traction, drawing in nearly US$7.4 billion in net inflows, data from BitMEX Research show. This week, allocations to the ETFs accelerated, surpassing US$1.7 billion in three days, with BlackRock’s IBIT alone pulling in US$1.2 billion of fresh funds.\n[1\/5] Bitcoin ETF Flow – 28th Feb 2024\nAll data in. Today was a record inflow day, with $673.4m of net inflow. This was driven by Blackrock, which also had a record day, with $612.1m of inflow pic.twitter.com\/vklRVtrDoI\n— BitMEX Research (@BitMEXResearch) February 29, 2024\nThese heavy inflows have sparked comparisons between bitcoin and gold with analysts speculating about how long it will take for the total assets under management (TAM) of bitcoin ETFs to surpass TAM for gold ETFs. Bloomberg senior ETF analyst Eric Balchunas predicts that this could take less than two years to achieve given the current market frenzy.\nGold's Pain is Bitcoin ETFs' Gain in Store of Value Smackdown.. new from me on how gold being in the gutter is like the cherry on top for bitcoin fans who just got to witness the biggest ETF launch ever. Decent chance bitcoin ETFs pass gold ETFs in aum in less than 2yrs w… pic.twitter.com\/rXJra1dyhF\n— Eric Balchunas (@EricBalchunas) February 26, 2024\nEchoing Balchunas, Hunter Horsley, CEO of American crypto index fund manager Bitwise Investments, stated on X: “Bitcoin is going to eat into gold’s TAM faster than people expect. US$250k Bitcoin could happen much sooner than most who’ve followed the space for years would imagine.”\nThe market upsurge is also likely a sign that retail traders are using the bitcoin ETFs to participate in the ongoing bitcoin rally. On February 28, 2024, bitcoin surged past US$62,000, a level last seen in November 2021 and which represents an increase of 40% since the beginning of the year.\nThis rise was largely driven by the launch of the US spot bitcoin ETFs and their subsequent success, fueling demand for the cryptocurrency and pushing its price further up.\nData from Vetle Lunde, a senior analyst at Norwegian digital assets brokerage K33, reveal that US spot ETFs now hold more than 760,000 BTC under management. Since their launch, these funds have seen a net inflow of over 149,000 BTC, with the past three days alone pulling in some 30,000 BTC.\nU.S. spot ETFs now hold 768,280 BTC. They have seen a net inflow of a whooping 149,080 BTC since its launch.\nThe net flows in the past three days sit at a massive 30,754 BTC! pic.twitter.com\/ndhTt3oa94\n— Vetle Lunde (@VetleLunde) February 29, 2024\nAnother possible factor driving the rally is the upcoming bitcoin halving. The pre-programmed event, which occurs approximately every four years, is designed to control the issuance rate of new bitcoins into circulation by cutting the reward for mining bitcoins by half.\nAfter the halving, which is expected to take place in April, the number of new coins mined daily will decline to 450 from 900 currently, effectively decreasing the rate of supply growth. If demand for bitcoin remains constant or increases, the reduction in new supply entering the market could create a supply-demand imbalance and potentially lead to upward price pressure, advocates claim.\nDespite investor enthusiasm in the availability of bitcoin ETFs, advisors and top management at the European Central Bank (ECB) argue that bitcoin remains unsuitable both as a means of payment and as an investment.\nIn a new blog post published on February 22, 2024, Ulrich Bindseil, general director of the Market Infrastructure and Payments at the ECB, and Jürgen Schaaf, an advisor to the senior management of the Market Infrastructure and Payments at the ECB, state:\n“On 10 January, the US SEC approved spot ETFs for bitcoin. For disciples, the formal approval confirms that bitcoin investments are safe and the preceding rally is proof of an unstoppable triumph. We disagree with both claims and reiterate that the fair value of Bitcoin is still zero. For society, a renewed boom-bust cycle of Bitcoin is a dire perspective. And the collateral damage will be massive, including the environmental damage and the ultimate redistribution of wealth at the expense of the less sophisticated.”\nThe authors attribute the ongoing price rally to factors including rising interest rates, the forthcoming bitcoin halving and the approval of spot bitcoin ETFs, but warn that such upswings are not sustainable in the absence of economic fundamentals.\nThey criticize US regulatory authorities for their perceived failure to address the risks associated with bitcoin, and call for tighter regulation and enforcement measures to protect society from the negative consequences of bitcoin’s volatility, speculative behavior, and its associated risks.\nFeatured image credit: edited from freepik\nYour Privacy Matters to Us\nTo provide the best experiences, we use technologies like cookies to store and\/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.",null]}
{"date":"2024-03-04","titles":["3 Key Points for Crypto Trading powered by AI","Quantified Trading Strategies","Bitcoin hits fresh record high amid massive short squeeze"],"urls":["https:\/\/www.finextra.com\/blogposting\/25834\/3-key-points-for-crypto-trading-powered-by-ai","https:\/\/www.quantifiedstrategies.com\/bitcoin-futures-trading-strategy\/","https:\/\/financefeeds.com\/bitcoin-hits-fresh-record-high-amid-massive-short-squeeze\/"],"sources":["finextra.com","quantifiedstrategies.com","financefeeds.com"],"descriptions":["In the dynamic world of cryptocurrency, investors and traders are constantly seeking innovative stra...","A Bitcoin futures trading strategy refers to the methodologies and techniques you can use to trade Bitcoin futures contracts profitably. Bitcoin futures are","Bitcoin has surged to record highs against both the euro and the pound, hitting €60,447 and £51,736 respectively on Coinbase. The primary cryptocurrency has ..."],"article_contents":[null,"A Bitcoin futures trading strategy refers to the methodologies and techniques you can use to trade Bitcoin futures contracts profitably. Bitcoin futures are futures contracts whose underlying asset is a specified quantity of Bitcoin. The contract trades on the CME Globex platform, and it is financially settled. A Bitcoin futures strategy would include technical and fundamental analyses of the Bitcoin futures market, allowing you to take positions on the direction of Bitcoin prices, either for speculation, portfolio diversification, or hedging purposes.\nWant to know about Bitcoin futures trading strategies? Launched on December 18, 2017, Bitcoin futures has become a popular futures contract on the CME platform such that the exchange also created the micro futures contract. Bitcoin is a decentralized digital currency for peer-to-peer transactions. It is the most actively traded and the first cryptocurrency, debuting in 2009. It can be traded via the spot market on many crypto exchanges, but the real standardized Bitcoin futures trade on regulated commodity exchanges like the CME platform.\nIn this post, we answer some questions about the Bitcoin futures strategy, and we provide you with a backtest of a strategy.\nTable of contents:\nBitcoin futures are futures contracts whose underlying asset is a specified quantity of Bitcoin — the most popular cryptocurrency. A futures contract represents a legally binding agreement to receive or deliver the specified quantity of the asset on a future date, at a pre-agreed price. The contract trades primarily on the CME Globex platform and it is financially settled.\nApart from the Bitcoin futures that trade on the CME platform, there are also Bitcoin futures that trade on cryptocurrency exchanges. However, given how poorly regulated those crypto exchanges are, trading Bitcoin futures with them is extremely risky, which is why we will focus on CME’s Bitcoin futures.\nOf all cryptocurrencies available, only Bitcoin futures contracts are offered on the CME platform. While you can trade the other crypto futures on crypto exchanges, it is only Bitcoin futures that you can trade on the CME platform. Bitcoin contracts on the CME platform are standardized in terms of quantity and date of expiry. You can use it for portfolio diversification, risk hedging, and speculation.\nA Bitcoin futures trading strategy refers to the methodologies and techniques you can use to trade the Bitcoin contract profitably. It includes the technical and fundamental analyses for timing the Bitcoin futures market, as well as the techniques for position sizing, risk management, and so on.\nHere you can find a Bitcoin Futures trading strategy.\nTo succeed in trading the Bitcoin futures market, you will need a robust trading strategy that offers precise entry and exit signals. Your trading strategy may also include spread trading and arbitrage across exchanges.\nA backtest with strict trading rules, settings, statistics, and historical performance is coming soon.\nSeasonality in Bitcoin prices refers to the tendency of Bitcoin prices to move in a fairly predictable way during certain periods of the year. The periods here can refer to the months of the year or seasons, such as winter, spring, summer, and fall.\nBoth the Bitcoin futures market is new, so the seasonality charts are not easily available. However, there is a seasonality chart for Grayscale Bitcoin Trust. See it below:\nFrom the chart above, Bitcoin performs best in the months of April, May, August, and November. The months of January, February, March, and September tend to perform poorly.\nAs with most cryptocurrencies, Bitcoin’s price is primarily affected by its supply, the market’s demand for it, availability, competing cryptocurrencies, and investor sentiment. Since Bitcoin supply is limited —there is a finite number of bitcoin (21 million in total and less than 20 million in circulation at the moment — the price factor is the demand for Bitcoin.\nWhen there is more institutional interest in the market, the demand for it rises, and the price goes up. When institutional players dump the coin, the prices decline, as is the case in the 2022 crypto winter.\nBitcoin futures contracts are traded on the CME Group’s futures exchange in full and micro contract sizes. On the Globex electronic platform, the contract trades from Sundays to Fridays from 5:00 p.m. to 4:00 p.m. CT the next day, with a one-hour break at the end of each day.\nThere are monthly contracts listed for 6 consecutive months, quarterly contracts (Mar, Jun, Sep, Dec) listed for 4 additional quarters, and a second Dec contract if only one is listed. The full contract size is 5 Bitcoin while the mini contract size is 0.1 Bitcoin. The contracts are financially settled. Trading terminates at 4:00 p.m. London time on the last Friday of the contract month that is either a London or U.S. business day — if the last Friday of the contract month is not a business day in both London and the U.S., trading terminates on the prior London or U.S. business day.\nTo trade the contract, you need a futures broker that will grant you access to the CME exchanges where Bitcoin futures contracts are traded. The first step to start trading is to register with a futures broker and fund your account. Since futures are leveraged instruments, you don’t need to have the total worth of the contract to be able to trade it — just a little above the required margin is enough.\nAlternatively, you can trade Bitcoin futures via a crypto exchange, such as Binance or Crypto.com, but given that those exchanges are poorly regulated and don’t maintain segregated accounts\/wallets for clients’ funds, it may be risky to trade with them. Another option is to trade the CFD of Bitcoin futures contracts via an online CFD broker, such as IG. With CFD, you can trade price fluctuations without having to worry about contract expiry which applies to futures contracts.\nBitcoin futures were trading at $16745 as of December 7, 2022. See the chart here on the CME platform chart. The chart was captured from TradingView.\nAs the price changes from time to time, what is quoted here may not be the price it would be trading when you are reading this post. To get the real-time price on the CME platform or directly from TradingView, click either of those links.\nBitcoin futures trade on the CME Globex electronic platform from Sundays to Fridays; the trading hours begin from 5:00 p.m. to 4:00 p.m. CT the next day. There is a one-hour break before the start of the next trading day (4:00 p.m. – 5:00 p.m. CT) from Monday to Thursday for maintenance.\nFor BTIC, the trading schedule is Sunday to Friday, from 5:00 p.m. to 4:00 p.m. CT with a trading halt from 4:00 – 4:30 p.m. London Time (10:00\/11:00 – 10:30\/11:30 a.m. CT) and a daily maintenance period from 4:00 – 5:00 p.m. CT.\nFor CME ClearPort, the schedule is Sunday – Friday, 5:00 pm – 5:15 pm CT, with no reporting Monday – Thursday from 5:45 p.m. – 6:00 p.m. CT.\nCharts can be found on any trading platform, provided it offers chart services. If your platform does offer charts, you can subscribe to trading charts via a third-party platform, such as MultiCharts.\nA better option is to use TradingView, which even offers free access to charts of different instruments. However, if you want to connect to your broker, you have to subscribe to the Pro services. You can also access the TradingView chart via the CME platform.\nThe full contract’s product codes are as follows:\nThe micro contract’s symbol and product codes are as follows:\nOne full contract of Bitcoin futures is equivalent to 5 Bitcoin, while one micro contract is equivalent to 0.1 Bitcoin. The price quotation is in U.S. dollars and cents per Bitcoin. The minimum price fluctuation of the full contract is $5.00 per Bitcoin, equivalent to $25.00 per contract for outright trading and $1.00 per Bitcoin or $5.00 per contract for BTIC and calendar spread. The minimum fluctuation of the micro contract is the same, tailored to the contract size.\nFor both contract sizes, there are monthly contracts listed for 6 consecutive months, quarterly contracts (Mar, Jun, Sep, Dec) listed for 4 additional quarters, and a second Dec contract if only one is listed. The contracts are financially settled. Trading terminates at 4:00 p.m. London time on the last Friday of the contract month that is either a London or U.S. business day — if the last Friday of the contract month is not a business day in both London and the U.S., trading terminates on the prior London or U.S. business day. For BTIC, trading terminates at 4:00 p.m. London time on the last Thursday of the contract month, and if this is not both a London and U.S. business day, trading terminates on the prior London or the U.S. business day.\nThere are many reasons to trade Bitcoin futures, but the primary one is speculation. You can trade Bitcoin futures to profit from the sizeable volatility in the Bitcoin market. Another reason to trade this contract is to diversify your portfolio into the crypto market — Bitcoin is the biggest market in the crypto industry and offers the best liquidity for those who want to gain exposure in the crypto market.\nSome also see Bitcoin as a store of value and a hedge against inflation, but it has not fared so well in that regard in 2022.\nOne full contract of Bitcoin futures is equivalent to 5 Bitcoin, while a micro contract is equivalent to 0.1 Bitcoin. Given that the current price of 1 Bitcoin as of writing is $16745, the USD worth of a full contract of Bitcoin is 5x $16.745 = $83,745. That of the mini contract would be 0.1 x $16745 = $1,674.50.\nThe tick size of one full contract of Bitcoin futures for outright trading is $25.00 per contract, while that of the micro contract is $0.5 per contract.\nThe minimum price fluctuation of the full contract for outright trading on the Globex platform is $5.00 per Bitcoin, which is equivalent to $25.00. That of the micro contract is $5 per Bitcoin, which is equivalent to $0.5.\nYes, there are quite a number of them:\nThere are many factors that affect Bitcoin prices. These are some of them:\nBased on the TradingView chart for Bitcoin futures (BTC), the all-time high for the Bitcoin futures market is $69355. It reached this level in November 2021.\nThe biggest risk when trading Bitcoin futures comes from adverse price movement, which can be disastrous when overleveraged. As a leveraged instrument, Bitcoin futures can give oversized losses because the losses are calculated using the actual value of the contract size traded, not the margin deposited by the trader. With a 20x leverage, a 5% negative movement would wipe out your account.\nFinancially settled\nThere is the usual daily settlement, where CME Group staff determines the daily settlements for Bitcoin (BTC) and Bitcoin Euro (BTE) futures based on trading activity on CME Globex between 14:59:00 and 15:00:00 Central Time (CT), the settlement period.\nOn expiry, delivery is by cash settlement by reference to the Final Settlement Price, equal to the CME CF Bitcoin Reference Rate (BRR) on the Last Day of Trading.\n5 contracts\nThe Bitcoin spot market can be traded via crypto exchanges, and it allows you to own the Bitcoin itself, which you can hold in your private wallet. Bitcoin futures, on the other hand, are derivative contracts and don’t offer ownership of Bitcoin.\nThere is also CFD trading offered by online CFD brokers. This differs from Bitcoin futures in that futures contracts have fixed expiration dates, while CFDs can be traded indefinitely.\nBitcoin CFD\nSome of the important dates in the Bitcoin market include:\nBased on the TradingView chart for Bitcoin (BTC\/USDT on Binance), the highest level Bitcoin has ever reached was $69000. It reached this level in November 2021.\nAccording to data from bankrate.com the lowest level Bitcoin has ever transacted was $0.00099 per Bitcoin in 2009 when it made its first transaction via an exchange.\nBitcoin futures trading strategies enables you to gain exposure in the Bitcoin market for speculative, portfolio diversification, or hedging purposes.\nHow do I start trading Bitcoin futures?\nTo start trading Bitcoin futures, you need to register with a futures broker that provides access to the CME exchanges. After registration, fund your account, and you can start trading. Alternatively, you can trade Bitcoin futures via crypto exchanges or trade the CFD of Bitcoin futures contracts through online CFD brokers.\nWhat factors affect Bitcoin prices?\nBitcoin prices are influenced by factors such as institutional demand, competing cryptocurrencies, investor sentiment, news about the crypto market, and the financial health of crypto exchanges.\nWhat is the difference between Bitcoin futures and Forex for Bitcoin?\nBitcoin futures are derivative contracts, while Forex for Bitcoin involves trading the cryptocurrency in the spot market. Futures contracts have fixed expiration dates, while Forex trading can be done indefinitely.\nI’ve got an Msc from Heriot-Watt University, Edinburgh (1996), in addition a to a business administration degree the Norwegian School of Management (BI – 1994). Did my mandatory military service in between.\nAfter university, I worked two years as an auditor (1996-1998).\nI co-founded Aksjeforum.com in 1998\/99 - one of the first websites about trading and investing in Norway. It was later acquired by Digi.no in 2001.\nI have written 4 books about trading (in Norwegian). One of them has sold 30,000 copies, a record for a financial book in Norway.\nFrom 2001 until 2018 full-time independent prop trader (Series 7 in 2001) and investor.\n2018-today: Investor, writer, analyst.\nQuantitative analysis sifts through numerical data to deliver solid, evidence-based conclusions. Crucial for decision-making across finance, science, and technology, it unravels complex datasets to predict trends and enhance strategies. As you navigate this article, expect a clear exposition of its…\nFor many years, we have witnessed a weekend effect in Bitcoin from late Friday to late Monday. Moreover, volume tends to drop, and perhaps the lack of volume makes the price go up. Key takeaways: Introduction to the Weekend Effect…\nDay trading in the cryptocurrency market can offer a lot of profit potential. However, before deciding to day trade cryptocurrencies, you ought to have developed a workable day trading strategy that will help you make consistent profits. So, what is…\nThis article presents some trend following strategies on Bitcoin. Cryptocurrency markets have many of the characteristics of the commodities markets: Wild swings and gyrations, both up and down, exactly what is needed for trend following and momentum strategies. Does this…\nDoes the RSI Indicator work on crypto or Bitcoin? Bitcoin and other cryptos are attracting many traders and new investors, and the crypto daily volume is rising significantly, probably draining resources from the more traditional stock trading arena. The crypto…\nBitcoin is traded 24\/7 and there exists a few seasonal patterns. For example, being invested from 5 PM to 7 PM any day has paid off well, and so has being invested on certain days. Let’s look at a Bitcoin…\nSession expired\nPlease log in again.\n\t\tThe login page will open in a new tab. After logging in you can close it and return to this page.","Although Bitcoin soared to over $67,620, it has yet to surpass its previous all-time high in U.S. dollar terms, which stood at over $69,000 in November 2021.\nMeanwhile, the Dollar Index, a gauge of the U.S. currency’s strength against six major rivals, closed higher last week, adding to a cumulative gain of 2.7% throughout January and February 2023.\nA recent market report from Grayscale indicates a steady decline in U.S. inflation since the beginning of the year. Despite this, markets are now anticipating a higher inflation outlook. Analysts at Grayscale suggest that the current uptrend in U.S. interest rates could benefit the dollar’s value while exerting downward pressure on Bitcoin.\nThe bitcoin price surged above $65,000 in early trading on Friday, triggering a surge in liquidations of leveraged bitcoin positions. The heightened volatility led to decent liquidations, with over $80 million worth of bitcoin positions being liquidated, with the majority ($60 million) being shorts.\nAcross various centralized exchanges, the overall crypto market saw over $160 million in liquidated short positions in the last 24 hours, contributing to a total of $251 million in liquidations.\nLiquidations occur when a trader’s position is forcibly closed due to insufficient funds to cover losses, typically caused by unfavorable market movements depleting initial margin or collateral.\nWith Bitcoin eyeing its all-time high price of just over $69,000, crypto exchange Coinbase (COIN) gained over 6%, while software company MicroStrategy (MSTR), which holds more than 190,000 BTC on its balance sheet, rose around 8.2% in pre-market trading.\nBitcoin mining companies also felt the positive impact, with CleanSpark leading the pack with an 8% gain, followed by Marathon Digital, Iris Energy, and Riot Platforms with respective advances of 6.6%, 6.8%, and 4.7%.\nUnit No: BA857 DMCC Business Centre Level No 1 Jewellery & Gemplex 3 Dubai, United Arab Emirates.\nInternational House, 10 Admirals Way, London, England, E14 9XL."]}
{"date":"2024-03-05","titles":["Future of AI Bots for Crypto Trading is Here","Bitcoin Just Hit an All-Time High, so Why Are Crypto Stocks Falling?","Bitcoin Trades Over $65,000 for First Time Since 2021, Volatility Causes Losses for Most Altcoins"],"urls":["https:\/\/www.finextra.com\/blogposting\/25841\/future-of-ai-bots-for-crypto-trading-is-here","https:\/\/www.valuewalk.com\/bitcoin-all-time-high-why-crypto-stocks-falling\/","https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-price-today-all-time-high-volatility-losses-most-altcoins-cryptocurrency-market-5179505"],"sources":["finextra.com","valuewalk.com","ndtv.com"],"descriptions":["Exploring the dynamic landscape of cryptocurrency reveals an innovative segment of the financial mar...","Crypto stocks are down today, but they're not alone; in fact, the major stock-market indexes are in the red.","The overall valuation of the crypto sector has risen by 5.17 percent in the last 24 hours. As of Tuesday, March 5, Bitcoin is trading at the high price point of..."],"article_contents":[null,null,"Photo Credit: Unsplash\/ Viktor Forgacs\nThe valuation of the crypto sector currently stands at $2.5 trillion\nThe last 24 hours, Bitcoin has come closest to it last attained all-time high of around $69,000 (roughly Rs. 57.2 lakh), which it touched in 2021. On Tuesday, despite registering a loss of 1.81 percent, Bitcoin's price reached a high point of $65,036 (roughly Rs. 53.9 lakh). In the last 24 hours, the value of Bitcoin rose by $1,551 (roughly Rs. 1.28 lakh), indicating a remarkable upswing. As per analysts, the market sentiment is positive, driven by institutional demand, the growth of spot Bitcoin ETFs, and the anticipation of the upcoming halving event.\n“Bitcoin is on track to surpass its all-time high anytime now. According to IntoTheBlock, there has been a five percent year-to-date increase in the number of whales holding at least 1,000 Bitcoins,” Edul Patel, CEO of Mudrex, told Gadgets360. “Furthermore, 97 percent of all Bitcoin addresses are currently in a profitable state, showcasing a surge in demand. Out of the 19.6 million Bitcoins currently in circulation, nearly 70 percent (13.6 million) are held by holders who have maintained their positions for over a year, reflecting a growing long-term investment sentiment,” he added.\nEther followed Bitcoin and logged a loss after days of rallying up the price ladder. At the time of writing, Ether was trading at $3,450 (roughly Rs. 2.85 lakh). Over the last day, Ether dipped in value by $23 (roughly Rs. 1,910). Market experts have noted that Ethereum has seen a significant surge these recent years. The asset has risen by 128 percent over the past year and an astonishing 804,027 percent since its inception at $0.43 (roughly Rs. 35) on October 20, 2015.\n“While market pullbacks are normal during an uptrend, they can prompt anticipation and uncertainty as investors await the market's next move. The decision by the Ethereum Foundation to liquidate $13 million (roughly Rs. 107 crore) worth of ETH has raised concerns among investors, as such actions are often seen as precursors to market shifts. Presently, ETH has a strong resistance at $3,750 (roughly Rs. 3.10 lakh) and $4,000 (roughly Rs. 3.31 lakh),” the ZebPay trade desk told Gadgets360.\nMore cryptocurrencies recorded losses than profits on Tuesday, March 5. These include Binance Coin, USD Coin, Cardano, and Polkadot.\nTron, Polygon, Bitcoin Cash, Uniswap, Litecoin, and Cosmos are also recorded losses.\nProfit-making cryptocurrencies on Tuesday, on the other hand, include Dogecoin,  Shiba Inu, Leo, Stellar, Cronos, and Bitcoin SV.\nThe overall valuation of the crypto sector has risen by 5.17 percent in the last 24 hours. It's worth currently stands at $2.5 trillion (roughly Rs. 2,07,29,000 crore), as per CoinMarketCap. In the last few days, BTC dominance on the crypto market stands at 52.5 percent.\n“We are also seeing the rise of meme coins, with roughly seven meme coins now ranking among the top 100 cryptos by market cap. With a total market cap of over $54 billion (roughly Rs. 4,47,746 crore), the rise of meme coins indicates a shift in investor interest towards this bucket of crypto assets. However, with the rise of the crypto market comes retail FOMO, which may have induced speculative buying. In terms of stablecoins, Tether's USDT touched $100 billion (roughly Rs. 8,29,160 crore) market cap as a result of increased market participation,” Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, told Gadgets360.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement"]}
{"date":"2024-03-06","titles":["BITO ETF: Uptrend Likely To Continue Till Bitcoin Halving, Amid Volatility","Bitcoin, Ethereum, Dogecoin Tumble As $1.15B Worth Of Crypto Liquidations Loom: Analyst Predicts 55% Correction For King Crypto To $35K Levels","HIVE Digital Announces Bitcoin Production and HODL Growth in February 2024 to 2,131 Bitcoins"],"urls":["https:\/\/seekingalpha.com\/article\/4676284-bito-etf-uptrend-likely-to-continue-till-bitcoin-halving-amid-volatility","https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/03\/37501033\/bitcoin-ethereum-dogecoin-tumble-as-1-15b-worth-of-crypto-liquidations-loom-analyst-predic","https:\/\/markets.businessinsider.com\/news\/stocks\/hive-digital-announces-bitcoin-production-and-hodl-growth-in-february-2024-to-2131-bitcoins-1033135961"],"sources":["seekingalpha.com","benzinga.com","markets.businessinsider.com"],"descriptions":["ProShares Bitcoin Strategy ETF has seen a 34% increase in share price since December, driven by surge in Bitcoin's price. Read why I'm bullish on BITO.","Major cryptocurrencies took a tumble on Tuesday evening after the price of BTC corrected by 7% following a rally to a new all-time high of $69,324 at the Coinba...","This news release constitutes a 'designated news release' for the purposes of the Company's amended and restated prospectus supplement dated Augus..."],"article_contents":[null,"Benzinga Rankings give you vital metrics on any stock – anytime.\nMajor cryptocurrencies took a tumble on Tuesday evening after the price of BTC corrected by 7% following a rally to a new all-time high of $69,324 at the Coinbase exchange.\nWhat Happened: Bitcoin plummeted by $5,000 on March 5, triggering widespread volatility in the market.\nThis reaction came on the heels of Bitcoin reaching a historic all-time high, a moment that bullish investors had been anticipating since November 2021.\nThe rise in Bitcoin’s value was largely catalyzed by the approval of Bitcoin ETFs in January, propelling it beyond the previous November 2021 peak.\nData from CoinGlass reveals that in the last 24 hours, over $884 million in long positions were liquidated, impacting a total of 311,448 traders and resulting in a combined liquidation value of $1.15 billion.\nThe most significant single liquidation order, amounting to $9.00 million, took place on Bitmex XBT-USD. Specifically focusing on BTC, long positions worth $250 million faced liquidation, while ETH experienced liquidations totaling over $209 million.\nTop Gainer (24 Hour)\nThe global cryptocurrency market cap now stands at $2.35 trillion, showing a 7.04% decrease in the past 24 hours.\nStocks declined for the second consecutive session on Tuesday, with drops in prominent tech companies such as Apple contributing to a further retreat.\nThe Nasdaq Composite experienced a 1.65% decrease, closing at 15,939.59 as technology stocks bore the brunt of the market’s downturn. The Dow Jones Industrial Average also lost 404.64 points, or 1.04%, ending the day at 38,585.19. Furthermore, the S&P 500 saw a 1.02% dip, settling at 5,078.65.\nApple encountered an almost 3% decline following a report from Counterpoint Research, which revealed a sharp drop in iPhone sales in China during the first six weeks of 2024.\nSee More: Best Cryptocurrency Scanners\nAnalyst Notes: Cryptocurrency analyst Michael Van de Poppe advises investors to remain calm amidst the volatile market conditions, stating, “Just sit down and relax.”\nHe adds, \"Bitcoin ran from $25,000 to $69,000 in less than four months. Altcoins are on cycle lows in their BTC valuations. Liquidity flushes happen, and these corrections are harsh and painful. The markets are at the start of a bull. Use the dips. Wait.\"\nJust sit down and relax. #Bitcoin ran from $25,000 to $69,000 in less than four months. Altcoins are on cycle lows in their BTC valuations. Liquidity flushes happen, and these corrections are harsh and painful.The markets are at the start of a bull.Use the dips.Wait.\nPseudonymous analyst Rekt Capital raised the question whether the current price cycle has experienced an “acceleration” due to the pre-halving move.\n\"Something to consider as we enter a new era for Bitcoin's price action — we've never really seen price action like this before,\" he said.\nCrypto analyst Aksel Kibar presented a chart illustrating Bitcoin’s surge beyond the $69,000 mark, labeling this milestone as the “FOMO stage.”\nKibar identified BTC trading within the $65,000 and $68,000 ranges, moving closer to the November 2021 peak of approximately $69,000. He cautioned investors against succumbing to the fear of missing out at this level.\nHe said,\"$BTCUSD I don’t think this is a breakout to an all-time signal. Don't FOMO this part of the move.\"\n$BTCUSD FOMO stage. Caution. https:\/\/t.co\/MQJUMXAAEZ pic.twitter.com\/Os49hq8Uo2\nAnother on-chain analyst Ali Martinez said, \"Bitcoin MVRV indicator is at 19.57% right now! Since February 2021, each time it crossed the 18% threshold, BTC price plunged by 24% to 55%. Traders should monitor this trend as it anticipates a steep price correction!\"\nA 55% drop from its present value would bring Bitcoin down to the price point of around $35,000.\nThe MVRV (Market Value to Realized Value) indicator in cryptocurrency measures the ratio of a crypto asset’s market capitalization to its realized capitalization, serving as a tool to assess if the asset is over or undervalued. It helps investors understand market behavior by comparing the price at which the coins were last moved to the current price.\n#Bitcoin MVRV indicator is at 19.57% right now! Since February 2021, each time it crossed the 18% threshold, $BTC price plunged by 24% to 55%. Traders should monitor this trend as it anticipates a steep price correction! pic.twitter.com\/kj3ysZPC46\nPhoto by Igor Faun on Shutterstock\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.","This news release constitutes a \"designated news release\" for the purposes of the Company's amended and restated prospectus supplement dated August 17, 2023, to its short form base shelf prospectus dated May 1, 2023.\nVancouver, British Columbia--(Newsfile Corp. - March 6, 2024) - HIVE Digital Technologies Ltd. (TSXV: HIVE) (NASDAQ: HIVE) (FSE: YO0) (the \"Company\" or \"HIVE\") a pioneer in green energy-powered blockchain infrastructure, proudly announces its unaudited production figures for February 2024.  The Company has increased its Bitcoin holdings by 10% and its HODL position at month end was 2,131 Bitcoin on its balance sheet.  The Company has maintained over 4.06 Exahash (\"EH\/s\") of Bitcoin mining capacity on average for February 2024.\nFebruary 2024 Highlights:\nStrategic HODL Increase:\nAs of March 4, 2024, HIVE's HODL position increased further to 2,159 Bitcoin, up from 2,131 BTC at the end of February 2024.\nThis continuing increase aligns with the Company's strategy to strive to HODL, anticipating heightened demand for Bitcoin due to the adoption of Bitcoin as an alternative asset class as witnessed with stunning fund flows into the recent launching of Bitcoin ETF's.  We believe as we approach the Halving event in April, the short-term volatility will remain high, and investors must be aware that HIVE like our peers are usually correlated with Bitcoin but with a greater amplitude in price volatility.\nExecutive Insights:\nFrank Holmes, Executive Chairman, emphasized HIVE's strategic foresight, stating, \"Our HODL strategy is to have a healthy balance sheet similar to what we had for the last Halving event in 2020.\"\nTechnological Advancements:\nAydin Kilic, President & CEO, highlighted the Company's technological stability with the integration of Bitmain S21 Antminers into its mining fleet.  \"These advanced machines not only bolster our mining efficiency but also provide sustainable stability by significantly reducing the cost of Bitcoin production,\" Kilic noted.\nOperational Excellence and Future Outlook:\nHIVE remains at the forefront of the blockchain technology sector, continuously enhancing its mining efficiency and expanding its green energy-powered data center facilities across Canada, Sweden, and Iceland.  With a keen focus on financial stability, growth and innovation, HIVE is well-positioned to navigate the volatile crypto market dynamics while securing balanced growth and value for its stakeholders.\nAbout HIVE Digital Technologies Ltd.\nHIVE Digital Technologies Ltd. went public in 2017 as the first cryptocurrency mining company listed for trading on the TSX Venture Exchange with a sustainable green energy focus.\nHIVE is a growth-oriented technology stock in the emergent blockchain industry.  As a company whose shares trade on a major stock exchange, we are building a bridge between the digital currency and blockchain sector and traditional capital markets.  HIVE owns state-of-the-art, green energy-powered data centre facilities in Canada, Sweden, and Iceland, where we endeavour to source green energy to mine digital assets such as Bitcoin on the cloud.  Since the beginning of 2021, HIVE has held in secure storage the majority of its treasury of ETH and BTC derived from mining rewards.  Our shares provide investors with exposure to the operating margins of digital currency mining, as well as a portfolio of Bitcoin.  Because HIVE also owns hard assets such as data centers and advanced multi-use servers, we believe our shares offer investors an attractive way to gain exposure to the cryptocurrency space.\nWe encourage you to visit HIVE's YouTube channel here to learn more about HIVE.\nFor more information and to register to HIVE's mailing list, please visit www.HIVEdigitaltechnologies.com. Follow @HIVEDigitalTech on Twitter and subscribe to HIVE's YouTube channel.\nOn Behalf of HIVE Digital Technologies Ltd.\n\"Frank Holmes\"Executive Chairman\nFor further information please contact:Frank HolmesTel: (604) 664-1078\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.\nForward-Looking Information\nExcept for the statements of historical fact, this news release contains \"forward-looking information\" within the meaning of the applicable Canadian and United States securities legislation and regulations that is based on expectations, estimates and projections as at the date of this news release. \"Forward-Looking information\" in this news release includes but is not limited to: business goals and objectives of the Company; the results of operations for February 2024; the acquisition, deployment and optimization of the mining fleet and equipment; the continued viability of its existing Bitcoin mining operations; and other forward-looking information concerning the intentions, plans and future actions of the parties to the transactions described herein and the terms thereon.\nFactors that could cause actual results to differ materially from those described in such forward-looking information include, but are not limited to, the volatility of the digital currency market; the Company's ability to successfully mine digital currency; the Company may not be able to profitably liquidate its current digital currency inventory as required, or at all; a material decline in digital currency prices may have a significant negative impact on the Company's operations; the regulatory environment for cryptocurrency in Canada, the United States and the countries where our mining facilities are located; economic dependence on regulated terms of service and electricity rates; the speculative and competitive nature of the technology sector; dependency on continued growth in blockchain and cryptocurrency usage; lawsuits and other legal proceedings and challenges;  government regulations; the global economic climate; dilution; future capital needs and uncertainty of additional financing, including the Company's ability to utilize the Company's at-the-market equity offering program (the \"ATM Program\") and the prices at which the Company may sell Common Shares in the ATM Program, as well as capital market conditions in general; risks relating to the strategy of maintaining and increasing Bitcoin holdings and the impact of depreciating Bitcoin prices on working capital; the competitive nature of the industry; currency exchange risks; the need for the Company to manage its planned growth and expansion; the effects of product development and need for continued technology change; the ability to maintain reliable and economical sources of power to run its cryptocurrency mining assets; the impact of energy curtailment or regulatory changes in the energy regimes in the jurisdictions in which the Company operates; protection of proprietary rights; the effect of government regulation and compliance on the Company and the industry; network security risks; the ability of the Company to maintain properly working systems; reliance on key personnel; global economic and financial market deterioration impeding access to capital or increasing the cost of capital; share dilution resulting from the ATM Program and from other equity issuances; the construction and operation of facilities may not occur as currently planned, or at all; expansion may not materialize as currently anticipated, or at all; the digital currency market; the ability to successfully mine digital currency; revenue may not increase as currently anticipated, or at all; it may not be possible to profitably liquidate the current digital currency inventory, or at all; a decline in digital currency prices may have a significant negative impact on operations; an increase in network difficulty may have a significant negative impact on operations; the volatility of digital currency prices; the anticipated growth and sustainability of electricity for the purposes of cryptocurrency mining in the applicable jurisdictions; the inability to maintain reliable and economical sources of power for the Company to operate cryptocurrency mining assets; the risks of an increase in the Company's electricity costs, cost of natural gas, changes in currency exchange rates, energy curtailment or regulatory changes in the energy regimes in the jurisdictions in which the Company operates and the adverse impact on the Company's profitability; the ability to complete current and future financings, any regulations or laws that will prevent the Company from operating its business; historical prices of digital currencies and the ability to mine digital currencies that will be consistent with historical prices; an inability to predict and counteract the effects of COVID-19 on the business of the Company, including but not limited to the effects of COVID-19 on the price of digital currencies, capital market conditions, restriction on labour and international travel and supply chains; and, the adoption or expansion of any regulation or law that will prevent the Company from operating its business, or make it more costly to do so;  and other related risks as more fully set out in the Company's disclosure documents under the Company's filings at www.sec.gov\/EDGAR and www.sedarplus.ca.\nThe forward-looking information in this news release reflects the current expectations, assumptions and\/or beliefs of the Company based on information currently available to the Company. In connection with the forward-looking information contained in this news release, the Company has made assumptions about the Company's objectives, goals or future plans, the timing thereof and related matters. The Company has also assumed that no significant events occur outside of the Company's normal course of business. Although the Company believes that the assumptions inherent in the forward-looking information are reasonable, forward-looking information is not a guarantee of future performance and accordingly undue reliance should not be put on such information due to its inherent uncertainty. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether because of new information, future events or otherwise, other than as required by law.\nTo view the source version of this press release, please visit https:\/\/www.newsfilecorp.com\/release\/200656"]}
{"date":"2024-03-07","titles":["How to Buy Bitcoin in India?","What factors are pushing Bitcoin to a new all-time high? | Explained","What is the Bitcoin Halving? Unveiling the Most Important Event in Bitcoin's History"],"urls":["https:\/\/economictimes.indiatimes.com\/markets\/cryptocurrency\/how-to-buy-bitcoinbtc-in-india-march-2024\/articleshow\/108295205.cms","https:\/\/www.thehindu.com\/sci-tech\/technology\/what-factors-pushing-bitcoin-to-new-all-time-high-explained\/article67920313.ece","https:\/\/www.financemagnates.com\/cryptocurrency\/what-is-the-bitcoin-halving-unveiling-the-most-important-event-in-bitcoins-history\/"],"sources":["economictimes.indiatimes.com","thehindu.com","financemagnates.com"],"descriptions":["Discover how to buy Bitcoin in India with our step-by-step guide. Learn to invest confidently and navigate the crypto world safely.","On March 5, Bitcoin broke its previous price record to hit a new all-time high of $69,170.","Learn about the Bitcoin halving: its significance, impact on prices, and industry trends. The 2024 halving may be a bigger deal than any in Bitcoin’s history."],"article_contents":["Did you Know?\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors.\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\nCan the BP partnership drill new life into ageing ONGC wells?\nWhy every large IT deal is going back to the drawing board\nIndia to Trump tariffs: What? Us worry? Why?\nConsidered risky amid Covid, these 20 stocks have returned around 50x in 5 years\nAre Indian investors facing a harder hit?\nTrump’s embrace of Gandhian swadeshi economics gives India a breather with rival\nStories you might be interested in","Updated  - March 09, 2024 11:09 am IST\nMultiple factors could have contributed to Bitcoin’s price gains this year [File]\n                                          | Photo Credit: REUTERS\nStory so far: On March 5, Bitcoin, the largest cryptocurrency by market capitalisation, broke its previous price record to hit a new all-time high of $69,170.63, according to the CoinMarketCap live tracker. The last high was $68,789.63, which Bitcoin achieved in November 2021. After this event in 2021, the coin crashed to multi-year lows and the crypto market was battered by company collapses and regulatory hits.\nWhat does the new all-time high price mean for the sector? Will Bitcoin’s price keep rising? And is it a good idea to invest in cryptocurrencies?\n(For top technology news of the day, subscribe to our tech newsletter Today’s Cache)\nMultiple factors could have contributed to Bitcoin’s price gains this year.\nThe market is recovering from the shock of Russia’s invasion of Ukraine that started in 2022, as well as the collapse of cryptocurrencies LUNA\/UST and the subsequent fall of trading platforms such as FTX that same year.\nIn addition to a market recovery, the U.S. Securities and Exchange Commission (SEC), known for taking strong legal action against crypto companies, approved the first spot exchange traded funds (ETFs) for Bitcoin. This move told cautious investors as well as financial institutions that the regulatory landscape was perhaps beginning to open up, and it encouraged more traditional investors to explore the world of blockchain-based assets.\nAccording to CoinShares’ Digital Asset Fund Flows weekly report released on Monday, Bitcoin alone saw $1.73 billion in inflows. The total inflows came to $1.84 billion across digital asset investment products in general, showing just how dominant Bitcoin is.\nFurthermore, Bitcoin investors and traders are preparing for the Bitcoin Halving event predicted for this April. Many investors and analysts believe this engineered scarcity mechanism will help drive up the price of the cryptocurrency. This sense of expectation and hype usually encourages investors to buy more Bitcoin, and can help push prices up.\nThe Bitcoin Halving takes place about every four years and sees the crypto mining reward cut in half. While this may sound like a loss rather than a cause for price rises, there is more to the process.\nBitcoin miners use advanced computer equipment and enter an energy-intensive race in order to digitally “mine” their coins. This means they get some Bitcoin as a reward for helping the blockchain grow by processing other users’ transactions. While the mining reward is currently 6.25 BTC, this will be halved around April so that fewer coins are introduced into the crypto economy.\nBitcoin has a maximum supply of 21 million BTC, and more than 19 million coins are already in circulation. The halving tightens this process so that the coins will continue to be released at slower and slower rates, likely extending into the next century as well.\nThe Bitcoin Halving is meant to automatically keep the asset scarce, based on mathematic principles. This is unlike paper money, which can be printed on the basis of human decisions.\nThe dangers of volatility cannot be stressed enough.\nNew investors who are buying Bitcoin or other blockchain-based assets must know just how quickly they can lose their hard-earned money.\nFor instance, Bitcoin hit a daily high of $69,170.63 on March 5, while the 24-hour low was $59,323.91 - roughly a $10,000 difference. This means looking away from your device for even just a few minutes can drastically change your fortune.\nWhen Bitcoin reaches new high prices, many speculators usually sell their assets to exit the market with what they have, or they buy the assets at a profit again after prices fall.\nBitcoin’s market cap is more than $1 trillion this week, making it the leading crypto. Second in line is Ethereum, with a currency called Ether (or ETH for short). However, Ethereum’s market cap was less than $500 billion this week.\nWhile Bitcoin’s origin and founder (or founders) are largely a mystery, Ethereum has a relatively more corporate structure, though developers worldwide are free to participate in its ecosystem that is known for enabling self-executing commands called smart contracts. People can also establish their own crypto tokens using Ethereum’s underlying infrastructure, or build other blockchain services.\nEther used to be digitally mined like Bitcoin, but the platform has switched to the less energy-hungry ‘proof-of-stake’ model as it continues to grow.\nEther prices tend to echo those of Bitcoin, so ETH also enjoyed a lift this week as Bitcoin hit its all-time high. Ether crossed the $3,900 threshold, but it is yet to beat its all-time high price of $4,891.70 from November 16, 2021, as per CoinMarketCap.\nPublished - March 07, 2024 11:54 am IST\ntechnology (general)\n                    \n                            \/                      \n                        \n                        internet\n                    \n                            \/                      \n                        \n                        cryptocurrency\n                    \n                            \/                      \n                        \n                        The Hindu Explains\nTerms & conditions  |  Institutional Subscriber\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.","With spot Bitcoin ETFs having been approved the same year that the halving is set to take place, many newcomers to the space may be wondering: what is the Bitcoin halving? This is a common question among those wanting to learn more about the Bitcoin protocol. Expected to be the most important event in Bitcoin’s history, the 2024 halving is expected to occur sometime on or around April 13.\nHere we will cover the basics of how the Bitcoin halving works, what the Bitcoin halving is, why it happens, and what it may mean for markets this year and beyond.\n#BTC4 Phases of The Bitcoin Halving1. Pre-Halving RallyApproximately 42 days remain until the Bitcoin Halving in April 2024And ~60 days before the Halving, a Pre-Halving rally tends to occur (light blue)History has repeated in this respectNow, Bitcoin is approximately… pic.twitter.com\/UQ8Klh6EfH\nBefore looking at the potential impacts of the 2024 halving, let’s discuss how the Bitcoin halving works.\nBitcoin operates on a deflationary model, where the reward for mining new blocks is halved every 210,000 blocks, or approximately every four years, a process known as the \"halving.\" This event is significant because it reduces the rate at which new bitcoin are generated, thereby limiting supply. Bitcoin is the only asset in human history to have a fixed supply that never increases, making it the hardest currency ever known.\nThis aspect of the protocol cannot be changed due to the decentralized distribution of nodes. For the supply limit of Bitcoin to be increased, the majority of nodes would have to agree to such a change. While this might be possibly in theory, it’s hard to imagine a scenario where it becomes reality. Thousands of independent node operators around the world would have to agree to making themselves poorer and reducing the value of Bitcoin as a whole.\nThe 2024 halving will slash the block reward from 6.25 bitcoin to 3.125 bitcoin. Historically, each halving event has been followed by a notable increase in bitcoin's price, although past performance is no guarantee of future results. However, the anticipation alone can lead to increased trading volume and price volatility, as we’ve seen in recent weeks.\nContrary to what some market commentators may say, the halving can never be truly priced in before it happens. That’s because much of the selling pressure in the market comes from miners, who must sell coins to cover their operating expenses. After the halving, this selling pressure gets reduced by 50%, as the miner revenue declines by the same amount.\n#Bitcoin’s halving is almost here. Unpack the event from a miner’s perspective with our new report: https:\/\/t.co\/sUsmeP70X0 pic.twitter.com\/rcTiSIpiG6\nMiners can struggle after the halving, as they see a significant reduction in revenue. Larger, public mining companies can have a lifeline by accessing capital markets for further investment. In the absence of a swift increase in the Bitcoin price, some smaller miners may be forced to shut down.\nAs a result, the network’s hash rate tends to come down for a time after the halving. This then leads to a difficulty adjustment downwards, which can eventually make it possible for more miners to come back online.\nIf you are looking for signs that this #Bitcoin bull market is different, look no further. 👀#BTC is sitting at its all time high BEFORE the Fed has started cutting rates and BEFORE the halving. Totally unprecedented. Bullish AF.\nThis year’s halving may be the most important halving event in Bitcoin’s history. There are several converging factors that haven’t been present during previous halving cycles. Some of these include:\nIn the past, the halving has been a significant event for both Bitcoin’s price and the industry as a whole, even in the absence of the above variables. It stands to reason that this time around could be astronomical given the compounding effect of these new developments.\nIn addition, because retail investors can now gain exposure to bitcoin through ETFs, there could be ripple effects throughout the entire financial system. How this might take shape is anyone’s guess.\nTOM LEE: \"I think #Bitcoin makes a beeline back towards its long-term trend line, which is probably $82,000 in the near term, $150,000 before year-end\" 👀 pic.twitter.com\/RBw5LqaMcc\nA few of the more certain impacts of the halving and associated bull market include:\nAnd most entertaining of all, the creation of new Bitcoin-related memes tends to skyrocket during this period.\nStay tuned to social media for more on the subject.\nThe Bitcoin halving is a pivotal event, occurring approximately every four years and reducing the rate at which new bitcoin comes online. As we approach the 2024 halving, there’s a lot of anticipation for its potential impact on Bitcoin's price and the broader industry.\nWith the emergence of spot Bitcoin ETFs, increased regulatory clarity, and growing adoption by both nations and corporations, this halving could be more significant than ever before. While the exact outcomes remain uncertain, past halving events have historically led to increased trading volume, market volatility, and renewed investment in the crypto space. As we navigate through this exciting period, investors may want to stay informed and prepared for potential opportunities and challenges ahead.\nWith spot Bitcoin ETFs having been approved the same year that the halving is set to take place, many newcomers to the space may be wondering: what is the Bitcoin halving? This is a common question among those wanting to learn more about the Bitcoin protocol. Expected to be the most important event in Bitcoin’s history, the 2024 halving is expected to occur sometime on or around April 13.\nHere we will cover the basics of how the Bitcoin halving works, what the Bitcoin halving is, why it happens, and what it may mean for markets this year and beyond.\n#BTC4 Phases of The Bitcoin Halving1. Pre-Halving RallyApproximately 42 days remain until the Bitcoin Halving in April 2024And ~60 days before the Halving, a Pre-Halving rally tends to occur (light blue)History has repeated in this respectNow, Bitcoin is approximately… pic.twitter.com\/UQ8Klh6EfH\nBefore looking at the potential impacts of the 2024 halving, let’s discuss how the Bitcoin halving works.\nBitcoin operates on a deflationary model, where the reward for mining new blocks is halved every 210,000 blocks, or approximately every four years, a process known as the \"halving.\" This event is significant because it reduces the rate at which new bitcoin are generated, thereby limiting supply. Bitcoin is the only asset in human history to have a fixed supply that never increases, making it the hardest currency ever known.\nThis aspect of the protocol cannot be changed due to the decentralized distribution of nodes. For the supply limit of Bitcoin to be increased, the majority of nodes would have to agree to such a change. While this might be possibly in theory, it’s hard to imagine a scenario where it becomes reality. Thousands of independent node operators around the world would have to agree to making themselves poorer and reducing the value of Bitcoin as a whole.\nThe 2024 halving will slash the block reward from 6.25 bitcoin to 3.125 bitcoin. Historically, each halving event has been followed by a notable increase in bitcoin's price, although past performance is no guarantee of future results. However, the anticipation alone can lead to increased trading volume and price volatility, as we’ve seen in recent weeks.\nContrary to what some market commentators may say, the halving can never be truly priced in before it happens. That’s because much of the selling pressure in the market comes from miners, who must sell coins to cover their operating expenses. After the halving, this selling pressure gets reduced by 50%, as the miner revenue declines by the same amount.\n#Bitcoin’s halving is almost here. Unpack the event from a miner’s perspective with our new report: https:\/\/t.co\/sUsmeP70X0 pic.twitter.com\/rcTiSIpiG6\nMiners can struggle after the halving, as they see a significant reduction in revenue. Larger, public mining companies can have a lifeline by accessing capital markets for further investment. In the absence of a swift increase in the Bitcoin price, some smaller miners may be forced to shut down.\nAs a result, the network’s hash rate tends to come down for a time after the halving. This then leads to a difficulty adjustment downwards, which can eventually make it possible for more miners to come back online.\nIf you are looking for signs that this #Bitcoin bull market is different, look no further. 👀#BTC is sitting at its all time high BEFORE the Fed has started cutting rates and BEFORE the halving. Totally unprecedented. Bullish AF.\nThis year’s halving may be the most important halving event in Bitcoin’s history. There are several converging factors that haven’t been present during previous halving cycles. Some of these include:\nIn the past, the halving has been a significant event for both Bitcoin’s price and the industry as a whole, even in the absence of the above variables. It stands to reason that this time around could be astronomical given the compounding effect of these new developments.\nIn addition, because retail investors can now gain exposure to bitcoin through ETFs, there could be ripple effects throughout the entire financial system. How this might take shape is anyone’s guess.\nTOM LEE: \"I think #Bitcoin makes a beeline back towards its long-term trend line, which is probably $82,000 in the near term, $150,000 before year-end\" 👀 pic.twitter.com\/RBw5LqaMcc\nA few of the more certain impacts of the halving and associated bull market include:\nAnd most entertaining of all, the creation of new Bitcoin-related memes tends to skyrocket during this period.\nStay tuned to social media for more on the subject.\nThe Bitcoin halving is a pivotal event, occurring approximately every four years and reducing the rate at which new bitcoin comes online. As we approach the 2024 halving, there’s a lot of anticipation for its potential impact on Bitcoin's price and the broader industry.\nWith the emergence of spot Bitcoin ETFs, increased regulatory clarity, and growing adoption by both nations and corporations, this halving could be more significant than ever before. While the exact outcomes remain uncertain, past halving events have historically led to increased trading volume, market volatility, and renewed investment in the crypto space. As we navigate through this exciting period, investors may want to stay informed and prepared for potential opportunities and challenges ahead.\nShare this article"]}
{"date":"2024-03-08","titles":["Trader Says Top Ethereum Rival Could Surge by Over 600%, Forecasts That Bitcoin Is ‘Close to the Finish Line’"],"urls":["https:\/\/dailyhodl.com\/2024\/03\/08\/trader-says-top-ethereum-rival-could-surge-by-over-600-forecasts-that-bitcoin-is-close-to-the-finish-line\/"],"sources":["dailyhodl.com"],"descriptions":["A closely followed crypto analyst is expressing bullish sentiment on a top-10 altcoin while updating his outlook on Bitcoin (BTC)."],"article_contents":["A closely followed crypto analyst is expressing bullish sentiment on a top-10 altcoin while updating his outlook on Bitcoin (BTC).\nStarting with smart contract platform Solana (SOL), pseudonymous crypto strategist Altcoin Sherpa tells his 209,900 followers on the social media platform X that the fifth-largest crypto asset by market cap could appreciate by roughly between 250% and 600% this cycle.\n“SOL: This will cleanly break all time highs this cycle, the only question is how high. $500 is probable, something obscene like $1,000 isn’t out of the question in my opinion.\nStill one of my bigger bags. $170 next level up.”\nAccording to the analyst’s chart, it appears that after climbing above $140, the next major resistance levels for the Ethereum (ETH) competitor are around $174 and around $202.\nSolana, which hit an all-time high of around $260 in November of 2021, is trading for $142 at time of writing.\nMoving on to the flagship digital asset, Altcoin Sherpa says it will experience immense volatility in the short term but will eventually reach a six-figure price tag this cycle.\nBased on the analyst’s chart, it appears that Bitcoin could surge to just below $70,000 before plunging to around $62,000 in the near future.\n“Bitcoin is going to go to $100,000 this cycle and these short-term movements are a blip on the radar. Don’t lose your stack when we’re so close to the finish line.”\nBitcoin is trading at $67,478 at time of writing, a fractional increase during the last 24 hours.\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-03-11","titles":["Bitcoin, Ether Chase New All-Time Highs Despite Incurring Small Losses, Market Stays Volatile","Futures Drop As Nvidia Extends Slide, Japan Stocks Tumble, Bitcoin Hits $72,000"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-ether-price-today-india-all-time-high-market-volatility-5216483","https:\/\/www.zerohedge.com\/markets\/futures-drop-nvidia-extends-slide-japan-stocks-tumble-bitcoin-hits-72000"],"sources":["ndtv.com","zerohedge.com"],"descriptions":["In the last 24 hours, the overall crypto market cap dunked by 1.61 percent. Bitcoin and Ether, both registered minor losses, but have managed to come close to t...","ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero"],"article_contents":["Photo Credit: Pexels\nThe current crypto market valuation stands at $2.59 trillion\nBitcoin on Monday, March 11 registered a loss of one percent. The most expensive cryptocurrency in existence, Bitcoin is presently trading at the price point of $68,481 (roughly Rs. 56.6 lakh). This is the closest it has come to its previously set all-time high pricing of $69,225 (roughly Rs. 57.2 lakh). Over the weekend, Bitcoin managed to rise in pricing by $2,087 (roughly Rs. 1.72 lakh). Market analysts are now looking at the mark of $70,000 (roughly Rs. 57.8 lakh) as the next big resistance point for the crypto asset.\nEther slipped in pricing by 2.64 percent. The value of ETH, at the time of writing stands at $3,840 (roughly Rs. 3.17 lakh). Over the weekend, Ether also managed to record a substantial spike of $297 (roughly Rs. 24,555) in its value.\n“The biggest Spot ETF which fuelled this recent rally, BlackRock's bitcoin exchange-traded fund, has reached $10 billion (roughly Rs. 90,110 crore) faster than any US ETF in history. We could see Ethereum break the $4,000 (roughly Rs. 3.30 lakh) resistance level as the Dencun upgrade, which is expected to decrease fees on the Layer2 Blockchains, is less than two days away,” Shivam Thakral, CEO of BuyUcoin told Gadgets360.\nAlong with BTC and ETH, majority altcoins reflected losses next to their names on Monday.\nThese include Tether, Solana, Ripple, USD Coin, Cardano, Shiba Inu, Polkadot, and Tron.\nTron, Uniswap, Bitcoin Cash, and Litecoin also logged losses as of Monday.\n“With just 40 days left to the Bitcoin halving event, we can expect a period of heightened volatility in the market. Simultaneously, the wider investment landscape continues to actively move towards digital assets,” Parth Chaturvedi, Investments Lead, CoinSwitch Ventures told Gadgets360.\nIn the last 24 hours, the overall crypto market cap dunked by 1.61 percent. The current crypto market valuation stands at $2.59 trillion (roughly Rs. 2,14,13,614 crore), as per CoinMarketCap. While BTC's dominance on the market cap stands at 51.9 percent, Ether's stands at 17.9 percent.\nMeanwhile, cryptocurrencies trading in the profits include Binance Coin, Chainlink, Polygon, Near Protocol, and Leo.\n“The ETH\/BTC pair appears stable, indicating a potential rebound, which could lead to ETH outperforming BTC in the coming days or weeks. It's worth noting that the upcoming US CPI announcement may introduce additional volatility into the market, the CoinDCX research team told Gadgets360.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement",null]}
{"date":"2024-03-12","titles":["Bitcoin Experiences Price Swings With ETFs, But Analyst Foresees Long-Term Volatility Dampening: 'Will Likely Ease As Funding Rates Normalize'","Systematic Hedging of the Cryptocurrency Portfolio"],"urls":["https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/03\/37605915\/bitcoin-experiences-price-swings-with-etfs-but-analyst-foresees-long-term-volatility-dampe","https:\/\/quantpedia.com\/systematic-hedging-of-the-cryptocurrency-portfolio\/"],"sources":["benzinga.com","quantpedia.com"],"descriptions":["As the cryptocurrency market continues to evolve, the introduction of Bitcoin (CRYPTO: BTC) exchange-traded funds (ETFs) has led to unexpected outcomes, with vo...","Cryptocurrencies are already one of the major asset classes. They fill the top pages of magazines and are a topic of a day to day conversation. There are a lot ..."],"article_contents":["Benzinga Rankings give you vital metrics on any stock – anytime.\nAs the cryptocurrency market continues to evolve, the introduction of Bitcoin BTC\/USD exchange-traded funds (ETFs) has led to unexpected outcomes, with volatility levels reaching new heights.\nWhat Happened: Bitcoin’s volatility has surged, contradicting expectations that ETFs would stabilize the cryptocurrency market, CNBC reported on Monday.\nBitcoin reached a new peak last week, marking its first record in over two years, only to plunge by up to 10% and then soar to another record high. The 30-day historical volatility index for Bitcoin is at an 11-month high, reflecting increased leverage in crypto trading.\nCiti analyst David Glass noted that while ETFs were anticipated to temper volatility, the recent leverage and sharp price movements have instead led to greater short-term volatility. Funding rates for Bitcoin futures have spiked, indicating a surge in demand for leveraged crypto exposure, particularly ahead of the anticipated halving event next month.\nOpen interest in Bitcoin futures is at record levels, suggesting more liquidity and potential volatility. U.S. Bitcoin ETFs, which started trading in January, were supposed to offer a regulated entry point into the crypto market for investors.\nSee Also: Bitcoin, Nvidia, Tesla, Apple And Why Crypto Analyst Expects Dogecoin To Hit 67 Cents: Benzinga Bulls And Why Crypto Analyst Expects Dogecoin To Hit 67 Cents\nDespite the current fluctuations, Glass predicts that volatility will decrease as funding rates normalize.\n\"Realized crypto [volatility] will likely ease as funding rates normalize. However, the path to get there could be highly volatile given the increased leverage in the system,” he said.\nGlass also suggests that portfolio rebalancing should mitigate volatility.\nInvestors have been cautioned about possible steep corrections through March. Technical analysis indicates support at around $48,000, significantly below Bitcoin’s current price after hitting new highs. Meanwhile, Enclave Markets CEO David Wells believes that ETFs will eventually lead to steadier inflows, akin to automatic investments in retirement accounts, which could smooth out Bitcoin’s volatility in the long run.\n\"Anytime you reach a multi-year, all-time high, volatility will be higher until that level is broken and becomes [a] new support level,\" Wells added.\nWhy It Matters: Bitcoin ETFs have become a focal point in the cryptocurrency landscape, offering investors a new avenue to engage with Bitcoin. Indian investors now have access to U.S. Bitcoin Spot ETFs, thanks to the crypto investment platform Mudrex. This move allows for regulated investment into Bitcoin, with the option to invest in individual ETFs or curated baskets.\nMoreover, BlackRock’s iShares Bitcoin ETF (IBIT) has quickly surpassed MicroStrategy in Bitcoin holdings, amassing 195,985 BTC in less than two months. This rapid accumulation underscores the significant impact ETFs are having on the market, potentially reshaping the dynamics of Bitcoin ownership and investment strategies.\nPrice Action: At the time of writing, BTC was trading at $72,009, up 4.84% over the last 24 hours, according to data from Benzinga Pro.\nRead Next: Bitcoin Vs. Ethereum Vs. Shiba Inu Vs. Doge: How Much You Would Have Now If You Had $1,000 Invested In Each Of The Crypto At Start Of Current Bull Run\nPhoto by 24K-Production on Shutterstock\nEngineered by Benzinga Neuro, Edited by \nPooja Rajkumari\nThe GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you.\n            Learn more.\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.","Cryptocurrencies are already one of the major asset classes. They fill the top pages of magazines and are a topic of a day to day conversation. There are a lot of ways to buy them through a lot of different channels. But some of the hardcore HODLers like to keep their coin portfolio safe – they buy a portfolio of cryptocurrencies and hold them in cold storage. It has a lot of advantages (you will probably not become a victim of hacking if your crypto coins are in cold storage in your wall safe) but also some disadvantages (your cold storage device can become unreadable or destroyed). One of the disadvantages of cold storage is that while you hold the cryptocurrencies in your cold storage, you are exposed to the price swings of the cryptocurrency market (which can be tremendous). But do you need to have this risk, especially when the market is at an all-time high? What if you smartly hedged a portion of your portfolio? The goal of this article is to serve as an inspiration for a hedging strategy for your cold storage cryptocurrency portfolio. We do not say this is the only way to run a hedging strategy, but we would like to inspire you to start thinking about this possibility even when you have not considered it yet. Are you ready? Then let’s go 🙂\nImagine you want to permanently store the top 5 alts (altcoins) in a soft\/hardware wallet and find an optimal hedging strategy through BTC derivatives to minimize crypto market beta exposure risk. How do we best approach that?\nWe have created a hypothetical market capitalization-weighted Top 5 cryptocurrency index portfolio (T5) as a proxy for a portfolio; hard-core HODLers may hold that. We now do not deal with the task of picking individual coins into your portfolio. That’s the topic that is covered in entirely different articles (see, for example, our list of research articles related to cryptocurrency trading or our database entries with cryptocurrency trading strategies).\nThe rule for inclusion in the index is simple. Each year, on the first day of the year, select 5 top coins ranked by market cap for a yearly holding period. Include them in the index based on market cap weight (thus proportionally). We exclude the stablecoins from the index as the goal of the cold wallet is to hold the true cryptocurrency coins. So, the following coins can’t be part of the portfolio:\nCoinMarketCap. In daily granularity, we select a span from 2015 to have enough data for further investigation. Here, we list coin ranks at the corresponding year start:\nThe top 5 index is constructed in such a way as to mimic the B&H (buy & hold) approach, often favored by both individual and institutional investors (but maybe in different asset classes of choice). This is similar to the construction of market cap-weighted equity indexes such as the Dow Jones Industrial Average (Dow 30, as seen on CNBC, the stock market index of 30 prominent companies listed on stock exchanges in the United States, but our index is even more concentrated).\nInvestors in cryptocurrencies can experience crazy bubble rallies of altcoins, but brutal drawdowns (some even over -80 %) may be associated with them. This is the disadvantage of B&H portfolios in most asset classes, but cryptos are by far the most risky. Everybody wants to mitigate that B&H risk somehow; nobody likes to see their portfolio value disappear exceptionally fast, as in crypto busts. And that is where hedging arrives to (at least) a particular rescue.\nThere are many aspects of how something can be hedged; for our purposes, we selected a selective sequential one: We would hedge parts of the portfolio some days. The question is: how big should the hedge be, and when should it be commenced? Plus, what should be the hedge? Suspecting that there is left Bitcoin beta residual associated with other cryptocurrencies (as Bitcoin is the largest and the oldest cryptocurrency), we suppose that beta can be efficiently hedged out by Bitcoin derivatives, which may offer an antidote to drawdowns.\nFirst, we would present three naive hedging solutions, review them, check the residual spread performance, and compare advantages and disadvantages. Then, we would move to the active hedging strategy. However, let’s at least show the performances of Bitcoin and our considered and constructed T5 Index for a start:\nNow, onto the first one (proposed solution):\nAs introduced earlier, we are long the Top 5 Index portfolio and short the exact amount of $ value corresponding to Bitcoin (BTC).\nThe graph showing the performances of the spread T5 – BTC shows high volatility, especially in the years 2015, 2017, and 2018. The volatility of the spread portfolio after we naively remove the beta starts to decrease only after the year 2018.\nAfter noticing the difference in the spread’s volatility after the year 2018, we decided to split the sample to two parts – 2015-2018 (included) and 2019-2023.\nThis is the comparison of the behavior of the naïvely leveraged spread over time from the start of 2015 and 2019, respectively, where x-axe depicts t days from the start of those years. After the orange line ends, it is the last day of 2018, and the blue line continues that same spread from the first day of 2019. Once again, the volatility of the spread has been considerably dampened since 2018. In the 2015-2018 window, the average yearly spread volatility was 3.94%, whereas in the later period, it was 2.48%.\nWhy is it so? Once again, we suspect the introduction of Bitcoin futures is the cause (as we discussed in our previous article about the optimal portion of the usual investment portfolio allocated to Bitcoin).\nIn our 2nd attempt, we tried to run a simple OLS regression over the whole period and find out the beta coefficient. In this naïve “back-test”; the optimal beta was found to be ~ 0.97. Of course, we can’t use it in reality as in the first years, we would not know the data from the future. But still, this serves useful as a mental exercise.\nThe finding that surprised us was that the beta is less than 1.0, so the optimal hedging ratio would be less than $1 in the BTC futures for every $1 in the cold storage. We expected the opposite.\nThis variant is going long portfolio and hedging with BTC according to yearly regression, which gets new data, adjusts each year’s end, and rebalances accordingly on the first day of the new\/next year.\nThe problem here is that using shorter timeframe windows gives us a lower slope, which makes us dimensionally underhedged. This leaves us with a high residual and high beta on the index, which is not optimal for our purpose.\nOk, let’s continue. In the first part of the article, we checked some naive hedging methods to remove the portfolio beta and now we can continue and built some simple hedging strategy that stems from our older article Trend-following and Mean-reversion in Bitcoin. We will use the trend-following signal to selectively hedge the cold-storage portfolio.\nSo, we propose to include the following rules in a simple manner decision-if-then-tree manner:\nAnd now, finally, delve into the bread-and-butter part.\nFirstly, the performance of the BTC\/T5 index (in cold storage) from the year 2015 to 2019 and from 2019 onwards is shown.\nSecondly, let’s analyze the alternative strategy that employs the cold storage and hedges it with a BTC future with the above mentioned rules (hold cold storage without a hedge if we are at X-day high, otherwise, hedge with a BTC future)\nAs always, graphs and tables (from 2015 and 2019).\nSince 2015\nSince 2019\nWe can see that we can relatively successfully employ the hedging strategy and retain the majority of the returns of the cold-storage portfolio. For example, from the year 2019 until 2023, the cold storage portfolio registered a 57% gain with a 67% volatility and -a 77% drawdown. Our hedging strategies (mainly those that use the shorter X-day high signals) registered returns between 44% and 47%, with halved volatility (34-43%) and a fraction of the maximal drawdown of the passive cold-storage portfolio (-22% to -37%).\nOf course, the non-hedged cold-storage portfolio would probably also have higher returns in the future. However, it would be unwise not to consider hedging at least a portion of the portfolio with BTC derivatives. A little lower returns are not a high price for a good night’s sleep.\nThe cryptocurrency market is extremely volatile, and a lot of the participants are accustomed to the wild swings in the price. However, it doesn’t make sense to tolerate that large swing all of the time when there are options for dampening the volatility of the portfolio a little. Hedging variant + cold storage provides a very good tradeoff for people who want to have crypto in their own hands, their own paper or hardware (both represent so-called cold) wallets, but on the other side, want to mitigate the most adverse effects of the price swings.\nDo you have an idea for systematic\/quantitative trading or investment strategy? Then join Quantpedia Awards 2024!\nAre you looking for more strategies to read about? Sign up for our newsletter or visit our Blog or Screener.\nDo you want to learn more about Quantpedia Premium service? Check how Quantpedia works, our mission and Premium pricing offer.\nDo you want to learn more about Quantpedia Pro service? Check its description, watch videos, review reporting capabilities and visit our pricing offer.\nAre you looking for historical data or backtesting platforms? Check our list of Algo Trading Discounts.\nOr follow us on:\nFacebook Group, Facebook Page, Twitter, Linkedin, Medium or Youtube\nWe’ve already analysed tens of thousands of financial research papers and identified more than 700 attractive trading systems together with hundreds of related academic papers.\nSign up for Quantpedia Newsletter!\nGet updates from our Blog via RSS Feed\nCheck offered Algo Trading Discounts!\nJoin our Facebook Group\nYou’ve reached your limit for viewing up to 5 strategies for free\nAfter free sign-up you’ll be able to browse all free strategies in our library for free\nThis website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful.\nStrictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings.\nIf you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again."]}
{"date":"2024-03-13","titles":["Bitcoin Halving 2024 and the Crypto Industry: What to Watch Out For"],"urls":["https:\/\/www.financemagnates.com\/cryptocurrency\/bitcoin-halving-2024-and-the-crypto-industry-what-to-watch-out-for\/"],"sources":["financemagnates.com"],"descriptions":["The Bitcoin halving 2024 is an important, industry-changing event. Learn how the halving could impact your business and the industry as a whole."],"article_contents":["One of the most significant events within the Bitcoin ecosystem is the Bitcoin halving, an event that reduces the reward for mining new blocks by half. The event next month occurs approximately every four years and has profound implications for the cryptocurrency industry.\nThe halving is a pivotal moment for the crypto industry, influencing everything from miners' revenue to overall market sentiment. Industries like mining, exchanges, and funds are just a few that can be impacted. Some ways the halving can affect such industries include:\nFurthermore, for brokers and exchanges, effective ways to deal with the Bitcoin halving might involve planning to manage things like liquidity, trading volumes, and customer engagement.\nIt's official.$70,000 #bitcoin before the 2024 halving, before ZIRP, and before significant M2 growth—what does it mean?~$800T of fiat assets are about to try to get an allocation to bitcoin, which is only $1.3T today, and much of that $1.3T is not for sale. pic.twitter.com\/ZDvyWuZIIZ\nOne thing to keep in mind may be to ensure the exchange has sufficient liquidity to accommodate the increased trading activity that often follows the halving. This may involve optimizing trading algorithms, enhancing order-matching systems, and bolstering liquidity reserves.\nExchanges may also want to do all they can to keep customers informed about potential disruptions and changing market conditions around the time of the halving event. Engaging users through educational content, market insights, and promotional campaigns can help maintain interest and activity levels while fostering a sense of community within the platform.\nConsider having a plan in place for when things go wrong, for example, if overwhelming activity causes the exchange to come offline for a time.\nCoinbase is down again. pic.twitter.com\/CA0eVJY05F\nAs we approach the 2024 halving event, investors may want to monitor developments that can help gauge where the market is heading.\nThere has already been a big surge in crypto-related activity, and the halving is still about a month away. This could be foreshadowing even bigger moves to come. The spot Bitcoin ETFs have been the most successful launch for an ETF in history, with over $10 billion in inflows in less than two months. Corporations like MicroStrategy continue buying BTC, while more institutions have begun offering the ETFs to their customers. Bank of America and Wells Fargo, for example, just announced that they will be supporting the ETFs.\nOnly 38 days left until the #Bitcoin halving.We are getting really close! 😳 pic.twitter.com\/uDGQPnVhPA\nThere are some specific metrics worth keeping an eye on during this halving cycle, such as:\nThere are several other variables to consider, but these are some of the most important.\n\"With #Bitcoin right now ... there is too much demand and not enough supply.\" - Matt Hougan, CIO Bitwise pic.twitter.com\/1B0joUQ1Pp\nAs mentioned in the previous article, the history of the halving has been one of significant impacts throughout the industry. This time promises to have even greater implications, as a great new influx of demand is coinciding with a decrease in supply.\nOne of the most significant events within the Bitcoin ecosystem is the Bitcoin halving, an event that reduces the reward for mining new blocks by half. The event next month occurs approximately every four years and has profound implications for the cryptocurrency industry.\nThe halving is a pivotal moment for the crypto industry, influencing everything from miners' revenue to overall market sentiment. Industries like mining, exchanges, and funds are just a few that can be impacted. Some ways the halving can affect such industries include:\nFurthermore, for brokers and exchanges, effective ways to deal with the Bitcoin halving might involve planning to manage things like liquidity, trading volumes, and customer engagement.\nIt's official.$70,000 #bitcoin before the 2024 halving, before ZIRP, and before significant M2 growth—what does it mean?~$800T of fiat assets are about to try to get an allocation to bitcoin, which is only $1.3T today, and much of that $1.3T is not for sale. pic.twitter.com\/ZDvyWuZIIZ\nOne thing to keep in mind may be to ensure the exchange has sufficient liquidity to accommodate the increased trading activity that often follows the halving. This may involve optimizing trading algorithms, enhancing order-matching systems, and bolstering liquidity reserves.\nExchanges may also want to do all they can to keep customers informed about potential disruptions and changing market conditions around the time of the halving event. Engaging users through educational content, market insights, and promotional campaigns can help maintain interest and activity levels while fostering a sense of community within the platform.\nConsider having a plan in place for when things go wrong, for example, if overwhelming activity causes the exchange to come offline for a time.\nCoinbase is down again. pic.twitter.com\/CA0eVJY05F\nAs we approach the 2024 halving event, investors may want to monitor developments that can help gauge where the market is heading.\nThere has already been a big surge in crypto-related activity, and the halving is still about a month away. This could be foreshadowing even bigger moves to come. The spot Bitcoin ETFs have been the most successful launch for an ETF in history, with over $10 billion in inflows in less than two months. Corporations like MicroStrategy continue buying BTC, while more institutions have begun offering the ETFs to their customers. Bank of America and Wells Fargo, for example, just announced that they will be supporting the ETFs.\nOnly 38 days left until the #Bitcoin halving.We are getting really close! 😳 pic.twitter.com\/uDGQPnVhPA\nThere are some specific metrics worth keeping an eye on during this halving cycle, such as:\nThere are several other variables to consider, but these are some of the most important.\n\"With #Bitcoin right now ... there is too much demand and not enough supply.\" - Matt Hougan, CIO Bitwise pic.twitter.com\/1B0joUQ1Pp\nAs mentioned in the previous article, the history of the halving has been one of significant impacts throughout the industry. This time promises to have even greater implications, as a great new influx of demand is coinciding with a decrease in supply.\nShare this article"]}
{"date":"2024-03-14","titles":["Predicting Bullish Signals on Crypto Charts","Bitcoin's rising dominance over Ethereum"],"urls":["https:\/\/www.globalbankingandfinance.com\/predicting-bullish-signals-on-crypto-charts\/","https:\/\/www.forexlive.com\/Cryptocurrency\/bitcoins-rising-dominance-over-ethereum-20240314\/"],"sources":["globalbankingandfinance.com","forexlive.com"],"descriptions":["Predicting Bullish Signals on Crypto Charts Bitcoin, the ruler of cryptocurrencies, has recently showcased its hallmark volatility. Soaring to an all-time high ...","Discover why Bitcoin maintains dominance in crypto and find out about this little secret how to identify the relative strength trend, even for a possible ETHBTC..."],"article_contents":[null,"Bitcoin: Maintaining dominance in the cyptocurrency market\nThis article examines recent trends in the cryptocurrency market, highlighting Bitcoin's continued leadership. It also shows crypto investors and traders how to look at how BTC price is trending vs ETH price.\nUnequivocal Dominance: Bitcoin's market capitalization significantly surpasses its competitors, solidifying its position as the premier digital asset.\nInvestor Preference:  New capital is increasingly flowing into Bitcoin, particularly through burgeoning exchange-traded funds (ETFs). This suggests investor confidence in Bitcoin's stability and long-term growth potential.\nEthereum's Challenge: While Ethereum boasts a promising roadmap, Bitcoin's established presence and growing ETF accessibility position it favorably.\nThe emergence of Bitcoin ETFs has significantly enhanced investor appeal.\nEase of Investment:  ETFs offer a regulated and familiar framework for investing in Bitcoin, attracting new participants to the market.\nMarket Sentiment:  The consistent growth of Bitcoin ETFs reflects the market's confidence in Bitcoin's future.\nBitcoin vs. Ethereum: A divergent path\nWhile Ethereum offers unique functionalities, Bitcoin's narrative as a secure and valuable store of value is attracting significant investment.\nConsidering current market trends, Bitcoin offers several strategic advantages:\nHeightened trust:  Investor confidence in Bitcoin's stability continues to rise.\nAccessibility:  Bitcoin ETFs provide a convenient entry point for new investors.\nDigital gold standard:  Bitcoin's reputation as a digital equivalent to gold is solidifying.\nCrypto investment considerations\nWhile Bitcoin presents a compelling opportunity, diversification remains crucial for a well-rounded portfolio.\nConclusion: A calculated move\nIn this engaging video, we delve into a little-known secret of the crypto world, making it accessible to everyone from seasoned investors to curious newcomers. Discover the competitive dynamics between Ethereum and Bitcoin through the lens of two powerful technical indicators:\n🔍 Using the daily chart, we break down these indicators into easy-to-understand insights, providing a clear roadmap to navigate the probable future movements of Bitcoin and highlighting strategic moments for potential trend reversals. This tutorial is your key to unlocking the mysteries of crypto trading and investing, offering a simple yet effective tool to enhance your market analysis skills. Whether you're looking to sharpen your trading strategies or simply curious about crypto trends, this video has something for everyone. 🚀\nInvesting in Bitcoin transcends mere trend-following; it reflects a strategic understanding of the evolving cryptocurrency landscape. The growth of Bitcoin ETFs and consistent market inflows solidify Bitcoin's position as a dominant force in the digital asset space. Discerning investors are well-positioned to capitalize on this ongoing trend.\nAlways trade at your own risk only and visit ForexLive.com for additional views, updates, news and analyses.\nTags\nTop Brokers\nSponsored\nMost Popular\nStock Daily Updates\nMust Read"]}
{"date":"2024-03-15","titles":["Bitcoin Bloodbath: Digital Gold Loses Its Luster, But Are Investors Shaken Or Shopping?","Deciphering When To Buy And Sell Your Bitcoin","Bitcoin, Ethereum, Dogecoin Trade Mixed After Hotter Inflation Data: Analyst Predicts King Crypto To Reach $500K As Spot ETF 'Inflow Will Only Increase Over The Coming Years'"],"urls":["https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/03\/37740013\/bitcoin-bloodbath-digital-gold-loses-its-luster-but-are-investors-shaken-or-shopping","https:\/\/www.forbes.com\/sites\/digital-assets\/2024\/03\/15\/deciphering-when-to-buy-and-sell-your-bitcoin\/","https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/03\/37724175\/bitcoin-ethereum-dogecoin-trade-mixed-after-hotter-inflation-data-analyst-predicts-king-cr"],"sources":["benzinga.com","forbes.com","benzinga.com"],"descriptions":["Cryptocurrency traders and investors awoke to a scene of carnage on Friday morning as Bitcoin (CRYPTO: BTC) hemorrhaged over 10% of its value, plu","As volatile as ever, bitcoin is hitting new highs. But how can you tell the difference between normal trading and major bull or bear moves?","Major cryptocurrencies on Thursday experienced mixed trading, with data from macro and on-chain whale movement casting uncertainty over the outlook for the lead..."],"article_contents":["Benzinga Rankings give you vital metrics on any stock – anytime.\nCryptocurrency traders and investors awoke to a scene of carnage on Friday morning as Bitcoin BTC\/USD hemorrhaged over 10% of its value, plummeting to $67,567.70 in a brutal early Asian trading session.\nThis sudden price crash sent a jolt through the crypto community, igniting a firestorm of reactions and rekindling the age-old debate: is this a buying opportunity or a sign of a crumbling castle?\nThe social media streets were flooded with tweets reflecting the rollercoaster of emotions.\nWhile Bitcoin Magazine, ever the jester, took a jab at the recent volatility with a tongue-in-cheek tweet: \"BREAKING: #Bitcoin crashes to levels not seen in …checks notes … 2 weeks…\"\nThis lighthearted jab underscored the dramatic price swings that have become a hallmark of the cryptocurrency market.\nSeasoned crypto investor Jelle opted for a calming approach, reminding his followers with a touch of humor, \"First time?\"\nMeanwhile, Quinten Francois embodied the spirit of a true believer, declaring his unwavering loyalty with a battle cry of \"On my way to buy the dip!\" – a common strategy for investors who see price drops as opportunities to accumulate more coins at a discount.\nHowever, not everyone remained unfazed.\nFinancial analyst Rajat Soni cast a wary eye on the situation, pointing out the liquidation of leveraged long positions, a potential harbinger of further losses for those who bet on rising prices.\nTyler Durden echoed this concern, noting that Bitcoin hadn't seen these prices since earlier in the week, hinting at a potential short-term trend reversal.\nDespite the immediate panic, some analysts saw this as a buying opportunity in disguise.\nAdopting a long-term view, Soni described Bitcoin as \"the biggest wealth transfer that will ever happen,\" urging investors to focus on the bigger picture.\nAlso Read: Michael Saylor's Bold Bet: Analysts Marvel At MicroStrategy's Double-Down On Bitcoin\nHe argued that those who ignore Bitcoin now may find themselves regretting it later.\nThe battle lines were clearly drawn on Twitter.\nJelle championed patience, advising investors to hold onto their Bitcoin with diamond hands, unshaken by the temporary price tremors.\nOliver Wong amplified this message by sharing words of wisdom from Bitcoin bulls Michael Saylor and Cathie Wood – a rallying cry to hold on tight.\nOn the other hand, Bitcoin Munger suspected foul play, suggesting the drop was orchestrated by market manipulators who \"just liquidated leveraged longs.\"\nCrypto user Vivek offered a different perspective, emphasizing the importance of a long-term investment horizon. For him, Bitcoin requires a minimum commitment of four years to experience its potential truly.\nThe future of Bitcoin remains shrouded in uncertainty.\nHowever, some analysts like Thomas Fahrer believe a potential surge is on the horizon, fueled by institutional buying.\nHe pointed to upcoming regulatory filings that could reveal significant purchases by institutional giants who entered the market after Bitcoin ETFs launched.\nWhile the immediate future may seem bleak for some, Inspired Analyst used the opportunity to question if people are still missing out on the cryptocurrency revolution.\nThis sentiment was echoed by Simply Bitcoin TV, who declared their unwavering faith by tweeting, \"I'm buying every dip!\"\nRead Next: Who Is Satoshi Nakamoto? Court Rejects Craig Wright's Claim To Be Bitcoin's Inventor\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.","ByCharles Lloyd Bovaird II\nByCharles Lloyd Bovaird II,\nSenior Contributor.\nIt is not always easy to know when its time to buy or sell bitcoin\nBitcoin prices have been on a tear over the past month, rallying 60% to set a new all-time high above $72,000 as the cryptocurrency benefits from billions of dollars in flows into spot-based exchange-traded funds and anticipation surrounding the upcoming halving.\nCrypto is clearly in another bull run, but making this judgment is usually complex given bitcoin’s natural volatility, as is identifying when they are starting to stall. Investors must understand a bull market’s core components and indicators to make informed portfolio decisions throughout market cycles.\nMost analysts define a bull market for stocks as a 20% increase from a recent low, which can be measured by tracking the progress of a single stock or a primary index like the S&P 500. For instance, equities are also in a bull run right now—despite consistently stubborn inflation—because the S&P 500 is up about 24% from its recent low in October 2023.\nThe S&P 500 is currently in a bull market\nThe situation with bitcoin is more complicated. The digital currency has a history of significant volatility and frequently experiences 20% gains and losses. In the last 12 months, bitcoin surged more than 20% at least three times and dropped by more than 20% on four occasions. This erratic behavior is not helpful for investors looking to make long-term directional plays.\nIn the last 12 months, bitcoin surged more than 20% at least three times and dropped by more than 20% on four occasions.\nTherefore, several other variables, such as trading volume, the derivatives market, market sentiment, and critical support and resistance levels, must be considered before declaring a bull or bear market in crypto.\nSubscribe now to Forbes' CryptoAsset & Blockchain Advisor and successfully navigate the bitcoin and crypto market roller-coaster.\nThe easiest place to begin is by determining a price movement threshold that would constitute a new market trend. The 20% benchmark traditional industry uses needs to be increased. To apply this metric to crypto, it is necessary to consider its comparatively high volatility relative to traditional assets.\nJoshua de Vos, research lead at CCData, looked at the 30-day rolling annualized volatility of the cryptocurrency and the S&P 500 index going back to 2010, calculating a ratio for each year. While this figure has decreased, bitcoin was roughly 3.3 times more volatile than the S&P 500 over the last few years (2022, 2023 and the start of 2024).\nThe table below illustrates these changes, specifically comparing bitcoin price data from Bitstamp to the benchmark index:\nBitcoin price data from Bitstamp\nWith this ratio, de Vos estimates that a 66% increase in bitcoin would indicate a possible bull run. Going back to the most recent chart, by this metric, it would mean that the only bitcoin bull run in 2023 would have started in August, which coincides with a landmark ruling by the Washington, D.C Circuit Court of Appeals vacating a rejection of a bitcoin exchange-traded fund (ETF) application from the SEC. However, confirming a bull market still requires reviewing other factors.\nAnother area that can be analyzed is the derivatives market. During bullish periods, optimistic investors tend to use futures contracts as tools to bet on further price increases, oftentimes with leverage to stretch out gains. The challenge here is identifying shifts in the behavior of derivatives traders before a directional shift in the underlying asset price.\nA key finding in derivatives data during the fall of 2023 signaled an impending bull run. Between roughly the end of September 2023 (9.27.23) and the end of October 2023 (10.24.23), the open interest on bitcoin options on Deribit, measured in U.S. dollars, increased by more than 100%, rising from approximately $6.45 billion to $13.96 billion. Open interest is defined as the total value of unsettled futures contracts.\nNow, as discussed earlier, the bull run started in August, but it accelerated in October when the SEC declined to appeal the DC Appellate court’s decision regarding its decision on Grayscale’s ETF application. It then accelerated again in February 2024 right before bitcoin’s surge above $70,000 for the first time. Therefore, sometimes, there can be accelerations in momentum during bull runs, which is evidenced here. The key metric is a 100% surge in open interest.\nThe chart below displays this activity. A link can be found here.\nBitcoin derivatives data\nBitcoin trading volumes continue to rise\nAnother key variable is trading volume, specifically identifying changes in activity that would indicate a new market cycle. However, this metric requires some nuance. De Vos looked at specific activity in 2019 and 2020 to show what shifts could signal the start of a bull market.\n“In the first quarter of 2019, the crypto market experienced its lowest average quarterly volume since the third quarter of 2017,” he stated, citing figures from CCData. He singled this out as a “significant bottom,” after which bitcoin formed a bullish market structure.\n“A notable observation during this time was the substantial increase in quarter-over-quarter volume from Q1 to Q2 2019. This increase in volume was sustained well above the levels recorded in Q1, signaling growing market interest and potentially the start of a bullish trend,” he continued.\nDe Vos noted, citing figures from CCData, which sources data from roughly the 100 top exchanges, that volume rose by nearly 150% from roughly $250 billion to $623 billion between Q1 and Q2 2019.\nThe following quarter, trading volume dropped roughly 14% to $537 billion, and then it declined another 19% to $434 billion in the subsequent period. This metric may have decreased because the Q2 2019 surge represented an overreaction, and some price consolidation occurred afterward. This again shows why evaluating many factors in making such a determination is necessary. The chart below illustrates these developments:\nBitcoin price action during previous market cycles\nHe noted that near mid-March 2020, bitcoin plummeted over 50% in 24 hours. This point represented another market bottom, and in April and June 2020, spot trading volumes increased significantly. “This period saw consecutive price increases, which, combined with the increased volumes, instilled a bullish sentiment in the market,” de Vos claimed.\nAnother potentially helpful way to examine trading volume for bull market signals is by examining its moving averages. Moving averages smooth out data volatility by averaging values looking back in time. The chart below compares bitcoin’s price with a relatively low 7-day simple moving average (SMA). Although the pattern does not always fit, clear surges of more than 50% in the 7-day SMA in the spring of 2020 and January 2023 predicted bull runs.\nClear surges of more than 50% in the 7-day SMA in the spring of 2020 and January 2023 predicted bull runs.\nBut a word of caution: increased trading volume does not always equate to bull runs. Sometimes, the opposite can be true. For instance, there was also a surge in July 2022, but that volume rush was more due to a sell-off during the bearish end of 2022.\nAn even better indicator may be a surge in trading volume that occurs without a commensurate increase in bitcoin balances on an exchange (a leading indicator of the intention to sell). As you can see in the bottom chart, the spikes in the spring of 2020 and January 2023 coincided with the amount of bitcoin on exchanges either decreasing or staying the same. This matters because it signals that growing buying pressure for the asset is not met with an increase in supply from willing sellers.\nSpikes in 2020 and January 2023 coincided with the amount of bitcoin on exchanges either decreasing or staying the same\nAside from these indicators, technical analysis of bitcoin price charts can also help detect bull markets. There is evidence that a bitcoin bull structure was beginning in March 2023, according to CCData’s de Vos. To illustrate this development, he provided a chart depicting bitcoin’s price movements from May 2022 until now:\nBitcoin price action on an uphill trend\n“Analyzing the chart, the horizontal line indicates the price level which needs to be exceeded for a bullish market structure break to be confirmed (set in August 2022),” he stated. The expert tied the aforementioned market structure to the suggested 66% price increase, stating that “Based on the chart provided, a 66% move from the bottom would put BTC at ~ $ $25,600, which coincidentally serves as a price level just above the bullish market structure break (~$ $24200).”\n“Utilizing the threshold provided of 66%, Bitcoin would have confirmed ‘bull market’ status upon the exact weekly candle where a bullish market structure break was confirmed (w\/c 13 March 2023), if we consider a bull market to be characterized by price action alone,” he noted.\nDe Vos offered further background context, examining key technical levels.\n“During the Silicon Valley Bank crisis in March 2023, bitcoin broke out of a multi-month consolidation, achieving its highest price since August 2022. By breaking above that previous resistance and retesting it as support, bitcoin’s bullish market structure was confirmed, maintaining higher lows and higher highs throughout 2023,” said de Vos.\nBased on the factors outlined above, it is clear that bitcoin is in a bull market right now. A natural question to then ask is how long the market will continue. Each one ends differently, and its closure can come from several factors. For instance, a major catalyst for the collapse of the 2017 bull run was the creation of bitcoin futures, which let professional investors short the asset for the first time. The 2022 bear market was rooted in rapid monetary tightening from the Federal Reserve and other central banks around the world to rein in the highest levels of inflation in decades. But those bull runs lasted between 1-1.5 years. The market is currently in about an eight-month surge, and there are reasons to expect it to continue.\nThe upcoming bitcoin halving, a once-every-four-year event, will shrink bitcoin’s rate of new supply by 50%. This reduction, combined with further expectations of asset manager inflows into the bitcoin ETFs and growing expectations for a soft landing of the economy will likely extend this bull run. There will still be volatility, but the longer-term trend should stay intact for some time.\nInvestors looking to invest in bitcoin have a variety of options. Direct bitcoin exposure can be gained from purchasing it on the spot market from an exchange like Coinbase or Kraken, but the fees are higher than investing in one of the new ETFs offered from firms like BlackRock, Fidelity, WisdomTree, Invesco and VanEck. On the equity side, software company MicroStrategy (MSTR) is the best pure-play crypto stock because of its large leveraged holding of the digital asset. Bitcoin miners have served as proxies in the past, but they are underperforming bitcoin due to concerns about how the halving will impact their profitability post-April. Coinbase is appealing as a more diversified way to get exposure to the industry, as it offers a wide variety of services beyond just offering brokerage services.","Benzinga Rankings give you vital metrics on any stock – anytime.\nMajor cryptocurrencies on Thursday experienced mixed trading, with data from macro and on-chain whale movement casting uncertainty over the outlook for the leading cryptocurrency and the broader market.\nWhat Happened: Data released by the Labor Department’s Bureau of Labor Statistics on Thursday revealed a 0.6% increase in the producer price index last month.\nThis crucial inflation indicator revealed that prices surged beyond expectations in February. Traders have interpreted this data as a potential indication that the Federal Reserve might refrain from cutting interest rates in May. As a result, there was a significant sell-off of cryptocurrency in response to this development.\nGrayscale reportedly shifted around $400 million in Bitcoin to its custodian, Coinbase, as per Arkham Intelligence data today. In January, the fund manager offloaded a significant amount of BTC, moving $2.2 billion in a matter of days to the exchange, causing downward pressure on the price.\nIn the past 24 hours, CoinGlass data reveals that over 161,570 traders liquidated their positions worth $547.19 million. The largest single liquidation order, valued at $13.30 million, took place on OKX – BTC-USDT-SWAP. Moreover, over $135 million worth of longs in BTC and over $80 million in ETH longs have been liquidated.\nTop Gainer (24 Hour)\nThe global cryptocurrency market cap now stands at $2.77 trillion, showing a 0.11%  increase in the past 24 hours.\nThe 30-stock Dow retreated by 137.66 points, or 0.35%, concluding at 38,905.66. The Nasdaq Composite experienced a 0.3% decrease, ending at 16,128.53, while the S&P 500 slipped 0.29%, finishing the session at 5,150.48.\nIn February, the producer price index, which measures wholesale inflation, rose by 0.6%. When excluding food and energy prices, the core PPI showed a 0.3% increase. This exceeded the expectations of economists polled by Dow Jones, who had predicted a 0.3% gain for headline PPI and a 0.2% increase for the core reading.\nSee More: Best Cryptocurrency Scanners\nAnalyst Notes: Cryptocurrency analyst Michael Van de Poppe said, \"The Spot #Bitcoin ETFs have proven that Bitcoin isn’t going away and is a legitimate asset, with a significant use case of ‘Hard Money’.  I think that the inflow will only increase over the coming years. Bitcoin to $500K.\"\nData tracked by BitMEX Research reveals a significant surge in spot Bitcoin ETFs since launch. In total, the inflows surpassed the $4 billion mark on Tuesday.\nIt's incredible how fast the adoption is accelerating.The Spot #Bitcoin ETFs have proven that Bitcoin isn't going away and is a legitimate asset, with a significant use case of 'Hard Money'. I think that the inflow will only increase over the coming years. #Bitcoin to $500K.\nPseudonymous crypto analyst Rekt Capital said, \"Whenever Bitcoin breaks its old All Time High, price doesn't just enter an uninterrupted uptrend. Historically, $BTC has experienced lots of upside & downside volatility around old ATHs. But once that volatility resolves itself… Price Discovery awaits.\"\nAli Martinez, an on-chain analyst, said that the short-term realized Profit\/Loss Margin indicator reveals that short-term Bitcoin holders are currently sitting on profits of 70% in their holdings. \"This level of unrealized BTC profits is the highest in the past three years!\"\nThe STHRP Profit\/Loss Margin indicator reveals that short-term #Bitcoin holders are currently sitting on profits of 70% in their holdings. This level of unrealized $BTC profits is the highest in the past three years! pic.twitter.com\/nK3EZhcGVH\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users\nPhoto via Shutterstock\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes."]}
{"date":"2024-03-18","titles":["Bitcoin price: Standard Chartered says $150,000 level in 2024 'now looks likely' By Investing.com","1 Super Cryptocurrency Could Soar to $200,000 by 2025, According to a Wall Street Analyst"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/bitcoin-price-standard-chartered-says-150000-level-in-2024-now-looks-likely-3342345","https:\/\/finance.yahoo.com\/news\/1-super-cryptocurrency-could-soar-093000021.html"],"sources":["investing.com","finance.yahoo.com"],"descriptions":["Bitcoin price: Standard Chartered says $150,000 level in 2024 'now looks likely'","Some Wall Street analysts believe a combination of catalysts could push the price of Bitcoin much higher in the coming months."],"article_contents":[null,"Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe price of Bitcoin (CRYPTO: BTC) has rocketed by 65% to about $68,000 since the beginning of 2024. But certain Wall Street analysts still see a substantial upside in the cryptocurrency.\nGautam Chhugani at Bernstein believes Bitcoin will reach $150,000 by mid-2025, implying that its price will soar by 120% (or $82,000) during the next 12 to 18 months. Similarly, Geoff Kendrick at Standard Chartered Bank believes Bitcoin could reach $200,000 by the end of 2025, implying that its price could soar by 194% (or $132,000) during the next 21 months.\nUltimately, cryptocurrencies are no different than any other asset. Their prices are a product of supply and demand. However, the total possible Bitcoin supply is limited to 21 million coins, and 19.7 million (94%) of them are already in circulation. That means demand is the most consequential variable where Bitcoin is concerned.\nWith that in mind, Chhugani and Kendrick believe two catalysts will turbocharge Bitcoin demand in the coming months: the recent approval of spot Bitcoin exchange-traded funds (ETFs) and the halving event next month.\nIn January, the Securities and Exchange Commission (SEC) approved 11 spot Bitcoin ETFs, which differ from the Bitcoin futures ETFs that started trading in 2021. Specifically, spot Bitcoin ETFs track Bitcoin prices precisely because they invest directly in the cryptocurrency. Bitcoin futures ETFs do not track Bitcoin prices as precisely because they invest in futures contracts -- agreements to buy or sell assets at agreed-upon prices on predetermined dates.\nInvestors can see that dynamic in action by observing the performance of the ProShares Bitcoin Strategy ETF, the largest Bitcoin futures ETF. While Bitcoin gained about 200% since the start of 2023, the ProShares Bitcoin Strategy ETF is up only 123% in that period.\nIn short, spot Bitcoin ETFs reduce friction. They offer direct exposure to Bitcoin without the hassle of cryptocurrency exchanges and blockchain wallets. Instead, investors can effectively purchase Bitcoin through existing brokerage accounts and hold it alongside other assets in their portfolios. That convenience could bring more retail traders and institutional investors into the crypto market.\nIn fact, that seems to be happening already. The spot Bitcoin ETFs issued by BlackRock and Fidelity ranked as the two most successful ETF launches in history, according to Bloomberg Intelligence. They accumulated more assets during their first months of trading than the other 5,500 ETFs that launched in the past 30 years. That screams demand.\nLooking ahead, Chhugani believes those products will lead to \"unprecedented institutional adoption\" of Bitcoin. That is particularly auspicious because PwC estimates that institutional assets under management will reach $145 trillion by 2025. If even a small fraction of that total is allocated to Bitcoin, its price could rocket much higher. In that context, Bitcoin reaching $150,000 by mid-2025 or $200,000 by the end of 2025 is a plausible outcome.\nAs mentioned, the total supply of Bitcoin that can ever be mined is capped at 21 million coins. That feature has helped Bitcoin fans promote its reputation as a type of digital gold, simply because gold also derives value from its scarce supply. Halving events are part of the mechanism that enforces the Bitcoin supply limit.\nSpecifically, each time 210,000 blocks are added to the Bitcoin blockchain, the rewards miners get for validating transactions are cut in half. This happens about once every four years. The next halving is forecast to occur on April 16. That event should effectively boost demand by blunting selling pressure, simply because miners will have 50% less newly mined Bitcoin to sell during the next four years.\nSo far, Bitcoin has always gained value during the two-year period after a halving.\nHalving\nBitcoin Return (2 Years Later)\nNovember 2012\n2,964%\nJuly 2016\n922%\nMay 2020\n348%\nData source: Fidelity Digital Assets.\nThe post-halving gains have diminished with each successive halving event because their impact on total supply has become less significant over time. For instance, the halving in November 2012 saw mining rewards fall from 50 Bitcoin to 25 Bitcoin, a much steeper drop in terms of the number of coins than the 25 to 12.5 cut that occurred in July 2016, which itself was much steeper than the 12.5 to 6.25 cut in May 2020.\nIn that context, the impact of next month's halving (which will cut mining rewards from 6.25 BTC to 3.125 BTC) will likely be smaller than previous halvings.\nUltimately, no one knows what Bitcoin will be worth in the future. The targets of $150,000 and $200,000 outlined by Chhugani and Kendrick, respectively, are certainly plausible due to the catalysts I've discussed. But investors should never anchor themselves to such estimates.\nAdditionally, bear in mind that Bitcoin has been extremely volatile in the past. It lost more than 76% of its value during the last cryptocurrency market crash, and similar plunges are possible in the future. In that context, a long-term mindset is critical. Anyone who bought and held Bitcoin for at least five years has profited, regardless of when they made their purchases, according to Ark Invest.\nHere's the bottom line: Patient investors comfortable with risk and volatility should absolutely consider allocating a small portion of their portfolios to Bitcoin, but they should not do so with the expectation of seeing triple-digit percentage returns by 2025. That may or may not happen. But Bitcoin has crushed the returns of virtually every other asset class -- including gold, commodities, real estate, bonds, equities, and emerging market equities -- during the past five years, and a similar outperformance during the next five years is possible.\nShould you invest $1,000 in Bitcoin right now?\nBefore you buy stock in Bitcoin, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bitcoin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 11, 2024\nTrevor Jennewine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin. The Motley Fool has a disclosure policy.\n1 Super Cryptocurrency Could Soar to $200,000 by 2025, According to a Wall Street Analyst was originally published by The Motley Fool"]}
{"date":"2024-03-19","titles":["Bitcoin price: Is this the last dip buying opportunity? By Investing.com","Bitcoin Takes A Dive As Flash Crash Hits $8.9K On BitMEX Crypto Exchange","IBIT ETF: There's Still Plenty Of Upside In Bitcoin Amid Halving"],"urls":["https:\/\/www.investing.com\/news\/cryptocurrency-news\/bitcoin-price-is-this-the-last-dip-buying-opportunity-3344474","https:\/\/www.benzinga.com\/markets\/cryptocurrency\/24\/03\/37814911\/bitcoin-takes-a-dive-as-flash-crash-hits-8-9k-on-bitmex-crypto-exchange","https:\/\/seekingalpha.com\/article\/4679102-ibit-ishares-bitcoin-trust-etf-still-plenty-of-upside-crypto-btc-halving"],"sources":["investing.com","benzinga.com","seekingalpha.com"],"descriptions":["Bitcoin price: Is this the last dip buying opportunity?","Late Monday evening, Bitcoin (CRYPTO: BTC) experienced a sudden and dramatic drop in value on the BitMEX cryptocurrency exchange, plunging to $8,900 from much h...","iShares Bitcoin Trust ETF is one of the simplest ways to get exposure to Bitcoin. Find out why IBIT ETF is an appealing option for long-term investors."],"article_contents":[null,"Benzinga Rankings give you vital metrics on any stock – anytime.\nLate Monday evening, Bitcoin BTC\/USD experienced a sudden and dramatic drop in value on the BitMEX cryptocurrency exchange, plunging to $8,900 from much higher figures on other platforms.\nWhat Happened: Bitcoin is the apex cryptocurrency, trading over $60,000 on various exchanges. However, within a mere two minutes, as per TradingView’s charts, its value plummeted to its lowest level since early last year.\nFollowing this unexpected tumble, Bitcoin made a swift comeback, climbing to a price of $67,000. While BitMEX saw these drastic fluctuations, the average global price of Bitcoin hovered around $67,400.\nBitcoin’s surge to record levels has shown signs of losing steam. The cryptocurrency, which reached a peak of $73,835 on March 14, saw its value drop by 8.3% by March 19.\nThis downturn in Bitcoin’s price follows concerns from some investors who feel the market may be becoming excessively buoyant after the approval of spot ETFs.\nThe fluctuating Bitcoin futures market has further highlighted this sentiment, with a notable liquidation spike. On March 18, long positions worth more than $40 million were liquidated in a signal of heightened volatility. Data from CoinGlass shows that long liquidations surged, amounting to over $15 million, particularly within a four-hour period.\nBitcoin’s trade volumes also diminished, registering a drop of more than $25 billion from the year-to-date high on March 5, which recorded $45 billion in daily transactions.\nCrypto asset management firm Grayscale experienced significant withdrawals from its spot Bitcoin ETF, with March 18 marking the fund’s largest day of outflows since transitioning to a spot ETF on January 11. The day saw departures amounting to $642.5 million.\nIn contrast, the Fidelity Bitcoin ETF, the second-largest fund of its kind, had its inflows dwindle to a mere $5.9 million on the same day, marking its smallest inflows as reported by Farside Investors.\nThese shifts resulted in a collective net outflow for spot Bitcoin ETFs totaling $154.3 million.\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\nWhy It Matters: In response to the event, BitMEX publicly addressed the situation via social media. The exchange assured its users that while they had noted atypical trading behavior on the BTC-USDT Spot Market, all systems had been functioning normally.\nThey identified what they described as “aggressive selling behavior involving a very small number of accounts,” which was significantly outside expected market norms.\nThe exchange’s official statement read, “We launched an investigation as soon as we saw unusual activity on our BTC-USDT Spot Market. All of our systems were operating as normal, but we identified aggressive selling behavior involving a very small number of accounts widely beyond expected market ranges. We can't comment on any specific behavior of a user or actions taken, and we continue to investigate.”\nBitMEX further added, “The trading platform is operating as normal, and all funds are safe.”\nPrice Action: At the time of writing, the price of Bitcoin was $65,824, down 4% in the last 24 hours, according to Benzinga Pro.\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\nBenzinga Rankings give you vital metrics on any stock – anytime.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.",null]}
{"date":"2024-03-20","titles":["Bitcoin Retreats to $62,000, Ether Drops to $3,100 as Crypto Market Sees Notable Slowdown","Crypto market selloff: Don’t miss out on further crypto opportunities By Investing.com"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-price-today-usd-62000-ether-market-slowdown-most-altcoins-losses-5274163","https:\/\/www.investing.com\/news\/cryptocurrency-news\/crypto-market-selloff-dont-miss-out-on-further-crypto-opportunities-3346268"],"sources":["ndtv.com","investing.com"],"descriptions":["The overall market cap of the crypto sector dropped by 5.76 percent in the last 24 hours. Bitcoin and Ether – both are trading in significantly reduced prices...","Crypto market selloff: Don’t miss out on further crypto opportunities"],"article_contents":["Photo Credit: Pixabay\/ WorldSpectrum\nThe valuation of the crypto sector currently stands at $2.31 trillion\nThe overall crypto market, after witnessing a bull run earlier this month, is presently undergoing some notable volatility. Bitcoin on Wednesday, March 20 reflected a loss of 5.38 percent. The trading value of crypto market's most expensive asset currently stands at $62,800 (roughly Rs. 52.1 lakh). In the last week, the value of BTC reached its new all-time high of $73,000 (roughly Rs. 60.6 lakh) before retreating to its present price point. The decline in BTC price started after the US decided not to reduce interest rate charges for the time being.\n“The dip could be a buying opportunity for investors who have been sidelined for the longest time as the halving approaches. This temporary consolidation phase of Bitcoin could be a good opportunity for investors to add it to their long-term portfolios, as the overall outlook remains positive,” Shivam Thakral, CEO of BuyUcoin told Gadgets360.\nEther tumled in prices by six percent on Wednesday. At the time of writing, the value of ETH stood at $3,104 (roughly Rs. 2.57 lakh). Ether, as part of its bull run, had breached the price point of $3,900 (roughly Rs. 3.23 lakh).\n“Should Ethereum manage to stay above the $3,000 (roughly Rs. 2.49 lakh) support level, it could signal potential for a price recovery, as buyers may find confidence in this historically significant level. However, a breach below this support level could lead to a swift descent towards the next support area around $2,800 (roughly Rs. 2.32 lakh), suggesting a weakening of upward momentum,” Rajagopal Menon, Vice President, WazirX told Gadgets360.\nMajority cryptocurrencies, at this point, are facing the brunt of the ongoing slowdown of the market momentum. These include Solana, Binance Coin, Avalanche, Dogecoin, Shiba Inu, and Polkadot.\nPolygon, Near Protocol, Bitcoin Cash, Uniswap, Chainlink, and Tron also failed to register any gains.\nAgainst all odds, Wrapped Bitcoin, Leo, Iota, and Braintrust managed to reel-in minor gains on Wednesday.\nThe overall market cap of the crypto sector dropped by 5.76 percent in the last 24 hours. The valuation of the crypto sector, as per CoinMarketCap, stands at $2.31 trillion (roughly Rs. 1,91,80,992 crore) as of March 20.\n“Strengthening the case that with BTC halving less than just 30 days away -- another shake out might be on the cards. Solana lost more than 13 percent value in a day, other layer-1 blockchains and said ‘Solana Killers' like Aptos (+4.5 percent) and Fantom (+18.8 percent) have shown decent strength which shows that investors' confidence is still not lost and a bit of cool off before another leg up might be on the cards,” the CoinSwitch market desk told Gadgets360, commenting on the market status.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement",null]}
{"date":"2024-03-21","titles":["Bitcoin Likely Entering Volatile Corrective Period, According to On-Chain Analytics Firm Glassnode","Bitcoin Could Explode by Over 200% ‘If Things Go Really Well,’ Says Analyst Kevin Svenson – Here’s His Outlook","MicroStrategy: A Bad Deal For Investors (NASDAQ:MSTR)"],"urls":["https:\/\/dailyhodl.com\/2024\/03\/21\/bitcoin-likely-entering-volatile-corrective-period-according-to-on-chain-analytics-firm-glassnode\/","https:\/\/dailyhodl.com\/2024\/03\/21\/bitcoin-could-explode-by-over-200-if-things-go-really-well-says-analyst-kevin-svenson-heres-his-outlook\/","https:\/\/seekingalpha.com\/article\/4679576-microstrategy-bad-deal-for-investors"],"sources":["dailyhodl.com","dailyhodl.com","seekingalpha.com"],"descriptions":["The crypto analytics firm Glassnode believes Bitcoin (BTC) is now entering a period of market correction and price volatility after a massive rally this year.","Cryptocurrency analyst Kevin Svenson is saying that Bitcoin (BTC) could skyrocket by triple digits from the current level.","MicroStrategy offers business intelligence\/analytics solutions and targets the enterprise segment for its services. Learn why MSTR stock is a Sell."],"article_contents":["The crypto analytics firm Glassnode believes Bitcoin (BTC) is now entering a period of market correction and price volatility after a massive rally this year.\nIn a new YouTube video, the analytics firm says key indicators suggest Bitcoin is “taking a breather” as holders are selling off for profits after the crypto king soared 175% this year and put in a new all-time high this month.\n“When I look at the overall market structure in these different phases, whilst we don’t know whether the top is in, we shouldn’t be surprised that the market hit some kind of a correction here. It does make sense because we’ve got enough green in everyone’s portfolio that people historically speaking have started to take profits.\nWe can then see that in the long-term holder supply, which is in fact taking profits at a fairly substantial rate. Over seven days, we’ve seen long-term holder supply declining, and realized profits have hit a new all-time high, $3.5 billion per day.\nSo that really means that we need $3.5 billion worth of inflows into the asset to acquire those new coins. Now, these are fairly substantial numbers, but we’re also talking about a post-ETF [Bitcoin exchange-traded fund] world. We’re talking about hundreds of millions to billions of dollars at the moment.”\nThe firm says two key indicators point to a Bitcoin correction.\nAccording to the firm, Bitcoin’s market-value-to-realized-value (MVRV) indicator, which is the ratio of Bitcoin’s market capitalization relative to its realized capitalization (the value of all BTC at the price they were bought at), is flashing possible overvalued market conditions.\nThe firm also uses the Active-Value-to-Investor-Value (AVIV) Ratio, which is similar to the realized price but excludes inactive coins such as those lost. When Bitcoin’s price action takes moves far off the metric’s mid-point it indicates a correction is likely.\n“It makes sense for us to bump our head at this point and we’re also moving into as you can see in the AVIV ratio a more volatile period. Historically speaking, the market can go up quite sharply, but then also correct almost as sharply as we saw… in our MVRV and AVIV ratio. So just something to keep in mind and using that to kind of frame up where we are in the cycle when we can start to expect resistance to kick in.”\nBitcoin is trading for $67,672 at time of writing, up 7.5% in the last 24 hours.\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","Cryptocurrency analyst Kevin Svenson is saying that Bitcoin (BTC) could skyrocket by triple digits from the current level.\nSvenson tells his 73,500 followers on the social media platform X that based on historical precedent, Bitcoin could appreciate by roughly between 50% and 201%.\n“…based on the ratio of past gains gives me $95,000 as the minimum target… …and the median target of $142,000. And if things go really well, we will hit $190,000.\nBut anywhere you know closer to $142,000 maybe… but it could be between $95,000 and $142,000, could be like $124,000. Something along those lines. But these are the areas that I’m looking at just based on a rough estimate.”\nAccording to Svenson, Bitcoin’s volatility is likely to ramp up over the coming months if and when the flagship crypto asset hits new highs.\n“What we’re getting right now is nothing compared to what you might see in the coming months if Bitcoin continues this, gets the extension up to $90,000.\nAt that point, we’re going to be vertical. And at that point, that’s when everyone’s convinced that the bull market is back we’re going to go up and up and up, a $100,000 whatever. And that’s the part, that’s the point where most people are vulnerable and sort of just mesmerized by the bullish price action.\nThat’s when you have to be most careful because this is where your huge parabolic trend breakdown takes place and you get a huge washout and a big correction and a consolidation.\nAnd then, I would think, because we’re so early; the halving hasn’t even happened yet, after that move, likely consolidate and then run up again at a later point.”\nBitcoin is trading at $63,125 at time of writing, down by around 13% from the all-time high reached on March 14th.\nGenerated Image: DALLE3\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl",null]}
{"date":"2024-03-22","titles":["Investor Dan Tapiero Says Bitcoin Bull Market in Third Inning, Predicts 200% BTC Rally – Here’s the Timeline"],"urls":["https:\/\/dailyhodl.com\/2024\/03\/22\/investor-dan-tapiero-says-bitcoin-bull-market-in-third-inning-predicts-200-btc-rally-heres-the-timeline\/"],"sources":["dailyhodl.com"],"descriptions":["Macro investor and fund manager Dan Tapiero believes the bull market cycle for Bitcoin (BTC) is still in its early stages."],"article_contents":["Macro investor and fund manager Dan Tapiero believes the bull market cycle for Bitcoin (BTC) is still in its early stages.\nThe CEO of investment firm 10T Holdings tells his 114,500 followers on the social media platform X that Bitcoin could soar 3x from its current value in the next year or two.\n“Conservative again on BTC price. A mere 3x over next 12-24 months. Bull market just in its third inning now.”\nSince there are nine innings in a baseball game, he suggests Bitcoin’s upward momentum will continue for a while. He also says there may be price volatility, but investors should “hold on for dear life” (HODL), a term used to encourage crypto investors not to sell when prices dip.\n“Third inning of this Bitcoin bull market…at least 12-24 months to go in this up-cycle. Ignore short term wiggles. It’s hodl season.”\nLast month, the investor said Bitcoin’s bull market was in the second inning.\n“I think we’re in the second inning of this bull market, so I’d be much more concerned and think that there [could be] problems potentially if I felt we were in the seventh inning, the eighth inning. The bullish consensus at 75%-80% – I mean that’s an issue but maybe [it] just means you have a short-term correction. We’re just getting started here.”\nThe investor previously said  Bitcoin could soar to somewhere between $150,000 and $200,000 this year. And while he thinks there will be short-term Bitcoin corrections this cycle, he doesn’t envision Bitcoin ever dipping down to the $20,000 level.\n“If you’re saying do I think we’re going to go back down to the $20,000, $18,000 lows in Bitcoin, I don’t see it at all.”\nBitcoin is trading for $63,665 at time of writing, down more than 4% in the last 24 hours.\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-03-25","titles":["How This New 'Black Account' Token Filled The Void For Bitcoin (BTC) and Ethereum's (ETH) Price Uncertainty","The Rise of Digital Assets: Bitcoin vs. Ethereum Deeply Analyzed by Toobit Experts"],"urls":["https:\/\/www.globenewswire.com\/news-release\/2024\/03\/25\/2851782\/0\/en\/How-This-New-Black-Account-Token-Filled-The-Void-For-Bitcoin-BTC-and-Ethereum-s-ETH-Price-Uncertainty.html","https:\/\/www.europeanbusinessreview.com\/the-rise-of-digital-assets-bitcoin-vs-ethereum-deeply-analyzed-by-toobit-experts\/"],"sources":["globenewswire.com","europeanbusinessreview.com"],"descriptions":["Dubai, UAE, March  25, 2024  (GLOBE NEWSWIRE) -- In the ever-evolving landscape of the cryptocurrency market, the recent price uncertainties of Bitcoin...","Discover the rise of Bitcoin and Ethereum as leading digital assets, and explore their strengths, weaknesses, and comparative analysis. Learn about Toobit's tra..."],"article_contents":["March 25, 2024 11:00 ET\n\n\n | Source:\r\n            \nOption2Trade\n\n\n\n\n\nOption2Trade\nDubai, UAE, March  25, 2024  (GLOBE NEWSWIRE) -- In the ever-evolving landscape of the cryptocurrency market, the recent price uncertainties of Bitcoin (BTC) and Ethereum (ETH) have left many investors searching for stability and growth. Amidst this environment of unpredictability, Option2Trade (O2T) has emerged as a beacon of innovation, offering a promising alternative with its 'Black Account' token. This novel offering has quickly gained traction, filling the void left by Bitcoin (BTC) and Ethereum (ETH)'s fluctuating fortunes.\nOption2Trade (O2T): A New Horizon in Crypto Investment\nOption2Trade (O2T) introduces a groundbreaking concept with its 'Black Account,' a feature that promises to revolutionize the way investors interact with the cryptocurrency market. Unlike the traditional models observed in Bitcoin (BTC) and Ethereum (ETH), Option2Trade (O2T) provides users with enhanced trading capabilities, exclusive access to premium features, and an array of benefits designed to optimize investment outcomes.\nBitcoin (BTC) and Ethereum (ETH) Face Challenges\nAs the pioneering cryptocurrencies, Bitcoin (BTC) and Ethereum (ETH) have long dominated the market landscape. However, their recent bouts of price volatility have sparked concerns among investors, driving the search for alternatives that offer both stability and potential for high returns. This is where Option2Trade (O2T) steps in, addressing the gaps in the market that Bitcoin (BTC) and Ethereum (ETH) currently face.\nThe Appeal of Option2Trade (O2T) Over Bitcoin (BTC) and Ethereum (ETH)\nInvestors disillusioned by the price uncertainty of Bitcoin (BTC) and Ethereum (ETH) are increasingly turning to Option2Trade (O2T) for several reasons. Firstly, the innovative 'Black Account' system provides a level of exclusivity and benefit that is unparalleled in the market, setting a new standard for what investors can expect from a cryptocurrency token. Additionally, Option2Trade (O2T)’s focus on advanced technology and user-centric features offers a fresh perspective compared to the more established Bitcoin (BTC) and Ethereum (ETH).\nBitcoin (BTC) and Ethereum (ETH) Investors Explore New Avenues\nThe growing interest in Option2Trade (O2T) from the Bitcoin (BTC) and Ethereum (ETH) communities signifies a shift in investor sentiment. As individuals look to diversify their portfolios and hedge against the unpredictability of Bitcoin (BTC) and Ethereum (ETH), Option2Trade (O2T) presents an attractive proposition. Its promise of high returns, coupled with the stability offered by its unique trading and investment platform, makes Option2Trade (O2T) a compelling choice.\nOption2Trade (O2T) Bridges the Gap\nOption2Trade (O2T) not only offers an alternative to the uncertainties surrounding Bitcoin (BTC) and Ethereum (ETH) but also bridges the gap between traditional financial mechanisms and the new age of digital currencies. Its approach to integrating cutting-edge technology with the benefits of the 'Black Account' token provides a seamless transition for investors looking to navigate the complexities of the crypto market.\nA Future Beyond Bitcoin (BTC) and Ethereum (ETH)\nAs Option2Trade (O2T) continues to carve its niche, it represents a new chapter in cryptocurrency investment, one that goes beyond the foundational blocks laid by Bitcoin (BTC) and Ethereum (ETH). With its innovative offerings and commitment to enhancing investor experience, Option2Trade (O2T) is well-positioned to lead the charge towards a future where digital currency investments are more accessible, profitable, and stable.\nConclusion: A New Chapter for Cryptocurrency Investments\nThe emergence of Option2Trade (O2T) and its 'Black Account' token amidst the price uncertainties of Bitcoin (BTC) and Ethereum (ETH) marks a significant development in the crypto world. By offering a viable alternative that addresses the needs of modern investors, Option2Trade (O2T) not only fills the void left by Bitcoin (BTC) and Ethereum (ETH) but also paves the way for the next evolution of cryptocurrency investments. As the market continues to mature, the role of innovative platforms like Option2Trade (O2T) will undoubtedly become increasingly vital in shaping the future of digital currency investment.For more information on the Option2Trade (O2T) Presale:\nUse promo code O2TLaunch to get 15% bonus\nVisit Option2Trade (O2T)\nJoin and become a community member:\nhttps:\/\/t.me\/O2TOfficial https:\/\/twitter.com\/Option2Trade\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.",null]}
{"date":"2024-03-26","titles":["$160,000 Bitcoin Could Be ‘Conservative’ Price Target, According to Trader That Called 2022 Bear Market Bottom","Crypto Talk: Mudrex set to see 3x rise in trading volumes by month-end: Edul Patel"],"urls":["https:\/\/dailyhodl.com\/2024\/03\/26\/160000-bitcoin-could-be-conservative-price-target-according-to-trader-that-called-2022-bear-market-bottom\/","https:\/\/economictimes.indiatimes.com\/markets\/expert-view\/crypto-talk-mudrex-set-to-see-3x-rise-in-trading-volumes-by-month-end-edul-patel\/articleshow\/108783696.cms"],"sources":["dailyhodl.com","economictimes.indiatimes.com"],"descriptions":["A trader known for several accurate crypto market calls says that Bitcoin (BTC) could soar beyond $160,000 this bull cycle if its current market structure holds...","Mudrex anticipates massive growth with 100,000 new users and tripled trading volume by March. Edul Patel shares insights on market dynamics, Bitcoin ETFs, Halvi..."],"article_contents":["A trader known for several accurate crypto market calls says that Bitcoin (BTC) could soar beyond $160,000 this bull cycle if its current market structure holds up.\nPseudonymous analyst Dave the Wave tells his 143,000 followers on the social media platform X that based on Bitcoin’s price action from 2020, the crypto king could hit $160,000 before May and continue to soar.\n“A BTC $160,000 target, should we see a continued parabolic run, is actually quite conservative on this comparison.”\nDave the Wave uses his own version of logarithmic growth channels (LGC) to attempt to forecast market cycle tops and bottoms while filtering out short-term volatility and noise.\nLooking at his chart, the trader suggests that Bitcoin is printing a similar price pattern as 2020 where it breaks out of an ascending channel and into a parabolic impulse upward, completing a 154% move.\nPseudonymous crypto trader Rekt Capital is also drawing a comparison between Bitcoin’s current cycle and 2020 as BTC heads into the April halving event when miners’ rewards are cut in half. He suggests that Bitcoin could consolidate in the high $60,000 range as it enters the halving and later breakout similar to the 2020-2021 cycle.\n“This current cycle has been a story of re-accumulation ranges (green-red). And one interesting possibility for price going into the halving is further consolidation at highs (i.e. re-accumulation). This turn of technical events would be historically accurate. It would satisfy the fact that a pre-halving retrace occurs 28-14 days before the halving. And it would satisfy the fact that pre-halving retraces transition into post-halving re-accumulation.\nIf Bitcoin manages to turn the old all-time high of ~$69,000 into new support then this ‘re-accumulation range’ idea would be invalidated because price would be ready for price expansion into price discovery. If however, Bitcoin isn’t able to turn ~$69,000 into support before the halving this re-accumulation range could become a reality and would be in line with historical price tendencies around the halving.”\nBitcoin is trading for $69,847 at time of writing, down slightly in the last 24 hours.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","Crypto Academy Episode 2: Founder Edul Patel speaks of strategies and secrets to build a $1000 crypto portfolio\nCryptocurrency Price on March 26: Bitcoin jumps above $70,000; Internet Computer, Shiba Inu rise up to 14%\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\nFrom yoga, FMCG to insurance now, Patanjali Ayurveda takes a bold leap. What lies ahead?\nTurning the tables, how Air India Express plans to do an IndiGo on IndiGo\nWhy ‘Trump tariffs’ can become a supply chain nightmare\nWould Vodafone Idea been better off opting for bankruptcy?\nStock Radar: Symmetrical Triangle breakout makes RBL Bank stock an attractive buy; stock still down over 30% from highs\nTop Nifty50 stocks analysts suggest buying in this volatile week\nWorry not. You’re just a step away.\nIt seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account  and log in again using your ET Prime credentials  to enjoy all member benefits.\nOffer Exclusively For You\nSave up to Rs. 700\/-\nON ET PRIME MEMBERSHIP\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet Flat 40% Off\nThen  ₹ 1749 for 1 year\nOffer Exclusively For You\nET Prime at ₹ 49 for 1 month\nThen  ₹ 1749 for 1 year\nSpecial Offer\nGet flat 40% off on ETPrime\n90 Days Prime access worth Rs999 unlocked for you\nStories you might be interested in"]}
{"date":"2024-03-27","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-03-28","titles":["Bitcoin, Ether Trade Sideways, Most Altcoins Register Price Dips Amid Industry Turmoil","Stock Split Watch: Is MicroStrategy Next?"],"urls":["https:\/\/www.gadgets360.com\/cryptocurrency\/news\/bitcoin-price-today-ether-losses-market-down-binance-kucoin-coinbase-legal-troubles-5325960","https:\/\/finance.yahoo.com\/news\/stock-split-watch-microstrategy-next-090700882.html"],"sources":["ndtv.com","finance.yahoo.com"],"descriptions":["The overall crypto market cap, as of Thursday, dipped in value by 1.33 percent. While Bitcoin saw a miniscule gain, Ether joined majority cryptocurrencies on th...","Trading around $1,900 per share, MicroStrategy could potentially benefit from a stock split."],"article_contents":["Photo Credit: Pixabay\/ WorldSpectrum\nThe overall crypto market cap, as of Thursday, stands at $2.62 trillion\nMajority cryptocurrencies registered losses on Thursday, March 28 in the aftermath of industry players like Binance, Coinbase, and KuCoin facing legal issues in different parts of the world. Bitcoin on Thursday managed to see a miniscule gain of 0.06 percent. With this, the value of Bitcoin has come to the point of $67,145 (roughly Rs. 55.9 lakh). In the last 24 hours, the value of Bitcoin dropped by $143 (roughly Rs. 11,920). Markets experts expect the asset to cross the mark of $70,000 (roughly Rs. 58.3 lakh) in the coming days.\n“Technically, BTC is consolidating within a range after an upward movement, finding support at the 20EMA 4 H level, which is robust. The key level remains at $69,000 (roughly Rs. 57.5 lakh), with BTC needing to maintain position above it. Resistance is at the all-time high, which BTC must clear for new highs,” the CoinDCX team told Gadgets360.\nEther recorded a loss of 2.13 percent on Thursday. The asset is currently trading at the price point of $3,360 (roughly Rs. 2.80 lakh).\n“ETH continues to underperform BTC, currently hovering slightly above $3,500 (roughly Rs. 2.90 lakh) and below the 20EMA. To see a significant upside move, ETH must first surpass $3,650 (roughly Rs. 3.04 lakh) while $3,450 (roughly Rs. 2.87 lakh) serves as a support level,” the CoinDCX team added.\nTether, Binance Coin, Solana, USD Coin, Cardano, and Avalanche -- found themselves following Ether towards the loss-making side of the crypto chart.\nOther cryptocurrencies that failed to register any gains on Thursday include Litecoin, Leo, Polkadot, Polygon, and Uniswap.\nThe overall crypto market cap, as of Thursday, stands at $2.62 trillion (roughly Rs. 2,18,43,778 crore) after the valuation dipped by 1.33 percent in the last 24 hours, showed CoinMarketCap.\nProfit-making cryptocurrencies, meanwhile, include Dogecoin, Bitcoin Cash, Leo, Cosmos, and Braintrust.\nThe market volatility could persist for a while as some of the biggest exchanges in the sector are undergoing legal issues. Binance, for instance, is facing inquiry in Nigeria after a company executive managed to escape custody and fled the nation.\nKuCoin has been charged by the US' CFTC for operating an illegal digital asset derivatives exchange. Meanwhile, a court in the US has reportedly ruled that the SEC has made a plausible argument that Coinbase is operating as an unregistered broker, exchange, and clearinghouse.\nClarity in the resolution of these industrial hurdles could help the crypto sector snap out of its volatility phase.\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\nCryptocurrency Prices across Indian exchanges\nFor the latest tech news and reviews, follow Gadgets 360 on X, Facebook, WhatsApp, Threads and Google News. For the latest videos on gadgets and tech, subscribe to our YouTube channel. If you want to know everything about top influencers, follow our in-house Who'sThat360 on Instagram and YouTube.\nAdvertisement\n04:42\n00:55\n02:21\n02:34\n00:54\nAdvertisement","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWith the recent news that the fast-casual restaurant chain Chipotle Mexican Grill plans a 50-for-1 stock split, many investors might wonder which publicly traded company could be next.\nMicroStrategy (NASDAQ: MSTR), an enterprise software company that shifted its focus to buying and holding Bitcoin (CRYPTO: BTC) in 2020, could benefit from a split since its stock is trading close to $1,900 per share. Let's explore why a company might split its stock and whether MicroStrategy might entertain such a move.\nA stock split occurs when a company divides its existing shares into multiple shares, effectively increasing the number of available shares while maintaining its market capitalization. While shareholders end up with more shares, their ownership percentage and the total worth of their investment stay the same.\nFor example, suppose you hold 10 shares of a company priced at $100 per share. If the company executes a 2-for-1 stock split, you would then own 20 shares valued at $50 each, while your total investment value would remain at $1,000.\nWhen a stock like MicroStrategy has a high price, it might become too expensive for many individual investors. While some brokerages offer fractional shares, others (like Vanguard) do not.\nLowering the share price makes a stock more accessible to a broader range of investors, which in theory could drive up demand for the company's shares and increase its market value.\nA decrease in stock price can benefit options traders by making them more affordable. This may attract more participants to the options market and open up opportunities for traders to implement strategies at lower costs, thus bringing more visibility to the stock.\nMicroStrategy went public in 1998, and in early 2000, the company split its stock 2-for-1 as it reached an all-time high. Similar to other dot-com companies, the bubble burst soon after, and MicroStrategy undertook a 1-for-10 reverse split in 2002 to meet the minimum-price requirements of a Nasdaq listing.\nExecutive Chairman Michael Saylor oversaw the company through its previous stock split and reverse stock split. Given the stock's past scars and volatility, with a 52-week high of $1,900 and a 52-week low of $230, Saylor could arguably be more hesitant this time around. No one at the company has commented in public on a potential stock split.\nIt's typically not recommended to base investment decisions solely on the potential for a stock split. Instead, a company's financial performance should be of much greater importance when evaluating a stock's long-term potential.\nWith that said, MicroStrategy is not like any other publicly traded company on the market because, facing limited growth prospects in its software business, it decided to purchase $250 million of Bitcoin in 2020 -- and hasn't stopped buying it since.\nToday, the company holds 214,246 bitcoins, acquired for $7.53 billion at an average price of $35,160 each. With Bitcoin trading for approximately $69,400, the unprecedented bet has paid off for MicroStrategy investors thus far, with its stock up over 1,400% since the company initiated the new approach.\nStill, prospective buyers should know a few things before investing in MicroStrategy today. First, the company's balance sheet has taken a considerable hit, with its net cash of $531 million transformed into $2.1 billion in net debt since its spending spree began.\nSecond, the company's number of outstanding shares has surged from 9.7 million in August 2020 to 17 million today, diluting the shares by 83%. Most of the cash generated by these stock sales was reinvested in even more Bitcoin.\nThe company's debt and share dilution will likely continue, as Microstrategy recently announced two convertible notes at $800 million and $600 million to fund its latest Bitcoin spending spree. Convertible notes are a type of financial instrument that represents debt and holds the potential to be transformed into stock shares at a future time. These notes are set to reach maturity in 2030 and 2031, respectively, unless they're repurchased, redeemed, or converted earlier, per the conditions outlined in their terms.\nEven for Bitcoin enthusiasts, MicroStrategy stock is starting to make less sense than buying the cryptocurrency directly or through one of the newly approved Bitcoin exchange-traded funds. That's because, as of this writing, the company has an enterprise value (market capitalization plus net debt) of $34.8 billion yet holds $14.9 billion worth of Bitcoin.\nTherefore, prospective investors are paying a significant premium for MicroStrategy, which generated $496 million in revenue for 2023, down 1% from $499 million in 2022. That makes this stock an unfavorable arbitrage play, and prospective investors should avoid the stock at today's lofty price.\nShould you invest $1,000 in MicroStrategy right now?\nBefore you buy stock in MicroStrategy, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and MicroStrategy wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 25, 2024\nCollin Brantmeyer has positions in Chipotle Mexican Grill. The Motley Fool has positions in and recommends Bitcoin and Chipotle Mexican Grill. The Motley Fool has a disclosure policy.\nStock Split Watch: Is MicroStrategy Next? was originally published by The Motley Fool"]}
{"date":"2024-03-29","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
