{"date":"2024-09-02","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-09-03","titles":["Bitfinex Says ‘Sell-The-News’ Reaction to Rate Cuts Could Push Crypto Markets Down in September","1 Cryptocurrency to Buy Before It Soars Up to 84,380%, According to Michael Saylor"],"urls":["https:\/\/dailyhodl.com\/2024\/09\/03\/bitfinex-says-sell-the-news-reaction-to-rate-cuts-could-push-crypto-markets-down-in-september\/","https:\/\/finance.yahoo.com\/news\/1-cryptocurrency-buy-soars-84-080600380.html"],"sources":["dailyhodl.com","finance.yahoo.com"],"descriptions":["Research from crypto exchange Bitfinex warns that reactions to recent rate cut news could bring down crypto prices in September.","MicroStrategy's Michael Saylor is forecasting tremendous gains for Bitcoin holders over the next 20 years."],"article_contents":["Research from crypto exchange Bitfinex warns that reactions to recent rate cut news could bring down crypto prices in September.\nIn its latest research, Bitfinex speculates that Bitcoin (BTC) could fall as low as $40,000 over the coming weeks.\n“If we were to speculate, we would caution to expect a 15-20% decline when rates are cut this month, with a bottom of $40-50,000 for BTC. This is not an arbitrary number but is based on the fact that the cycle peak in terms of percentage return reduces by around 60-70% each cycle and the average bull market correction has reduced as well.\nBut this logic could be negated quite easily if macroeconomic conditions change. These are uncertain times for traders.”\nWith Bitcoin currently trading for $57,701, a fall to $40,000 would represent a fall of 30% for the flagship cryptocurrency.\nAccording to Bitfinex, September is a historically volatile and poor-performance month for Bitcoin. The exchange says that BTC will likely be tied to central bank monetary policy and price action in the traditional financial markets.\n“This volatility, combined with the potential for a ‘sell-the-news’ reaction after a rate cut, could present both risks and opportunities for traders. Meanwhile, Bitcoin’s increasing correlation with traditional risk assets like the S&P 500 suggests its price movements will remain closely tied to global macroeconomic conditions.”\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","Oops, something went wrong\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMichael Saylor is the Executive Chairman at MicroStrategy (NASDAQ: MSTR), a company that specializes in business intelligence software. However, MicroStrategy is better known as the first public company to adopt Bitcoin (CRYPTO: BTC) as its primary treasury reserve asset, and it recently rebranded itself as a \"Bitcoin development company.\"\nMicroStrategy owned 226,500 BTC as of July 31, currently worth more than $13 billion. So, buying shares of MicroStrategy stock is tantamount to buying Bitcoin. The company has a market capitalization of $25 billion, and a substantial portion of that value is derived from its Bitcoin holdings.\nSaylor recently delivered a keynote speech at a Bitcoin conference in Nashville, Tennessee, during which he shared his 20-year outlook:\n\"What do I think will happen? Well, I've got a bear case and a bull case. But what I think will happen is that 55% [compound annual growth rate in Bitcoin] goes to 50%, 45%, 35%, 30%, 25%, 20%. It's between 50% and 20%. It will gradually decelerate until it's growing about twice as fast as the S&P 500 index. And at that rate, Bitcoin's $13 million a coin in the year 2045. $13 million! It could be a $3 million bear case and a $49 million bull case.\"\nBitcoin currently trades at $58,000 per coin. So, Saylor expects the cryptocurrency to return between 5,170% and 84,380% by 2045. Here's what investors should know.\nThe investment thesis for Bitcoin is simple supply and demand. Bitcoin supply is limited to 21 million coins, so demand is the most consequential variable. In other words, Bitcoin will become increasingly valuable provided demand continues to trend upward over time. And Michael Saylor believes the recent approval of spot Bitcoin ETFs will boost demand by bringing more investors to the market.\n\"There's 10 years of pent up demand. People have been waiting for these ETFs, and finally mainstream investors are able to access Bitcoin,\" Saylor told CNBC in February. \"The asset has found its footing, and now people are beginning to realize that there's 10 times as much demand for Bitcoin coming in through these ETFs as there is supply coming from the natural sellers, who are the miners.\"\nTraditionally, investors have needed to go through cryptocurrency exchanges to get Bitcoin exposure, and they generally incurred high fees for each transaction. But spot Bitcoin ETFs could unlock substantial demand from retail and institutional investors by reducing that friction. Investors no longer need a separate account with a cryptocurrency exchange, but rather can add Bitcoin to existing brokerage accounts.\nAdditionally, investors no longer need to pay exorbitant transaction fees because many spot Bitcoin ETFs are less expensive. For instance, the iShares Bitcoin Trust carries an expense ratio of 0.25%, meaning the annual fees on a $10,000 portfolio will total $25. But Coinbase charges 0.4% to 0.6% per transaction for orders under $10,000. In that scenario, investors get hit with higher fees twice: once when they buy, and again when they sell.\nSpot Bitcoin ETFs broke all sorts of records following their approval in January. The iShares Bitcoin Trust and Wise Origin Bitcoin Trust accumulated more assets during their first 50 trading days than any ETF in history, according to Eric Balchunas at Bloomberg Intelligence. Additionally, the iShares Bitcoin Trust hit $10 billion in assets faster than any ETF in history, according to The Wall Street Journal.\nBitcoin halving events refer to the 50% reduction in block subsidies that happens about once every four years. To elaborate, miners are rewarded with newly minted Bitcoin (called block subsidies) when they solve the cryptographic puzzle required to validate a group of transactions (called a block). But the payout is cut in half every time 210,000 blocks are added to the blockchain, which takes about four years.\nThe most recent halving event occurred in April 2024, when the block subsidy was reduced from 6.25 BTC to 3.125 BTC. Halving events are important for two reasons. First, they are the mechanism by which Bitcoin's 21-million-coin supply limit is enforced. Second, they reduce selling pressure simply because miners are minting less Bitcoin, so they have less Bitcoin to sell.\nImportantly, Bitcoin has always increased in value between one halving event and the next, as detailed in the chart below.\nBitcoin Halving\nPrice At Halving\nPrice At Next Halving\nReturn\nNovember 2012\n$12\n$647\n5,291%\nJuly 2016\n$647\n$8,821\n1,263%\nMay 2020\n$8,821\n$63,462\n619%\nData source: Morgan Stanley, YCharts.\nIn short, history says Bitcoin will be worth more than $63,462 when the 2028 halving event rolls around. In the past, the return between halving events has gotten smaller with each subsequent event, but access to spot Bitcoin ETFs could break that pattern, simply because that variable was absent from previous halving events. In other words, Bitcoin could theoretically return more than 619% by the 2028 halving event.\nTime for a reality check. Saylor's bear case price target of $3 million is wildly optimistic, and his bull case price target of $49 million seems downright absurd. But I would have said the same thing about a $58,000 price target in 2010 (back when Bitcoin traded at less than $1). Lo and behold, nearly 15 years later, Bitcoin is worth $58,000. So I would have been wrong.\nThat does not mean Bitcoin is headed to $3 million (or $49 million). But Bitcoin clearly has the capacity to create substantial wealth, so patient investors comfortable with volatility should consider owning a small position. Even if Bitcoin returns a mere 100% in the coming years, that could be a significant chunk of change.\nHowever, comfort with volatility is key. Bitcoin has declined more than 50% on several occasions and similar drawdowns are probable in the future. Moreover, smaller drawdowns are commonplace. For instance, the cryptocurrency currently trades 20% below its record high. Anyone not bothered by that information should consider buying a small position in Bitcoin today, either directly or through a spot Bitcoin ETF.\nBefore you buy stock in Bitcoin, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bitcoin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $731,449!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of August 26, 2024\nTrevor Jennewine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin and Coinbase Global. The Motley Fool has a disclosure policy.\n1 Cryptocurrency to Buy Before It Soars Up to 84,380%, According to Michael Saylor was originally published by The Motley Fool"]}
{"date":"2024-09-04","titles":["Cryptocurrency prices on September 4: Bitcoin, Ether decline up to 5% on US growth worries","Digihost Announces 50% Increase in Cash and Crypto Position Over Previous Month-End and Provides August 2024 Production Update"],"urls":["https:\/\/economictimes.indiatimes.com\/markets\/cryptocurrency\/cryptocurrency-prices-on-september-4-bitcoin-ether-decline-up-to-5-on-us-growth-worries\/articleshow\/113057514.cms","https:\/\/www.globenewswire.com\/news-release\/2024\/09\/04\/2940301\/0\/en\/Digihost-Announces-50-Increase-in-Cash-and-Crypto-Position-Over-Previous-Month-End-and-Provides-August-2024-Production-Update.html"],"sources":["economictimes.indiatimes.com","globenewswire.com"],"descriptions":["Bitcoin and Ether fell up to 5% due to U.S. economic slowdown fears and weak ISM manufacturing data. The global crypto market cap dropped below $2 trillion.","HOUSTON, Sept.  04, 2024  (GLOBE NEWSWIRE) -- Digihost Technology Inc. (“Digihost” or the “Company”) (Nasdaq \/ TSXV: DGHI), an innovative U.S. based..."],"article_contents":["Did you Know?\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors.\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\nWhy Trump wants a ‘weak’ dollar, and what makes it an opportunity, or a challenge, for India\nDo Gensol, IndusInd revive corporate governance worries?\nAsian Paints is trading at P\/E lower than pandemic levels. Is it still a value buy?\nTrade gap: Can India do a Trump to China?\nMarket share at 0.1%, Trump wants to make US shipbuilding great again. Too little, too late?\n10 wilful defaults of INR10,000 crore that broke the back of IDBI Bank\nWorry not. You’re just a step away.\nIt seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account  and log in again using your ET Prime credentials  to enjoy all member benefits.\nOffer Exclusively For You\nSave up to Rs. 700\/-\nON ET PRIME MEMBERSHIP\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet Flat 40% Off\nThen  ₹ 1749 for 1 year\nOffer Exclusively For You\nET Prime at ₹ 49 for 1 month\nThen  ₹ 1749 for 1 year\nSpecial Offer\nGet flat 40% off on ETPrime\n90 Days Prime access worth Rs999 unlocked for you\nStories you might be interested in","September 04, 2024 06:00 ET\n\n\n | Source:\r\n            \nDigihost Technology Inc.\n\n\n\n\nDigihost Technology Inc.\nHOUSTON, Sept.  04, 2024  (GLOBE NEWSWIRE) -- Digihost Technology Inc. (“Digihost” or the “Company”) (Nasdaq \/ TSXV: DGHI), an innovative U.S. based blockchain technology and computer infrastructure company, is pleased to provide unaudited comparative Bitcoin (“BTC”) production results for the month ended August 31, 2024, combined with an operations update. All monetary references are expressed in USD unless otherwise indicated.\nMonthly Production Highlights for August 2024\nFinancing\nIn August, the Company closed its previously announced private placement of its equity securities (the “Private Placement”). The Private Placement was for gross proceeds of US$4 million and consisted of the sale of 3,636,363 units of the Company (“Units”) at a purchase price of US$1.10 per Unit. Each Unit is comprised of one subordinate voting share of the Company (a “Share”) and one warrant (a “Warrant”), with each Warrant entitling the holder to purchase one additional Share. The Warrants have an exercise price of US$2.00 per Share and an exercise period of three years from February 15, 2025.\nOperations Update\nPresently, Digihost’s consolidated operating capacity across its three sites represents approximately 90MW of available power, and Digihost is mining at hashrate of 2.75 EH\/s. The Company is currently exploring opportunities to build its initial Tier 3 data center with a target completion date of end of 2025.\nAbout Digihost\nDigihost is a growth-oriented technology company focused on the blockchain industry. The Company operates from three sites in the U.S. and, in addition to managing its own operations, provides hosting arrangements at its facilities.\nFor further information, please contact:\nDigihost Technology Inc.www.digihost.caMichel Amar, Chief Executive Officer T: 1-818-280-9758Email: michel@digihost.ca\nCautionary Statement\nTrading in the securities of the Company should be considered highly speculative. No stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\nForward-Looking Statements\nExcept for the statements of historical fact, this news release contains “forward-looking information” and “forward-looking statements” (collectively, “forward-looking information”) that are based on expectations, estimates and projections as at the date of this news release and are covered by safe harbors under Canadian and United States securities laws. Forward-looking information in this news release includes information about potential further improvements to profitability and efficiency across mining operations, including, as a result of the Company’s expansion efforts, potential for the Company’s long-term growth, and the business goals and objectives of the Company. Factors that could cause actual results to differ materially from those described in such forward-looking information include, but are not limited to: future capital needs and uncertainty of additional financing; share dilution resulting from equity issuances; risks relating to the strategy of maintaining and increasing Bitcoin holdings and the impact of depreciating Bitcoin prices on working capital; effects on Bitcoin prices as a result of the most recent Bitcoin halving; development of additional facilities and installation of infrastructure to expand operations may not be completed on the timelines anticipated by the Company, or at all; ability to access additional power from the local power grid; a decrease in cryptocurrency pricing, volume of transaction activity or generally, the profitability of cryptocurrency mining; further improvements to profitability and efficiency may not be realized; development of additional facilities to expand operations may not be completed on the timelines anticipated by the Company; ability to access additional power from the local power grid; an increase in natural gas prices may negatively affect the profitability of the Company’s power plant; the digital currency market; the Company’s ability to successfully mine digital currency on the cloud; the Company may not be able to profitably liquidate its current digital currency inventory, or at all; a decline in digital currency prices may have a significant negative impact on the Company’s operations; the volatility of digital currency prices; and other related risks as more fully set out in the Annual Information Form of the Company and other documents disclosed under the Company’s filings at www.sedarplus.ca and www.SEC.gov\/EDGAR. The forward-looking information in this news release reflects the current expectations, assumptions and\/or beliefs of the Company based on information currently available to the Company. In connection with the forward-looking information contained in this news release, the Company has made assumptions about: the current profitability in mining cryptocurrency (including pricing and volume of current transaction activity); profitable use of the Company’s assets going forward; the Company’s ability to profitably liquidate its digital currency inventory as required; historical prices of digital currencies and the ability of the Company to mine digital currencies on the cloud will be consistent with historical prices; the ability to maintain reliable and economical sources of power to run its cryptocurrency mining assets; the negative impact of regulatory changes in the energy regimes in the jurisdictions in which the Company operates; and there will be no regulation or law that will prevent the Company from operating its business. The Company has also assumed that no significant events occur outside of the Company's normal course of business. Although the Company believes that the assumptions inherent in the forward-looking information are reasonable, forward-looking information is not a guarantee of future performance and accordingly undue reliance should not be put on such information due to the inherent uncertainties therein. The Company undertakes no obligation to revise or update any forward-looking information other than as required by law.\nMIAMI, April  01, 2025  (GLOBE NEWSWIRE) -- Digi Power X Inc. (“Digi Power X” or the “Company”) (Nasdaq: DGXX \/ TSXV: DGX), an innovative energy infrastructure company that develops cutting-edge data...\nMIAMI, March  31, 2025  (GLOBE NEWSWIRE) -- Digi Power X Inc. (“Digi Power X” or the “Company”) (Nasdaq: DGXX \/ TSXV: DGX), an innovative energy infrastructure company that develops cutting-edge data..."]}
{"date":"2024-09-05","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-09-06","titles":["The U.S. Dollar's Resilience: Strength Or Illusion?","Bitcoin Edging Toward Massive Breakout, According to Trader That Called May 2021 Collapse","How to Trade in Cryptocurrency?"],"urls":["https:\/\/seekingalpha.com\/article\/4719602-vaneck-crypto-monthly-recap-august-2024","https:\/\/dailyhodl.com\/2024\/09\/05\/bitcoin-edging-toward-massive-breakout-according-to-trader-that-called-may-2021-collapse\/","https:\/\/economictimes.indiatimes.com\/markets\/cryptocurrency\/how-to-trade-in-cryptocurrency\/articleshow\/113129836.cms"],"sources":["seekingalpha.com","dailyhodl.com","economictimes.indiatimes.com"],"descriptions":["Most crypto assets fell sharply in August as fundamental usage and financial statistics slipped against the broader market backdrop of rising volatility. Click ...","A veteran trader who accurately predicted the May 2021 crypto collapse believes that Bitcoin (BTC) is on the verge of a massive breakout.","Cryptocurrency is gaining global traction with its market value in trillions. The article discusses key steps for trading, including choosing a trading type, un..."],"article_contents":[null,"A veteran trader who accurately predicted the May 2021 crypto collapse believes that Bitcoin (BTC) is on the verge of a massive breakout.\nPseudonymous trader Dave the Wave shares a chart with his 146,400 followers on the social media platform X that shows Bitcoin may be forming a similar pattern from the last cycle right before an explosive rally.\nLooking at his monthly chart, the trader suggests that Bitcoin will test a long-term diagonal support that could act as a launch pad for upward price action similar to what occurred in late 2020.\nThe analyst also shares a chart using his version of the logarithmic growth channel (LGC) curve, which aims to predict Bitcoin’s longer-term cycle lows and highs while filtering out shorter-term volatility.\nAccording to the trader, his LGC model is suggesting that Bitcoin’s current market cycle remains in an uptrend.\n“BTC bull markets climb a wall of worry… unless you’ve got the LGC model to go by.”\nLastly, the analysts say that the king crypto’s one-year moving average is acting as a support level, which has historically lined up with big rallies.\n“One-year BTC moving average reaching all-time highs while currently supporting price.”\nBitcoin is trading for $58,168 at time of writing.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","Did you Know?\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors.\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\nStories you might be interested in"]}
{"date":"2024-09-09","titles":["Bitcoin Short-Term Holders Feeling the Stress As Correction Brings Positions Underwater: Glassnode"],"urls":["https:\/\/dailyhodl.com\/2024\/09\/09\/bitcoin-short-term-holders-feeling-the-stress-as-correction-brings-positions-underwater-glassnode\/"],"sources":["dailyhodl.com"],"descriptions":["Short-term holders (STHs) of Bitcoin are feeling pain as BTC falls in price, creating the potential for heightened volatility, according to analytics firm Glass..."],"article_contents":["Short-term holders (STHs) of Bitcoin are feeling pain as BTC falls in price, creating the potential for heightened volatility, according to analytics firm Glassnode.\nIn a new report, Glassnode says that the short-term holder cohort is “heavily underwater” in their positions.\n“The Bitcoin market has continued to experience downward pressure over recent months despite the average Bitcoin investor remaining profitable overall. However, the short-term holder cohort remains heavily underwater on their holdings, making them a source of risk for the time being.”\nAccording to Glassnode, short-term Bitcoin holders are a primary risk to BTC given they are significantly underwater and therefore could be one of the main sources of selling pressure.\n“Nevertheless, the short-term holder cohort continues to carry elevated unrealized losses, indicating they are the primary cohort at risk and the expected source of sell-side pressure in the event of a downturn.\nAlongside this, profit and Loss-taking activities remain remarkably light, suggesting a saturation of our current range with critical metrics such as the sell-side risk ratio, which alludes to a potential for heightened volatility in the near future.”\nUsing the market value to realized value (MVRV) ratio, Glassnode says short-term holders present the risk of more weakness to come for Bitcoin.\nThe MVRV is the ratio of a crypto asset’s market capitalization relative to its realized capitalization or the value of all the coins at the price they were bought.\nSays Glassnode,\n“This tells us that the average new investor is holding an unrealized loss. Generally speaking, until the spot price reclaims the STH cost basis of $62,400, there is an expectation for further market weakness.”\nAt time of writing, Bitcoin is trading at $55,501, up nearly 2% on the day.\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-09-10","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-09-11","titles":["GOLD MARKET: August 2024 Overview, September 2024 Outlook"],"urls":["https:\/\/financefeeds.com\/gold-market-august-2024-overview-september-2024-outlook\/"],"sources":["financefeeds.com"],"descriptions":["August has been a truly historic month for gold (XAU). Despite starting off at an already elevated level after more than a 5% increase in July, gold prices"],"article_contents":["A monthly digest by the global broker Octa\nAugust has been a truly historic month for gold (XAU). Despite starting off at an already elevated level after more than a 5% increase in July, gold prices continued to move higher for most of August, setting a new all-time high of $2,531 per ounce (oz) on 20 August.\nThe month has been packed with major market-moving events (see the list below), which have resulted in a rather bumpy ride for traders. Indeed, gold investors lived through intensifying geopolitical tensions in the Middle East and Eastern Europe, experienced substantial volatility due to a major stock market rout and digested increasingly dovish investors’ interest rate expectations. As many times before, gold has once again proved its underlying value as a safe-haven asset and may continue to shine in the months ahead.\nMajor market-moving events\nDespite temporary setbacks, gold continued to move higher in August, and the price of yellow metal remained comfortably above its 100-day and 200-day moving averages. Rising expectations for looser monetary policy in the U.S. and globally, endless geopolitical tensions and political instability, and solid structural demand on the part of central banks helped push the bullion’s price to an all-time high. In addition, the technical picture has been positive, resulting in trend buying by investors.\nPhysical demand for bullion has been a key driver behind the rising price of gold in the financial markets. Just recently, a Hong Kong Census and Statistics Department (C&SD) report showed that China’s net gold imports via Hong Kong in July rose by about 17% from the previous month. Although the data for August has not been released yet, it seems reasonable to infer that China’s purchases probably remained elevated given that the People’s Bank of China (PBOC), China’s central bank, has granted new gold import quotas to commercial banks in anticipation of revived demand. This is important because China is the world’s largest consumer of gold, and its buying patterns can influence the global market and affect prices. In fact, according to the World Gold Council (WGC), PBOC was the world’s largest single buyer of gold in 2023, with net purchases of 7.23 million oz. According to global broker Octa’s estimates, global central banks have added more than 130 tons of gold to their reserves in 2024.\nCFTC Commitments of Traders vs Gold Price\nApart from central banks, global investors have also remained quite bullish on gold. According to the Commodity Futures Trading Commission (CFTC), large speculators (leveraged funds and money managers) increased their net-long exposure in COMEX gold futures and options by 47,909 contracts in August to 236,818 net-long contracts. They have maintained their largest net-long exposure in gold in more than four years. According to LSEG, a financial firm, physically-backed gold exchange-traded funds (ETFs) witnessed their third consecutive monthly inflow in August––21.94 tons.\nGold ETF Monthly Flows\nThe competition between gold and Bitcoin has been a hot topic in the financial services industry for years. Both assets have their own unique appeal to investors, yet they represent very different approaches to wealth preservation and capital growth. Both assets are viewed as hedges against inflation but in slightly different ways. Gold’s value has historically been tied to its ability to hedge against currency depreciation and inflation. On the other hand, Bitcoin is often seen as a hedge against the uncontrolled emission of fiat currencies thanks to its fixed supply of 21 million coins. However, Bitcoin’s shorter history makes it less predictable in this role than gold.\nGold and Bitcoin respond differently to increasing global risks, including geopolitical conflicts and economic recessions. When global stability is disrupted, gold tends to rise, while Bitcoin, which often correlates with U.S. indices such as the S&P 500 and NASDAQ, tends to decline. This is because Bitcoin is considered a high-risk, high-reward asset and is usually sold off first when the risk-off sentiment hits the markets. Investors then shift their funds into more reliable and less volatile assets. In fact, August has vividly demonstrated this relationship, as gold increased by 2.2% during the month, while Bitcoin price dropped by 8.5%. However, Bitcoin has outperformed gold year-to-date (y-t-d), gaining 44% (see the chart).\nRelative Performance of Key Financial Assets in 2024\n(December 29, 2023 = 0)\nOver time, this situation may change as Bitcoin gains credibility among institutional investors. Several Bitcoin ETFs were launched earlier this year, which have begun to reshape the cryptocurrency market. Specifically, ETFs reduce Bitcoin’s volatility as demand becomes more stable. Moreover, Bitcoin ETFs compete with Gold ETFs for investors’ funds.\nAccording to The Block, a crypto research portal, in August 2024, inflows into BTC ETFs exceeded $200 million, bringing the total since their launch close to $60 billion. For comparison, the total assets under management (AUM) in gold ETFs amount to approximately $90 billion. ‘If this trend continues, Bitcoin ETFs could surpass gold ETFs by the end of the year. In the long term, competition with Bitcoin is likely to exert bearish pressure on gold prices,’ said Kar Yong Ang.\nFundamentally, the outlook for gold looks bright. We have singled out three important bullish factors that will continue to play out in September 2024.\nGlobal monetary policy\nGold is priced in U.S. dollars and is therefore highly sensitive to changes in U.S. interest rates, inflation, and the greenback’s value. As already mentioned, the market is positioned for a dovish Fed. In fact, the latest interest rates swap market data implies roughly 220 bps worth of rate cuts by the Fed by the end of December 2025. This means the market expects the U.S. central bank to cut the borrowing costs in half over the next five quarters. It is widely expected that other central banks will not fall far behind. Investors expect the European Central Bank (ECB) to deliver three quarter-point rate cuts by the end of January 2025, while the Bank of England (BoE) is anticipated to announce at least two rate cuts of 25 bps each before the end of February 2025. Fundamentally, a tighter (or looser) monetary policy worldwide is a major bullish factor for gold. Because gold has no passive income and does not pay any interest, the opportunity cost of holding it becomes lower when central banks reduce their policy rates. The main risk is, of course, inflation. Should it remain above central banks’ targets or, even worse, start to increase, the Fed and its counterparts will be forced to hold the rates higher for longer.\nGeopolitical uncertainty\nThe conflicts in the Middle East and Eastern Europe, such as the Israel-Hamas hostilities, the Red Sea crisis, and the ongoing tensions between Russia and Ukraine, have destabilised world politics and raised many fears ranging from oil and food supply disruptions to the prospect of a worldwide conflict. Gold, considered a ‘safe-haven’ asset, typically sees increased demand during political uncertainty and instability. While it is extremely difficult to project the resolution of geopolitical conflicts, let alone to forecast the emergence of new ones, peace negotiations in the hottest regions are yet to commence. ‘Until there is a clear path to stability, investors would prefer to err on the side of caution and will simply buy gold ‘just in case’. Nobody wants to be caught shorting the bullion when the news of another military incident here or there hits the newswires’, says Kar Yong Ang, global broker Octa analyst.\nThe upcoming U.S. elections further complicate the global political landscape, adding another reason for gold prices to keep rising. Due to its safe-haven status, gold typically experiences increased buying interest during electoral volatility. Historical data indicates that on a micro level, gold prices tend to rise in the months leading up to an election and may continue to do so if the election results are contested or lead to significant policy shifts.\nChina and India\nPhysical demand for gold may continue to increase thanks to China and India, two major gold consumers. Specifically, China has seen its national currency, renminbi (RMB), appreciate more than 2% over the past month. This is not a welcoming development for a country whose economy heavily depends on exports. Thus, Chinese authorities may relax gold import quotas to stop the yuan from appreciating too much. As a result, the physical and investment demand for gold in China may rise in the months ahead.\nRetail demand in India will probably remain robust following the government’s decision to cut import duties on gold and silver from 15% to just 6%. This decision comes ahead of the Indian festive season (October – March) and may boost jewellery consumption in the country.\nTechnical picture\nFrom a technical perspective, during a 4-hour timeframe, we observe the first signs of weakness. RSI signals bearish divergence, and the growth rate has slowed down. Despite the bullish trend in gold in general, the price may decline towards the 2,475.00 support level. At this level, the ascending trend line and a 200-day moving average will act as support. Since the trend is generally bullish, the price may renew the maximums after a mild correction. If the price fails to hold the 2,475 level, it may drop towards 2,360–2,400 (dashed arrow on the chart).\nGold Technical Chart (4-hour timeframe)\nOn a weekly timeframe, we also see a bearish divergence and a possible bearish wedge formation, which may become highly negative for gold prices. However, it doesn’t necessarily mean that the price will drop immediately. Firstly, the price may correct towards the 20-week exponential moving average, rebound to test the 2,600 level, and then pull back towards the 2,400 level by the end of the year. By this time, the 50-week moving average is expected to be near the 2,400 mark, which may provide a new long-term entry point for gold buyers.\nGold Technical Chart (1-week timeframe)\nConclusion\nOverall, we see a mixed picture. Fundamentally, gold is a ‘screaming buy’, but technicals suggest that a short-term correction is likely. Gold is looking to test $2,600 and may move towards $3,000 in 2025. However, technical analysis indicates that the price may reach these highs only after a healthy bearish correction.\n‘There are so many reasons for the gold price to continue rising in September, that the largest risk for gold bulls seems to be pure complacency. Too many bullish factors are already priced in. If investors start speculating that something is not playing out as planned they may sharply reduce their net-long exposure leading to a major sell-off in gold prices. This is not our base scenario as we believe that gold will continue to trend higher slowly, but we must prepare for periods of above-normal volatility and could see sharp downward corrections. A road to $2,600 per ounce will not be an easy one’,  said Kar Yong Ang, global broker Octa analyst.\nKey Macro Events in September (scheduled)\nUnit No: BA857 DMCC Business Centre Level No 1 Jewellery & Gemplex 3 Dubai, United Arab Emirates.\nInternational House, 10 Admirals Way, London, England, E14 9XL."]}
{"date":"2024-09-12","titles":["Bitcoin climbs above $58,000 amid U.S. inflation data and Fed rate cut bets","Gold Market - A Monthly Digest by the Global Broker Octa"],"urls":["https:\/\/economictimes.indiatimes.com\/markets\/cryptocurrency\/bitcoin-climbs-above-58000-amid-u-s-inflation-data-and-fed-rate-cut-bets\/articleshow\/113287738.cms","https:\/\/www.financemagnates.com\/thought-leadership\/gold-market-a-monthly-digest-by-the-global-broker-octa\/"],"sources":["economictimes.indiatimes.com","financemagnates.com"],"descriptions":["Following a surprise in U.S. core inflation data, the cryptocurrency market surged as expectations for a major Federal Reserve rate cut diminished. Bitcoin jump...","August has been a truly historic month for gold (XAU). Despite starting off at an already elevated level after more than a 5% increase in July, gold prices cont..."],"article_contents":["Did you Know?\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors.\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\nWe’re building Peak XV into a global firm: Shailendra Singh\nTake a dip, Maha Kumbh may have flown the best Q4 for Indian airlines\nShould construction, mining be halted between noon and 3 PM?\nThe work of art(ists) in the age of GenAI\nISL vs. IPL: Can football match the success of cricket for Reliance?\nThe Ambani, Adani, Tata twist to India’s nuclear energy playbook\nWorry not. You’re just a step away.\nIt seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account  and log in again using your ET Prime credentials  to enjoy all member benefits.\nOffer Exclusively For You\nSave up to Rs. 700\/-\nON ET PRIME MEMBERSHIP\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet Flat 40% Off\nThen  ₹ 1749 for 1 year\nOffer Exclusively For You\nET Prime at ₹ 49 for 1 month\nThen  ₹ 1749 for 1 year\nSpecial Offer\nGet flat 40% off on ETPrime\n90 Days Prime access worth Rs999 unlocked for you\nStories you might be interested in","August\nhas been a truly historic month for gold (XAU). Despite starting off at an\nalready elevated level after more than a 5% increase in July, gold prices\ncontinued to move higher for most of August, setting a new all-time high of\n$2,531 per ounce (oz) on 20 August.\nThe\nmonth has been packed with major market-moving events (see the list below),\nwhich have resulted in a rather bumpy ride for traders. Indeed, gold investors\nlived through intensifying geopolitical tensions in the Middle East and Eastern\nEurope, experienced substantial volatility due to a major stock market rout and\ndigested increasingly dovish investors' interest rate expectations. As many\ntimes before, gold has once again proved its underlying value as a safe-haven\nasset and may continue to shine in the months ahead.\n●      \n5 August. U.S. recession worries induced by a disappointing nonfarm\npayrolls (NFP) report for July shook global markets. U.S. stock indices plunged\nto almost two-month lows, while Nikkei 225, Japan's benchmark stock index,\nrecorded its worst two-day decline ever, dropping by 18.2%, exceeding the\nlosses incurred during the 1987 Black Monday crash. The gold market saw\nsubstantial volatility as the price of the bullion fluctuated between $2,360\nand $2,460 during a single trading session. Although gold managed to recoup\nsome of the losses later, overall, XAUUSD was down 1.5% that day.\n●      \n8 August. Gold rose by almost 2% due to safe-haven demand and growing\nexpectations for a sizable interest rate cut from the U.S. Federal Reserve\n(Fed) in September. Overall, the market begins to expect more than 100 basis\npoints (bps) worth of rate cuts by the Fed over the course of just four\nmeetings.\n●      \n12 August. Gold price rose another 1.7% ahead of the U.S. Consumer Price\nIndex (CPI) report, while the market continues to price in more than a 50%\nchance of a 50-basis point (bps) rate cut by the Federal Reserve (Fed) in\nSeptember. In addition, renewed tensions in the Middle East stimulate more\ndemand for safe-haven assets as traders brace for retaliation by Iran against\nIsrael over the assassination of a Hamas leader in Tehran.\n●      \n16 August. Gold surges more than 2% to a fresh one-month high as much\nlower-than-expected U.S. housing data puts additional pressure on the\ngreenback, making gold more attractive for holders of other currencies.\n●      \n20 August. The gold price reached a new all-time high as traders continued\nto bet on imminent interest rate cuts by the Fed while awaiting painful\nrevisions to U.S. payroll data and Jerome Powell's speech at the Jackson Hole\neconomic conference.\nDespite\ntemporary setbacks, gold continued to move higher in August, and the price of\nyellow metal remained comfortably above its 100-day and 200-day moving\naverages. Rising expectations for looser monetary policy in the U.S. and\nglobally, endless geopolitical tensions and political instability, and solid\nstructural demand on the part of central banks helped push the bullion's price\nto an all-time high. In addition, the technical picture has been positive,\nresulting in trend buying by investors.\nPhysical\ndemand for bullion has been a key driver behind the rising price of gold in the\nfinancial markets. Just recently, a Hong Kong Census and Statistics Department\n(C&SD) report showed that China's net gold imports via Hong Kong in July\nrose by about 17% from the previous month. Although the data for August has not\nbeen released yet, it seems reasonable to infer that China's purchases probably\nremained elevated given that the People's Bank of China (PBOC), China's central\nbank, has granted new gold import quotas to commercial banks in anticipation of\nrevived demand. This is important because China is the world's largest consumer\nof gold, and its buying patterns can influence the global market and affect\nprices. In fact, according to the World Gold Council (WGC), PBOC was the\nworld's largest single buyer of gold in 2023, with net purchases of 7.23\nmillion oz. According to global broker Octa's estimates, global central banks\nhave added more than 130 tons of gold to their reserves in 2024.\nApart\nfrom central banks, global investors have also remained quite bullish on gold.\nAccording to the Commodity Futures Trading Commission (CFTC), large speculators\n(leveraged funds and money managers) increased their net-long exposure in COMEX\ngold futures and options by 47,909 contracts in August to 236,818 net-long\ncontracts. They have maintained their largest net-long exposure in gold in more\nthan four years. According to LSEG, a financial firm, physically-backed gold\nexchange-traded funds (ETFs) witnessed their third consecutive monthly\ninflow in August––21.94 tons.\nThe\ncompetition between gold and Bitcoin has been a hot topic in the financial\nservices industry for years. Both assets have their own unique appeal to\ninvestors, yet they represent very different approaches to wealth preservation\nand capital growth. Both assets are viewed as hedges against inflation but in\nslightly different ways. Gold's value has historically been tied to its ability\nto hedge against currency depreciation and inflation. On the other hand,\nBitcoin is often seen as a hedge against the uncontrolled emission of fiat\ncurrencies thanks to its fixed supply of 21 million coins. However, Bitcoin's\nshorter history makes it less predictable in this role than gold.\nGold\nand Bitcoin respond differently to increasing global risks, including\ngeopolitical conflicts and economic recessions. When global stability is\ndisrupted, gold tends to rise, while Bitcoin, which often correlates with U.S.\nindices such as the S&P 500 and NASDAQ, tends to decline. This is because\nBitcoin is considered a high-risk, high-reward asset and is usually sold off\nfirst when the risk-off sentiment hits the markets. Investors then shift their\nfunds into more reliable and less volatile assets. In fact, August has vividly\ndemonstrated this relationship, as gold increased by 2.2% during the month,\nwhile Bitcoin price dropped by 8.5%. However, Bitcoin has outperformed gold\nyear-to-date (y-t-d), gaining 44% (see the chart).\nOver\ntime, this situation may change as Bitcoin gains credibility among\ninstitutional investors. Several Bitcoin ETFs were launched earlier this year,\nwhich have begun to reshape the cryptocurrency market. Specifically, ETFs\nreduce Bitcoin's volatility as demand becomes more stable. Moreover, Bitcoin\nETFs compete with Gold ETFs for investors' funds.\nAccording\nto The Block, a crypto research portal, in August 2024, inflows into BTC ETFs\nexceeded $200 million, bringing the total since their launch close to $60\nbillion. For comparison, the total assets under management (AUM) in gold ETFs\namount to approximately $90 billion. ‘If\nthis trend continues, Bitcoin ETFs could surpass gold ETFs by the end of the\nyear. In the long term, competition with Bitcoin is likely to exert bearish\npressure on gold prices,’ said Kar Yong Ang.\nFundamentally,\nthe outlook for gold looks bright. We have singled out three important bullish\nfactors that will continue to play out in September 2024.\nGlobal monetary policy\nGold\nis priced in U.S. dollars and is therefore highly sensitive to changes in U.S.\ninterest rates, inflation, and the greenback's value. As already mentioned, the\nmarket is positioned for a dovish Fed. In fact, the latest interest rates swap\nmarket data implies roughly 220 bps worth of rate cuts by the Fed by the end of\nDecember 2025. This means the market expects the U.S. central bank to cut the\nborrowing costs in half over the next five quarters. It is widely expected that\nother central banks will not fall far behind. Investors expect the European\nCentral Bank (ECB) to deliver three quarter-point rate cuts by the end of\nJanuary 2025, while the Bank of England (BoE) is anticipated to announce at\nleast two rate cuts of 25 bps each before the end of February 2025.\nFundamentally, a less tight (or loose) monetary policy worldwide is a major\nbullish factor for gold. Because gold has no passive income and does not pay\nany interest, the opportunity cost of holding it becomes lower when central\nbanks reduce their policy rates. The main risk is, of course, inflation. Should\nit remain above central banks' targets or, even worse, start to increase, the\nFed and its counterparts will be forced to hold the rates higher for\nlonger.\nGeopolitical uncertainty\nThe\nconflicts in the Middle East and Eastern Europe, such as the Israel-Hamas\nhostilities, the Red Sea crisis, and the ongoing tensions between Russia and\nUkraine, have destabilised world politics and raised many fears ranging from\noil and food supply disruptions to the prospect of a worldwide conflict. Gold,\nconsidered a 'safe-haven' asset, typically sees increased demand during\npolitical uncertainty and instability. While it is extremely difficult to\nproject the resolution of geopolitical conflicts, let alone to forecast the\nemergence of new ones, peace negotiations in the hottest regions are yet to\ncommence. ‘Until there is a clear path\nto stability, investors would prefer to err on the side of caution and will\nsimply buy gold 'just in case'. Nobody wants to be caught shorting the bullion\nwhen the news of another military incident here or there hits the newswires’,\nsays Kar Yong Ang, global broker Octa analyst.\nThe\nupcoming U.S. elections further complicate the global political landscape,\nadding another reason for gold prices to keep rising. Due to its safe-haven\nstatus, gold typically experiences increased buying interest during electoral\nvolatility. Historical data indicates that on a micro level, gold prices tend\nto rise in the months leading up to an election and may continue to do so if\nthe election results are contested or lead to significant policy shifts.\nChina and India\nPhysical\ndemand for gold may continue to increase thanks to China and India, two major\ngold consumers. Specifically, China has seen its national currency, renminbi\n(RMB), appreciate more than 2% over the past month. This is not a welcoming\ndevelopment for a country whose economy heavily depends on exports. Thus,\nChinese authorities may relax gold import quotas to stop the yuan from\nappreciating too much. As a result, the physical and investment demand for gold\nin China may rise in the months ahead.\nRetail demand in India will\nprobably remain robust following the government's decision to cut import duties\non gold and silver from 15% to just 6%. This decision comes ahead of the Indian\nfestive season (October – March) and may boost jewellery consumption in the\ncountry.\nTechnical picture\nFrom\na technical perspective, during a 4-hour timeframe, we observe the first signs\nof weakness. RSI signals bearish divergence, and the growth rate has slowed\ndown. Despite the bullish trend in gold in general, the price may decline\ntowards the 2,475.00 support level. At this level, the ascending trend line and\na 200-day moving average will act as support. Since the trend is generally\nbullish, the price may renew the maximums after a mild correction. If the price\nfails to hold the 2,475 level, it may drop towards 2,360–2,400 (dashed arrow on\nthe chart).\nOn a weekly timeframe, we also see\na bearish divergence and a possible bearish wedge formation, which may become\nhighly negative for gold prices. However, it doesn't necessarily mean that the\nprice will drop immediately. Firstly, the price may correct towards the 20-week\nexponential moving average, rebound to test the 2,600 level, and then pull back\ntowards the 2,400 level by the end of the year. By this time, the 50-week\nmoving average is expected to be near the 2,400 mark, which may provide a new\nlong-term entry point for gold buyers.\nGold Technical Chart (1-week\ntimeframe)\nOverall,\nwe see a mixed picture. Fundamentally, gold is a ‘screaming buy’, but\ntechnicals suggest that a short-term correction is likely. Gold is looking to\ntest $2,600 and may move towards $3,000 in 2025. However, technical analysis\nindicates that the price may reach these highs only after a healthy bearish\ncorrection.\n‘There are so many reasons for the gold price\nto continue rising in September, that the largest risk for gold bulls seems to\nbe pure complacency. Too many bullish factors are already priced in. If\ninvestors start speculating that something is not playing out as planned they\nmay sharply reduce their net-long exposure leading to a major sell-off in gold\nprices. This is not our base scenario as we believe that gold will continue to\ntrend higher slowly, but we must prepare for periods of above-normal volatility\nand could see sharp downward corrections. A road to $2,600 per ounce will not\nbe an easy one’,  said Kar Yong Ang, global broker Octa\nanalyst.\nKey Macro Events in September (scheduled)\nAugust\nhas been a truly historic month for gold (XAU). Despite starting off at an\nalready elevated level after more than a 5% increase in July, gold prices\ncontinued to move higher for most of August, setting a new all-time high of\n$2,531 per ounce (oz) on 20 August.\nThe\nmonth has been packed with major market-moving events (see the list below),\nwhich have resulted in a rather bumpy ride for traders. Indeed, gold investors\nlived through intensifying geopolitical tensions in the Middle East and Eastern\nEurope, experienced substantial volatility due to a major stock market rout and\ndigested increasingly dovish investors' interest rate expectations. As many\ntimes before, gold has once again proved its underlying value as a safe-haven\nasset and may continue to shine in the months ahead.\n●      \n5 August. U.S. recession worries induced by a disappointing nonfarm\npayrolls (NFP) report for July shook global markets. U.S. stock indices plunged\nto almost two-month lows, while Nikkei 225, Japan's benchmark stock index,\nrecorded its worst two-day decline ever, dropping by 18.2%, exceeding the\nlosses incurred during the 1987 Black Monday crash. The gold market saw\nsubstantial volatility as the price of the bullion fluctuated between $2,360\nand $2,460 during a single trading session. Although gold managed to recoup\nsome of the losses later, overall, XAUUSD was down 1.5% that day.\n●      \n8 August. Gold rose by almost 2% due to safe-haven demand and growing\nexpectations for a sizable interest rate cut from the U.S. Federal Reserve\n(Fed) in September. Overall, the market begins to expect more than 100 basis\npoints (bps) worth of rate cuts by the Fed over the course of just four\nmeetings.\n●      \n12 August. Gold price rose another 1.7% ahead of the U.S. Consumer Price\nIndex (CPI) report, while the market continues to price in more than a 50%\nchance of a 50-basis point (bps) rate cut by the Federal Reserve (Fed) in\nSeptember. In addition, renewed tensions in the Middle East stimulate more\ndemand for safe-haven assets as traders brace for retaliation by Iran against\nIsrael over the assassination of a Hamas leader in Tehran.\n●      \n16 August. Gold surges more than 2% to a fresh one-month high as much\nlower-than-expected U.S. housing data puts additional pressure on the\ngreenback, making gold more attractive for holders of other currencies.\n●      \n20 August. The gold price reached a new all-time high as traders continued\nto bet on imminent interest rate cuts by the Fed while awaiting painful\nrevisions to U.S. payroll data and Jerome Powell's speech at the Jackson Hole\neconomic conference.\nDespite\ntemporary setbacks, gold continued to move higher in August, and the price of\nyellow metal remained comfortably above its 100-day and 200-day moving\naverages. Rising expectations for looser monetary policy in the U.S. and\nglobally, endless geopolitical tensions and political instability, and solid\nstructural demand on the part of central banks helped push the bullion's price\nto an all-time high. In addition, the technical picture has been positive,\nresulting in trend buying by investors.\nPhysical\ndemand for bullion has been a key driver behind the rising price of gold in the\nfinancial markets. Just recently, a Hong Kong Census and Statistics Department\n(C&SD) report showed that China's net gold imports via Hong Kong in July\nrose by about 17% from the previous month. Although the data for August has not\nbeen released yet, it seems reasonable to infer that China's purchases probably\nremained elevated given that the People's Bank of China (PBOC), China's central\nbank, has granted new gold import quotas to commercial banks in anticipation of\nrevived demand. This is important because China is the world's largest consumer\nof gold, and its buying patterns can influence the global market and affect\nprices. In fact, according to the World Gold Council (WGC), PBOC was the\nworld's largest single buyer of gold in 2023, with net purchases of 7.23\nmillion oz. According to global broker Octa's estimates, global central banks\nhave added more than 130 tons of gold to their reserves in 2024.\nApart\nfrom central banks, global investors have also remained quite bullish on gold.\nAccording to the Commodity Futures Trading Commission (CFTC), large speculators\n(leveraged funds and money managers) increased their net-long exposure in COMEX\ngold futures and options by 47,909 contracts in August to 236,818 net-long\ncontracts. They have maintained their largest net-long exposure in gold in more\nthan four years. According to LSEG, a financial firm, physically-backed gold\nexchange-traded funds (ETFs) witnessed their third consecutive monthly\ninflow in August––21.94 tons.\nThe\ncompetition between gold and Bitcoin has been a hot topic in the financial\nservices industry for years. Both assets have their own unique appeal to\ninvestors, yet they represent very different approaches to wealth preservation\nand capital growth. Both assets are viewed as hedges against inflation but in\nslightly different ways. Gold's value has historically been tied to its ability\nto hedge against currency depreciation and inflation. On the other hand,\nBitcoin is often seen as a hedge against the uncontrolled emission of fiat\ncurrencies thanks to its fixed supply of 21 million coins. However, Bitcoin's\nshorter history makes it less predictable in this role than gold.\nGold\nand Bitcoin respond differently to increasing global risks, including\ngeopolitical conflicts and economic recessions. When global stability is\ndisrupted, gold tends to rise, while Bitcoin, which often correlates with U.S.\nindices such as the S&P 500 and NASDAQ, tends to decline. This is because\nBitcoin is considered a high-risk, high-reward asset and is usually sold off\nfirst when the risk-off sentiment hits the markets. Investors then shift their\nfunds into more reliable and less volatile assets. In fact, August has vividly\ndemonstrated this relationship, as gold increased by 2.2% during the month,\nwhile Bitcoin price dropped by 8.5%. However, Bitcoin has outperformed gold\nyear-to-date (y-t-d), gaining 44% (see the chart).\nOver\ntime, this situation may change as Bitcoin gains credibility among\ninstitutional investors. Several Bitcoin ETFs were launched earlier this year,\nwhich have begun to reshape the cryptocurrency market. Specifically, ETFs\nreduce Bitcoin's volatility as demand becomes more stable. Moreover, Bitcoin\nETFs compete with Gold ETFs for investors' funds.\nAccording\nto The Block, a crypto research portal, in August 2024, inflows into BTC ETFs\nexceeded $200 million, bringing the total since their launch close to $60\nbillion. For comparison, the total assets under management (AUM) in gold ETFs\namount to approximately $90 billion. ‘If\nthis trend continues, Bitcoin ETFs could surpass gold ETFs by the end of the\nyear. In the long term, competition with Bitcoin is likely to exert bearish\npressure on gold prices,’ said Kar Yong Ang.\nFundamentally,\nthe outlook for gold looks bright. We have singled out three important bullish\nfactors that will continue to play out in September 2024.\nGlobal monetary policy\nGold\nis priced in U.S. dollars and is therefore highly sensitive to changes in U.S.\ninterest rates, inflation, and the greenback's value. As already mentioned, the\nmarket is positioned for a dovish Fed. In fact, the latest interest rates swap\nmarket data implies roughly 220 bps worth of rate cuts by the Fed by the end of\nDecember 2025. This means the market expects the U.S. central bank to cut the\nborrowing costs in half over the next five quarters. It is widely expected that\nother central banks will not fall far behind. Investors expect the European\nCentral Bank (ECB) to deliver three quarter-point rate cuts by the end of\nJanuary 2025, while the Bank of England (BoE) is anticipated to announce at\nleast two rate cuts of 25 bps each before the end of February 2025.\nFundamentally, a less tight (or loose) monetary policy worldwide is a major\nbullish factor for gold. Because gold has no passive income and does not pay\nany interest, the opportunity cost of holding it becomes lower when central\nbanks reduce their policy rates. The main risk is, of course, inflation. Should\nit remain above central banks' targets or, even worse, start to increase, the\nFed and its counterparts will be forced to hold the rates higher for\nlonger.\nGeopolitical uncertainty\nThe\nconflicts in the Middle East and Eastern Europe, such as the Israel-Hamas\nhostilities, the Red Sea crisis, and the ongoing tensions between Russia and\nUkraine, have destabilised world politics and raised many fears ranging from\noil and food supply disruptions to the prospect of a worldwide conflict. Gold,\nconsidered a 'safe-haven' asset, typically sees increased demand during\npolitical uncertainty and instability. While it is extremely difficult to\nproject the resolution of geopolitical conflicts, let alone to forecast the\nemergence of new ones, peace negotiations in the hottest regions are yet to\ncommence. ‘Until there is a clear path\nto stability, investors would prefer to err on the side of caution and will\nsimply buy gold 'just in case'. Nobody wants to be caught shorting the bullion\nwhen the news of another military incident here or there hits the newswires’,\nsays Kar Yong Ang, global broker Octa analyst.\nThe\nupcoming U.S. elections further complicate the global political landscape,\nadding another reason for gold prices to keep rising. Due to its safe-haven\nstatus, gold typically experiences increased buying interest during electoral\nvolatility. Historical data indicates that on a micro level, gold prices tend\nto rise in the months leading up to an election and may continue to do so if\nthe election results are contested or lead to significant policy shifts.\nChina and India\nPhysical\ndemand for gold may continue to increase thanks to China and India, two major\ngold consumers. Specifically, China has seen its national currency, renminbi\n(RMB), appreciate more than 2% over the past month. This is not a welcoming\ndevelopment for a country whose economy heavily depends on exports. Thus,\nChinese authorities may relax gold import quotas to stop the yuan from\nappreciating too much. As a result, the physical and investment demand for gold\nin China may rise in the months ahead.\nRetail demand in India will\nprobably remain robust following the government's decision to cut import duties\non gold and silver from 15% to just 6%. This decision comes ahead of the Indian\nfestive season (October – March) and may boost jewellery consumption in the\ncountry.\nTechnical picture\nFrom\na technical perspective, during a 4-hour timeframe, we observe the first signs\nof weakness. RSI signals bearish divergence, and the growth rate has slowed\ndown. Despite the bullish trend in gold in general, the price may decline\ntowards the 2,475.00 support level. At this level, the ascending trend line and\na 200-day moving average will act as support. Since the trend is generally\nbullish, the price may renew the maximums after a mild correction. If the price\nfails to hold the 2,475 level, it may drop towards 2,360–2,400 (dashed arrow on\nthe chart).\nOn a weekly timeframe, we also see\na bearish divergence and a possible bearish wedge formation, which may become\nhighly negative for gold prices. However, it doesn't necessarily mean that the\nprice will drop immediately. Firstly, the price may correct towards the 20-week\nexponential moving average, rebound to test the 2,600 level, and then pull back\ntowards the 2,400 level by the end of the year. By this time, the 50-week\nmoving average is expected to be near the 2,400 mark, which may provide a new\nlong-term entry point for gold buyers.\nGold Technical Chart (1-week\ntimeframe)\nOverall,\nwe see a mixed picture. Fundamentally, gold is a ‘screaming buy’, but\ntechnicals suggest that a short-term correction is likely. Gold is looking to\ntest $2,600 and may move towards $3,000 in 2025. However, technical analysis\nindicates that the price may reach these highs only after a healthy bearish\ncorrection.\n‘There are so many reasons for the gold price\nto continue rising in September, that the largest risk for gold bulls seems to\nbe pure complacency. Too many bullish factors are already priced in. If\ninvestors start speculating that something is not playing out as planned they\nmay sharply reduce their net-long exposure leading to a major sell-off in gold\nprices. This is not our base scenario as we believe that gold will continue to\ntrend higher slowly, but we must prepare for periods of above-normal volatility\nand could see sharp downward corrections. A road to $2,600 per ounce will not\nbe an easy one’,  said Kar Yong Ang, global broker Octa\nanalyst.\nKey Macro Events in September (scheduled)\nShare this article"]}
{"date":"2024-09-13","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-09-16","titles":["Is Bitcoin Going To Be The Only Trustless Digital Store Of Value?"],"urls":["https:\/\/www.benzinga.com\/partner\/cryptocurrency\/24\/09\/40876645\/is-bitcoin-going-to-be-the-only-trustless-digital-store-of-value"],"sources":["benzinga.com"],"descriptions":[""],"article_contents":["As the world's first cryptocurrency, Bitcoin has captured much of the digital asset spotlight since its inception in 2008, serving as a digital store of value and inflationary hedge. The leading cryptocurrency by size has seen its market capitalization balloon as high as $1.44 trillion at its peak earlier in 2024. The price has since retreated from those high levels, and the value of the broader crypto market now hovers at approximately $2 trillion as of Sep. 12, according to data from CoinMarketCap.\nWith a dominance between 40%-50% as of the time of writing, Bitcoin is still the most widely held cryptocurrency in the world. However, Bitcoin is not the only horse in the digital asset race. Instead, it shares the stage with thousands of other cryptocurrencies that were developed in its wake, known as altcoins. Yet another segment of cryptocurrencies consists of what are called stablecoins, which are backed by fiat money and tend to exhibit less volatility than Bitcoin and other digital assets. Not to be outdone, Seasonal Tokens arrived on the scene, which are intended to be ethical tools for wealth building through trading in digital assets.\nSome BTC maximalists, as they're known, are convinced there's only room for one leader over the long haul, and that's Bitcoin, while all other coins will eventually fall by the wayside. With the cryptocurrency markets clearly evolving, now is a good time to explore whether Bitcoin will reign as the only trustless digital store of value or if there's room for other tokens to exist alongside it.\nMultiple factors support the assertion that Bitcoin's dominance isn't likely to threaten the existence or success of altcoins.\nIt's undeniable that Bitcoin has played a major role in the growth of the cryptocurrency market. As the Bitcoin price has risen over the years, so too has the size of the broader digital asset market, fueled by Bitcoin on one hand and the performance of other tokens on the other. However, it's important to note that as of Sep. 12, 2024, Bitcoin's dominance hovers at less than 50% compared with 85% five years ago. As Bitcoin's dominance has been slipping, that of the altcoin market has been rising, a trend that is reflected in the below chart.\nImage source: CoinGecko\nTake Bitcoin's halving events, a supply phenomenon that occurs every four years and tends to be bullish for the Bitcoin price. Leading up to and after the Bitcoin halving events of 2017 and 2021, the altcoin market cap expanded alongside a rising Bitcoin price. This suggests that investors were also looking for cheaper alternatives to the pricey leading crypto.\nBased on this trend, it's also possible that the altcoin share of the broader cryptocurrency market could be poised to continue rising going forward. Consider the total crypto market share pie witnessed in Q3 2024 in which Bitcoin holds roughly half, while the seven leading altcoins control a combined 25% and the remaining cryptocurrencies hold the other 25%.\nWhat sets Bitcoin apart from the pack is its inherent use case as a payment method. A common thread among seven of the top eight cryptocurrencies is that they each operate on their own unique blockchains. Other major blockchains more closely resemble Ethereum, the number two cryptocurrency by market cap that also serves as a decentralized virtual computer. This differentiator is a major driver of price for the underlying tokens.\nHowever, these alone may not be enough to form a full picture of the altcoin market’s expected growth pattern. Therefore, let's explore some reasons to support this likely scenario.\nSatoshi Nakamoto designed Bitcoin as a peer-to-peer digital currency whose transactions underpin the Bitcoin blockchain. However, with the combination of block-size limitations and a mandated supply cap of 21 million coins ever to be minted, Bitcoin soon evolved as a store of value as well, competing with conventional assets like gold.\nMeanwhile, Ethereum, the number two cryptocurrency, was created with a different use case – as a decentralized virtual computer. Most other blockchains followed in Ethereum's footsteps, completing decentralized transactions using products known as smart contracts. Smart contracts became commoditized over time, growing in influence but declining in price. It's a similar phenomenon with other technologies like cars and cell phones, whose use case and price have gone in opposite directions.\nAmong the leading eight cryptocurrencies, one outlier is Tether (USDT), as unlike the others it is not a blockchain. One of the industry's first stablecoins, Tether was created as an ERC-20 token on the Ethereum blockchain with the primary purpose of payment and acting as a stable digital asset so investors can sidestep volatility. Its existence is a testament to the fact that decentralized virtual computer technology permits the separation of blockchain infrastructure from the underlying cryptocurrencies, the latter of which can perform independently.\nThis brings us to the Seasonal Tokens project, comprising four proof-of-work tokens – Spring, Summer, Autumn and Winter – that operate on the Ethereum network. Their relative prices take cues from one another over time. While Bitcoin's primary use case is money, and Ethereum's is a decentralized virtual machine, Seasonal Tokens aim to take the role of more of a trading instrument.\nBitcoin has often been compared with gold. However, Seasonal Tokens also share some similarities with commodities, operating in cryptocurrency similar to how other products like agricultural produce function in the physical world.\nIn the agricultural industry, farmers rely on the changing of the seasons to inform their growing and harvesting decisions as well as risk taking. Similarly, the nature of changing cycles in the relative prices of Seasonal Tokens guides traders in their decision-making process. One key difference between Seasonal Tokens and nature's seasons is that the crypto cycle unfolds for nine months at a time.\nBitcoin has already succeeded as the most trusted store of value cryptocurrency, earning the nickname of \"digital gold.\" However, that is just fine with the altcoin market, as they are not vying for this title. Rather, they serve as a complement to Bitcoin by offering their own value and opportunities to traders.\nAs Bitcoin's total supply shrinks every four years like clockwork, the economic incentives for stakeholders will pivot from mining to other things. For example, Bitcoin miners may shift their attention from mining new coins – their primary means of getting paid — to generating blockchain transaction fees for income. Given the blockchain's limitations on transaction speed, Bitcoin will likely be favored among major industry players, but potentially not for small transactions.\nAs for Seasonal Tokens, price swings serve as demand drivers for the foreseeable future until the mining supply is less influential. By this time, traders are expected to be incentivized to provide liquidity to decentralized markets as they profit from various blockchains such as Ethereum and Polygon while opportunistically trading price changes among the four Seasonal Tokens – Spring, Summer, Autumn and Winter.\nIn early September, Seasonal Tokens had a major event when the mining supply of the Winter token was halved. This event was a milestone for the project, ushering in the end of the first full period of halvings. Based on historical data, the project's leaders report that the mechanics of Seasonal Tokens are performing like clockwork: the Winter Token shows signs of transforming from the cheapest of the project's four tokens to the most expensive.\nTraders may want to stay tuned if they'd like to participate in the synchronized Seasonal Tokens cycles.\nIf that sounds like you, click here to receive an exclusive Winter halving gift from Seasonal Tokens just for Benzinga's readers!\nFeatured photo by geralt on Pixabay.\nThis post contains sponsored content. This content is for informational purposes only and is not intended to be investing advice.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nTrade confidently with insights and alerts from analyst ratings, free reports and breaking news that affects the stocks you care about.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes."]}
{"date":"2024-09-17","titles":["Successful Investing Stories in the Bitcoin World"],"urls":["https:\/\/www.under30ceo.com\/successful-investing-stories-in-the-bitcoin-world\/"],"sources":["under30ceo.com"],"descriptions":["We'll share stories of people who have had success investing in Bitcoin. Let’s see what it takes to become the next millionaire."],"article_contents":["Since its introduction, Bitcoin has swept the world and brought innovation and profit to many who believed in this coin. Those who had the vision of how much this token could grow have become millionaires, while others are embracing this technology and creating their own blockchain networks. After the launch and reaching a couple of milestones, plenty of other cryptocurrencies were developed, but none succeeded in the popularity and importance of Bitcoin. In this article, we will share stories of people who have had success investing in Bitcoin. Let’s see what it takes to become the next millionaire.\nBefore discussing the real-life examples, it’s important to understand what Bitcoin’s creation meant for the investor community and why it became a necessity in one’s portfolio.\nIf you are interested in Bitcoin and need a little push to invest in it, we’ve put together the most successful stories that will encourage you to embrace it and make a fortune on it.\nFirst on the list is Bitcoin’s creator Satoshi Nakamoto. While we don’t know if it’s a single person or a group of developers, one thing is for sure: We should be thankful for this creation. Nakamoto is estimated to own around 1.1 million BTC, which, at today’s prices, would amount to roughly $64.45 billion. Despite vanishing from the public eye in 2011, Nakamoto’s legacy remains one of the most important in the cryptocurrency space.\nAs the founder and former CEO of Binance, the world’s largest cryptocurrency exchange, CZ has been instrumental in bringing cryptocurrencies to the masses. His holdings in Bitcoin have grown alongside Binance’s success, making his crypto fortune worth an estimated $47.7 billion.\nArmstrong, the co-founder and CEO of Coinbase, saw the potential in Bitcoin while working as a software engineer at Airbnb. He launched Coinbase in 2012, a platform designed to simplify cryptocurrency trading, and today, his personal fortune is valued at $11.5 billion.\nOnce a surgeon, Devasini transitioned into the crypto world and is now the CFO of Tether (USDT). His 47% stake in the company is worth approximately $9.2 billion.\nMicroStrategy CEO Saylor made headlines when his company began investing heavily in Bitcoin in 2020. Saylor’s firm belief in Bitcoin’s potential has led to an estimated $5 billion in crypto wealth.\nCameron and Tyler Winklevoss, famous for their role in the early days of Facebook and crypto Company Gemini, were early adopters of Bitcoin. Since purchasing BTC in 2013 at around $100 per coin, the twins have seen their crypto wealth grow to about $2.7 billion.\nFor those new to this world, reading some of the other quick millionaire success stories might make you think it is easy and that you will need a bit of luck. However, if you take a closer look, it’s clear that it’s more than just luck. These investors made their fortune based on smart investing strategies, entrepreneurship skills, and great knowledge of technology. Some of them entered the market early, but others adopted cryptocurrency investments just a couple of years ago.\nFor instance, the Winklevoss twins started buying Bitcoin in 2013, and Brian Armstrong launched Coinbase in 2012. Their early moves into this relatively unknown market paid off massively, but it required a strong belief in a technology that many were still skeptical about at the time. However entrepreneurs such as Michael Saylor and Giancarlo Devasini gained profits in more recent years. For instance, Saylor transformed MicroStrategy’s investment strategy, putting Bitcoin at the center of its portfolio. Other pioneers, like Changpeng Zhao and the Winklevoss twins, built successful exchanges that facilitated the broader adoption of Bitcoin, creating wealth while helping to grow the crypto ecosystem.\nInvesting in crypto is a rocky road, and no one has the same experience; each investment story is unique. However, there are some common lessons that these great investors can learn. Here are some of them:\nSmart investing relies on constant learning and keeping up with the high pace of crypto markets. Make sure to always keep an eye on the latest innovations, trends and price fluctuations. After all, it’s not too late to make a fortune on Bitcoin and join this list of millionaires.\nLed by editor-in-chief, Kimberly Zhang, our editorial staff works hard to make each piece of content is to the highest standards. Our rigorous editorial process includes editing for accuracy, recency, and clarity.\nSignup for our newsletter to get access to our proven pitch deck template."]}
{"date":"2024-09-18","titles":["Beyond Trading: Crypto Exchanges As Financial Powerhouses"],"urls":["https:\/\/www.forbes.com\/sites\/roomykhan\/2024\/09\/18\/beyond-trading-crypto-exchanges-as-financial-powerhouses\/"],"sources":["forbes.com"],"descriptions":["Crypto exchanges, the Superapps in financial services, are provisioning services beyond simple trading, including borrowing, lending, staking, and DeFi products..."],"article_contents":["ByRoomy Khan\nByRoomy Khan,\nContributor.\nCryptocurrency logos\nSure, Bitcoin\nBitcoin\n and Ethereum\nEthereum\n Exchange-Traded Funds (ETFs) offer an easy gateway to crypto investing, but they limit investor exposure to just two cryptocurrencies out of thousands available in the wider crypto market. To unlock the true potential of the dynamic crypto ecosystem and alternative cryptocurrencies (altcoins)—where cutting-edge technology meets explosive growth—one must step beyond traditional finance into the evolving world of crypto exchanges. These are no longer just token trading platforms; they are morphing into comprehensive financial ecosystems.\nExchanges like Coinbase and Kraken have introduced staking options for assets such as Ethereum, allowing users to earn rewards while maintaining access to their funds and illustrating how exchanges are continuously pushing the boundaries of decentralized finance. With staking rewards that can outpace traditional savings accounts, liquid staking for additional liquidity without sacrificing yields, and lending options that bypass traditional banks, they're redefining financial services. In fact, Coinbase Wrapped BTC (cbBTC) lets users tap into Ethereum and Base networks with their Bitcoin holdings. This opens the door to Decentralized Finance (DeFi) apps, giving Bitcoin holders more ways to use their crypto, thereby bridging the gap between the largest cryptocurrency and the burgeoning DeFi ecosystem. \"The Subscription and Services revenue reached an all-time high in Q2 2024 with increases and positive growth rates of 12.28% to 36.27%, showing an upward trajectory in this business segment.\" a Coinbase spokesperson.\nBy integrating DeFi—the hotbed of innovation—and opening new opportunities for revenue and digital ownership through NFTs, these platforms are making creative finance accessible to everyone—not just Wall Street or the super wealthy. They are offering a broad range of services that intersect banking, investments, and trading—paving the way for a new era of digital finance.\nLet's look at this innovation. SwissBorg simplifies the crypto experience for traditional investors, offering a comprehensive ecosystem beyond basic trading and providing multiple ways to earn from assets. Its staking options feature allows investors to earn passive income while holding certain cryptocurrencies—similar to receiving stock dividends, generating consistent returns without active portfolio management. Additionally, SwissBorg offers \"crypto bundles,\" akin to crypto ETFs, making it easy to invest in themed groups of projects. SwissBorg's user-friendly platform and diverse earning opportunities make it a compelling one-stop solution that demystifies digital assets while enhancing earning potential in the crypto space.\nHow Crypto Exchanges Work\nCrypto trading can be a maze, but exchanges are your map and compass. These online platforms store your digital coins and match you with other traders, making buying and selling crypto almost as easy as trading stocks. Modern crypto exchanges have really stepped up their game, mirroring traditional brokers in many ways. Like stock trading platforms, they offer margin trading, letting you borrow to make bigger trades. They've also adopted futures and options trading for more advanced strategies. Most platforms provide learning resources to help newcomers, just as you'd find on conventional finance sites. And, of course, they've got mobile apps for trading on the go, keeping pace with the convenience of mainstream financial services.\nCrypto trading platforms are pretty similar to the apps you might use for online banking or trading stocks and derivatives, and they work a bit like currency exchange markets, too. You'll typically see live prices, charts, and other market data; currencies are listed in pairs, i.e., BTC\/USD or ETH\/USD., which lets one swap Bitcoin for dollars, Ethereum for dollars, or trade between different cryptocurrencies. Although exchanges have made it easier for anyone to trade crypto, they're not without problems. To name a few, headline-grabbing security breaches, trading fees that can be way higher than what one would pay for regular stock trading, and regulations that are still a bit of a moving target.\nCrypto Market Volatility and Exchange-Specific Risks\nWhile crypto exchanges offer exciting opportunities and offer a way to trade fiat currencies (mostly for onboarding and offboarding) or other digital coins for various cryptocurrencies, they come with serious risks. The crypto market is extremely volatile, with prices swinging wildly in short periods, i.e., in the past 3 months alone, Bitcoin is down 17.99%, and Ethereum is down 36%, while altcoins are down even more dramatically in 2024. Users face constant threats of hacks and theft; despite advances in technology, exchanges remain prime targets for hackers. In 2024 so far, crypto heists resulted in losses of over $1.6 billion. Regulatory uncertainty adds another layer of issues as governments worldwide are catching up to how to oversee this rapidly evolving sector; many countries lack clear rules for these exchanges, leaving users with few options if a company mistreats them. It's especially maddening when technical issues lock you out of your account during key market moves. Chasing alpha in your portfolio? Beware. Once risk-adjusted, those dazzling crypto returns could often lose their shine.\nFintech (Financial technology) concept.\nInnovative Features in Crypto Exchanges\nCrypto exchanges now provide functionalities that extend well beyond basic buying and selling. Decentralized order books (e.g., dYdX\ndYdX\n) and AI-powered fraud detection (e.g., Binance's risk control system) are enhancing security and efficiency. Cross-chain trading (e.g., THORChain\nTHORChain\n) is breaking down barriers between different blockchains, while smart order routing (e.g., 1inch's pathfinder algorithm) and copy trading (e.g., eToro's CopyTrader) are making advanced strategies accessible to all. Stablecoin integration (e.g., Circle) is easing crypto adoption and preserving fiat value on-chain, while tokenization (e.g., Synthetix) is expanding DeFi's reach. As the industry matures, enhanced security measures (e.g., Coinbase's vault feature) and regulatory compliance tools (e.g., Chainalysis KYT) are becoming standard. With support for layer-2 scaling solutions (e.g., Optimism\nOptimism\n), exchanges are tackling the challenges of speed and cost, paving the way for wider adoption of crypto trading.\nCentralized vs Decentralized Exchanges: Understanding CEXs and DEXs\nCEXs such as Coinbase, Binance, Kraken, Bitget, and more act like traditional banks\/brokerages for crypto. They are user-friendly and hold your coins in their custody; therefore, they are subject to stricter regulations and potential hacks. They are attractive targets for hackers since breaching a CEX could potentially provide access to numerous users' funds at once and a windfall to the perpetrators. On the positive, CEXs often have higher liquidity and trading volume, which can lead to better prices and faster trade execution. They offer a wider range of trading pairs and features such as margin trading or futures. CEXs usually require KYC (Know Your Customer) procedures, which may be a privacy concern for some users. Most CEXs have transparent proof-of-reserves backing their credibility and assuring users about the security of their assets.\nCEXs also have a more mature, user-friendly interface, which makes traders feel at home as compared to DEXs. Recently, many exchanges have integrated various methods of buying and selling crypto on the platform. For instance, Bitget has integrated Apple Pay and Google Pay, which allows its wide user base to buy crypto within seconds. Followed by credit card and debit card purchases along with bank transfers enabled for multiple fiat currencies, this ease of interacting with crypto lowers the barrier for entry for traditional investors. Bitget's audited Proof of Reserves report reveals a hefty 176% total reserve ratio, with overall reserves consistently maintained above 150% since the initiative's launch.\nDEXs such as Uniswap\nUniswap\n, PancakeSwap\nPancakeSwap\n, Sushiswap, and more, on the other hand, work differently - you keep your coins in your custody\/wallet and trade through shared liquidity pools; \"Not your keys, not your coins.\" These exchanges generally operate on smart contracts — self-executing code stored in the blockchain that automatically processes trades without intermediaries. DEXs offer more privacy and give you more control over your crypto, including private keys. However, they usually have steeper learning curves and can be less liquid— making trade execution slower or more difficult sometimes due to price matching issues. Most DEXs use what are known as liquidity pools, where users lock their crypto assets to make them available for trades. In return, these users earn token rewards through a process called yield farming. This setup increases overall liquidity and enables trading of a wider range of tokens than possible with big CEXs, as even newer or less popular ones can find homes here.\nThe decision between centralized (CEX) and decentralized exchanges (DEX) boils down to prioritizing user-friendliness or full autonomy over one's assets.\nWhile the crypto world is unpredictable and full of risks and opportunities, it can seem like a space reserved for experts. But the truth is, you don't have to be a professional to get involved. Platforms like ChangeNOW make it possible for anyone to navigate the crypto landscape. With no need to register and low fees, it's accessible to beginners and experienced traders alike. Plus, if you do choose to sign up, you can earn cashback on every swap. The platform's intuitive design and broad selection of cryptocurrencies make it easier to take control of your investment journey, regardless of your level of experience.\nConclusion\nCrypto exchanges, the comprehensive financial ecosystems, offer a glimpse into the future of finance. As Superapps in financial services, they provision a wide array of services beyond simple trading, including borrowing, lending, staking, and DeFi products. Exploring and learning these crypto exchanges is the first step towards harnessing the full potential of crypto finance. They're not just bringing new assets to the investor's toolkit; they're actively transforming how financial services operate in the digital age."]}
{"date":"2024-09-19","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-09-20","titles":["Bitcoin mining gets harder, hashrate marketplaces provide solutions"],"urls":["https:\/\/financefeeds.com\/bitcoin-mining-gets-harder-hashrate-marketplaces-provide-solutions\/"],"sources":["financefeeds.com"],"descriptions":["Platforms like NiceHash let retail buyers buy hashrate and try their luck with solo mining. Buyers choose which cryptocurrency they want to mine, and NiceHash m..."],"article_contents":["One of the first decisions new cryptocurrency miners need to make is whether to mine solo or join a pool. While there are plenty of reasons for and against both, there are other options out there too, including hashrate marketplaces.\nBitcoin mining income is highly unpredictable, fluctuating based on luck, payment terms, distribution schedules, and difficulty adjustments.\nEvery 10 minutes, miners race to find the right hash, add the next block to the blockchain, and earn the rewards. To boost their odds, they keep adding more computing power, or hashrate, to their setup. The higher the hashrate, the better their odds of being the first to solve the block.\nAs it stands, efficiency is crucial to the crypto mining industry due to tight profit margins and the need for the most computing power possible. Miners often rely on traditional mining pools, which allow them to combine their hashing power for more frequent rewards than solo mining.\nOne alternative is selling hashing power. Hashing power, or the computational power of hardware like ASICs used to solve cryptocurrency algorithms, can be sold on a marketplace. Here, miner profits depend on buyer demand rather than mining difficulty or coin price.\nHashrate marketplaces connect buyers and sellers of hashing power. Buyers can grab hashrate and direct it to a mining pool of their choice, earning cryptocurrency rewards without needing to own mining hardware. On the other hand, sellers provide the hashing power and receive real-time payments for every share they send to the buyer.\nThis arrangement can appeal to miners because buyers typically pay in Bitcoin, transferring the risk of not mining a block to the buyer. If a buyer successfully mines a block, they receive the full reward, currently 3.125 BTC for Bitcoin.\nAdditionally, miners in regions with lower electricity costs—due to geographic advantages, government subsidies, or special agreements with power companies—can sell their hashrate at market prices and profit from the difference between their lower costs and the market rate.\nMeanwhile, hardware owners get an average payout based on all the orders in the marketplace, which cuts down the ups and downs they usually face with traditional mining pools.\nThe volatility and uncertainty of Bitcoin mining can hinder expansion plans. By selling hashrate in short-term contracts, miners can generate the capital needed to fund business growth and development initiatives.\nPlatforms like NiceHash let retail buyers buy hashrate and try their luck with solo mining. Buyers choose which cryptocurrency they want to mine, and NiceHash miners complete the order.\nThe platform works with a variety of ASIC mining rigs, like Antminer, WhatsMiner, and Avalon models, so both large and small-scale miners can easily connect and sell their hashrate on the open market.\nOn the operational side, Hashrate reflects the total computational power directed at Proof of Work (PoW) blockchains like Bitcoin. It is measured in hashes per second (H\/s) and shows how many hash computations the entire network performs at any given time.\nBut hashrate isn’t just about network security; it’s also a tradable commodity, much like digital or physical assets.\nThat said, there are different approaches to trading hashrate, such as futures markets that allow miners to mitigate potential losses by hedging against price declines. However, when it comes to trading the actual computational power used to secure Bitcoin’s PoW network, NiceHash stands out as the primary platform.\nSince its launch in 2014, NiceHash has been known for its two-sided spot market that connects buyers and sellers of hashpower.\nNiceHash also provides a level of anonymity that may appeal to miners concerned about regulatory changes. The platform does not require Know Your Customer (KYC) verification, allowing miners to receive payouts directly to their Bitcoin wallets without sharing personal information.\nWhen deciding whether to join a Bitcoin mining pool, think of it as joining a lottery syndicate—the pros and cons are pretty similar. Mining solo means you keep the entire reward if you win, but your chances of winning are much lower. On the other hand, a mining pool like NiceHash has a much better chance of solving a block and earning the reward, but that reward is shared among all the members.\nAnother thing to consider with solo mining is the difficulty level, which is currently so high that it’s nearly impossible for solo miners to turn a profit—unless you have a garage full of ASICs in Arctic-like conditions.\nFor beginners, joining a Bitcoin mining pool is a great way to earn smaller rewards more consistently. Pools help keep small-scale miners engaged and active in the mining community.\nSumming up, miners have several ways to earn crypto with their hardware. Selling hashrate instead of using it directly is often one of the more profitable options.\nNiceHash data shows that selling hashrate on their platform has given miners more earnings compared to mining Bitcoin directly.\nUnit No: BA857 DMCC Business Centre Level No 1 Jewellery & Gemplex 3 Dubai, United Arab Emirates.\nInternational House, 10 Admirals Way, London, England, E14 9XL."]}
{"date":"2024-09-23","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-09-24","titles":["From Niche to Mainstream: How Crypto Can Strengthen Its Derivatives Market","Bitwise Executive Says ‘Things Will Likely Get Wild’ After Bitcoin ETF Options Launch – Here’s Why"],"urls":["https:\/\/www.financemagnates.com\/cryptocurrency\/from-niche-to-mainstream-how-crypto-can-strengthen-its-derivatives-market\/","https:\/\/dailyhodl.com\/2024\/09\/24\/bitwise-executive-says-things-will-likely-get-wild-after-bitcoin-etf-options-launch-heres-why\/"],"sources":["financemagnates.com","dailyhodl.com"],"descriptions":["One advantage that traders have in the traditional financial markets over cryptocurrency ones is the option to trade derivatives. Financial contracts for future...","Bitwise executive Jeff Park thinks"],"article_contents":["One advantage that traders have in the traditional\nfinancial markets over cryptocurrency ones is the option to trade derivatives.\nFinancial contracts for futures, options, and other derivatives have long been\na backbone driving new investments and unique commodity combinations.\nCryptocurrency-based derivatives have been slowly\ngaining popularity for the better part of a decade. For experienced traders,\ntheir rise represents a sophisticated step forward in what digital assets are\ncapable of achieving.\nBy offering services that mimic what quantitative\nanalysts and deft-handed traders seek in traditional financial instruments, the\nblockchain ecosystem demonstrates its viability as a true competitor to the\nfiat world.\nThat being said, in crypto’s quest to rival\ntraditional financial trading, the learning curve to get traders involved comes\nwith a learning curve too steep for many to even consider. Remember, crypto\ndoesn’t necessarily function in the same way as traditional currencies. That\nfact necessitates a degree of financial and technological understanding that\nsome traders don’t want to bother exploring.\nCrypto-based derivatives have incredible potential,\nbut the potential doesn’t matter if nobody actually uses\nthese tools. So, it’s time for crypto companies that want to offer derivatives\ncontracts to understand what gaps remain in getting traders and liquidity on\nboard.\nThe appeal of derivatives like options and futures in\ncrypto is pretty much identical to those in traditional finance. For\nquantitative analysts, or quants, who work tirelessly to investigate market\ndirections and take positions on movements based on incredibly complex\nfinancial models—crypto is a novelty that could lead to generous rewards.\nIt’s official! Coinbase International Exchange is here. Institutional traders in eligible non-US jurisdictions now have access to trade perpetual futures settled in USDC with up to 5x leverage. Read more about our announcement ⬇️https:\/\/t.co\/vrIfK999om pic.twitter.com\/E5ssl8NBz3\nThis is exemplified by the crypto derivative market’s\npotential to benefit from reactivity to news and worldwide developments. For\ninstance, crypto has become a hot-button political issue, given its potential\nimpacts on worldwide markets and continuing development in real-world\napplications.\nMore countries are considering launching proprietary centralized\ndigital currencies than ever before, and its adoption continues on a meaningful\nscale beyond subreddits and Discord groups.\nBanks, including investment leaders, have continued to\nenter crypto as well—especially in the U.S., where the launch of BTC and ETH ETFs opened up a clear pathway for institutional investors to onboard digital\nassets into their offerings. However, crypto derivatives still don’t have that\nsame ease of access.\nDAY ONE in the books for Eth ETFs who did $1b in total volume, which is 23% of what the spot bitcoin ETFs on their first Day and $ETHA did 25% of $IBIT's volume. The gap between $ETHE and The Newborn Eight is a healthy +$625m (a sizable chunk of which *should* convert to inflow pic.twitter.com\/jaP4dKLrOs\nThe entry point for derivatives is steep. Even in\ntraditional finance, it’s not as though most retail investors are deeply\ninvolved in analyzing financial models to trade in futures or options. So, it’s\nnot surprising that adding another layer of complexity with the unique facets\nof cryptocurrencies  \n            Cryptocurrencies\n           \n      By using cryptography, virtual currencies, known as cryptocurrencies, are nearly counterfeit-proof digital currencies that are built on blockchain technology. Comprised of decentralized networks, blockchain technology is not overseen by a central authority.Therefore, cryptocurrencies function in a decentralized nature which theoretically makes them immune to government interference. The term, cryptocurrency derives from the origin of the encryption techniques that are employed to secure the netw\n     \n    By using cryptography, virtual currencies, known as cryptocurrencies, are nearly counterfeit-proof digital currencies that are built on blockchain technology. Comprised of decentralized networks, blockchain technology is not overseen by a central authority.Therefore, cryptocurrencies function in a decentralized nature which theoretically makes them immune to government interference. The term, cryptocurrency derives from the origin of the encryption techniques that are employed to secure the netw\n    Read this Term would be an aversion to many.\nIt’s fine not to create every financial product for everyone. In fact, people need to know what they’re getting themselves into when it comes to investing—particularly in derivatives. However, there does need to be a concerted effort to make these financial instruments more accessible to those who want to explore them, especially in\ncrypto, an industry that already frequently grapples with accessibility.\nOne project working to close that gap is Thalex, a\ncrypto derivatives exchange and trading platform that puts access at the\nforefront of its offering—making sure that anyone has equal footing to easily\nenter the burgeoning sector.\nNew crypto options and futures exchange #Thalex closes Series A funding round. #Options #Crypto @FlowTraders @Bitstamp @bitfinex @IMCTrading @wintermute_t @QCPCapital pic.twitter.com\/aV8Uoqvj18\nA key component of Thalex’s ethos and development is\nstreamlining the crypto derivatives experience without sacrificing its nuances.\nBy offering stablecoin-settled contracts, the platform also eschews the\nneedless complexity and convoluted processing of inverse derivatives contracts\nthat are mainly popular within the crypto space.\nIn practice, offering stablecoin-settled contracts\ngreatly elevates Thalex’s usability. Traditionally, this involves using\ncryptocurrencies like Bitcoin or Ethereum as both the underlying asset and\ncollateral for each trade. So, the contract’s value relates inversely to the\nunderlying asset’s price—meaning if Bitcoin’s price rises, the contract’s value\ndrops.\nSince this can also happen the other way around, both losses and profits\nare settled in the currency itself, leaving traders exposed to potentially higher\nvolatility and complicated pricing dynamics. This might be ideal for traders or institutional\ninvestors with a much higher risk appetite since the potential for higher gains\nis exponentially greater.\nRevolut plans to launch stablecoinRevolut, the financial technology giant, is reportedly planning to launch its own stablecoin, according to CoinDesk. A spokesperson for the company stated that Revolut aims to expand its cryptocurrency offerings, prioritize compliance and…\nSome exchanges like Deribit, which also focus on\nderivatives trading, have built a robust platform and community by using this\nmodel over the course of many years despite the heightened loss factor. With\nthe Deribit covering a large majority of the crypto derivatives market today,\nit clearly is a strategy that works for some.\nHowever, stablecoin-settled contracts still give\nThalex a key point of difference. For those unfamiliar with it, a stablecoin is a\ndigital currency tied to real-world assets, most commonly a fiat currency like\nthe USD. In derivatives contracts, stablecoin  \n            Stablecoin\n           \n      Unlike other cryptocurrencies like Bitcoin and Ethereum, stablecoins are cryptocurrencies that have been designed to keep a stable value. Placing a greater emphasis on stability over volatility can be a huge draw for some investors. Many individuals can be turned off from large swings and uncertainty presented by cryptos relative to other traditional assets.Stablecoins control for this volatility by being pegged to another cryptocurrency, fiat money, or to exchange-traded commodities, including \n     \n    Unlike other cryptocurrencies like Bitcoin and Ethereum, stablecoins are cryptocurrencies that have been designed to keep a stable value. Placing a greater emphasis on stability over volatility can be a huge draw for some investors. Many individuals can be turned off from large swings and uncertainty presented by cryptos relative to other traditional assets.Stablecoins control for this volatility by being pegged to another cryptocurrency, fiat money, or to exchange-traded commodities, including \n    Read this Term-backed options utilize\nstablecoins as collateral for trades, directly relating the contract’s value\nand the underlying asset’s price.\nThis greatly reduces the volatility risk\nsince the collateral and settlement are in a stable currency, simultaneously\nallowing Thalex to offer a much simpler pricing model for trades. Yes, stablecoin-settled contracts reduce the potential for ultra-high yields. However, they do broaden access to crypto derivatives by making them more approachable for traders of any background.\nCoinbase is planning a pivotal acquisition that will allow it to launch crypto derivatives in the EU https:\/\/t.co\/7jH4kxkpf1\nAnother key fixture of Thalex’s spread is strategically partnering with other exchanges to easily onboard their services to new audiences. This enables the platform to grow sustainably while meeting potential traders where they are.\nLikewise, by treating institutions, retail\nquants, and traders with the same level of respect, Thalex is helping lead the\ncharge on more accessible derivatives experiences. Derivatives will continue to grow in crypto and offer\nenticing strategies to quants and experienced traders. But if it wants to break\nthe glass ceiling on adoption, platforms must step up and create more\nopportunities for broad adoption and exploration.\nOne advantage that traders have in the traditional\nfinancial markets over cryptocurrency ones is the option to trade derivatives.\nFinancial contracts for futures, options, and other derivatives have long been\na backbone driving new investments and unique commodity combinations.\nCryptocurrency-based derivatives have been slowly\ngaining popularity for the better part of a decade. For experienced traders,\ntheir rise represents a sophisticated step forward in what digital assets are\ncapable of achieving.\nBy offering services that mimic what quantitative\nanalysts and deft-handed traders seek in traditional financial instruments, the\nblockchain ecosystem demonstrates its viability as a true competitor to the\nfiat world.\nThat being said, in crypto’s quest to rival\ntraditional financial trading, the learning curve to get traders involved comes\nwith a learning curve too steep for many to even consider. Remember, crypto\ndoesn’t necessarily function in the same way as traditional currencies. That\nfact necessitates a degree of financial and technological understanding that\nsome traders don’t want to bother exploring.\nCrypto-based derivatives have incredible potential,\nbut the potential doesn’t matter if nobody actually uses\nthese tools. So, it’s time for crypto companies that want to offer derivatives\ncontracts to understand what gaps remain in getting traders and liquidity on\nboard.\nThe appeal of derivatives like options and futures in\ncrypto is pretty much identical to those in traditional finance. For\nquantitative analysts, or quants, who work tirelessly to investigate market\ndirections and take positions on movements based on incredibly complex\nfinancial models—crypto is a novelty that could lead to generous rewards.\nIt’s official! Coinbase International Exchange is here. Institutional traders in eligible non-US jurisdictions now have access to trade perpetual futures settled in USDC with up to 5x leverage. Read more about our announcement ⬇️https:\/\/t.co\/vrIfK999om pic.twitter.com\/E5ssl8NBz3\nThis is exemplified by the crypto derivative market’s\npotential to benefit from reactivity to news and worldwide developments. For\ninstance, crypto has become a hot-button political issue, given its potential\nimpacts on worldwide markets and continuing development in real-world\napplications.\nMore countries are considering launching proprietary centralized\ndigital currencies than ever before, and its adoption continues on a meaningful\nscale beyond subreddits and Discord groups.\nBanks, including investment leaders, have continued to\nenter crypto as well—especially in the U.S., where the launch of BTC and ETH ETFs opened up a clear pathway for institutional investors to onboard digital\nassets into their offerings. However, crypto derivatives still don’t have that\nsame ease of access.\nDAY ONE in the books for Eth ETFs who did $1b in total volume, which is 23% of what the spot bitcoin ETFs on their first Day and $ETHA did 25% of $IBIT's volume. The gap between $ETHE and The Newborn Eight is a healthy +$625m (a sizable chunk of which *should* convert to inflow pic.twitter.com\/jaP4dKLrOs\nThe entry point for derivatives is steep. Even in\ntraditional finance, it’s not as though most retail investors are deeply\ninvolved in analyzing financial models to trade in futures or options. So, it’s\nnot surprising that adding another layer of complexity with the unique facets\nof cryptocurrencies  \n            Cryptocurrencies\n           \n      By using cryptography, virtual currencies, known as cryptocurrencies, are nearly counterfeit-proof digital currencies that are built on blockchain technology. Comprised of decentralized networks, blockchain technology is not overseen by a central authority.Therefore, cryptocurrencies function in a decentralized nature which theoretically makes them immune to government interference. The term, cryptocurrency derives from the origin of the encryption techniques that are employed to secure the netw\n     \n    By using cryptography, virtual currencies, known as cryptocurrencies, are nearly counterfeit-proof digital currencies that are built on blockchain technology. Comprised of decentralized networks, blockchain technology is not overseen by a central authority.Therefore, cryptocurrencies function in a decentralized nature which theoretically makes them immune to government interference. The term, cryptocurrency derives from the origin of the encryption techniques that are employed to secure the netw\n    Read this Term would be an aversion to many.\nIt’s fine not to create every financial product for everyone. In fact, people need to know what they’re getting themselves into when it comes to investing—particularly in derivatives. However, there does need to be a concerted effort to make these financial instruments more accessible to those who want to explore them, especially in\ncrypto, an industry that already frequently grapples with accessibility.\nOne project working to close that gap is Thalex, a\ncrypto derivatives exchange and trading platform that puts access at the\nforefront of its offering—making sure that anyone has equal footing to easily\nenter the burgeoning sector.\nNew crypto options and futures exchange #Thalex closes Series A funding round. #Options #Crypto @FlowTraders @Bitstamp @bitfinex @IMCTrading @wintermute_t @QCPCapital pic.twitter.com\/aV8Uoqvj18\nA key component of Thalex’s ethos and development is\nstreamlining the crypto derivatives experience without sacrificing its nuances.\nBy offering stablecoin-settled contracts, the platform also eschews the\nneedless complexity and convoluted processing of inverse derivatives contracts\nthat are mainly popular within the crypto space.\nIn practice, offering stablecoin-settled contracts\ngreatly elevates Thalex’s usability. Traditionally, this involves using\ncryptocurrencies like Bitcoin or Ethereum as both the underlying asset and\ncollateral for each trade. So, the contract’s value relates inversely to the\nunderlying asset’s price—meaning if Bitcoin’s price rises, the contract’s value\ndrops.\nSince this can also happen the other way around, both losses and profits\nare settled in the currency itself, leaving traders exposed to potentially higher\nvolatility and complicated pricing dynamics. This might be ideal for traders or institutional\ninvestors with a much higher risk appetite since the potential for higher gains\nis exponentially greater.\nRevolut plans to launch stablecoinRevolut, the financial technology giant, is reportedly planning to launch its own stablecoin, according to CoinDesk. A spokesperson for the company stated that Revolut aims to expand its cryptocurrency offerings, prioritize compliance and…\nSome exchanges like Deribit, which also focus on\nderivatives trading, have built a robust platform and community by using this\nmodel over the course of many years despite the heightened loss factor. With\nthe Deribit covering a large majority of the crypto derivatives market today,\nit clearly is a strategy that works for some.\nHowever, stablecoin-settled contracts still give\nThalex a key point of difference. For those unfamiliar with it, a stablecoin is a\ndigital currency tied to real-world assets, most commonly a fiat currency like\nthe USD. In derivatives contracts, stablecoin  \n            Stablecoin\n           \n      Unlike other cryptocurrencies like Bitcoin and Ethereum, stablecoins are cryptocurrencies that have been designed to keep a stable value. Placing a greater emphasis on stability over volatility can be a huge draw for some investors. Many individuals can be turned off from large swings and uncertainty presented by cryptos relative to other traditional assets.Stablecoins control for this volatility by being pegged to another cryptocurrency, fiat money, or to exchange-traded commodities, including \n     \n    Unlike other cryptocurrencies like Bitcoin and Ethereum, stablecoins are cryptocurrencies that have been designed to keep a stable value. Placing a greater emphasis on stability over volatility can be a huge draw for some investors. Many individuals can be turned off from large swings and uncertainty presented by cryptos relative to other traditional assets.Stablecoins control for this volatility by being pegged to another cryptocurrency, fiat money, or to exchange-traded commodities, including \n    Read this Term-backed options utilize\nstablecoins as collateral for trades, directly relating the contract’s value\nand the underlying asset’s price.\nThis greatly reduces the volatility risk\nsince the collateral and settlement are in a stable currency, simultaneously\nallowing Thalex to offer a much simpler pricing model for trades. Yes, stablecoin-settled contracts reduce the potential for ultra-high yields. However, they do broaden access to crypto derivatives by making them more approachable for traders of any background.\nCoinbase is planning a pivotal acquisition that will allow it to launch crypto derivatives in the EU https:\/\/t.co\/7jH4kxkpf1\nAnother key fixture of Thalex’s spread is strategically partnering with other exchanges to easily onboard their services to new audiences. This enables the platform to grow sustainably while meeting potential traders where they are.\nLikewise, by treating institutions, retail\nquants, and traders with the same level of respect, Thalex is helping lead the\ncharge on more accessible derivatives experiences. Derivatives will continue to grow in crypto and offer\nenticing strategies to quants and experienced traders. But if it wants to break\nthe glass ceiling on adoption, platforms must step up and create more\nopportunities for broad adoption and exploration.\nShare this article","Bitwise executive Jeff Park thinks “things will likely get wild” now that the U.S. Securities and Exchange Commission (SEC) has approved options on BlackRock’s Bitcoin (BTC) exchange-traded fund (ETF).\nLast week, the SEC greenlit accelerated approval for the listing and trading of options on the iShares Bitcoin Trust (IBIT), BlackRock’s ETF.\nPark, Bitwise’s head of alpha strategies, says the approval “marks the most monumental advancement possible for the crypto market.” The executive notes that options will unlock synthetic flows with leverage for BTC.\nHe also says Bitcoin has unique volatility characteristics, including a “volatility smile.”\n“Bitcoin is unique because melt-ups are as frequent as melt-downs, so the market demands a risk premium on both sides. The practical implication? It’s seen in the second order Greek called vanna. Historically, with call options, as spot rises, implied volatility tends to fall. So while the option delta increases (becoming more in the money), the rate of increase slows – this is positive vanna, which creates a sort of drag.\nHowever, Bitcoin options have negative vanna: as spot goes up, so does volatility, meaning delta increases even faster. When dealers who are short gamma hedge this (a gamma squeeze), Bitcoin’s case becomes explosively recursive. More upside leads to even more upside, as dealers are forced to keep buying at higher prices. A negative vanna gamma squeeze acts like a refueling rocket.”\nPark notes that BTC can’t be diluted, unlike meme stocks for companies where management can issue new shares.\n“In summary, the Bitcoin ETF options market is the first time the financial world will see regulated leverage on a perpetual commodity that is truly supply constrained. Things will likely get wild. In such scenarios, regulated markets may shut down.\nBut the remarkable thing about Bitcoin is there will always be a parallel, decentralized market that can’t be shut down, unlike GME – which, as you can imagine, will add even more fuel to the fire.\nIt’s going to be unbelievably fantastic.”\nPark also says options are going to be great for Bitcoin miners.\n“Miners help us find the FLOOR. ETF options will help us imagine the idea of grasping the CEILING, and miss it each time as it goes higher – which in turn help miner profitability and enhance security.”\nFollow us on X, Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox \n\nCheck Price Action\n\nSurf The Daily Hodl Mix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\nGenerated Image: Midjourney\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl"]}
{"date":"2024-09-25","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-09-26","titles":["Here’s an End-of-2025 Price Target for Bitcoin (BTC), According to Trader That Called Bear Market Bottom","Cryptocurrency Prices on September 26: Bitcoin holds above $63,600 ahead of Fed's Powell speech"],"urls":["https:\/\/dailyhodl.com\/2024\/09\/26\/heres-an-end-of-2025-price-target-for-bitcoin-btc-according-to-trader-that-called-bear-market-bottom\/","https:\/\/economictimes.indiatimes.com\/markets\/cryptocurrency\/cryptocurrency-prices-on-september-26-bitcoin-holds-above-63600-ahead-of-feds-powell-speech\/articleshow\/113694458.cms"],"sources":["dailyhodl.com","economictimes.indiatimes.com"],"descriptions":["A popular trader known for several accurate crypto market calls is outlining his 2025 outlook for Bitcoin (BTC).","Major cryptocurrencies traded mixed on Thursday as investors anticipated speeches from Federal Reserve officials, including Chair Jerome Powell, which may shed ..."],"article_contents":["A popular trader known for several accurate crypto market calls is outlining his 2025 outlook for Bitcoin (BTC).\nPseudonymous analyst Dave the Wave tells his 146,900 followers on the social media platform X that Bitcoin could soar nearly 214% from its current value by the end of next year.\nThe analyst shares a chart using his own version of logarithmic growth channels (LGC) which aim to forecast market cycle tops and bottoms while filtering out short-term volatility and noise.\n“BTC technical target of $200,000 end of 2025.”\nHe also says that Bitcoin appears to be forming a cup-and-handle pattern on the weekly chart. A cup-and-handle formation is typically viewed as a bullish continuation pattern, suggesting that an asset is taking a breather after a steep rally before taking out a key resistance level.\n“BTC cup and handle anyone?”\nLastly, he suggests that Bitcoin may finish the year off in an uptrend as the flagship crypto may be printing a bullish pattern on the daily chart of higher low prices and higher high prices.\n“Setting up for a BTC 4th quarter fireworks? Does this mark the beginning of the turnaround with local higher lows and higher highs?”\nBitcoin is trading for $63,700 at time of writing, up 7% in the last seven days.\nFeatured Image: Shutterstock\/Swill Klitch\/Sensvector\nCovering the future of finance, including macro, bitcoin, ethereum, crypto, and web 3.\nCategories\nBitcoin • Ethereum • Trading •\nAltcoins • Futuremash • Financeflux •\nBlockchain • Regulators • Scams •\nHodlX • Press Releases\nABOUT US | EDITORIAL POLICY | PRIVACY POLICY\nTERMS AND CONDITIONS  | CONTACT | ADVERTISE\nJOIN US ON TELEGRAM\nJOIN US ON X\nJOIN US ON FACEBOOK\nCOPYRIGHT © 2017-2025 THE DAILY HODL\n© 2025 The Daily Hodl","Did you Know?\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors.\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\nSubscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today.\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price\nWhy Trump wants a ‘weak’ dollar, and what makes it an opportunity, or a challenge, for India\nDo Gensol, IndusInd revive corporate governance worries?\nAsian Paints is trading at P\/E lower than pandemic levels. Is it still a value buy?\nTrade gap: Can India do a Trump to China?\nMarket share at 0.1%, Trump wants to make US shipbuilding great again. Too little, too late?\n10 wilful defaults of INR10,000 crore that broke the back of IDBI Bank\nWorry not. You’re just a step away.\nIt seems like you're already an ETPrime member with\nLogin using your ET Prime credentials to enjoy all member benefits\nLog out of your current logged-in account  and log in again using your ET Prime credentials  to enjoy all member benefits.\nOffer Exclusively For You\nSave up to Rs. 700\/-\nON ET PRIME MEMBERSHIP\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet 1 Year Free\nWith 1 and 2-Year ET prime membership\nOffer Exclusively For You\nGet Flat 40% Off\nThen  ₹ 1749 for 1 year\nOffer Exclusively For You\nET Prime at ₹ 49 for 1 month\nThen  ₹ 1749 for 1 year\nSpecial Offer\nGet flat 40% off on ETPrime\n90 Days Prime access worth Rs999 unlocked for you\nStories you might be interested in"]}
{"date":"2024-09-27","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
{"date":"2024-09-30","titles":[],"urls":[],"sources":[],"descriptions":[],"article_contents":[]}
